{"title":"Sr. Android Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJyhzjiXuZfxYbEt5sCGkBVrOK5tvI9QN9Hvg42wfvGtmwcjn3GjhDSvhu7dTFvYq5S2xX0YsPd4-LoNcHE16hdHP0rlcpLz1d_isAEudTVH-MxdGDxHXfNEAhVWE93KJ6p4__YnRzBRrbZKXjvYPlwgNFbgmFvPiIUNyTLBfjrincQxYaM-MOMcO_7d24R","source":"ziprecruiter","full_description":"Our client, a global provider of information technology products and services, is seeking a Sr. Android Engineer Location: Colorado Spring, CO / Denver, CO Position Type: Full Time Who We Are:  The Integration SDK team facilitates second- and third-party integrators adoption models of \"client as a Platform\" and \"Payments as a Service\". We do this through the design, implementation, and support of nine SDK's written in five languages: Android, iOS, JavaScript, .NET, and Java. The result: we support billions of dollars of GPV (Gross Payment Volume) per year and are growing rapidly. The Integration SDK Team publishes artifacts on NPM, Maven Central, NuGet, CocoaPods, and GitHub. We achieve amazing agility through the development and deployment of highly reliable, highly available robotics backed test automation integrated into our modern CI pipeline.  Join an engineering team whose SDK's are used by thousands of merchants and hundreds of integrators around the world generating billions of dollars in transactions a year and used 24 hours a day. What does a Senior Android Engineer do? As a Senior Android Engineer, you will be a part of an Integration Platform team that designs, builds, and supports core architectural technology that facilitates success for thousands of merchants and hundreds of second- and third-party integrators. We build high performance, extensible, and observable integration service layers that are used around the world. This position focuses on Android; However, we must think on a much larger scale than Android alone. We have integrators using .NET, iOS, JavaScript, and Enterprise Java containers who depend on us to deliver a highly reliable financial platform.  You will contribute to the overall architecture processing billions of dollars in GPV, this person will also help scale the team through mentorship and solid software design principles. The bulk of this Engineer's time will be spent in a substantial multi-repo Android environment: this person should be eager to design and debug across numerous technology boundaries from an embedded RTOS performing secure contactless communications, through android and into the cloud over mutual TLS. As a Senior Android Engineer, you can look forward to:  -Collaborating with Product Development, UX Designers, and QA to build quality products; including resolving complex technical issues related to projects. -Build, test, implement and launch the solutions proposed. -Install, configure, customize, upgrade, support and troubleshoot all technical issues related to on premise and hosted environments for mobile platforms. -Work directly with third party vendors to define technical requirements and customize, configure and implement solutions to interface with various external systems. -Work with senior management to define and implement technical processes and procedures within department focusing on client satisfaction and efficiency -Communicating within your functional team and across Engineering to keep information flowing -Reviewing peer code, designs, and providing mentorship. -Writing tests and automation to advance maturity in product testing -Be a team player, ability to collaborate idea sharing in a strong product setting. -Develop native mobile applications for Android -Work in an agile environment, participating in planning and Scrumban boards.  The above statements are intended only to describe the general nature of the job and should not be construed as an all-inclusive list of position responsibilities. Basic Qualifications:  -Bachelor's degree required. -8+ years of Android development experience. -10 years software engineering experience in a modern engineering language: Java, C, C++, JavaScript, .NET, Swift, Objective C. -Demonstrated experience implementing both Android software design patterns and application architecture. -An advanced understanding of coding techniques which contribute to the reliability, maintainability, readability, simplicity, performance, and testability of software. -Experienced in the day-to-day practicalities of Software Development Lifecycles such as Kanban. Preferred Qualifications: -Software Engineering Technical Leadership experience. -Experience with CI/CD pipeline, Gradle/Kotlin DSL's for building Android applications/libraries -Experience developing in Kotlin. -Experience working with e-commerce, shopping cart, or payment service gateways. -Exposure to POS Hardware and/or Software for the Station Pro, Mini, Flex or Go. -Experience in Payment Terminal Certification in area of Contact & contactless payment -Experience with relational databases, SQL Experience using Android devices Education: Basic Qualifications: -Bachelor's degree required. Employment Type: [\"FULL_TIME\"]"}