{"title":"Electrical Engineer Substation Design Engineer 20-00104 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAINCHm0dQgypF4Kl0wxulh2HcQf9UT0WgJvKqFECclmori6H54C5omXReolGG7Ur3GlHaUjUoPGQyxLzYRFtgr32vUTjdOfLhXasQubP2mxF9cTUNSAwiKPWhDRdRiMLw9BP_JsXywxzjl_86CrVk2dIEkHxB_D_7eMpoXJB7xRgP_cGqojTEDWYKkkGzTo","source":"ziprecruiter","full_description":"Electrical Engineer Substation Design EngineerOffice Located in Washington, DC. 20068(work remote from home during Covid)2 year plus assignmentWill work remote from home during Covid, but will be required to be local enough to be able to conduct site visits in the DC and MD area on a weekly basis.Electrical Engineer - Substation Engineering.Utility background, substation engineering experience, proficient in MicroStation a plus..Local candidates, no per diem.5 plus years experience preferred, but flexible.Job Description:Required to have a degree in electrical engineering or other relevant engineering field.Required to have experience in the power industry.Responsible for developing electrical engineering design change packages in support of maintenance or capital projects for substation power facilities.Protection and Control, Arrangements, physical, wiring, etc.Overseeing Installation or functionality of substation equipment, design & contraction activities; 70/30.- Experience w/ working with high voltage (4KV to 500KV) substation.- Familiar w/ substation drawings (MicroStation, AutoCAD or some type of CAD software).Espo CorporationWillowbrook, IL 60527(630) 789-2525View all open jobs at www.espocorp.com/jobsLeaders in Technical Recruiting & Staffing since 1965We are an Equal Opportunity Employer and value the benefits of diversity in our workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity and expression, national origin, disability, protected Veteran status or any other attribute or protected characteristic by law. {Want to learn more? Click here www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf.} If you need assistance applying please contact us at 630-789-2525."}