{"title":"Sr Software Engineer - Java EE & Microservices","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALwMkoz1_8L0bW3IxLOKUv2ebtM1eQM85C0a9wY521XMu4wSTXCVOuQRK9-cQuARjU_ViOueO7BKP0obFB202EtxuPtp2fJoJryaRy6La0Xggh5W7tpR6v-r9dZ2C6M8465f6tKyhGlPij82vPdFMsGyzm70AdPyqx6xiUAhcCvDgzr7saYAoeeCWM0LbvF","source":"ziprecruiter","full_description":"Description Robert Half is looking for a hands-on Senior Software Engineer - \"Java EE & Microservices\" who can independently contribute to the vision of a Microservice architecture, evangelizing across team on technologies, and leading the service development effort for the Search Experience team. The ideal candidate is an experienced engineer with proven tracking record of delivering high quality services in a cloud platform, AWS preferred, and passionate about building the best possible technical solutions for customer problems. If you are available and interested, please apply to the job post and contact Suman Sandhu at 408-271-9063Requirements BS/MS in Computer Science or related field. 5+ years software engineering experience, with 3+ years of such experience in an agile environment. Excellent written, verbal and interpersonal communication skills. Strong experience in Java EE or Spring Framework. Strong experience with Cloud technologies, AWS preferred. Strong Experience with developing and integrating with microservices. Strong Experience building applications on Search technology, Solr preferred. Experience delivering high performance, scalable and mission-critical software in a cloud environment. Plus: + AWS Certification is a big plus. Experience in Node.js. Experience with Service Discovery solutions. Experience with building platform serviced for internal and external developers. Robert Half Technology matches IT professionals with remote or on-site jobs on a temporary, project or full-time basis. From roles in software and applications to IT infrastructure and operations, we provide you unparalleled access to exciting career opportunities. Our experienced staffing professionals can promote you to employers and advocate on your behalf. We provide access to top jobs, competitive compensation and benefits, and free online training. For more opportunities, get the Robert Half app and receive instant notifications when our AI matches you with jobs. When you work with us, you're working with the best. Robert Half has been recognized as one of FORTUNE's \"Most Admired Companies\" every year since 1998 and was named to Forbes' inaugural list of America's Best Temporary Staffing Firms. Questions? Call your local office at 1.888.490.4429. All applicants applying for U.S. job openings must be authorized to work in the United States. Benefits are available to temporary professionals. Visit https://roberthalf.gobenefits.net/ for more information. 2020 Robert Half Technology. An Equal Opportunity Employer. M/F/Disability/Veterans. By clicking \"Apply Now,\" you're agreeing to Robert Half's Terms of Use (www.roberthalf.com/terms-of-use). Salary: DOELocation: San Jose, CADate Posted: March 3, 2021Employment Type: TemporaryJob Reference: 00420-9502871732Staffing Area: Technology u0026 IT"}