{"title":"Product Marketing Manager, Android Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJMU3vq8QpuPTxDuWMNblR7TfLWwm2ElXHV3-NDVp5sB3dw6qeD6Do1pB2ZLSVXi8EDmRF17591LoB2BAAGAYtf_KTFaWLM8CTlJQphAlZSmNgTTnAdSpt6PbRqL6P5LvHIbUhISlf347mtUfgZCjItp8zE2t8I18aM6sFCbF3IWqwlLUEwB9tZaxKOQTTu","source":"ziprecruiter","full_description":"Developer Marketing is focused on driving the success of Google's developer platforms, such as Android, Google Assistant, AR/VR, and others, by delivering global, scalable programs, events and creative marketing campaigns to engage software engineers and developers. You will have a passion for innovative software technology and an understanding of how developers use our APIs and tools to achieve business growth. Working closely with other product marketing managers, engineers, designers, and others to own, drive, and execute a wide range of marketing initiatives.The Product Marketing Manager for Android Developer will help developers build innovative and high quality user experiences on the Android platform. You will build awareness of new capabilities of the upcoming OS release, ensure app compatibility, as well as drive adoption of prioritized features of current and past releases. You will build a narrative for how we talk about the future of Android, and support our initiatives to improve quality across form factors. You will help build the Android community globally and shape developer satisfaction with the platform.Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself."}