{"title":"Technical RAS Specialist - Aquaculture","location":"","salary":"","description":"","term":"$65,000 to $85,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAL_JI9k0HzVw8RjjCA7-7ZoUNEENeWeFA4LHufGqHdcf2q4gHBywPBUH9AwtW6omtDGe_yKHD0ksTfERq_B0T8lT8j17y_tlGgc2BRv-tulT72q2dyiQArb-hofWGTsBaYlFh5tsr_UOP4AHoVkET_e6Baqi_-ieH0eG39dNTjR1Fd93Wufq0WnUHSQlvxK","source":"ziprecruiter","full_description":"Feeding the Future. Skretting is an essential link in the feed-to-food chain, and we aim to contribute to meeting the rising food needs of a growing population in a sustainable manner. Headquartered in Vancouver, BC, Skretting is the leading manufacturer of quality feed for the aquaculture industry in North America with production facilities in British Columbia, New Brunswick and Utah. Skretting is a wholly owned subsidiary of Nutreco, which employs approximately 11,000 people in 35 countries across the world. For more details refer to http://nutreco.com.Currently, we are looking for a Technical Sales Specialist to join our team. Reporting to the Sales Manager, the Technical Sales Specialist will provide expert support to clients in fish nutrition and production system performance, which support the business requirements. The Technical Sales Specialist acts as a point of contact for Skretting clients in the Eastern US region, building strong relationships and finding the solution which best fits their individual needs. Frequent travel is required for this role and the ability to work from your own home office.Key Duties and Responsibilities:Maintain and grow sales relationships with existing clients in multiple production system types with the majority of time (>75%) spent on RAS business.Identify and gain new business in sales territory working with Commercial team to tailor value propositions based on customer needs and wants.Assess clients' needs, recommend and assist in the selection of appropriate feed features and value added services suited to the production system and for the mutual benefit of the client, and Company.Routinely communicate sales activities and customer news with Sales Manager and account team.Routinely maintain detailed feed requirement forecasts for clients and communicate needs to internal team effectively.Provide input for development teams in SKNA product design and features, when feed or services must be tailored to suit commercial clients' needs or key market trends.Develop presentations, proposals and other materials in collaboration with Marketing to illustrate benefits from using Skretting or Bio‐Oregon feed and services.Prepare cost‐benefit analysis for clients’ needs comparing feeds and/or features.Support in the preparation and execution of sales contracts as needed.Consult with clients after sale to resolve problems and to provide ongoing technical support.Implement and maintain technical support services to key clients.Support team members requiring technical input and aid.Troubleshoot problems related to feed, feeding and performance.Resolve complaints and prevent additional issues and maintain accurate records (CRM).Develop and maintain technical product and service knowledge to explain features and effects to clients and answer questions about diet features and services.Develop, implement and report on marketing plans (CRM) and sales strategies to achieve business goals.Assess market share, marketing conditions and competitors' activities and develop an awareness of emerging markets and trends.Collaborate with the Sales and support departments to maintain flow of information and full circle customer care.Know and follow current safe work procedures.Practice good communication.Participate in the development of a working climate where all staff cooperates to help achieve planned results (i.e. Together Everybody Achieves More).What you bring:Post secondary degree in Biology, Animal Nutrition or AquaticsMinimum 5 years experience in the aquaculture fieldExperience with various recirculating aquaculture systemsUnderstanding of water quality fundamentalsSales experience an assetProven record of relationship buildingA valid driver’s licenseA valid passportAbility to track, analyze and communicate effectivelyProficient in Microsoft programsCustomer Relationship Management system skillsA demonstrated understanding of fundamentals of RAS production systemsData analysis and understanding of modelingAs a member of the Skretting team, you can expect:A diverse and inclusive cultureCompetitive compensationComprehensive benefits packageInternal advancement opportunitiesAnnual employee eventsAn organization that supports the local community"}