{"title":"Computer Systems Validation / Technical Writer for Maximo Upgrade","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AALTKv3RMk-1ho0eWF1l1x1mXLZ_Hwnwe3U0aOWHezqxZu5xp9U9Jhmcq_cKi3drYWMtk4o0XnU9QeIGyLZrCsznfmy9dETaoYOqi07qA_stfYgT7Hhne9Xy3JVJSbUlnV2yR4IZz_wOuQsKpe9fuwNqbhLSJGV1fmWK-2hfj6PA7J8w5g4_6uKOPwFXXOA","source":"ziprecruiter","full_description":"COMPUTER SYSTEMS VALIDATION / TECHNICAL WRITER FOR MAXIMO UPGRADETAMPA, FLOT may be required if project timelines require it.Required Skills:21 CFR Part 11 - 6-10 yrs.Business Writing - 6-10 yrs.3-5 yrs. experience with Maximo as a user and 6-10 yrs. computer system validation specialist is highly preferred. 5 years of CSV experience5 years of experience in writing and reviewing testing strategies and planning documents.5 years of Data Migration5 years with CSV regulations (FDA, MHRA and other applicable global health regulations)Familiar with automated testing tools HP ALMFamiliar with EDMSProject Description:This role is specific to supporting a Maximo upgrade of the entire system. EM needs to find someone who knows the application well and also has the CSV experience.Advanced knowledge of complete MS Office suite and Visio. Firm understanding of technology platforms as needed for project.Experience with electronic document management systems (e.g., documentum, Qumas, SharePoint etc.); application development and lifecycle management (e.g., HP ALM, JIRA, etc.); and IT service management systems (e.g., ServiceNow, SAP Solution Manager, etc.)Excellent oral and written communication skills in English. Strong expertise and ability to interview and accurately interpret communication requirements of team members.Ability to perform in a highly matrixed organization structureThis 12+ month position starts ASAP.Please E-MAIL your resume (attachment to email) with rate and availability to Cheryl: cambrose@alphaconsulting.comALPHA'S REQUIREMENT #21-00747MUST BE ELIGIBLE TO WORK IN THE U.S. AS AN HOURLY W2 EMPLOYEE #ZR#LI-CA1"}