{"title":"Digital Audio Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIoxtXhbTA_Ojw-YS1v6lYHtC6eL0txe4C3fEltWzXezsGE685NxU8wcZ473KgR4cY-OhteNNTTvPQiQhdQ58JBJx7Yz48fmDRaAYpxdUAb61l45cyog_31JeDBazzNjj4Z_ND5l74aZ2tAKqlnvbSrcEUSMbutz4acpRVhv9vHibjN1yTipGZdPgHespY","source":"ziprecruiter","full_description":"Digital Audio Network Engineer Information TechnologyNew York City,New YorkApplyDescriptionDigital Audio Network EngineerNew York Public Radio, home to WNYC, WQXR, WNYC Studios, and The Greene Space, is seeking an IT professional with audio experience to support audio and video productionin our downtown Manhattan facility.Consider this opportunity to use your IT and audio engineering skills to support the journalists, broadcasters and podcasters at the country's most-listened-to public radio station.This position provides 1st-tier end-user support focused on the needs of broadcasters and media producers -- including: + Radio Automation (DAVID Systems, RCS NexGen/Zetta) + Production/Mixing (Avid Pro Tools)+ On-air call management (PhoneBox) + News production and news wires (NewsBoss)+ Music scheduling software (MusicMaster) Responsibilities + Monitoring the above systems and responding to first-tier technical requests from end users+ Acquiring in-depth knowledge of NYPR's operations from a user's perspective in order to support broadcast and production workflows+ Learning the ins and outs of a myriad of new systems as they come online+ Performing software updates and testing all software configuration changes on mission-critical broadcast and production systems -- in collaboration with your senior team members+ Meticulously documenting solutions to technical problems -- both for end users and for IT colleagues+ Carefully maintaining the inventory of equipment in an asset-tracking system+ Participating in any training seminars, classes, workshops, etc. recommended by NYPR.+ Performing additional duties as needed+ Following standard operating procedures and policies set by NYPR Engineering and IT departments+ Maintaining all technical areas in an organized and safe condition Required Qualifications + Proficiency in troubleshooting PC and Mac hardware+ Knowledge of digital audio, editing, mixing, and storage + Expertise in administering Windows and Mac OS on a LAN + Understanding of current radio station and recording studio practices + Very strong team orientation + Experience with Active Directory, Group Policy, and automated software deployment+ A basic understanding of coding/scripting+ Familiarity with Jira software and Agile project management, preferred+ Work experience with Dante, Axia Livewire and AES67 protocols, preferred The ideal candidate has a curiosity to learn new technologies, enjoys a collaborative team environment, and looks for ways to improve the team's workflow.Additional InformationThis is a full-time role which includes benefits. New York Public Radio offers competitive compensation with excellent medical, dental, and vision insurance, vacation, personal and sick time as well as generous parental leave.Due to the nature of this role, in-person work at our office is required. All facilities are cleaned often, our ventilation system is fully compliant with COVID safety standards, and mask wearing is required. In addition, most non-essential employees are currently working remotely therefore very few employees are entering the office. Our team has worked very hard to make this a safe environment for those whose job duties require them to be onsite.This position is covered by a collective bargaining agreement between New York Public Radio and SAG-AFTRA. Commitment to Diversity, Equity & InclusionAt New York Public Radio diversity, equity, and inclusion is more than a strategy or an initiative; it is an organizational mindset that is reinforced every day. Ultimately, we strive to place our employees at the center of our thinking and pursue inclusive strategies to support and encourage them and create a more engaged, committed, and productive workforce. Diversity, equity, and inclusion are especially important to us as a media organization because a diverse workforce allows us to report with perspective and insight, and deliver a variety of content reflecting the diverse population we serve in New York City and beyond. We believe that diversity is essential to honest, authentic, accurate storytelling and reportage; creating an inclusive workplace in which all voices are encouraged and heard is a core part of our values as an organization. Equal OpportunityNew York Public Radio is an equal opportunity employer committed to achieving the goal of equal employment opportunity for all. Applicants and employees are considered and evaluated for positions without regard to mental or physical disability, race, creed, color, religion, gender, national origin, citizenship status, age, genetic information, military or veteran status, sexual orientation, marital status, employment status or any protected federal, state or local status unrelated to the performance of the work involved."}