{"title":"Full Stack Developer, Senior/Lead NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALQM-0tHOKBeMip6HSoHZxWRfhpdd01yNPhTn6Jg3HsG5vgb8pxzDxrep6Hsbwh97-LLYklrjpeZh-Wd-HpGrvSRefaL992PMre1UkwBVQuJAe4YkGk0YJVFiRrnXcVt6_Ai0HcqARRwOF0k1F6k3O4TodXniSe8WF7AK0zWOMsuEQLKTiObjVwcC1kfyhM","source":"ziprecruiter","full_description":"About UsOver 360 million people worldwide experience hearing loss, yet 80% of them do nothing about it. At Eargo, we?re striving to disrupt an industry that?s desperate for change. Through product innovation and web technology, we?re looking to make a true difference in the world. Think Warby Parker for eyewear or Casper for mattresses. We?re a family of engineers and entrepreneurs with an ambition to dream big, and we?re looking to you to join us and help make it all happen.Position SummaryThe Senior Software Engineer, Full Stack will be responsible for leading a team in developing, maintaining and optimizing the web and eCommerce experience at Eargo. This position offers the opportunity to take ideas from conception to reality, building features end-to-end in an agile process. You will be a part of a small, rapidly growing team in a mentoring role.Responsibilities + Lead the overall design and architecture of our eCommerce platform+ Participate in project planning efforts to coordinate development work+ Design, code, and test new features in an independent manner+ Translate UI/UX wireframes into responsive, cross-platform friendly user interfaces+ Ensure compatibility with various browsers and platforms+ Build scalable, maintainable and robust code+ Collaborate effectively with engineers, designers and stakeholders+ Mentor engineers in growing their technical talent+ Advocate for and adapt industry best practices for web development technologies Qualifications + At least 5 years of working experience as a Full stack engineer+ At least 3 years of work experience with Ruby on Rails+ Strong grasp of HTML, CSS and related web technologies+ Strong understanding of JavaScript, JQuery and other web scripting technologies+ Working knowledge of Git+ Experience with software testing, particularly in web development+ Experience supporting various browsers and platforms (e.g. ? desktop, mobile, tablet)+ Ability to work in a dynamic, agile environment Preferred Qualifications + Experience with Spree or other eCommerce platform+ Familiarity with site performance optimization using a variety of tools+ Experience with SEO Eargo is an Equal Opportunity Employer. All employment is decided upon the basis of qualification, merit and business need. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}