{"title":"Sales Manager Business Development NEW!","location":"","salary":"","description":"","term":"$72,000 to $78,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKL8AB3loM9bwEj0LP1VSFlpICZRhUtZNkCxU1dwyfwZBboQVony2Xx6eVmPVLJdzsBkuVDlHveHin1uU8IyCCfo7HbaNyT42nElUYItKm6phJ06qEtSGifIZNcpMGoUbR5MdiVlkBg6oGgUkwyrm_QRML4xkPESMLsv3swxYedpeMNYmgvNrlxGp55c0g","source":"ziprecruiter","full_description":"If you are:· Motivated to influence your own trajectory within a company· Dedicated to the idea of serving others through education and advising· Goal-oriented with a vision for growth· Seeking an accountable but flexible work schedule· Passionate about making a positive impact on a community· An excellent communicator committed to time-management mastery· Able to thrive in an environment with other coachable, competitive individuals…you don’t want to miss this opportunity to explode your personal growth and professionalgoals with PMA USA, Washington National Insurance Company’s largest American marketing partner.This position is a territory-based, outside sales role with opportunity for rapid advancement. We are gathering a team of people from varying backgrounds, many of whom did not have previous sales or insurance experience. That experience is a plus, but not a requirement. Our comprehensive training program is designed to effortlessly navigate you through licensing procedures and set you up for sales success in a team environment as you service our urban and rural clients.Qualities we look for:· Professionalism· Ability to travel (in state)· Commitment to earning the trust of our clients and managing those relationships in their best interest· Readiness to learn, grow, work, and prosperWe offer:World-Class TrainingLearn from industry leaders in both team and one-on-one environments, as our seasoned fieldmanagers and team members offer their experience and guidance to equip you withcomprehensive knowledge of Washington National’s products and how to effectively marketthem. On-going training, mentoring, convenient online training modules, and qualitypresentation materials are all provided as tools to support your success in the field.Advancement OpportunityAre you looking for a field management role? Advancement is based on your commitment, effort, and performance.· Commit to learning the industry product offerings.· Sharpen your sales skills with our proven playbooks· Demonstrate excellent relationship management skills· Provide five-star service to your clients.As you match people with products and use your experience to train others, PMA USA offersmultiple levels of advancement to keep growth opportunities achievable.StabilityWe service over 12,000 organizations in 49 states and have access to nearly 1 millionpolicyholders. We are backed by Washington National with $5.2 billion in investedassets and $3.9 billion in policy reserves.* Our excellent track record in marketing, sales, andcustomer service date back more than 20 years, as PMA USA is the insurance marketing powerhouse that emerged through the combination of three of the most successful regionalinsurance marketing firms in the United States.Unmatched Product Portfolio:We know that our sales are only as strong as the products we sell. You will be confident thatwhat you are offering to clients is the best in the industry. Washington National, a companywith more than 100 years of service to its policyholders, has paid nearly $5.6 billion inclaims to supplemental health policyholders to help protect policyholders from the costs of illnesses, injuries, and accidents. Nearly $3 billion has been paid to policyholders through thereturn-of-premium and cash-value benefits.**Tremendous Income OpportunityCompetitive commission compensation with generous bonus structures along with lifetimerenewal income from your individual and team sales mean your earning potential is unlimited.Add in trips, prizes, recognition, and team support and you have a very unique opportunity toobtain the life you imagine for yourself, all while providing an invaluable service to thecommunity.Earn what you’re worth, enhance the lives of others, and have a great time doing it!PMA USA is an Equal Opportunity Company.*Data as of September 2019**The claims and premium-return amount are based on ROP/CV and claims payments to Washington National policyholders from January 1, 1995, through December 31, 2017. The return of premium (ROP) or cash value (CV) (in MO, “cash return”) benefit is subject to state and productavailability. The benefit has an additional charge and may pay minus claims or regardless of claims based on the policy selected. The policy must remain in force until the end of the ROP/CV period for the benefit to be paid."}