{"title":"Onsite Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJQjoibjm04MajmJIgllGyp50-B8thpzD3p52BR6XPEZFaVGPbE-HTOWWY99G0UEWCh35255vFwFzcyirhNUqtcyS1YoglN3JgfE6PwR1kfOtJ_iy61W6TY3SurTFB46v-IL2QNpldUGfMGokbOmp-WH1pIkQchzS3wqtyLjEJXs4FpcWrEUphuex0NIzg","source":"ziprecruiter","full_description":"The DigitalNET Onsite Engineer provides a high level of in-person customer service implementing, maintaining, resolving technical issues, supporting, and optimizing all customer workstation and server hardware, software, and network equipment and connectivity. Must be customer service orientated, have effective verbal and communication and provide proactive work on behalf of our clients.Responsible for working through DigitalNET’s ticketing system to configure, implement, monitor, manage, and support all of DigitalNET’s clients IT environments including;Windows workstationsServer hardware and server operating systemsAnti-virus/malware software and remediationEmail systems such as Office 365 and/or Exchange and SPAM FilteringNetwork switches, firewalls and access pointsBackup systems and data recoveryAdminister and maintain end user accounts, permissions and access rightsProvide 3rd party vendor management assistanceProduce accurate documentation related to client environments and issue resolutionEnsure that Service Level Agreements are met for all customersThis role must also be able to;Setup, deploy and replace Windows desktops and laptopsSetup and install Windows operating systems, Microsoft Office Suite, and other Windows applicationsSetup and install network equipment such as switches, firewalls and/or wireless access pointsSetup, deploy, replace and support server hardware and Windows Server operating systemsSetup, deploy and support server virtualization such as; Microsoft Hyper-V and VMWareCoach and mentor junior staffExperienceThree to five years hands on experience configuring, deploying, supporting and troubleshooting PC hardware, Windows operating systems and Windows applications, server hardware and operating systems and networking equipment networking hardware and protocols. Experience working with 3rd party vendors.EducationCollege diploma or university degree in the field of computer science preferred. Industry certifications such as Microsoft, CompTIA, Cisco and other is a plus but not required.Interpersonal SkillsDigitalNET Onsite Engineer must be customer service focused. This is a direct customer interactive role so strong written and verbal skills with the ability to speak in user-friendly terms as well as communicate with technical peers. Collaboration with peers to problem solve and find the best solution and outcomes for DigitalNET’s clients is a must.Work ConditionsThis position will have local travel with 90% of time at client sites, so a clean driving record is required. There will be limited after hours work but must be available for On-Call support when required. This role may require the ability to sit or stand for extended periods of time. The ability to lift and transport moderately heavy objects such as computer equipment and peripherals. May require climbing of ladders or working in confined spaces such as under desks, data closets, etc.Full Time/Direct Hire!! GFI Digital offers a full suite of benefits - medical, dental, STD/LTD, Life Insurance, PTO and 401K."}