{"title":"Diesel Mechanics and Service Technicians","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIhrYP5KYIVYS2TEzhgeXDeph_qLej0uDSkC5LfWCRsxHFLY4jkEXT7djD2z-kCT4iGUyZKlRSTQyUpSQYFlKP9UNiHK7TLD01aV4F_PfizuSQ74WZe_bCLV_dVSyzZXHJJzdehzemJQmBnvsgkXW9pvMWPIj_t-obVZ17lFrskGeG4xj9-EaBlWbU1Q-c","source":"ziprecruiter","full_description":"Outstanding career opportunity!Long Term, Stable Employment, Great work environment.J. P. Mascaro & Sons is a locally owned and operated private family owned company who has been experiencing record growth and success. In 1964, it started with one truck. We have grown into one of the largest most successful fully integrated solid waste companies serving the mid-Atlantic area.For over 40 years, our motto has been \"If it's service, it's us\". We cannot meet the goals of our company if we do not satisfy our customer's needs first. Our existence is dependent upon them. Our employees are our greatest asset. We invest in the growth and success of our employees. Come join our team!!We have immediate position available for a dependable and dedicated Diesel Mechanics and Service Technicians to support our ongoing success in a family-like environment at our Parsippany Transfer Station.The main responsibility of this role is to maintain and repair equipment and associated equipment in a safe, time and cost efficient manner in order to maximize vehicle utilization and longevity.ESSENTIAL FUNCTIONS:Repairs and maintains a wide variety of equipment, cabs, and bodies of company equipment and other equipment as necessary to maintain a serviceable fleet of heavy equipment for the division’s operating needs.Performs regular preventative servicing to include oil and filter changes, lubrication, hoses, belts, transmission fluids, coolant system, batteries, brake lines, brake adjustments, hydraulics, lights and electrical components, and engine components.Inspects and tests equipment at prescribed intervals of time and usage or upon malfunction or breakdown. Diagnoses malfunctions, disassembles, inspects, and replaces worn or broken parts as required.Performs repairs to equipment to meet standards set for inspections and safety standards.Test-drives repaired equipment on-site. May drive a service vehicle on site or off site to travel to other divisions, pick up parts, etc.Uses hoists, winches, lifts, gauges, drills, grinders and hand tools specialized to the mechanical auto/truck trade.Keeps service records, accounts for time and parts used.Performs welding, bodywork and repainting as necessary to maintain equipment.Reviews Vehicle Condition Reports and makes repairs as indicated.Notifies supervisor of unsafe equipment and recommends corrective action.Notifies the Maintenance Manager for all work required which is beyond the mechanics ability, or for direction when unsure of proper repair methods.Able to work with a minimum of supervision and complete tasks in a timely manner."}