{"title":"Software Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAINRUZPO7L4CQiDPYvjp1NuD-CI_acLJx1fNaMjkDeRcDDlb4w7vzh_4LWDW8ZddyKfw-D-vNF7uIQADsH7aWDkUKPhQt3dptU_nrWJQ6zVqcqDjlqgdU4fun15huOXzxnHgVSS66REtKxwq-oEbU-u85JMNK_W9ajVHaJLubD_EG9fg-PRFGhqw-PW73i4","source":"ziprecruiter","full_description":"Job Description:Enlogica Solutions is actively seeking a Software Developer to support our client in Huntsville, AL. Successful candidate will provide creative solutions for complex technical system and software integration problems using modern DevOps/Agile process and tools. Candidate will be able to work in an ever-changing environment managing multiple tasks and projects and will have strong problem solving and analytical skills. Candidate must be able to work with a team and also independently with minimal guidance from supervisor/manager.***MAJOR JOB ACTIVITIES:**** Works in a DevOps environment employing techniques such as Continuous Integration, Continuous Deployment, Test Driven Development (TDD), Automated Functional Testing, and Pair Programming throughout the software development life cycle Works closely with Systems Engineers to design ideal solutions with the end user and operational needs in mind Applies various technologies including C#, C++, Java, XML, XAML, JUnit, Jira, etc.***PREFERRED SKILLS:**** Experience with narrowly defined or ambiguously defined capability and translating it into a reusable open source software application which interfaces using new technology, innovation, and creativityResponsible for performing development, integration, test, and documentation duties in a DevOps environment to ensure proper operation of the software platform Ability to work in agile environment using test driven development (TDD) and paired programming Develop software, tailor reusable software, and integrate software components on virtual machines or target hardware***REQUIRED SKILLS:**** C#, Java, and/or C++, Object Oriented Analysis (OOA), and Object Oriented Design (OOD) skills Proficiency in Android, Windows, and/or Linux operating system concepts Knowledge and understanding of agile software development* Strong oral and written communication skills; ability to work closely in a multi-discipline team on a daily basis***REQUIRED QUALIFICATIONS:**** Bachelor's Degree in Computer Science, Information Technology, or a related field and 6+ years prior work experience (in some cases experience will be considered in lieu of a degree) Active Security Clearance or ability to obtain Security Clearance (or company may sponsor qualified/suitable candidates) Active CompTIA Security+ Certification and equivalent acceptable Computing Environment Certification(s)About Enlogica:Enlogica Solutions is a Technology Services and Solutions Company focused on providing Commercial and Government customers with robust and cost effective solutions to their problems. We are a responsive SBA 8(a) certified Small Disadvantaged Business (SDB) with strong capabilities, innovative ideas and firm dedication to solving customers' challenges. We provide excellent employee opportunities for growth, recognition and advancement. Enlogica is an Equal Opportunity Employer. Enlogica does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other basis covered by appropriate law. All employment is decided on the basis of qualifications, merit, and business need.Code: AL-191007Category: Information TechnologyDepartment: Customer SiteLocation: Huntsville, ALJob Type: Full Time"}