{"title":"Hardware Engineer I NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIL8KAVLgyMqQu5KgClkFEQeoGBWVjkunr3JnnVwZsxMaK8OwBeRDtkwGqoFQjL0ZWm0sOebOPOFTT3RUVWoWEjCSa_aHMj6qI6vuxdguDDZIvCfe5C8mItZ_WJqN7iw8UWBiTRCKG7MSassZjp-IFs13QhCu9qPTSfx6B0ZjVZLbo1oWkxiH3SsPXw2LEG","source":"ziprecruiter","full_description":"Innovation Lives HereYou go all in no matter what you do, and so do we. You want to use your powers for good, and that's exactly what we do at Lytx. Our team is made up of hungry, humble, and capable people who are making a difference every day with technology that helps save lives each year.Why Lytx:Lytx's Engineering department is looking for a Junior Engineer that will work under the supervision of our Senior Engineer and will mentor our HW Technicians. The immediate role will be design maintenance, which includes working closely with our supply chain to prevent component shortage situations in our continuously growing manufacturing capacity. This is a cross functional role that includes working the Operations Organization, external component suppliers and distributors. As the role grows, the engineer will be included in design concept and in the R&D hardware process.You'll Get To: Maintain Hardware design Collaborate with other departments and outside vendors to provide engineering support Be responsible for second source evaluation of key electrical components Create test specifications for HW features; executing test conditions and documenting results against test specifications Analyze field returns and proposing HW design improvements Collaborate with mechanical engineers to solve problems and component quality engineers on component issues Track engineering change orders (ECOs) throughout their life cycle Provide guidance to Hardware technicians Review troubleshooting guides for manufacturing support Serve as the main point of contact for the technical support team Perform other duties, as assigned.What You'll Need:  BS/MS in Electrical Engineer or equivalent combination of education and experience MS Office skills are a must Previous internship experience in engineering hardware 1 year of experience in Electrical design is a plus Knowledge of electrical/electronic engineering fundamentals Knowledge of Electrical circuits simulation software tools  Effectively collaborate with cross-funtional teams, both technical and nontechnical Basic understanding of systems engineering Be willing to learn, ask questions, suggest solutions and be a true team-player____________Lytx is powered by cutting-edge technology and Happy People. You want to use your powers for good, and that's exactly what we do at Lytx. Our team is made up of hungry, humble, and capable people who are making a difference every day with technology that helps save lives each year. Lytx, Inc. is proud to be an equal opportunity/affirmative action employer and maintains a drug-free workplace. We are committed to attracting, retaining and maximizing the performance of a diverse and inclusive workforce. EOE/M/F/Disabled/Vet."}