{"title":"Rep, Technical Support I - Lenexa, KS","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ70xHd91x40iZpOxmNrRbnDY4-2hZn5Ih--rEeeDFHZ3js6kHIv9Pb-Tb3i1fXK1k0n-Zc1rwnj8JtRKvarybRwmvfIXUWOr6kRwPASCxgUSAkx_LzoPK9feunQLLL2AERlnoE-QbnzUZche7JcMPrweNMu5xycHg74peg6-jQJbK-lk7Q88lAc_lB8So_","source":"ziprecruiter","full_description":"Questions and Answers.  In Client Services you will work for the world leader in the industry, with a career where you can expand your skills and knowledge. You'll have a role where you can act with professionalism, you can inspire colleagues, and you can care about the work we do and the people we serve. At Quest, Client Service is something we take pride in - making sure that the people we serve feel valued and understood, while providing and gathering accurate information. Client Service is always critical and that's why our team is both valued and recognized within the business as a key part of our brand. As part of a diverse and supported team, Client Services offers an outstanding career path with an industry leader.Rep, Technical Support I - Lenexa, KSBasic Purpose:  MyQuest Technical Support Rep will provide first-level technical and non-technical support for Consumer Suite of Products, including but not limited to, MyQuest Patient Portal (Web & Mobile) and QuestDirect.  The position will review, diagnose, and resolve basic and complex issues using various support tools and systems.  Maintain timely, accurate, and detailed record of each interaction and provide follow-up to ensure total contact ownership.  Recognize problems outside of MyQuest Help Desk environment and escalate to appropriate functional support teams when necessary.   Principle Duties:  Review, analyze, diagnose, and resolve support inquires received via e-Mail, Gazelle Tracker, PRS Admin, and Skype related to MyQuest and QuestDirect using established guidelines and processes.Understand and comply with security and support policies and procedures.Perform assessment analysis to identify root cause as well as scope of problems and escalate recurring issues to management. Maintain proficiency in applications and product expertise to serve as an internal consultant in multiple applications and functionalities. Demonstrate ability to effectively communicate, verbal and written, with all levels (consumers, technical and non-technical personnel, and leadership). Use appropriate tools to document all pertinent details of support inquiries to allow for maintaining of complete and accurate records.For inquiries submitted via email - offer to call the customer at their convenience should they have questions that may be better answered over the phone rather than email. Comply with and proactively contribute to the improvement of all established processes and procedures to ensure regular adherence to Service Level Agreements and Service Level Objectives.Maintain up to date knowledge and assimilate quickly to product enhancements and releases.Be accountable for meeting and/or exceeding individual and departmental Key Performance goals set by NCECS leadership team.Participate in development of process, procedure, and technical documentation for communication as well as adhoc and scheduled training for continuous learning and improved efficiency across the team.Partner across functions (NCECS, Billing, Patient Advocacy, Data Steward, Legal, Compliance, IT, etc.) to review, investigate, and provide recommendations for problems or gaps. Lead by example in demonstrating \"Everyday Excellence\" and modeling Quest behaviors.  Accept changes in the organization, including additional job responsibilities and schedule changes when appropriate.THE ABOVE STATEMENTS DESCRIBE THE GENERAL NATURE AND LEVEL OF WORK PERFORMED BY PEOPLE ASSIGNED TO THIS JOB.  THIS IS NOT AN EXHAUSTIVE LIST OF ALL THE DUTIES AND RESPONSIBILITIES THAT AN INCUMBENT MAY BE EXPECTED TO PERFORM. Quest Diagnostics has many career opportunities for individuals whose talent, initiative and dedication will complement our belief that the patients come first and that values do matter. We work to earn our customers' trust every day by providing the highest quality diagnostic information services in a professional, accessible and informative way. We have a large recognized brand; we offer flexibility and autonomy, great support, pay and benefits and a comprehensive training and onboarding program. All requirements are subject to possible modifications to reasonably accommodate individuals with disabilities.  Quest Diagnostics is an Equal Opportunity Employer: Women / Minorities / Veterans / Disabled / Sexual Orientation / Gender Identity."}