{"title":"Blue Prism Certified - RPA Developer","location":"","salary":"","description":"","term":"$45 to $75 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAI1zosQ_xRhL4jhYXj0c2E5CljWYUNCXvsnYF9nTsyCP-cESLrwleclTkU2AgcSTBkapp9pyhFK3GteTszGQ89Y-Ru7e_4To36w1p0tmF2jlj-swD_zNHMshEAsSRAHL0uk8sPUY2v2_3j4dsWdRlc2rLY22A17rSuyz1LAfxyfDUvcZt2QyKN5aBsX-p4","source":"ziprecruiter","full_description":"RPA Developer (Blue Prism) – 12 Month(s) Contract - Atlanta, Georgia – 100% RemoteAs an RPA Developer, you will be responsible for the development and implementation of automation processes. You will also validate automation by performing unit testing and ensuring that environment and configuration control is maintained at all times.Day-to-day, you will:• Develop new processes, tasks, and objects using core workflow principles that are efficient, well structured, maintainable and easy to understand• Comply with and help enforce design, coding, and testing standards, policies, and procedures• Work collaboratively with test teams during the product-test and UAT phases to fix assigned bugs• Report status, issues, and risks to tech leads on a regular basis• Improve skills in automation products by completing automation certificationsEnterprise Req SkillsRPA, Blue Prism, Finance, Automation, Robotics, .NETTop Skills Details1. 3+ years of RPA Development with Blue Prism. Must be Blue Prism, no substitutions.2. Background in .NET/Microsoft technologies.3. RPA Blue Prism Certification.Additional InformationCAN USE APPROVED SUBVEDOR IF THROUGH POPULUS GROUP• 1-2yrs experience with Robotic Process Automation’s solutions leveraging BluePrism(BP)• BluePrism Developer Certification, a plus• Knowledge of SQL databases• HTML/JavaScript experience• Experience in the financial sector• Experience as a software developer like .NetDrug Test RequiredtrueExperience LevelExpert LevelExternal Communities Job DescriptionTEKsystems is looking for a senior Blue Prism developer for a long-term contract with a large fortune 500 clients.EVPFortune 200 company and provides a large, enterprise work environment. This position will touch multiple areas of the company and will be consistently evolving with new technology. They value work/life balance, the facilities are great, and the people legitimately care about one another. Additionally, there are many fun events that take place on campus. There is an onsite cafeteria, an onsite library, auditorium, and more.The company provides clean, safe, reliable, and affordable energy through electric operating companies in four states, natural gas distribution companies in seven states, a competitive generation company serving wholesale customers across America, and a nationally recognized provider of energy solutions, as well as fiber optics and wireless communications.This client’s brands are known for excellent customer service, high reliability, and affordable prices that are below the national average. Through an industry-leading commitment to innovation, the company and its subsidiaries are inventing America\\'s energy future by developing the full portfolio of energy resources, including carbon-free nuclear, 21st-century coal, natural gas, renewables, and energy efficiency, and creating new products and services for the benefit of customers.Additional Skills & QualificationsPer Client Website--• Results-oriented, product-focused excellent ability to work cross-functionally.• Exceptional observation and listening skills; ability to recognize user experience needs and convert them into product design.• Ability to work well with a team; values the project, company, and co-workers.• Excellent communication skills, both verbal and written.Start DateFeb-28-2021Impact to the Internal/External CustomerLoss of productivity and efficiencyInterview InformationEach candidate must complete a Sparkhire interview to be submitted. Then they will interview with Tammie and the team.Business ChallengeTheir Financial tasks are in the process of being automated and they are seeing a significant amount of work coming from Finance, Treasury, and Accounting to continue automating tasks"}