{"title":"REMOTE Software Developer","location":"","salary":"","description":"","term":"$65,000 to $110,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKTp6XKTxVQT9zZtPkPC4RRxB5aPaWaZoitUX7dcbOUOFmlQb_C2rsXxGaEWBfcgcE0XJYQwCs9I4puNUn3ddQN4aMp6-m9t-KpSY4uvkmh86SSfLMZTpV6fOsKVCjXe_vQzUHTk-9hrkNyHhhMorZlNaaX9-0sZmE2urmuZHhTH8l0EdAE8J1y4a-mvt0","source":"ziprecruiter","full_description":"REMOTE Software Developer If you have several years of Vue experience building SaaS applications, this is the role for you! Working remotely for the foreseeable future, we'd love candidates who are local to the greater Dallas/Ft Worth area. We are a digital agency with 15 years in business focusing on working with institutions and organizations that impact the world in a positive way. You will be a part of a small, tight-knit group where your experience and contributions will make a difference.Top Reasons to Work with Us- Our clients impact the world in a positive way- Tight-knit group with massive growth potential- Work alongside bright and motivated individuals like yourselfWhat You Will Be DoingPrimarily, you will be bringing your strong Vue experience to our team to build SaaS applications. - Create beautiful, exciting and responsive websites and SaaS products- On top of Vue, you'll use JavaScript, HTML5/CSS3, Less/Sass, Motif, PHP, Laravel, Sketch, Wordpress, Adobe Creative Cloud/Suite and moreWhat You Need for this PositionQualifications:- Bachelor's Degree preferred or equivalent work experience and certification- 2-3+ Years' of Vue.JS for SaaS applications and products- Experience creating exciting and responsive websites- JavaScript (ES5/ES6), HTML5/CSS3- LESS/SASSSome combination or knowledge in the following would be great:- Motif, PHP, Laravel, WordPress, Sketch, Adobe CS/Cloud, ModernizrWhat's In It for You- Competitive Salary DOE (65-100K+)- Comprehensive Benefits (Health, Vision, Dental)- 401K- 3 months paid maternity, 1 month paid paternity- Flex Scheduling- Flex vacationing (no limit....people actually take vacation)- REMOTE for the foreseeable future, but when back in office, it's a casual environment focused only on results- Professional development budgetSo, if you are a Software Developer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}