{"title":"Senior iOS Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKhba3gvMgXJl0_RlnLysglaMyiPA6LW7TXzlIIh_u0HtTW6qzg_u3MQhvX3fpPXRFRHP8rKOy_b1URngEOwZmxeXajqhG9518X4D7YYUoiURmKf2R2LkAyZr7P0ZfyrnIm1sFSp5BsIatmUhHftTQWGbmC4fdkroVoSgUHmjMXpGVD47VNrT1rIIafhg","source":"ziprecruiter","full_description":"Job Description#### Description### Our client delivers the apps, integrations and strategy that power connected user experiences. They are strategists, designers, and developers - and partner with leading companies to build transformative mobile and web applications for the Internet of Things.Job DescriptionWe are looking for an experienced iOS developer responsible for the development and continuous integration of a variety of IoT applications. You will have the opportunity to work directly with designers and developers who have been supporting enterprise-class connected products for nearly a decade. A commitment to collaborative problem solving, sophisticated design, and overall quality is essential.As an iOS Developer, you will... Develop new applications for Outside Source and for our clients Continuously integrate on existing mobile applications Write user stories, technical, and functional requirements Work closely with UX / UI teams to design first-class experiences Ensure the performance, quality, and responsiveness of applications Collaborate with a team to define, design, and ship new features Help maintain code quality and organization Guide clients towards effective solutions that balance technical requirements and business needs Attend development meetings (stand-ups, retrospectives, kick-offs, UX / UI design sessions)####Job Requirements#### Requirements Must reside in the US and be legally authorized to work in the US. You know the core aspects of iOS development within Xcode: workspace configuration, project / target configuration, build configuration, scheme management, and debugging You have significant experience with Swift and Objective C You have extensive experience implementing UX / UI programmatically with UIKit, Storyboards, and Auto Layout You know your way around Object-oriented design You have a solid knowledge of multithreaded programming concepts You have successfully managed projects with CocoaPods / dependency management You can smoothly integrate with any API You understand managing code in Git You have completed the App Store submission process You have excellent written and verbal communication skills You are friendly and understand that strong interpersonal skills are key for successNice to haves incldue: Have developed with other languages: JavaScript, TypeScript, Node.js, C#, Go, Kotlin, etc. Have developed Apple Watch apps using WatchKit Have developed apps supporting IoT integrations Have developed apps supporting Bluetooth integrations Have explored Alexa / Google Home integrations Have experience integrating with microservices on AWS, GCP, and Azure Used RxSwift / ReactiveX frameworks Used Realm or CoreData frameworks Have used Instruments for app performance and memory tuning Have implemented push notifications using Cloud SaaS providers Have experience with functional programming Have used test or behavior driven development Have distributed iOS apps in an enterprise environmentPosted: 6/30/2020Category: DevelopmentJob Type: Contract"}