{"title":"Hardware Engineer Sr","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIJ8Dlayoy9yx-iRAdQx_et0EtYwmL8Mq-BlNIWe2IOu3nq58d0wQVEaQuyZlzKMF860Ar1jOBZnPJR4hU2UrX-CcFMS28drhTKHv9QzTTqX-Xu6sg1Fn1X8qiDpnMRZM9FD_C7Q8Jd9eW67RDDZBzyskqchUDnHdzBmS0f4SYUvmw_6nZPQ36_WlxRWWR8","source":"ziprecruiter","full_description":"Description:The coolest jobs on this planet... or any other... are with Lockheed Martin Space.At the dawn of a new space age, Lockheed Martin is a pioneer, partner, innovator and builder. Our amazing people are on a mission to make a difference in the world and every single day we use our skills and experiences to create, design and build solutions to some of the worlds' hardest engineering problems. Our culture encourages employees to dream big, perform with excellence and create incredible products. We provide the resources, inspiration and focus and if you have the passion and courage to dream big, we want to build a better tomorrow with you.In this position you will:Conduct or participate in the research, design, development, and testing of COTS or custom computing hardware and/or other electrical components. Develop designs for the installation of components and assemblies into chassis, racks, cabinets, workstations, customer facilities, and/or shelters. Plan, direct, review, and coordinate preparation of project documentation to ensure customer contract and company requirements are met. Prepare specifications, evaluates vendors, and analyzes test reports.Typically has 5 - 10 years of professional experience.To promote the sharing of ideas, Lockheed Martin fosters an inclusive work environment that encourages differences and big-picture thinking.Our employees play an active role in strengthening the quality of life where we live and work by volunteering more than 850,000 hours annually. Here are some of the benefits you can enjoy:MedicalDental401kPaid time offWork/life balanceCareer developmentMentorship opportunitiesRewards & recognitionLearn more about Lockheed Martin's competitive and comprehensive benefits package.Basic Qualifications:Experience with hardware rack & stackExperience with fiber/cable runsExperience reading/interpreting drawing packages and cable diagramsExperience working in a team environment and lead jr EngineersDesired Skills:Experience creating, modifying and maintaining system drawing packages.Proficiency in cable fabrication, installation and troubleshooting (BNC, ENET, RF, Fiber Optic, data).Qualifications: Experience with hardware rack & stackExperience with fiber/cable runsExperience reading/interpreting drawing packages and cable diagramsExperience working in a team environment and lead jr EngineersEducation: Experience creating, modifying and maintaining system drawing packages.Proficiency in cable fabrication, installation and troubleshooting (BNC, ENET, RF, Fiber Optic, data).Employment Type: TS/SCI"}