{"title":"Senior Backend Engineer (Remote) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALQhhDOhC0kiRWuDwM2Xp1sWW8G90M9hGkHUEI8V0kvFPOJEFvGoigMCBv-OH7DbZeUfm-x-JN_KkvqqqUH0NOtgDP76zqw4Mzh9YQW4ePkqI61OusIIwOI0W4Nz_2cRy-VU3Trc7UDkeHIWp0-uTiQbkMcWjRIJM9MnQv4mI_hvMYQQstAZkFebg9FD_k","source":"ziprecruiter","full_description":"CVP seeks highly talented Remote Senior Backend Engineer to join our growing team in the Washington, D.C. and Baltimore Metropolitan areas to support mission-critical applications for our customer. The professional will be responsible for developing efficient software that serves our customer’s needs. The ideal applicant will also help solve critical business challenges with an innovative use of technologies. This is an excellent career opportunity to engage in creative work environment!ResponsibilitiesAssimilate quickly into CVP’s consultative approach.Utilize analytical skills to solve interesting and complex problems.Perform analysis, design, development, testing and maintenance of web and client-server software applications.Leverage Agile project management and software development methodologies.Possess and maintain knowledge of web-based technologies and architecture.Follow Software Configuration Management techniques and practices.Perform iterative code development.Perform troubleshooting and supporting production applications.Assist other developers with technical solutions.Evaluate, identify, and present alternatives for software.Drive enhancements, optimize performance, and troubleshoot defects for core business applicationsQualificationsBachelors or Master’s degree in Computer Science or related field from an accredited college or universityStrong applied experience - You've built, broken, and rebuilt software applications.Extensive Typescript requiredSolid experience with backend development using NodeJS or NestJSHands on experience with Web Services, SOA, REST APIsExperience with cloud platforms; AWS preferredVery strong foundational knowledge of Relational Databases with Oracle, Postgres or SQL Server, Data Structures, Algorithms, PL SQL development, Operating Systems, and Software EngineeringDevelopment experience with JavaScript framework; React, Angular or VueWorking knowledge of web technologies (such as HTTP, HTML/DOM, JavaScript, CSS, JSON, JQuery, ES5, ES6)Strong understanding of, and experience with Agile development practicesExperience performing unit testing; Jest preferredAbility to work independently and multi-task effectivelyA constant desire to grow, learn, and explore new thingsAttention to detailDesired QualificationsExperience working with or familiarity around .NET Core and C#Experience with ORM's like N-Hibernate, Entity Framework, or TypeORM"}