{"title":"Apple Technical Engineer","location":"","salary":"","description":"","term":"$55,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKvB2HMun42wOIxOEWjGZNSjwS0qRba-Imr_5ZL2EFW1jsrK08vzlXFf2XlsH9lIFZeOwwylIuK5af0DwQ-T_itjBNGBcrIpLRmqbpCq0uGf_DPffq1dyh0Wu9_N_mqunfRp92KbPpgD08lIadBZ8sMKLBRfjd49RGcbyfACLL2W-zSGlspyiFFAwoojqLV","source":"ziprecruiter","full_description":"Greystone Technology is looking for creative, self-accountable IT professionals to engage in our fast-paced, people-driven service model. Average IT people tend to be great at solving technical issues, but poor at understanding the true problems that need to be solved.We’ve redesigned the way technology services are provided – from the ground up. We don’t start with solutions; we start with questions. Lots of them. Then we listen. Service providers have a well-earned reputation for sharing the answer before knowing the problem, resulting in businesses getting solutions they don’t need to problems they don’t have.If you think differently, solve creatively, and love to connect with people, we want you to join our mission of digging deep and proving how meaningful IT services can be. It’s as common sense as it is revolutionary.We are looking for an On-Site Apple Technical Engineer (in other companies this person could hold the title of Jr. Systems Administrator, higher level Help Desk/Desk Side Support, Field Engineer, Tier 2 Technician) to join the Premier MIT team. The On-Site Apple Technical Engineer will be responsible for handling the majority of day to day user requests and tickets for a client within our Premier MIT Team. This position requires a person who can communicate about complex ideas and technology in simple everyday terms. The expected starting salary for this position is $55,000.This role will be located at our client location in Cherry Creek, CO. Ticket management and documentationLearning independently about our clients’ ever changing systemsWorking at our client location on a daily basisDoing what it takes to create enthusiastically satisfied customers and build trust and credibility within a client groupPreferred Skills & Experience3+ years’ experience in an IT help desk or desktop support environmentProficient in basic Apple support (iPad, iPhone, Mac, Apple watch, and iOS troubleshooting experience)Comfortable operating in high intensity situationsPrioritize and organize tasks based on urgency and needsAble to work within a team and independentlyExperience supporting Microsoft ServersA demonstrated history of pursuing learning objectives independently2+ years’ experience troubleshooting or supporting Microsoft platforms (e.g. Office 365, Active Directory, all current flavors of Windows)Experience troubleshooting or supporting Microsoft platforms (e.g. Office 365, Active Directory, all current flavors of Windows)Knowledge of networking principles, what they mean, and how they interact (TCPIP, DNS, DHCP, LAN/WAN)Experience installing, troubleshooting, and maintaining peripherals (scanners, fax machines, printers, etc.)Experience troubleshooting standard hardware issues and running diagnosticsKnowledge in standard IT Security practices (virus remediation, firewalls, phishing, etc.)A strong background in customer serviceDemonstrable ability to quickly learn and support various business applicationsUnderstanding backup and disaster recovery conceptsExperience with vendor management is a plusPreferred AttributesAn awareness of how technology impacts businessThe desire to work as part of a teamCritical thinking aptitude and troubleshooting experienceAn empathetic approach to solving customer problemsCuriosity about technology and the ability and motivation to learn independentlyProfessional confidence, and a passion for solving problemsA positive, courteous demeanorAn aptitude towards serviceOpenness to feedbackAbility to learn from experienceA focus on finding appropriate long-term solutions to technical issuesThe ability to own technical problems and see them through to resolutionWe are proud to be recognized as one of the top workplaces in Denver. In fact, it’s Greystone Technology team members themselves who say our company is a great place to work. We’ve created an inviting workspace that fosters a culture of collaboration, inclusion, innovation, and excitement. Some of the things our team members enjoy including:Competitive wages | $55,000Generous benefits for you and your family including Health, Dental, Vision, Life, Disability Insurance, HSA & 401(k) employer contributionsMaternal and paternal leaveVery generous paid time off program that is unique to the IT industrySustainable work-life balance and flexibilityYearly work anniversary rewardsFun company events, including chili cook-offs, annual company photo shoot, monthly happy hours, cup in hand kickball league, and more!We’re looking for smart, highly skilled, passionate people to help us do something daring, difficult, and incredibly rewarding. If you are ready to learn, be inspired, solve problems, grow professionally, and unleash your talent. Come as you are and apply today!How to Apply:We get a lot of job applications and unfortunately most of them get nothing more than a quick once-over. Please include the usual - a resume and a cover letter, and anything else that will show us that you are interested in and qualified for this specific position. Tell us stories. Show us as much as you can about who you are. Make us panic about the fact that we haven't already hired you. Learn to use Facebook privacy settings or better yet just un-tag yourself in that one picture (you know which one) and then become a fan of our page. Tell us your salary requirements and what kind of cookies we should bake for you on your birthday. Afraid you’re missing a technological requirement? Apply anyhow. We’re probably okay with teaching you some stuff if you’re as obsessive about customer service as we are.Greystone Technology is committed to creating an inclusive environment and is proud to be an equal opportunity employer. Greystone recruits, employs, trains, compensates, and promotes regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status."}