{"title":"Software Developer - Huntsville, AL","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIpVfBBdMPoSNPswvFHG8DnrGKW_6T2amPfyJ5s5RVmuzjKaWmgPZO_PmzGMLn-lNifobnxAFPvRwJg8N_SiOc5ALqwAeX9ZmoEzevt-M-HZCZhC_nnNkuYIGYIK_EY2ilBJF4_kKGmpmt4tZp4rw4mlW8Vo_lMfMe9X06bWCeH2P2Ia1WyFgQSx4LUxSM","source":"ziprecruiter","full_description":"Software Developer Location: Huntsville, AL (Remote)Pls. apply online at: https://www.1prospect.com/careersFLSA Classification: Exempt - SalariedEmployment Class: Full Time RegularPosition Summary:1 Prospect Technologies, LLC is seeking a qualified Software Developer who works with design and development of system enhancements, code, test and perform user acceptance. Minor and major enhancements to support ongoing iterations and bug fixes throughout the process.Essential Duties & Responsibilities:As part of development team, Code assigned work in timely manner using the standards for programming in this environment.Code: Application programming languages shall include C# (Visual Studio)Knowledge of C++(Embarcadero C++ Builder).Developers shall be familiar with basic and advanced concepts in C++ and Microsoft dotNET, as well as mobile platform development tools (e.g. couch, Pouch, MySQL, xamarin, etc.).Participate in requirements gathering; Specify and review requirements.Provide documentation of programming concepts and designs.Assist team with development of white papers as required by the customer.Participate in System Design Review, System Test, Integration Test, System Acceptance Test, User Acceptance Test, and ImplementationMust be able to develop Technical documentation for operational sustainment.Windows Server 2019 Experience preferred.Experience with planning, installation, configuration, and troubleshooting Windows, Unix, Network Devices, Virtual Machine Components in VMware environmentsStrong knowledge of Microsoft operating systems, IIS, >net framework and networking required.Knowledge of various Windows functions such as DFS, DCHP, DNS, etcLinux knowledge preferred (specifically Red Hat)Participate in all phases of software development phases using Agile framework.Manage workloads, workflows, demand, and capacity management.Provide input into the production of monthly status report.A strong familiarity with concurrency, threading, and asynchronous programming shall be required. Developers shall be familiar with collections.Ensure all disseminated new applications and tools have been tested and are free of malicious code (e.g. virus, worm, etc.) prior to being deployed.Support testing and deploying non-production versions of the application or any relevant resources.Keep abreast of new technologies and be able to adapt and make recommendation based on best practices.Experience in VMwareKnowledge and experience with team collaboration tools such as Jira, Microsoft Teams.Education, Certification & Experience Requirements:B.S. or B.A. degree or equivalent in Computer Science/Engineering or related fieldActive CompTIA Security+ CE certification (Must possess/obtain required certifications per DoD 8570.1M)Must be able to obtain/maintain SECRET ClearancePossess five (5) to seven (7) years of software development. Must possess or be able to obtain vendor provided computing certificate. (i.e., Microsoft Certified IT Professional. Amazon Cloud Certification, MCTS Windows Server Admin)Three (3) years support of the Federal Government contractAwareness of Governance methodologies commonly governing DoD organizationsExperience with database environments including Oracle DatabasesOne (1) year working with Agile Software Development LifecycleKnowledgeable of ITIL Incident ManagementKnowledgeable of DoD audit readiness requirements and RMFAbility to work towards Professional Computing Environment certificationFamiliar with the ATO process and understanding Information Assurance system practices and the Risk Management FrameworkPossess knowledge in implementing computer systems in a phased approach of requirements analysis and conceptual design, site survey, system design review, critical design review, installation, integration, and testing.Capable of performing configuration management, integrating software, interpreting software test results, and recommending solutions in support of user community.Knowledgeable of lifecycle support, including maintenance, administration and management. Working Conditions/Environment and Physical Demands:Basic office work environment at government facility location.Hours of operation are generally M-F between 0630-1730.Must prioritize work hours during the core hours of 0900 – 1500.Occasionally, project requirements may require temporary adjustment of work hours/daysTravel may be required infrequently.Duties are subject to change based on the needs of the government customer1 Prospect Technologies, LLC is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class."}