{"title":"Analytical Chemistry Group Leader","location":"","salary":"","description":"","term":"$93,085 to $120,980 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKHZUbht9gEVbzBEY50-ryrEjIEKrDjfz1nki_vZLQ1jAuxIoLl8sXzUrMjE87O4evEWOKBF1MHXFm1ZZKSmfrlIH67I1UHi_pnCu5lgMKu0cHe57dGtIZxEU2M1vWE3N516TMF1XbC6DOEcrhBMhaUwd_oB12qzWvwh3HxTSu0qRvza6vAi48xijp8HVY","source":"ziprecruiter","full_description":"SALARYActual pay will be based on your skills and experience.SUMMARYResponsible for providing group-level leadership for the analytical chemistry department in accordance with all regulatory requirements. Guides, directs and reviews work done by analytical chemists to support the development of new methods and the performance of existing analytical developmental methods. The Group Leader also ensures the reliability, accuracy and cGMP compliance in support of the validation of new and existing analytical methods. The Group Leader also supports and troubleshoots investigations into the performance of all analytical methods. The Group Leader’s further responsibilities include training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems. The incumbent is responsible for creating an environment that encourages technical excellence, developing and coaching the group to improve skills, and ensuring high quality technical work. ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned.Guides, directs and reviews work done by the analytical chemistry department to ensure relevancy, accuracy and cGMP compliance in support of the development of new and existing analytical methodsEnsures the proper technical resources and skills are in place and appropriately applied to meet and exceed development and manufacturing goalsIdentifies technical, business, and interpersonal skill development needs of the members of the department and recommend appropriate training, either formal or on the job, and ensure training occursAppraises the performance, rewards, and disciplines members of the department. Is responsible for recruiting, hiring and in making salary recommendations for the members of the departmentParticipates in development of new processes by applying analytical skills and training. Initiates and executes development of new and innovative analytical chemistry and methodology. Provides written analytical procedures and reports supporting clinical manufacturing, commercial manufacturing and regulatory needs. Facilitates and supports analytical technology transfers.Plans and formulates aspects of analytical process as well as HPLC purification research and development proposals such as objectives or purpose of project, applications that can be utilized from findings, cost of project, equipment and human resource requirements. Observes compliant working practices including completion of all required training, attendance at scheduled safety meetings, and performance of safe operating techniques in the labs, production areas, and office areas. Comply with all Quality, Environmental and Occupational Health and Safety policies and procedures and governmental regulationsDevelops and approves analytical methods and specifications for development products (raw materials, intermediates, drug substances)Ensures that improvements are constantly identified, prioritized and implemented in the primary areas such as process development as well as process improvements, technology transfers, and process robustnessEstablishes, implements and maintains a system of work standards by developing guidelines and systems that ensure a consistently high level of technical work LEADERSHIP & BUDGET RESPONSIBILITIESSupervises and directs group directly in cooperation with department manager and project managers. Responsible for effective communication within the department and externally to site and the company as appropriate.SAFETY & ENVIRONMENTAL RESPONSIBILITIESEvery individual is personally responsible for the safety and environmental aspects of his or her activities in the workplace. Each employee is expected to perform their job duties in a safe manner utilizing all of their knowledge, training, ability and experience. QUALIFICATIONSMinimum of 5 years of practical work experience in API pharmaceutical analytical development, including broad understanding of API Regulatory approval processes. Expert experience in the design and implementation of analytical techniques. Ability to formulate and articulate cohesive strategy for method development, including regulatory aspects. Advanced communication skills necessary to interrelate with external customers and other departments within the company structure. EDUCATION and/or EXPERIENCEPh.D. in Analytical Chemistry or equivalent education and work experience.  LANGUAGE SKILLSAbility to write reports, proposals, contracts, business correspondence, and procedure manuals. Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public. REASONING ABILITYAbility to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form. CERTIFICATES, LICENSES, REGISTRATIONSNone PHYSICAL DEMANDSThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand, walk, and sit. The employee is occasionally required to work with hands; reach above shoulder height; and taste or smell. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision, distance vision, and color vision. WORK ENVIRONMENTThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is occasionally exposed to fumes or airborne particles and low levels of toxic or caustic chemicals. The noise level in the work environment is usually moderate. CORE COMPETENCIESThe candidate must be able to put into use the following core competencies:Communication – oral and written communicationAdministration - able to organize group to achieve group goals and objectiveAnalytical Methodologies – HPLC/UPLC, Mass spec, GC, HS-GC, IR, UV, IC, ICP-MSAnalytical Instrumentation – Use, maintenance, troubleshoot and repairRegulatory Compliance – Excellent working knowledge of ICH guidelines/USP/EP/JP, SME for inspectionsQuality Compliance – Performing and supporting investigations, determination of root cause, comprehensive knowledge of industry quality standards for method development, validation and documentationValidation & Stability – Experienced in writing protocols, justifications, reports, etc.BENEFITS401(k) matching - Corden Pharma will contribute 100% of the first 6% - 100% vested after 2 years of service Accident planCritical illnessDental insuranceDisability insuranceEmployee assistance programFlexible spending accountHealth insurance PPO/HSAHospital indemnity planID TheftLife insurancePaid maternity/paternity leaveTuition reimbursementWellness ProgramVacation – Three weeks 1st yearVision insurance"}