{"title":"Civil Engineer Project Manager NEW!","location":"","salary":"","description":"","term":"$85,000 to $110,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALkqdBaa128cQiVzcfavLOWCdElO26vnSrxwbVYvf3mdegw-FoMPEdPFtVHI5CAB60214HbcaJeRWdZ_TI9Sq-UYENnbjUWIjRUiyk9o1t2EN-ufZrSE7T80VosA158brSgZfDOBbdE8lomf_YFQdamvQX0u8Fjbjs0tXC284wHhQk0EY74SPZ5Zquujtg","source":"ziprecruiter","full_description":"Civil Engineer / Construction Supervisor – Solar Farm DevelopmentWould you like to align yourself with one of the largest and most successful developers of ground mounted Solar Farms in the Southeast? Do you enjoy a combination of Civil Engineering responsibilities AND heavy pre-construction supervisory experience? Do you enjoy working outdoors and traveling regionally on a weekly basis? If the above sounds like you, our client has the immediate need for a full-time permanent Civil Engineer / Construction Supervisor to prepare solar farms for construction. The civil engineer / construction supervisor monitors ongoing construction to ensure that the work is being done correctly and the project stays on schedule. The job focuses on the civil construction portion of ground mounted solar projects, specifically clearing and grubbing the sites, grading the site, erosion control installation like settling ponds, silt fence, grassing, etc.General overview for the Civil Engineer / Construction SupervisorA civil engineer / construction supervisor should be familiar with the construction and material specifications for the infrastructure in the local area and specifically for a typical ground mounted solar farm. This often requires knowledge and experience specific to civil engineering. The civil engineer / construction supervisor must also be able to analyze the project's design and plan ahead for the safety of workers and owners of the solar array who will be using the facility for decades to come. The civil engineer / construction supervisor must be proficient in reading design drawings and turning them into actionable and Scope of Work and perform Quality Assurance on work.Primary Job Functions for the Civil Engineer / Construction SupervisorMonitors the activities of subcontractors to ensure compliance with specifications and procedures.Responsible for the implementation of corporate/project policies, procedures and instructions within assigned operations.Ensures all safety codes, requirements and standards are being complied within assigned area of responsibility.Oversees the implementation of work, makes corrections and approves work.Works with design engineering personnel to coordinate implementation activities.Works closely with operating personnel to coordinate site work with other disciplines.Provides oversight of field activities to ensure personnel safety.Keeps project management informed of project status, highlighting deviations from plans.Anticipates potential problem areas and analyzes and recommends solutions or corrective actions. Requirements for the Civil Engineer / Construction Supervisor - SolarBachelor’s Degree required - Civil Engineering or Construction Engineering highly preferredExperience supervising field work of multiple construction trades groups in remote locationsSolid understanding of erosion control and establishing erosion control procedures on all job sites.Preference for candidates with solar farm development experience (but not required)Ability to read Civil design drawingsAttention to detail in supervising Sub-contractor work and site activitiesExcellent planning and communications skillsTravel within Southeast 75-100% of time (Note – a daily per diem will be provided along with lodging and mileage OR company provided vehicle)"}