{"title":"Commercial Trailer Mechanics - Multiple Locations!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJVrBQ6W4FbN_zF4SBBMpdvoshW9m4WlL9M1XR_cfso4SJya9WAzAuKRwm_kfdOU1lZY8Rc1AxaEny2KcacZA8HIdO2T-vaQ2_4GuEYP9yF-3q91PH2ODO871R-4VJDlGyPi3uxMdHi4_-zIcs713LftsK4pJSD5farCR1cvTkME03nco8NOy8J_y33hg","source":"ziprecruiter","full_description":"CompanyCommercial Trailer Leasing, Inc. (CTL) is a National Trailer Leasing Company in search of qualified Road Service Trailer Mechanics. CTL’s Trailer Mechanics provide cutting edge technology and tools that facilitate mechanical service at the highest levels. With a focus exclusively on trailers, 17,000 in fleet nationwide, CTL’s Trailer Mechanics offer unmatched service and expertise to our customers. Job Description for Trailer Mechanic - RoadCurrently seeking Road Service Trailer Mechanics to perform mechanical services on CTL trailers at various customer sites. Knowledge and familiarity with trailer repair, including welding and carpentry required. Full-time, permanent career opportunity for individuals with a strong work ethic, outstanding punctuality, and a great teamwork attitude.--MULTIPLE LOCATIONS AVAILABLE--Baltimore, MDColumbia, MDDallas, TXIndianapolis, INLos Ángeles, CANorth Bergen, NJPhoenix, AZPompano Beach, FLRobbinsville, NJExperience/Qualifications/Responsibilities for Trailer Mechanic - RoadPrevious experience as a Trailer Mechanic requiredTrailer Mechanic must have knowledge and experience with:Brakes and suspensionHydraulics - Lift GatesSwing and Overhead DoorsTrailer Mechanic should be skilled in the followingDiagnosis and repair of trailer electrical systemsWelding and cuttingDOT Inspections/PMs/FHWAsDocumenting services and repairs accuratelyKnowledge of Refrigeration units and related components a plusDOT Physical with Medical Card requiredClear driving record a mustTrailer Mechanic should have and maintain a basic set of tools (shop tools provided by company)Pre-employment Requirements for Trailer Mechanic-RoadDrug testing, background check, and MVRBenefits:BenefitsCTL Road Service Trailer Mechanics receive a substantial and competitive benefits package that includes:$8,000 SIGN ON BONUSCompetitive Salary plus OvertimeMedical/Dental/VisionPaid time off401KEMPLOYEE STOCK OWNERSHIP PROGRAM/ESOPAnnual Bonus"}