{"title":"Field Service Engineer - New York NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK3MwxNg0XiL0gp0yvoG7b6-i3sR1eurKMVgS8GbNkW4t5lk0ELyTgMdtfsqb2dqpeRPGKC9_zySH79_9y21u_tN2n5TQqyCfZmQhKSCbm7dr26xOikNIMNKNDV4ug_s2vUrkyNkEI3b3cttSq7sld28rrNp0ow0lG4yVuY-eVL1fK0r0xkn8nuhqJUdMw","source":"ziprecruiter","full_description":"We are seeking a talented and highly motivated individual to join our team as a Field Service Engineer - New York. This position will report directly to the Manager, Field Service Engineering, and must be located near a major airport in New York, New Jersey, or Philadelphia, Pennsylvania. As a Field Service Engineer you will serve as a technical lead for installation and service for all T2 Biosystems instrumentation. The Field Service Engineer will be customer focused and process driven. Responsibilities: Installation of instrumentation at new and existing customers for both commercial and clinical sites. Perform onsite service for emergency calls and scheduled maintenance. Perform improvements to increase instrument performance and reliability. Complete and submit all required complaint documentation in a timely and professional manner. Support training and implementation plan with the customer and field team. Work cross functionally within the organization to meet customer expectations. Perform Site Assessments and review customer requirements prior to installation. Troubleshoot and diagnose instrument failures through log analysis and service software. Follow standard practices and procedures as outlined in service documentation. Escalate customer issues and unresolved product issues to Service management. Accurately manage service spare parts inventory. Support On-Call rotation as required. Responsible for ensuring customer satisfaction through exemplary service. Effectively communicate with Sales and Service management. Other responsibilities as assigned by your manager or the company. Requirements: 2-5 years of experience preferred as a Field Service Engineer in the medical diagnostics industry. BS/MS in a related engineering or medical field or equivalent experience can substitute for degree. Laboratory instrumentation and automation experience preferred. Experience repairing electro-mechanical systems and troubleshooting through log analysis. Committed to quality with excellent attention to detail. High level of motivation to overcome difficulties in changing environment. Experience with Sales Force or other CRM's. Demonstrated interpersonal and diplomacy skills. Excellent communication skills both verbal and written. Proficient computer skills. In addition, you will need: Willingness to travel up to 90% in the United States with the potential for occasional international travel. Valid Driver's License Ability to lift 50lbs"}