{"title":"Data Science Technical Writer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALu91VRy6ao4HqGnzqu8ziPDCN40E_aWsu3e2c-Oc3s22_n6DZxhHLnfGcpL5vKccP1NitKc76JlkIbnX2Y0i0QRGaueuzbMSND6891WdgawB7UhSadb-VNRBX0vtwASJbLQ7ZS2MPYOnw13N5DlQmlWcReDeI-0d6kbCi7UNyGR8LKL6eegj5cBhqRKKv7","source":"ziprecruiter","full_description":"We are looking for a creator of dynamic technical material to join our Product team as a Data Science Technical Writer. Since the launch of our company in 2013, we have experienced explosive growth and growing market demand. This individual contributor position is a new position due to expansion, to be located in the United States. The role will research and produce content that highlights the capabilities of Dataiku's data science platform. This content may be comprised of a variety of materials, including written how-tos, tutorials, and use cases, data science workflows shared on the public gallery, and videos. These materials will be used across the company to promote customer success.Requirements + Must excel at understanding and communicating technical topics. A combination of flair and economy of words is highly desirable. + Experience transforming raw content from technical contributors into human readable materials. + A strong background in constructing and explaining data science + machine learning workflows. We will consider exceptional creators in related fields. We place high value on: + Experience with Dataiku DSS + Experience with other tools of the data science trade (e.g., R, Python, SQL) + Experience with the greater data ecosystem (e.g., RDBMS, Hadoop, Spark, Kubernetes) + Professional knowledge of content production concepts and tools. Experience with the specific tools in our stack is helpful, including Git, Restructured Text (RST), and Sphinx. + Prior experience with video production is a plus BenefitsDataiku is an end-to-end data science collaboration platform that is revolutionizing how teams work together to create and share insights from big data. Our software is designed to be the one place where everyone in the data science process works together: it's as powerful for PhD data scientists as it is for Business Analysts as it is for Dev Ops engineers as it is for IT professionals. Our customers include companies like L'Oreal, GE, NPR, Capgemini, Kuka Robots, Unilever, Sephora, BNP Paribas, and many more. We raised our Series B in September 2017 with Battery Ventures, a preeminent New York VC fund known for their dominance in the data science space. We're growing quickly (more than doubling every year), and we're building out our global presence with amazing team members in France, the US, the UK, the Netherlands, and Singapore (with more locations on the way). We're looking for really talented, smart, kind, and genuinely curious individuals to work alongside us."}