{"title":"Java Developer NEW!","location":"","salary":"","description":"","term":"$90,000 to $105,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAI4UmJo2NDkzqLAgease49HfYKUSB_8K3KN3n80g3A9z_RP8IJjcwKDS9Utsr3yXjPk6K_W0Ed7_9MhooQ2OZ1tutUwfitZBgQa4RxFX1A7f6L7mvpMTRJWh3mn87gauyME9UegW-2Dj6REpmZ0BGBfzJxVi48Pt0riATbVLtSiOS8AOFUm8Ljo2_gq3w","source":"ziprecruiter","full_description":"Info Services is looking for Java with Microservices developer for one of our client project. If you are looking out for a change please forward your resume to sumathy@infoservicesllc.com.Location: Texas/Detroit/AtlantaPosition: Java developerRequirement type: On our W2 (4 months contract to hire)Status: H4 EAD/USC/GCJob description:• 5+ years of software development utilizing industry standard design patterns in common languages such as Java. Demonstrated experience with test-driven development techniques (TDD, Junit, mocks).• Familiarity with 12-factor microservice development patterns• Familiarity with multiple interface patterns including RESTful APIs or event-based messaging• Applied scripting experience in advanced scripting languages (eg. Python, Groovy, PowerShell, JavaScript)• Applied experience with Unix/Linux shell scripting• Applied experience with iterative and incremental development on product-focused teams practicing code reviews• Knowledge of version control systems (Git, Bitbucket) and modern version control for use in continuous deployments• Competency writing basic SQL queries. Oracle and/or Postgres experience a plus. NoSQL experience with Cassandra a plus.• Excellent verbal and written communication skills and ability to effectively communicate and translate feedback, needs and solutionsStrong teamwork focus and the ability to foster collaboration within and across teamsPreferred Qualifications:• Experience developing 12-factor microservices while utilizing Continuous Integration, Build, and Delivery w/Spring, Spring Boot• Experience building and maintaining highly automated CI and CD pipelines leveraging technologies such as Azure DevOps Server (formerly TFS), Jenkins, Maven, Artifactory, Black Duck, Chef, SonarQube• Experience in designing and implementing container technologies like Docker, Kubernetes and Helm• Experience utilizing platform and infrastructure-as-a-service technologies and capabilities and their corresponding services (object store, configuration management, service registries, etc.). Pivotal Cloud Foundry experience strongly preferred.• Experience with Big Data technologies and developing in Hadoop ecosystem, i.e. Hadoop, HBase, Hive, Scala, SPARK, Sqoop, Flume, Kafka, Python• Experience with the ELK stack and dashboarding within KibanaExperience supporting applications in ProductionThanks & Regards,Sumathy Muthukumar SankarBusiness Development ManagerEmail: sumathy@infoservicesllc.comE-Verify Employer | Certified Minority Business Enterprise Partner Partners With :Salesforce | Vlocity | AWS | AZURE | Snowflake | Copado | AutoRABIT"}