{"title":"Part-Time Faculty: Chemistry","location":"","salary":"","description":"","term":"Part-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ-VSFGq3-44N01U3fsadrIQGNeX6iHuhVspxF1eBUJ-5WbvrIu_PJCupsQW64ULIE62IZGoscXjQ1Lmz9vEOJK8b2YqO2V5GzTl36GU1QSWL-o2f7qZ20u6fHGj5A4CNdrYZW7E85jO_iy8Vh7WgUx-0wYCXYNBtZiTzrIu9ygPnUUuAQSVdFdKYIWbwwz","source":"ziprecruiter","full_description":"Position Number: EPTF50Department: Col Liberal Arts & Science (Col)Employment Type: Temporary - Part-timeMonths Per Year: 4Essential Duties and Responsibilities:UNC Charlotte is accepting applications for part-time faculty to teach lower-level laboratory courses. These positions are temporary and usually involve teaching a particular laboratory course or courses for a particular semester. These positions are temporary and do not accrue benefits. Responsibilities could include: Developing and/or updating course syllabus, preparation of lectures, projects, or other student assignments, meeting all designated class periods, maintaining regularly scheduled office hours, grading student assignments and exams in a timely manner, submitting completed mid-semester progress reports and final grades according to University regulations. As an EOE/AA employer and an ADVANCE Institution that strives to create an academic climate in which the dignity of all individuals is respected and maintained, the University of North Carolina at Charlotte encourages applications from all underrepresented groups. Applicants subject to criminal background check.Minimum Experience / Education:Faculty teaching undergraduate courses: doctorate or master's degree in the teaching discipline or master's degree with a minimum of 18 graduate semester hours in the teaching discipline. UNC Charlotte also considers competence, effectiveness, and capacity, including, as appropriate, undergraduate and graduate degrees, related work experiences in the field, professional licensure and certifications, honors and awards, continuous documented excellence in teaching, or other demonstrated competencies and achievements that contribute to effective teaching and student learning outcomes."}