{"title":"Software Developer - Remote, Location Open in the US","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIEDT8__rLLxfIBgJxyIAUcWz37HyaOZGrJkVhfPaxH08MY6iQMUyaJAzGmS6tnxRNvZTbtXvF3Nsh1surmlvONXuMId3YASXPtCrVzX3V0sCym0eEnM5QePnJPePia9lY8rGhpyBnsKOq-LwHYAMPY1Nh--lY_fAMMQjN3NhmltdTrCReFSKKAuHE-RAs","source":"ziprecruiter","full_description":"This is a remote position - location is open within the US.JOB SUMMARYTo power business growth through technology investments, we hire web application developers with a passion for technology, a desire to learn, and the drive to contribute that make the team better. In this role you will:· Design, develop, and test new and existing software applications working within a fast-paced and collaborative team environment to power our business growth· Actively contribute to team discussions on software design, architecture and process improvements· Experiment with new technologies and tools including but not limited to building AI/ML models· Participate in group events, hackathons and contests with a team that really enjoys working together and pushing each other to excel.· Work on systems that handle 3+ million API requests and 600,000 pageviews per week in a 24/7 high availability AWS cloud-based environment.PLEASE NOTE: Applicants must be legally authorized to work in the US. Visa sponsorship is not available for this role.ESSENTIAL DUTIES AND RESPONSIBILITIES:Include the following (other duties may be assigned):· Develop in the full stack Linux-Apache-MySQL environment using modern front-end application techniques like Static / SSR / Single Page Applications on the Nuxt.js framework powered by Vue.js.· Develop REST API containerized applications using the Spring Boot framework.· Build Cloud Native services using AWS serverless technologies when appropriate· Understand and implement the stated requirements for software.· Provide development time estimates, constraints, and risks/liabilities as part of the Scrum process.· Plan and prioritize development tasks in order to achieve objectives.· Design test protocols to provide high levels of confidence in software’s stability, usability, and security.· Use CICD pipelines and modern build tools such as Vagrant, NPM, Yarn, Docker and Gradle· Provide after-hours on-call technical support on rotation.EDUCATION/EXPERIENCE:Education:o Minimum: High school diplomao Preferred: Bachelor’s degree in Computer Science, Software Design or related fieldExperience:o Minimum: 3 years software development experienceo Preferred: 5 years software development experienceQUALIFICATIONS:The requirements listed below are representative of the knowledge, skills, and/or abilities required for this position:· Familiar with PHP MVC frameworks such as Slim, Phalcon, or Laravel· Familiar with frameworks like Java Spring Boot or JHipster.· Familiar with Vue.js and the Nuxt.js framework.· Familiar with CSS frameworks like Bootstrap, Vuetify, or TailwindCSS.· Experience with AWS, Python and JavaScript.· Demonstrated interest in and ability to learn new systems and programming languages quickly.· Ability to maintain high quality of work.· High aptitude for collaboration and teamwork.· High level of interpersonal and communication skills.· Ability to meet stated customer-initiated deadlines.· Demonstrate professional office etiquette and appearance.· Exemplify professionalism in all LRG-related contexts and activities.· Maintains confidentiality at all times.COMPANY OVERVIEW:Lowers Risk Group provides comprehensive enterprise risk management solutions to organizations operating in high-risk, highly regulated environments valuing risk mitigation. Join the software development team of one of Inc. 5000’s Fastest Growing Companies in the U.S.! Celebrating our 7th year on the Inc. 5000 list of fastest-growing companies. This achievement puts Lowers Risk Group in rarefied company with organizations such as Microsoft, Timberland, Vizio, Intuit, Chobani, Oracle, and Zappos.com.The software development team works in a collaborative, entrepreneurial environment to power our business growth on 24/7 high availability AWS cloud-based environments.WORK HOURS:Salaried position with typical work hours 8:30 AM - 5:00 PM; ability to flex schedule to meet team requirements.PHYSICAL REQUIREMENTS:· Repetitive motion. Moderate movements/motions of the wrists, hands and/or fingers· Visual acuity. Required to have close visual acuity to perform activities including viewing and reading a computer monitor and documents· Sedentary work. Must be able to sit for an extended period covering the duration of work shift hours.EQUAL EMPLOYMENT OPPORTUNITY:Lowers Risk Group provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetic information, pregnancy, gender identity, sexual orientation, status as a Vietnam-era, special disabled veteran or other veteran, or any other status or characteristic protected by applicable federal, state and/or local laws.AT WILL EMPLOYMENT:Lowers Risk Group is an “At Will” employer and nothing within the job posting or description should be construed as an offer or guarantee of employment.Lowers Risk Group reserves the right to modify, interpret or apply the job description in any way the company desires and the job description is not a contract for employment.Any offer of employment is conditional upon the successful completion of a background investigation and drug screen."}