{"title":"Electronics Manufacturing Engineer","location":"","salary":"","description":"","term":"$110,000 to $150,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJfOcwZH6TL8V6hyCQi_wbbiVrRWmZWKjhCylRgjIo5K0bO69q4PJMlwNRhSyCrV3yHjqAUlJKWAD72rSrLhonPKBMxR9uWNpcaLPwV7KeAVKUfawg4TS4SUVNqoIqNAQUmf4VhZLEkprMLQyhP2046yIgf-8Yst-Kvkt3mzbK20sP9YfrNhR-sO0gz85lw","source":"ziprecruiter","full_description":"Electronics Manufacturing Engineer If you are a Electronics Manufacturing Engineer with relevant experience, please read on!Space. Enough said! We are developing and manufacturing revolutionary propulsion systems for small satellites. Our plasma systems save spacecraft operators millions of dollars because of their fuel efficiency. If you have experience with high-reliability electronic assemblies and testing, and want to work on space technology, look no further!Top Reasons to Work with Us- Space Technology- Revolutionary Tech- Work with industry leadersWhat You Will Be DoingYou will bring your prior experience working with suppliers to product high-reliability electronic assemblies, experience with electronics functional test and test automation, and other similar industry knowledge to join our team of industry experts.Responsibilities:- Manage EMS contracts- Liaise between contract manufacturers and the company- Prepare assembly procedures, test procedures, SOPs, schematic diagrams, BOMs, and suitable alternate parts lists- Work with suppliers and contractors to ensure parts availability- Develop/maintain product process documentation- Continuous improvement efforts, lead projects that increase capability and efficiency of manufacturing test facilities- Product failure investigations - Analyze manufacturing/test data and trends to improve design requirements and mfg/test processesWhat You Need for this PositionQualifications:- BSEE, BS MFG Engineering, BS Industrial Engineering or similar- 3-5+ years' in design, manufacturing, production and/or test of electrical hardware systems- Experience working with suppliers to product high-reliability electronic assemblies- Electronics functional test and test automation- Ability to create test plans, develop test hardware and test stations, automated tests, and develop HIL simulationsDesired (Some of the following):- SMT Lines, Electronics Manufacturing, IPC- PCB, PCBS, E/M assembly processes- Environmental testing - vibration, shock, thermal, burn-in, TVAC- DFM, DFTBONUS/Nice to have:- Test Stand, LabVIEW, Matlab, Simulink, Speedgoat, dSpace, etc- Plasma Physics, Plasma Diagnostics, Thermodynamics- Electrical Propulsion, Space Tech, Rocket TechnologyWhat's In It for YouCompetitive Salary (110-150K)- Flex Work Schedule- Health Insurance- Prescription Drug Coverage- PTO - Retirement Plan with contribution matching- Employee Stock Ownership- Relo AssistanceSo, if you are a Electronics Manufacturing Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}