{"title":"C/C++ Algo Developer for Autonomous Mobile Robotics Company","location":"","salary":"","description":"","term":"$85,000 to $120,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKZ8KWLtijnW0nleiP4-27krKSkDrunUT5qwBx9Eifea7hd1WSiNK-JKOfdUeclLwtyExn8ZHRQwa46nLCslZfa5WmsgzSFSSQTrcsU4x3_2YT0_Hnz1O_bIt6HcbD3Lxn8XA_-aAyWMlkI8Jhj5ZNicYeJGImcIx120qkl0zzvTfGt6Xvh8thk_uHeG3w","source":"ziprecruiter","full_description":"C/C++ Algo Developer for Autonomous Mobile Robotics Company If you are a C/C++ Algo Developer for Autonomous Mobile Robotics Company with experience, please read on!Top Reasons to Work with UsOutdoor power equipment industry leader is looking for a talented software engineer to develop commercial power equipment product for autonomous operations. The ideal candidate will apply his or her full-stack robotics software experiences toward algorithm design, motion control, sensor fusion, database, IoT and cloud computing.What You Will Be Doing- Design and develop robotics software, diagnostic tools, and automated testing software for autonomous outdoor power equipment.- Use cloud computing, database tools, and IoT technologies to support the full product lifecycle, including product manufacturing and service. - Collaborate with a cross functional team of engineers in the development of the software and electrical systems for outdoor power equipment.- Generate engineering requirements and design documents; author and execute test. plans/processes for software verification and validation.What You Need for this PositionMust Have Experience: - M.S./PhD in Computer Engineering, Computer Science, Robotics, Electrical Engineering, or a related field. -Will consider applicants with B.S. and an equivalent level of work experience.- 3+ years' experience of programing experience in: -Linux development environment - C/C++ - Scripting languages (python/bash) - Java - gcc/g++ - make build tools, git, and database.- Knowledge of autonomy-related algorithms for mobile robotics such as path planning, SLAM, motion control, sensor fusion, collision detection and avoidance. - Strong skills in modular design and coding.- Understanding of software lifecycle, coding standards, and git-based software version control. Nice To Have Experience: - Familiarity with a Data Distribution Service such as the Robot Operating System (ROS) software framework.- Computer vision, machine learning and data analysis.- Embedded systems, RTOS, communication protocols (ex. CAN, RS232, SPI).- Knowledge of functional safety standards (ex. IEC-61508).- Agile software development, gitflow workflow, test-driven development process.- Excellent time and project management skills including task estimation and project planning.What's In It for YouCompetitive salary and benefit package that includes:- 401k- Defined Contribution Plan- Health and Dental Insurance- Vision Insurance- Tuition Reimbursement- Paid vacation & holidaysSo, if you are a C/C++ Algo Developer for Autonomous Mobile Robotics Company with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}