{"title":"PERL Software Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIW709w3ZWncQsUSuDdtkjh4zEVFN0ebWH7a1O1k-haerSkqSJhP3FKZDAWpei6qMyxBZsoXL1iUjsDjWE2eSobdqsCV2-KKJ19iEqu279qLiIHpYFOx6A8uSO8kQE41569R_vRu4z4Tzy3wqwIe3QCAy8F2GAudACXcLjV9S0UfciUiuduRWX77st5Kt0","source":"ziprecruiter","full_description":"DescriptionAre you a talented professional with a demonstrated ability to communicate effectively? Candidates looking for full-time work as Software Developers could work with Robert Half in this position! If you're looking for work where you can implement new features, maintain existing code, and refactor existing code across a breadth of products used both internally and externally at the company, this Software Developer job might be for you. This Software Developer opportunity will be located in the Edgerton, Kansas area and will be a full-time position. Qualified candidates should apply as soon as possible!Responsibilities- Supply clear and consistent contact around solutions and time estimate to client-facing program management teams- Diagnose and contribute production support- Consistently enact code-review and join up with other developers- You'll be great at this job if you can maintain and develop new features to internal and external facing software to enhance the customer experience and resolve issues on various operating systems- Team up with Scrum team to produce proper work estimatesRequirements - We are particularly looking for candidates who can write clean, standardized code that performs optimally in highly concurrent environments - We are particularly looking for candidates with experience with at least one framework/library, e.g. Vue.js, Polymer, Angular.js, React.js, Ractive.js, Knockout.js, Ember.js, Bootstrap, etc. - Experience crafting, documenting and testing APIs - Applicants with familiarity with full-stack development (front-end, to middle/application tier, to database) are strongly preferred - If you have experience with software development life cycles, e.g. Agile, Big Bang, Spiral, Waterfall, etc., you will be strongly preferred - Knowledge of education standard such as QTI/APIP, SIF, AIF is a plus - Solid understanding of Perl (at least 5-10 years of experience) - MySQL PostgreSQL experience preferred Robert Half Technology matches IT professionals with remote or on-site jobs on a temporary, project or full-time basis. From roles in software and applications to IT infrastructure and operations, we provide you unparalleled access to exciting career opportunities. Our experienced staffing professionals can promote you to employers and advocate on your behalf. We provide access to top jobs, competitive compensation and benefits, and free online training. For more opportunities, get the Robert Half app and receive instant notifications when our AI matches you with jobs. When you work with us, you're working with the best. Robert Half has been recognized as one of FORTUNE's \"Most Admired Companies\" every year since 1998 and was named to Forbes' inaugural list of America's Best Temporary Staffing Firms. Questions? Call your local office at 1.888.490.4429. All applicants applying for U.S. job openings must be authorized to work in the United States. Benefits are available to temporary professionals. Visit https://roberthalf.gobenefits.net/ for more information. 2020 Robert Half Technology. An Equal Opportunity Employer. M/F/Disability/Veterans. By clicking \"Apply Now,\" you're agreeing to Robert Half's Terms of Use (www.roberthalf.com/terms-of-use). **Salary:** DOE**Location:** Edgerton, KS**Date Posted:** February 10, 2021**Employment Type:** Full-time**Job Reference:** 01500-0011698105**Staffing Area:** Technology u0026 IT"}