{"title":"Technical Consultant - Facilities Management","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIcb0jDFLchPLVE2vvYi_lJ1cvNTJSzlWF45Fdtwr-0P1jkIyqDDRjbxr47UjFcSiU13_jO1fVBIu9_76FVAZoKBooqIXd0sJ_r_fYLIBeW7c2q7pYix6GBvLAZ6s1Z-YiGAApVE-Mavc2CZTw1I9t7POgQYcwKbD22dLVbglzMDN00QtO_pkV5R9QYi-o","source":"ziprecruiter","full_description":"Do you thrive in a fun and challenging work environment? Do you want to work with interesting people who support your success? Do you enjoy solving customer challenges?Go ahead… keep reading!WE ARE LOOKING FOR INDIVIDUALS WHO ARE EXCITED BY TECHNOLOGY AND PASSIONATE ABOUT DELIVERING THE HIGHEST QUALITY PROFESSIONAL SERVICES.  IMAGINiT Technologies, a division of Rand Worldwide, provides software and services for facility managers, space planners and portfolio managers. Our clients include universities, federal government agencies, and corporations. To support these customers, programming of the software employed is required. The software utilized in our implementations includes ARCHIBUS, ARCHIBUS Web Central, AutoCAD, Revit, Oracle, MS SQL Server, and Apache Tomcat. The FM group provides customization, configuration, drawing/data input/import, training and support for each of these as they pertain to the FM software implementation.Job DescriptionResponsibilities:As a Technical Consultant, you will create impact by contributing to both pre-sales and post-sales initiatives:Pre-sales (25%)Assess client’s current business processes to recommend and implement solutions to meet client needs.Work closely with sales staff and clients to document business goals and related processes.Write deliverable documents as applicable such as scopes of work and recommendations.Create intellectual property to support sales, marketing and implementation efforts.Post-sales (75%)Work with ARCHIBUS and other software packages, such as AutoCAD, Revit, Oracle, MS SQL Server and Apache Tomcat.Deliver ARCHIBUS training to our clients, and industry-related technical presentations at seminars, workshops, conferences, user groups, both onsite and remotely. Customize training solutions where applicable.Provide implementation solutions and application support for client FM workflows.Act as a brand ambassador always seizing opportunities to increase IMAGINiT’s visibility in the marketplace.QualificationsExperience working in Facilities Management across different business functions at both a strategic and operational level.Demonstrate Archibus to prospective customers.Building short proofs of concepts to show product capabilities.Develop a sales strategy for each client in partnership with the Account Executive.Resourceful with strong problem solving skills.Strong organizational and time management skills.Maintains technical knowledge of applications by reviewing and understanding enhancements released.Experience in delivering business solutions with strong customer focus and requirements-driven design and development.Knowledge of relational databases, to include Oracle and Microsoft SQL databases.Knowledge of developing Web applications using Java-based technology, including XTML, HTML and CFMLKnowledge of Web application servers (Apache Tomcat, Jetty, WebSphere, Oracle Application Server, etc.)Experience with JavaScript programming is a plus.Ability to travel up to 50%.Additional InformationFull Time-Monday-Friday Work ScheduleIMAGINiT provides a comprehensive compensation and benefits package. The compensation range for this position (including base salary and bonuses) starts at $75,000.Benefits include: Medical, Dental and Vision Insurance, Life Insurance & AD&D Benefits, Short & Long-Term Disability, Paid Holidays, Vacation and Sick Leave, 401(k) with company match, Flexible Spending Accounts, Tuition Reimbursement, Service Awards, Employee Referral Bonus, and Wellness ProgramsVisit us at http://www.rand.com for more information.We celebrate employment equity and diversity! We encourage applications from all qualified individuals and do not discriminate on the basis of disability, race, ethnicity, religion, gender, sexual orientation, age, veteran status or any other basis protected under federal, state, provincial or local laws.We are committed to providing reasonable accommodations for persons with disabilities. If you require reasonable accommodation during the application process, we will work with you to meet your needs.We thank all applicants in advance for their interest, but only those applicants who are to be considered will be contacted. Must be authorized to work in the U.S for any employer without company sponsorship."}