{"title":"Dynamics Navision Developer-Denver-$65 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKwNNhYoAOIzAn4PUDytOp4gGxWer_Plnp__KAumVlBZVOXVuY95JlJ5WKRQn3yiTgyWjeTUblKtuOfhTfFEy7vDKpzQVCCRvuJmKqbhBTDHJb54ojsdPdW12Df5Q--V5aiOMDnklLYub8BkB4y_wam-ze88RWvGHSe1f6uFFyxsPmzMJ5ad5w9nS9YqHc","source":"ziprecruiter","full_description":"Developer-Dynamics NAV-Denver-$65/HRDynamics Navision DeveloperThe client is looking to add an experienced Dynamics NAV developer to their team.The client is an end user in the healthcare vertical and is looking for someone who is extremely familiar with Dynamics NAV and all of its modules and add-ons. This company is known for their unique company culture, allowing every employee to spend their day solving engaging problems and creating importance in the workplace. Our client is looking for a highly driven candidate who consistently performs well above company standards.Your Roles and Responsibilities:Assist in the development and integration of Dynamics NAV Troubleshooting issues that arise within the NAV systemProgramming and upgrading Dynamics NAV, as well as the warehousing systemSupport and training of end-usersYour Preferred Skills and Experience:Must have a Dynamics NAV background (newest version preferred)Must be familiar with relative ERP systems Familiarity with the modules and add-ons commonly used within NavisionExperience in implementing numerous full lifecycle projects The client is looking for a highly skilled contract developer to work 20-40 hours on a collaborative team working on the newest Dynamics technologies. If you are looking for your next exciting contract opportunity email m.falick@nigelfrank.com. Nigel Frank International is the global leader for Microsoft Dynamics recruitment, advertising more Navision / Dynamics NAV jobs than any other agency. We deal with both Microsoft Partners & End Users throughout North America. By specializing solely in placing candidates in the Microsoft Dynamics market I have built relationships with most of the key employers in North America and have an unrivalled understanding of where the best opportunities and Navision / Dynamics NAV jobs are.  I understand the need for discretion and would welcome the opportunity to speak to any Microsoft Dynamics NAV / Navision candidates that are considering a new career or job either now or in the future. Confidentiality is of course guaranteed. For information on the Microsoft Dynamics market and some of the opportunities and Dynamics NAV / Navision jobs that are available I can be contacted on 303-558-4399 (ext 4399); Please ask for Madeleine Falick, or please email your resume to m.falick@nigelfrank.com and I will get in touch with you ASAP. Please see www.nigelfrank.com for more fantastic Microsoft Dynamics opportunities! Dynamics NAV // MS NAV // Microsoft NAV // NAV Dynamics // NAV // Developer // Senior Developer // Technical Consultant // Project Manager // Business Analysis // C/AL / C/side Nigel Frank International Inc. is acting as an Employment Agency in relation to this vacancy."}