{"title":"Technical Writer (Content Experience Specialist & Automation) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJYGNvbI4-R4V_gK7n-C0iB3ygz78S-x1jZTnutQvIA5rUVVeM09Qxn-uj2rjBHt8eDiDyU7n1CNRrQGej8EVz5laT9cr-ukfrKCXa1ekhqgFfMpFAsJ4_jCUwtQMcu_6YLJOOwkz2egaw6Vl1atGC8WMYJKrxnenkfNt1V3lr_XE09SogCDT8Gfo_9mNFD","source":"ziprecruiter","full_description":"The Customer Enablement and Education team is part product evangelist, part multimedia content producer, part instructor who inspires and educates customers. The primary focus of this team includes education, engagement and experience. They are responsible for the development and management of our community platform, knowledge base as well as the editor of our in-product messaging platform.Content Experience Specialist, Technical Writing + AutomationClassy is seeking a technical writer. Through support articles, videos, documentation, and a range of technical documentation, the technical writer will create content that equips customers and internal team members with the content they need to succeed. This role also supports the lifecycle management team in the creation, implementation, and testing of email nurture tracks. This critical content supports customers throughout their journey on the Classy platform. Your ability to oscillate between technical writing and customer-facing emails will be the key to success in this role. These responsibilities include:Research, ideate, and create support content and email nurture tracks for customersPrepare, organize, and publish the content you createCollaborate with customer support, product and lifecycle management to develop education/enablement contentCollaborate with product and technology teams to improve developer documentationCollaborate with product marketing teams to develop release notes and documentationHelp to maintain and revise internal documentation for effective communicationCollaborate with customer education and enablement team members to identify new opportunities for technical documentationWhat you bring to the table:A bachelor's degree in English or a related field1+ years experience in technical writing or related fieldExcellent writing and editing skills that demonstrate attention to detailStrong research and analytical skills A talent for simplifying complex conceptsAbility and willingness to adapt and learn new skillsTo be successful in this role you:Love creating, testing, and revising content for consistent improvementLove continuous developmentLove a good challengeOur amazing perks!Unlimited/flexible paid time off (PTO)Generous company holiday schedule10 half-day Fridays annually20 hours of paid volunteer time offMonthly parking pass, public transit pass, or ride-share allowance Pet-friendly officeGenerous parental leave benefitsAnnual stipend for professional & personal development Fitness membership discountsMonthly employee development coursesExpansive office in downtown San Diego overlooking Petco Park and the oceanAbout Classy Classy is a B Corp Certified social enterprise that helps nonprofit organizations maximize their impact through a suite of world-class, online fundraising tools to accelerate social impact around the world. Based in San Diego, CA and trusted by organizations of all sizes, from the fastest-growing nonprofits like Team Rubicon and The Trevor Project, to some of the world's largest social organizations, such as The Salvation Army, Robin Hood Foundation, and Shriners Hospitals for Children, nonprofits use Classy's platform to raise money, engage their communities, and advance their missions. Since 2011, Classy has powered tens of millions of donations from over 190 countries and raised over $2 billion for social good. Classy also hosts the Collaborative conference and the Classy Awards to spotlight the innovative work nonprofits are implementing around the globe. For more information, visit www.classy.org or follow Classy on Twitter @Classy.Dedication to Diversity Classy is working toward building a more diverse and inclusive environment that is representative of individuals of all backgrounds, experiences, and lifestyles, allowing all employees to feel comfortable being their true, authentic selves in a space that enables productivity and meaningful work."}