{"title":"Release Train Engineer NEW!","location":"","salary":"","description":"","term":"$120,000 to $130,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALZ-fftuEdcYvPMtfKu1yhJNtDHJbGQUb8zmxoUR1pUotS5-ycGyEQwgwBcxckJK6R-T3cOtHhVjzzmpaRHyf_3IvBXUcl73iFteXwaUiqJliy4tkH8kzYVZzejY5UR4qxafd5Xx8c5RxE8priofvg1MSgwRTBNntVMwdEx_2-yGVe12pm5ekoRL9idbAZ2","source":"ziprecruiter","full_description":"We are looking to for a Release Train Engineer to do the following:The Senior Release Train Engineer's (RTE) primary purpose is to lead Agile Release Trains (ART) to success and navigate the complexity of delivering software consistently in large environments The Senior RTE resolves and escalates impediments, manages risk, assures value delivery, and drives program level continuous improvement. They play a critical link between multiple scrum teams; facilitating communications, opening the flow of information, and sharing important progress updates to ensure all teams involved in the ART are focused on successful delivery. The Senior RTE is accountable for the overall coordination, execution and delivery of value through the program while ensuring alignment with company strategy, commitments and goals.Oversees small to medium-size release trains with complex scope and inter-dependencies.Facilitates the coordinated preparation of release planning for the release train, including communication and coordination with stakeholders and customers during feature definition and delivery.Manage change to the quarterly plan and the impacts of those changesResponsible for backlog management as well as ALM tool data integrity for accurate reporting. This includes the collection of metrics and KPI's.Coordinate major feature releases and ongoing delivery of value to customers where multiple teams, release trains, or solution groups are involved in developmentResolve/report issues and manage dependencies and risks across the ART and between ART's.Drive continuous improvement through the facilitation of retrospectives quarterly, or more often as needed, to improve backlog management, release train reviews, sprint reviews, or release train coordination and higher-level function.Active participate in the RTE Community of Practice helping the organization to maintain alignment, learn new techniques, and improve technical and quality practices. Work with RTE community to determine ways to help ARTs across the company improve cross train and solution group coordination and collaboration.Able to manage and develop System Security Plan, Security Assessment Plan/Report, and PO A&M documentation.You must have the following qualifications:3 or more years of experience as a Project Management Professional (PMP).Project Management Professional Certification and training.5 years' experience as RTE, Scrum Master, Product Owner, or Agile Project/Program Manager.5+ years in software engineering with the technologies listed:Minimum of 5+ years of experience supporting the development of complex Microsoft Azure, AD, and other Microsoft platforms.5+ years of experience in Cloud Computing to include migrations, large scale implementations, and CI/CD.3+ years implementing unit tests or automation frameworks.3+ years solution design/documentation and deployment with Azure.Knowledgeable with Federal Cybersecurity documentation procedures and processes.Must be able to obtain and maintain a U.S. Government issued the Homeland Security Presidential Directive-12 (HSPD-12) clearance.U.S. Citizenship required."}