{"title":"Chemistry Technician III","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJqaqk1dC6oq3y6ZuwHO4KluW1a2EGmZTuKiyHdgBNhbN3zUAF5CAYyeZl-j3TmEfD23ut0rylwCJxvvGA2tLxafpLgKrxqwRimhDjFpiRgNGXYNpfNHre0rVAmKarrwjiVO9QKCvYI0DThV-SitaI71usbMsF2MwEfS6maGdV_MQkysiuu0SyFkQchrSby","source":"ziprecruiter","full_description":"Overview Waters Corporation in Golden, CO is currently looking for a Chemistry Tech III to join our company.  In this role, the individual will help manufacture and provide analytical verification of all products assigned to the Waters ASR Team.  This position will work daily to meet production requirements and delivery schedules while creating, testing, and maintaining high quality products. The position is responsible for the ongoing manufacturing, verification, and quality control of products. Also has responsibility for generating and reviewing Certifications of Analysis and Document Control. Responsibilities Work with production team to meet production schedules and delivery dateManufacture of chemical solutions to specificationsAnalytical verification of products (instrument analyses)Assist in execution of Validation PlansData review of all products manufactured, and verification data generatedEnsure that all products/data generated meet quality control requirementsGeneration and review of bench sheets, certification documentation, and associated customer facing documentsProvide technical support for data interpretation and troubleshooting assistance for Waters ASR productsResponsible for ensuring 100% compliance to specification by ensuring proper production documentation to meet quality control requirementsFocus on process control to avoid customer impacted Service RequestsAttention to detail, organization and ability to work quickly without errorsResponsible for following written work procedures and SOPs to avoid variation in processAssist team in updating and improving processes including the update of SOP/WI documentsAssist team in constant improvement and development of solutions if problems/issues arise; Work with team on increasing efficiencyStrong interpersonal and communication skillsAbility to work on independently and within a Team environment; includes individual expectations and productivity rates to meet deadlines and delivery targetsQuality Investigations; Use of Lean Manufacturing tools for problem solvingFocus on Health & Safety Issues Qualifications Minimum B.S./B.A. in chemistry or related field with 4-7 years of analytical testing or laboratory related work experience.Excellent written/verbal communication skillsExperience in a highly controlled quality manufacturing lab or process preferredKnowledgeable and proficient in GLP and GDPAbility to work with your hands requiring dexterity to handle small containers, laboratory materials and equipmentExperience with protein handling preferredExperience preparing protein stocks highly desiredExperience with lyophilization and preparative scale chromatography preferredExperience with validation plan writing and execution preferredMicrosoft applications (Excel, Word, etc.) required; Experience with SAP preferred but not required  Company Description For over 50 years, Waters Corporation has developed innovative analytical science solutions to support customer discoveries, operations, performance, and regulatory compliance. Specifically, the company designs, manufactures, sells, and services high performance liquid chromatography, ultra performance liquid chromatography, and mass spectrometry technology systems and support products primarily in the United States, Europe, Japan, and Asia. Our innovations enable significant advancements within the pharmaceutical, life science, biochemical, industrial, food safety, environmental, academic and government industries. Waters is a publicly traded corporation (NYSE:WAT) with more than 5,000 employees and is represented in 85 countries around the world.  Waters Corporation is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.  Key Words Manufacturing, Chemistry, Chemistry Technician, Laboratory, Lab, Laboratory Technician, Manufacturing, Chemical solutions, protein handling"}