{"title":"Technical Specialist Robot Programming NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIrg2poPIGGHVj7c6QdGeTAkzvDU1fRsT7ECEV0Ym1NP6j8JAg4ZDCw-Sxw-9eZ0iO0ux_WMsNd5NNb99i5W4Oxq1eEdh0erZdr7oLioVUNdz-tXBDzOFBv58SAMeaLojDJfsXF3masXnAEpFrDPLgEOLUvlUL18z0-ehWqhI3ZpltGVYJ2jK5TcmoDezTA","source":"ziprecruiter","full_description":"REHAU – Trust. Reliability. Innovation. Join over 20,000 employees at more than 170 locations worldwide and set standards in terms of quality, function and sustainability with us.We are seeking an ambitious, experienced TECHNICAL SPECIALIST ROBOT PROGRAMMING for its manufacturing operations located in Cullman, Alabama.Employer:  REHAU Automotive, LLC   Title:  Technical Specialist Robot Programming Location: Cullman, AL REHAU Automotive LLC has opening for Technical Specialist Robot Programming to work in Cullman, Alabama.  Job Description:  Article development to TVK using the appropriate flaming and painting programs for robots. Develop time and cost optimized painting programs to fulfill customer specifications. Program the flaming and painting programs for robots. Adhere to cost and deadline specifications. Produce loading analyses. Conduct painting simulations. Ensure and achieve customer specifications for colorimetry, quality, layer thickness and paint adhesion. Continuous internal communication with the technical coordinator for article development.Requirements:  Requires Bachelor’s Degree in Computer Science or in a related field and 3 years’ experience in programming with FAMOS (Fast Analysis and Monitoring of Signals) Software. In lieu of a bachelor’s degree, the employer will accept 2 additional years of experience in programming with FAMOS Software. Must also possess some experience in each of the following skills: Waterborne Paint Technology; Electrostatic Paint Application; RAUCOLOR Color measurement system; PC DISPO process control data system; and Programmable Logic Controller (PLC) Programming Software."}