{"title":"Hardware Engineer - 35422","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIN0H-nyjUmPj3C50lhQzy282TGsh18XU6Xt76iD-En1WWOn3uIwUhPcH8xmDWMBKCOUgCh6GuRkb85a2EvilC_r7lfQ2LiZbfeti2jjszj1QyTTChb2ApB8I_sdpdHEgJCmAvk-ZCXzIpxprTvK_2cn5xZdA1dRxSm692C4HvFB3Ra3PmF54bgYnsL9q0","source":"ziprecruiter","full_description":"Job DescriptionAlion Science and Technology is seeking a junior Hardware Engineer to join our National Air and Space Intelligence Center (NASIC) support team to support efforts with digital hardware design and verification, and reverse engineering of electronics hardware. Prospective candidates must be able to work well in a team environment and independently under general supervision.In this position of Hardware Engineer you will be supporting the Foreign Materiel Exploitation (FME) Squadron of the [ Link Removed ] (NASIC). The mission objective is to help U.S. warfighters maintain their competitive edge by enabling the execution of timely exploitation of foreign aerospace and electronic systems for FME's Global Exploitation Intelligence Group. The majority of the work is performed at [ Link Removed ] (WPAFB) in Dayton. To find out more aboutthis excitingmission read [ Link Removed ] article.Required Skills:The ideal candidate should have experience in digital hardware design / verification and either experience or a desire to perform reverse engineering of electronics hardware; experience should include some of the following skills:Hardware Domain Knowledge (RF, EW, RADAR, etc.)Experience with assembling and disassembling hardware systems, equipment, and associated componentsExperience utilizing either Verilog and/or VHDLProgramming and reading Microcontrollers, Digital Signal Processing Chips, Pic Chips, PSOCs, and Field Programmable Gate Arrays (FPGA).Experience with code extraction from microcontrollers, EEPROMS, FPGAs, and DSPs.Manipulation of binary, hex, and other digital files.Experience with the setup and use of common test equipment such as oscilloscopes and logic analyzersStrong documentation and writing skills. Experience with Microsoft Office products.Additional Skills That Would Be a Plus:Previous software reverse engineer experience. Knowledge of computer programming, design software, and system designExperience with software debuggers, decompilers, disassemblers, and software reverse engineering tools such as IDAPro and Ghidra.Adequate knowledge of reading schematics and component and microprocessor data sheets. Required Education/Experience:Prospective candidates should have a Bachelors' degree in electrical engineering or computer engineering with 1-5 years of experienceSecurity Clearance:Candidates must hold an active Secret Clearance, and be eligible for an SCI and additional clearances commensurate to their involvement with the USG.Security Clearance: SecretQualifications: Alion Science and Technology is seeking a junior Hardware Engineer to join our National Air and Space Intelligence Center (NASIC) support team to support efforts with digital hardware design and verification, and reverse engineering of electronics hardware. Prospective candidates must be able to work well in a team environment and independently under general supervision., * The ideal candidate should have experience in digital hardware design / verification and either experience or a desire to perform reverse engineering of electronics hardware; experience should include some of the following skills: * Hardware Domain Knowledge (RF, EW, RADAR, etc.) * Experience with assembling and disassembling hardware systems, equipment, and associated components * Experience utilizing either Verilog and/or VHDL * Programming and reading Microcontrollers, Digital Signal Processing Chips, Pic Chips, PSOCs, and Field Programmable Gate Arrays (FPGA). * Experience with code extraction from microcontrollers, EEPROMS, FPGAs, and DSPs. * Manipulation of binary, hex, and other digital files. * Experience with the setup and use of common test equipment such as oscilloscopes and logic analyzers * Strong documentation and writing skills. * Experience with Microsoft Office products. Additional Skills That Would Be a Plus: * Previous software reverse engineer experience. * Knowledge of computer programming, design software, and system design * Experience with software debuggers, decompilers, disassemblers, and software reverse engineering tools such as IDAPro and Ghidra. * Adequate knowledge of reading schematics and component and microprocessor data sheets. Required Education/Experience: Prospective candidates should have a Bachelors' degree in electrical engineering or computer engineering with 1-5 years of experienceEducation: Bachelor's DegreeEmployment Type: [\"FULL_TIME\"]"}