{"title":"Software Developer (Systems Software)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK_wST9GJz3hsYxwoxrkTm6s5bIUEWvtAW5qdXPG2JaaO619MCsinc9DJGDSP21dIi5uBfTiJ7ziqQyqKTFFn7Z_2BzGhRJITiro9ngHoRyo2yJ_ZCZRcl4bQpimcN5i9Yvv4d6sDKNOy3r7WDQ3mELhpwaJ_zXx3cp9ARwwNCVSLwoJcz_Zl5mtJhi37Q","source":"ziprecruiter","full_description":"Software Developer (Systems Software) If you are a Software Developer (Systems Software) with experience, please read on!We're looking for a highly experienced full stack Software Engineer that performs in the areas of data extraction, transformation and load (ETL), data mapping, data extraction, analytical support, operational support, database support, application development and associated maintenance of production systems. Team members work in a multitasking, quick-paced, dynamic, process-improvement environment that requires experience with the principles of biometric technology, large-scale (Terabytes) database and application development, large-scale file manipulation, data modeling, data mapping, data testing, data quality, and documentation preparation.What You Will Be DoingIn this position you will be working side by side with a client that has a large group (80+) of SME software developers working on cutting edge cloud technology . In a fast paced, high volume, mission enabling environment, the strategic intent is to increase product deliverables over the next five years to meet business unit/directorate expectations. We're seeking a self-starter who enjoys collaborating with other highly motivated developers and tackling new challenges using new technology. You will provide all technical direction to project teams. Duties/Tasks and Responsibilities- Develops, tests, implements and maintains complex applications in our Cloud environment - Consults with end users to develop formal user requirements.- Translates user requirements from a formal requirements document into an application design- Writes interfaces to companion applications or databases- Writes all necessary code- Conducts unit/functional testing- Transitions the application to production; enhances application as needed- Attends sprint planning meetings and TEMs to verify scope of work for that sprint- Maintains currency on tools, methodologies, technologies and programming languages- Responsible for: Design, Development and Maintenance of Software Applications and/or Databases- Consults with Project Manager, end-users and managers to develop user requirements- Analyzes, designs, implements and maintains the applications - Designs, codes and debugs web applications; designs and maintains interactive web databases and web services; designs graphics and user interfaces.- Organizes content, develops color schemes, designs and produces graphics- Designs, Develops and Maintains applications within the cloud environment. This can be for new application development or the transition of legacy applications to the cloud environment.What You Need for this Position1. Demonstrated experience writing Java 8+2.Demonstrated experience with writing RESTful web services and creating rest end points3.Demonstrated experience with Spring Boot Technology, Spring Framework and/or Hibernate.4.Demonstrated experience using Hadoop: using cloud services to build Hadoop implementation and/or writing map reduce jobs5.Demonstrated experience writing java code using HBASE API and/or functional knowledge of HBASE6.Demonstrated experience with SOLR and/or other search technologies (elastic search)7.Cloudera Certified Hadoop Developer Other demonstrated experiences which are highly desired, though not required, include:1.AWS Developer Certification2.Cloudera Certified HBase Specialist3.Demonstrated Experience with IntelliJ4.Demonstrated ability utilizing Apache Spark in the HADOOP ecosystem to process data5.Demonstrated on-the-job experience performing Linux administration as necessary for server-side development tasks (i.e. build, configure, shell scripting)6.Demonstrated experience with GraphQLWhat's In It for You- Competitive Salary- 401k w/3% match- 4 weeks PTO- 10 holidays- 100% paid Medical- Dental & Vision- $5k towards training and continuing education- So, if you are a Software Developer (Systems Software) with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}