{"title":"Network Engineer Tier III","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKiIMD1a7mJDD77QDwg0hbwB_fg17psgiQo-Pm4InXB6ps5bt0FQ6GDJ625JJ6IHq8RiEW4Sl2xzn7AkyhOBATW4PSdDPRFz8c0fPe173mrEfzYJMKYsMtP9E2I_-UrJIt1ZhCr_fjrNv5Bqc4uGzWKGW5q4fgpDsc2YVRCtw9oDUnqguvH5l4mXhJWEyE","source":"ziprecruiter","full_description":"WHO WE ARE:EOS IT Solutions is a family run Global Technology and Logistics company, providing Collaboration and Business IT Support services to some of the world's largest industry leaders, delivering forward-thinking solutions based on multi-domain architecture.  Customer satisfaction and commitment to superior quality of service are our top business priorities, along with investing in and supporting our partners and employees. We are a true International IT provider and are proud to deliver our services through global simplicity with trusted transparency. POSITION OVERVIEW:The successful candidate will be enthusiastic and passionate about IT and Networking. Working as part of an expanding company, members of the Network Team will have opportunities to work on their own initiative as well as part of a team and can expect to be developed to their maximum of their potential.The role specifically involves working as a Network Engineer Tier III within a Network Engineering Team, supporting a large-scale enterprise network infrastructure for multiple customers.Hours: typical range will be Mon-Fri 9:00am to 5:00pm.The successful candidate will help develop and understand requirements from internal customers and create technical solutions to improve productivity and services. The candidate must have a strong technical background, be innovative and agile, collaborate well in a team environment, and have very strong written and verbal communication skills - a visionary who challenges the status quo and believes that technologies can level-up productivity. WHAT YOU'LL DO:Contribute to the design, implementation and ongoing management of the corporate network.Interface with customer teams to design and continuously deliver security-related enhancements.Analyze data and define network capacity models and performance metricsDevelop automated methods to mitigate and remediate network events and minimize operational complexity.Work with global operations teams to identify and remedy issues with new sites while minimizing impact to employees on site.Assist senior management with any project work as well as any technical or logistical requirements as deemed necessary.Assist in the full life cycle of any global network projects, planning, coordinating between procurement, logistics, resource planning, customer sites as well as our team of technical writers.Assist in preparation all relevant project related documentation as required by the customer.Review & tailor processes to ensure processes are lean & fit for purpose. WHAT YOU'LL NEED TO SUCCEED4+ years of experience with Layer 2 Switching protocols4+ years of experience with Layer 3 Routing protocolsAbility to configure and troubleshoot routing/switching technologies including TCP/IP, BGP, OSPF, HSRP, VRRP in an enterprise class environment.Some experience with Linux OS/NetworkingExperience with SDN and SDWAN deployments would be advantageous.Experience with Networking Hardware and Deployment (Cisco Catalyst9K's, ASR9K, ISR4K, Nexus series,  Juniper EX and MX series)Experience with multiple networking vendors including Cisco, HP, Aruba, Juniper, and AristaAbility to work outside regular working hours as needed by the client, including evenings and weekends.Familiar with generating Bill of Materials and turning designs into implementation. PREFERRED EXPERIENCE:Networking Certifications such as CCNPExperience with enterprise environments on a global scaleStrong attention to detail, and ability to multi-taskExcellent verbal and written communication skillsProven organizational skillsFluent in spoken & written English preferred EOS is committed to creating a diverse and inclusive work environment and is proud to be an equal opportunity employer. We invite you to consider opportunities at EOS regardless of your gender; gender identity; gender reassignment; age; religious or similar philosophical belief; race; national origin; political opinion; sexual orientation; disability; marital or civil partnership status or other non-merit factor.  #indeedhp"}