{"title":"Quality Chemist 1 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKGTp6uVFy_nlreZ7Xoc_ezBmNO4GQRrMq82aXqY4ZOGHHskYE8FXgoT0XG_eRQs5TvvhurhOrMev7BdbshpbdHZTwCDa6PBQOmXAgYWyXHTuizLF7H_hNi6mJbnr7m5uE9Mqm_AeaoXCBPZ1Zjz-bMs_aNJhclXR8S7uLRxdMU1_j9dEifHkAyOxXpwqy8","source":"ziprecruiter","full_description":"Quality Chemist 1 Apply now Apply now  Start apply with LinkedIn  Apply Now  Start Please wait...Date: Jan 21, 2021 Location: Clifton, NJ, US, 7012 Company:  Lubrizol Corporation Lubrizol, a Berkshire Hathaway company, is a market-driven global company that combines complex, specialty chemicals to optimize the quality, performance and value of customers' products while reducing their environmental impact.   Lubrizol produces and supplies technologies to customers in the global transportation, industrial and consumer markets.  These technologies include lubricant additives for engine oils, driveline and other transportation-related fluids, industrial lubricants, and additives for gasoline and diesel fuel.  In addition, Lubrizol makes ingredients and additives for home care and personal care products and pharmaceuticals, and specialty materials, including plastics technology and performance coatings in the form of resins and additives.Background: The Quality Control Laboratory Chemist reports to the Plant Manager. The position's main responsibilities include analyzing and adjusting production batches, entering the final analysis into the SAP computer system, and releasing raw materials for production. Specific job functions of the Quality Control Laboratory Chemist are described as follows:  Technical Related:Analyzes in-process samples provided by the production department. Records results in laboratory notebook.Using the information from standard operating procedures, provides instructions for batches to the production department based on the analytical results obtained.Enters final analysis into the SAP computer system for generation of a certificate of analysis.Analyzes and/or reviews parameters on the certificate of analysis of incoming raw materials and provides a status of release.Prepares and standardizes reagents and titrants.Retests/recertifies batches as needed.Completes and files all related paperwork.Performs laboratory work as required to help troubleshoot process and batch problems.  Other Responsibilities:Understands the use of personal protective equipment.Follows all plant safety, security, housekeeping, and ethics rules.Good organization skills, verbal and written English communication skills, and proficient in math.Assists with the preparation of samples for external and internal customer shipments.Supports the site's ISO9001 and GMP requirements.Monitors and places requisitions for laboratory related supplies as needed.Must be able to lift a minimum of 25 pounds.  Requirements:BS degree from an accredited university or school, preferably in chemistry.3 years minimum of quality control experience in chemical manufacturing.Must be knowledgeable in the safe handling of chemicals, the use of laboratory equipment, and laboratory safety procedures. Familiarity with gas chromatograph systems is a plus.Computer skills involving Microsoft Word and Excel are helpful.Lubrizol's Clifton facility is located in Clifton, NJ, a wonderful not-so-small town in the heart of Northeast New Jersey.  With a population of approximately 85,000, Clifton offers something for everyone.  There are plenty of dining, shopping, and entertainment options for you to enjoy right in the heart of Clifton.  Clifton also has great schools, diverse, tight-knit communities, and allows convenient travel to all the surrounding area has to offer.  We are located within a 25 minute drive of several excellent colleges and universities, multiple award-winning healthcare facilities, some of the area's largest shopping malls, and iconic New York City.  Whether you feel like gambling, walking on the beach, attending an NFL football game, hitting the slopes, or enjoying a fabulous bottle of wine at a local vineyard you can do it all in New Jersey. Lubrizol is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to sex, race, color, national origin, citizenship, age, religion, marital status, military service, sexual orientation, genetic information, gender identity, or any other characteristic or trait protected by federal, state, or local law. Do You Need Assistance?Please let us know if you need an accommodation to proceed with your application for a posted job, or with any other aspect of the interview or assessment process.  You can either call 440-943-4200 and ask for Talent Acquisition or send an email to talentacquisition@lubrizol.com. Please note that this phone line and email address are not to be used for checking on the status of an already submitted application and not to be used by third party recruiters.Job Segment:  Chemist, ERP, Chemical Research, Scientist, Quality, Science, Technology, Engineering  Apply now Apply now  Start apply with LinkedIn  Apply Now  Start Please wait..."}