{"title":"Principal Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKFUkfnhkrkB1wjdMinl1AcS13-Rnh5Xtzy5oKu6QXaEG2g04Ign4DbtNj_HzgvUQWKYUxUpZ7M064mtsA80JZqluvVwfeqnNx4ohD66dbNJLnyqg5v0NP2lHYVbq-EaQq_hye6LdcNmTefXPqYhhRMNmuU8Cfe0bp1qGuWytlnuFwHeG7YAHb08cUiFmA","source":"ziprecruiter","full_description":"Job DescriptionThe team for this role is in Seattle. If you are already located in Atlanta, Chicago, Denver, or Los Angeles, you can work remotely from that location. However, if you are located elsewhere, you must be open to relocating to Seattle once employees return to the office.Are you passionate about building a world class network that connects our employees, partners, and customers? Nordstrom is on a journey that will transform how we do business. To support that vision, we are hiring a Principal Network Engineer to join a team of technical leaders building the next generation of our retail, corporate and ecommerce networks. This is a strategic position within the Engineering discipline, providing technical leadership in planning, executing, and supporting business initiatives. You will influence our technology direction and impact strategic decisions across our business.A Day in the LifeLead and influence across multiple organizations to solution business and technical problems, while building and maintaining alignment with our partner teamsCollaborate cross functionally to build an infrastructure vision, develop strategy and contribute to team roadmapsCoach at all levels and mentor teams in the application of engineering principles to achieve design goals and meet a high quality barProactively identify areas of improvement in our designs, implementations, and processes to avoid production downtime and drive a culture of Operational ExcellenceIdentifies opportunities to support continuous improvement through performance instrumentationSME for resolving high impact production incidents in a timely mannerYou own this if you have...Bachelor's or master's degree in Computer Science, Engineering, or related field10+ years of progressive enterprise network engineering experience and deep technical knowledge across multiple network technology domains (e.g. Routing, switching, security, virtualization)Proven track record designing and delivering large scale network solutions for diverse business stakeholdersExperienced at developing and maintaining effective partnerships with customers, stakeholders and technical leadersProactive and entrepreneurial mindset capable of matching business opportunities with flexible technology strategiesStrong communication skills and the ability to build trust and maintain transparency with our customers and partnersInnate problem-solving ability and a passion for continuous improvementWe've got you covered...Our employees are our most important asset and that's reflected in our benefits.Nordstrom is proud to offer a variety of benefits to support employees and their families, including:Medical/Vision, Dental, Retirement and Paid Time AwayLife Insurance and DisabilityMerchandise Discount and EAP ResourcesA few more important points...The job posting highlights the most critical responsibilities and requirements of the job. It's not all-inclusive. There may be additional duties, responsibilities and qualifications for this job.Nordstrom will consider qualified applicants with criminal histories in a manner consistent with all legal requirements.Applicants with disabilities who require assistance or accommodation should contact the nearest Nordstrom location, which can be identified atwww.nordstrom.com.Nordstrom Careers Privacy Policy:https://careers.nordstrom.com/#/contact-us/privacy 2020 Nordstrom, Inc.Current Nordstrom employees: To apply, log into Workday, click the Careers button and then click Find Jobs."}