{"title":"Senior Software Engineer - D&D Beyond NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJYiA0xGQBIkglOEKofwVbecVWmhldPzmPiObgSMbBA6rBI1bu9zYAZUW0w2nwE2QnXWpV1zH8qiFHxnr6jWB6viSHb1IoLOtbYjmnBeMmOXo5txzCyoHAtcteLz1iCR84z7GtoxspKGaUaTeQLIAcqWGQhYr-YtynQy4G4CPLwoSZy-A46SAItQj81K_pP","source":"ziprecruiter","full_description":"About this RoleAt Fandom, this Senior Software Engineer will be part of our D&D Beyond team. D&D Beyond is the official digital toolset for Dungeons & Dragons fifth edition and aims to enhance the D&D experience by making game management easier for players both at the table and between sessions. Players can create, manage, and keep track of characters, and browse all of the official rules in the compendium. We're also giving players the ability to create custom homebrew content to use in the toolset.Our D&D Beyond team is looking for an experienced software engineer to join the Tabletop RPG team at Fandom and work on digital companions for the world's greatest role-playing games. We are excited to take the next steps in realizing our extensive vision for Tabletop gaming—continuing to bring the most convenience, customization, and captivation to the TRPG community we can.You will report to the Manager, Software Engineering.You Will...Write maintainable, high-quality features in a team-based development environmentUse a shared codebase with peer reviews and pull requestsWrite and maintains unit and integration testsHelp improve code integration and deployment processesParticipate and occasionally lead planning, daily stand-ups, and retrospectivesFollow and improve processes and coding standardsCreate project documentationWork in an environment where you have a direct influence on product and technical decisionsLearn from and mentor other passionate engineers with diverse skills in an environment that values collaborationWork with distributed teams in different time zonesDelight millions of D&D players who are eager to use our productsYou Have...5+ years Experience building high-quality solutions with modern web technologies such as React/Redux, HTML5, and SassExperience consuming RESTful APIs using industry-standard best practicesExperience contributing to and consuming NPM libraries, both internal and open sourceExperience writing maintainable, and unit-tested code at scaleExperience researching and learning new technologies and sharing your knowledge with your peersBonus Points if You Have Experience With...Running or playing in your own Dungeons and Dragons games.JavaScript transpilers (Babel)TypescriptCSS preprocessors (Sass, PostCSS)Responsive designCross-browser supportFeature flagsWeb animationsInline SVGCreating and maintaining CI/CD build and deploy processes for JavaScript packages and applicationsBenefits & PerksStock optionsHealth, Vision, Dental, and Life Insurance401k Plan (+matching)Flexible time off - flexible and generousFlexible Spending Accounts (FSA)Health Savings Account (HSA)Family Assistance ProgramsEmployee Assistance Programs and SupportWellness ProgramsLoan-Assistance, money-management, pet insurance, and other discountsPhone, Gym, and commuter programsAn international work environment with a startup cultureOpen, energetic and fan-focused, international work environmentMiscellaneous perks such as, swag, etc.About FandomFandom is a global entertainment media brand powered by fan passion. Fandom has a global audience of almost 300 million monthly unique users and encompasses over 400,000 fan communities. We currently feature more than 55 million pages of content, inclusive of video. Our Fandom values are:We serve a global community.Connection with our fans, creators, and partners is at our core, and it's grounded by our active efforts of inclusion.We build experiences.We imagine, improve, and deliver solutions.We bring joy.We celebrate our fandoms, our teammates, and the work we do.Learn More about FandomFandom Staff BlogWorking Remote - PerspectiveState of FandomFandom Engineering BlogBlack Lives MatterFandom is an Equal Opportunity EmployerAt Fandom, one of our core values is We Serve a Global Community. Connection with our fans, creators, and partners is at our core, and it's grounded by our active efforts of inclusion. As such, we're proud to be an Equal Opportunity Employer, and we do not discriminate based on race, ethnicity, ancestry, citizenship status, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), marital status, registered domestic partner status, caregiver status, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, genetic information, military or veteran status, mental or physical disability, political affiliation, status as a victim of domestic violence, assault or stalking, or other applicable legally protected characteristics.We invite you to complete the optional section below. This information will help Fandom with our reporting requirements and help us learn more about how we can increase diversity in our candidate pool. Completion of this section is entirely voluntary and has no impact on your opportunity for employment.New York Fair Chance ActSan Francisco Fair Chance Ordinance"}