{"title":"Quality Control Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI2xNdmlZdLy1TOM-k1UtUioQ6SXR5b4S--fhobySBClvW_8b96CbkxFwmaGQREKUoU19jpLTZ2AsGGYhote6xq16F1PptHWEzoVhEqLFVuBJIcStHh2t5Nq7yLiZWXv3lQ48LZ7iUCATLlqnSpvbjIaimnqZFW1Yq3RKkw8HsjNMUbPGE6_27EBL3q7NtR","source":"ziprecruiter","full_description":"Quality Control ChemistTri-Pac, Inc. a contract development and manufacturing company (CDMO) specializing in liquid and aerosol filling for personal care and pharmaceutical marketers, is seeking an experienced Quality Control Chemist for immediate addition to our fast growing team. Primary FunctionsPerforms analyses of raw materials, batches, and finished products following specified analytical methods.Develops analytical procedures, troubleshoots, and validates laboratory methodologies and instrumentation.Conducts routine analyses of raw materials, batches, and finished products following specified analytical methods.Develops analytical procedures employing various laboratory methodologies and instrumentation.Maintains accuracy and reliability of all laboratory instruments. Conduct instrument calibrations as required.Troubleshoots instrumentation and methodologies when mechanical or procedural difficulties occur.Validates newly developed methods to meet CGLP requirements.Performs assigned procedures for processing laboratory reports, documentation, customer paperwork, and any other clerical laboratory functions as required.Investigates customer complaints and internal technical services problems, reports findings, and recommends solution(s).Able to perform analysis using HPLC, GC, FTIR, UV-Vis, Karl Fischer, Coulometric Titrations, wet chemistry, and numerous other analytical methodologies/ techniques.Verify and validate USP compendial methods or customer methods for use in Tri-PacCore CompetencyDetail OrientedExperience with Medical Devices and/or OTC consumer productsLab Instrumentation including GC, HPLC, FTIRGMP, GLP, LIMSRequirementsMaintains a working knowledge of all Tri-Pac and customer procedures, requirements, and CGMP’s/CGLP’s.Minimum Bachelor Degree and 2-4 years related experienceStrong analytical skills with experience using HPLC, GC and other lab equipmentGood interpersonal skills and collaborative team attitudeMust have strong oral and written communication skillsDetail oriented and organizedSelf-motivatedCustomer focused and Quality DrivenBenefitsCompetitive Salary/ Pay & Packages, Vacations, Insurance, 401K, Life Insurance, Disability (Long term/ Short term) and Continuous Training. Work where you are HAPPY! Tri-Pac, Inc. also recognizes the importance of continuing education and offers Education Assistance to our employees to encourage continued personal development and growth.www.tri-pac.usThank you for your interest and consideration of a career with Tri-Pac, Inc.Tri-Pac, Inc. is an Equal Employment Opportunity / Affirmative Action EmployerTo Staffing & Recruitment Agencies: Our Company does not accept unsolicited CV's or applications from agencies. We are not responsible for any fees related to unsolicited CV's or applications and explicitly reserve its right to contact candidates presented in such unsolicited CV or application.COVID-19 considerations:All employees are mandated to wear masks while in any of the facilities. All employees are mandated to wear face shields, booties, hair nets and other PPE as required.Powered by JazzHRiDNxy5yBpS"}