{"title":"Wet Chemistry Scientist 1","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJBLdJ3LXwnmERWkNTzEzdaaAptW2CaXKjc9bN5z5ujBFslVs4QdevwBxqkTXm2UCUJtdoiFVrVpZVQLikFstxY3HTM1FolfoA1jC5-Cuccl3IBp1_q3ssv2z-f_13YGt9NeI_qaM84GaA864mxaKCxmz2Kphro3fHBpgb_H-Mf7LI5LA3UFJZ8vxZQ2Mc","source":"ziprecruiter","full_description":"Hours are Tuesday - Saturday 12:00 pm - 8:30 pmSUMMARY:Responsible for providing or overseeing the analysis, administration and oversight of standard chemistry/biochemistry policies, programs and practices; feedback and guidance regarding the analysis of samples using fundamental professional and technical knowledge of chemistry/biochemistry or related instrumentation, testing, and procedures.ESSENTIAL FUNCTIONS:This class specification lists the major duties and requirements of the job and is not all-inclusive. Incumbent(s) may be expected to perform job-related duties other than those contained in this document and may be required to have specific job-related knowledge and skills.1. Provides fundamental analysis in support of standard testing materials, products and/or devices utilizing standard analytical instrumentation; follows Standard Operating Procedures and methods to perform testing.2. Provides fundamental review, analysis, interpretation and documentation of testing results.3. Overseeing or reviewing, completing and processing various types of standard chemistry/biochemistry forms, documents, databases, and related materials and information.4. Provides fundamental analysis and interpretation and counsel to staff, management, and functional leaders regarding chemistry/biochemistry policies, programs and practices; involves standard operations.5. Provides standard research, feedback and decisions to resolve management and employee questions and requirements; assists with receiving customer feedback and coordinating resources and responses as required. 6. Analyzes and reviews process, results, feedback and related chemistry/biochemistry information on an ongoing to as needed basis to determine trends, draw conclusions, interpret findings, and presents results, proposals and recommendations to management.7. Ensures the accuracy of more fundamental tests, equipment, actions, procedures and operational databases, reports, and related details through audits, queries, and operational reviews; works with teams to resolve discrepancies; resolves discrepancies or escalates discrepancies to ensure quality assurance in testing process/results.8. Assists with developing or participating in chemistry/biochemistry or cross-functional project or program objectives, which includes proposed budgets, timelines, materials, personnel, and other project requirements, receives direction and presents information to management.9. Cleans, maintains, prepares and calibrates equipment, samples, and related areas.10. Interprets and applies department policies and procedures and assists with applicable laws, rules, and regulations; receives guidance within these areas as needed.11. Contributes to the efficiency and effectiveness of the department's service to its customers by offering suggestions and directing or participating as an active member of a work team.12. Promotes and supports the overall mission of Pace Analytical by demonstrating courteous and cooperative behavior when interacting with customers and staff; acts in a manner that promotes a harmonious and effective workplace environment.QUALIFICATIONS:To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required.Education and Experience:Bachelor's degree in chemistry/biochemistry, or a closely related field; OR an equivalent combination of education, training and experience.Required Certificates, Licenses, and Registrations:Continued employment is contingent upon all required licenses and certificates being maintained in active status without suspension or revocation.None.Required Knowledge and SkillsRequired Knowledge:Fundamental principles, practices and techniques of chemistry/biochemistry.Standard understanding of the administration and oversight of chemistry/biochemistry programs, policies and procedures. Fundamental methods to resolve chemistry/biochemistry problems, questions and concerns.Standard understanding of applicable chemistry/biochemistry laws, codes and regulations.Understanding of standard testing tools, instruments and calibration. Computer applications and systems related to the work.Principles and practices to serving as an effective project team member.Methods to communicate with staff, coworkers, and customers to ensure safe, effective and appropriate operations.Correct business English, including spelling, grammar and punctuation.Required Skills:Performing fundamental professional-level chemistry/biochemistry duties in a variety of assigned areas. Overseeing and administering standard chemistry/biochemistry functions.Training others in policies and procedures related to the work.Serving as a team member and the development and management of projects.Operating in a both a team and individual contributor environment.Interpreting, applying and explaining applicable laws, codes and regulations.Preparing fundamental functionals reports, correspondence and other written materials.Using initiative and independent judgment within established department guidelines.Using tact, discretion and prudence in working with those contacted in the course of the work.Performing effective oral presentations to large and small groups across functional peers and the department.Contributing effectively to the accomplishment of team or work unit goals, objectives and activities.Establishing and maintaining effective working relationships with a variety of individuals contacted in the course of the work.PHYSICAL/MENTAL REQUIREMENTS:The physical demands described herein are representative of those that must be met by an employee to successfully perform the essential functions of the job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Mobility to work in a lab and office setting, use standard office and lab equipment and stamina to sit for extended periods of time; exerting up to 20 pounds of force occasionally and/or up to 10 pounds of force frequently to lift, carry, push, pull or move objects; vision to read printed materials and computer screens; and hearing and speech to communicate in person or over the telephone.WORKING ENVIRONMENT:Work is performed in a lab and office setting.  Work is subject chemicals, fumes, gasses, noxious odors and related items in a lab setting."}