{"title":"Organic Chemist (Scientist I/II)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIlBwA9Qd2KtfGhUKyxh8_DrRtvLdEfGyT4QkWEJ0nEDvV6eRrWe3sSE-BgmpqI0J8HGj5dAP5TFuzdDKwSTSXCxru4Ys71iws837V3QkDrfhXtCCKXzGnQ3QibypjGU-j8GvS51_V65dCgLh6C251TBa1WVSasswr4eK6CipwbDqPqsJaxkpTA3vzf7lWn","source":"ziprecruiter","full_description":"Organic Chemist (Scientist I/II)Job DescriptionLooking for a Scientist in Chemistry with a solid background and experience in Organic Synthesis, RNA drug delivery and oligonucleotide conjugation chemistry. This individual will contribute to growth by providing synthetic support for RNAi drug R&D projects in a dynamic lab setting, where both discovery and process chemistry projects are on-going.Essential Job RequirementsPh.D. in RNA and/or DNA Chemistry, Organic Chemistry, Biochemistry, Nanotechnology or equivalent scientific discipline.Experience in conjugation chemistry applied to biological systems. Knowledge of Oligonucleotide conjugation is required.Synthesis experience in small organic molecules is a must, experience in galactose derivatives and peptide chemistry will be a strong plus.In-depth knowledge in organic and nucleic acid chemistry.Proven scientific and technical ability to design and execute synthetic route, product purification, optimization of chemistry, and analysis and present data.Experience in analytical methods such as NMR, HPLC, LCMS, UV-vis and IR.Broad experience in purification techniques such as revers phase, GPC, IEX chromatography, preparative HPLC.Highly motivated and self-driven individual with the ability to work independently, and multi-task under aggressive timeline to support team and corporate objectives.Duties And ResponsibilitiesDesign, and conduct the synthesis, purification and characterization of oligonucleotide small molecule conjugates, or of interest.Contribute to the development of Client siRNA drug delivery design. Maintain excellent laboratory records, and write reports and research summaries as required.Interact closely with other scientists to develop comprehensive solutions.Good organization skills with an ability to manage priorities and multi-task.Participate in intellectual property creation."}