{"title":"Sr. iOS Developer-Sugarmate","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKjdjm-7gpgrExcZCQAWr82PFZkL_ePK1jSTU27sNPzJoxvMTardZl4GUKuzwOgxPtPhb2blF-wFwtVW_j_wW8buC9Ovato_JkeIsqAU8aRGSx8_D277Tkkk5k8LQp2hhTEBuKx5x0hCe8qO0Qq8B7gEfftNLjaoqYxLWptITvCRryl0jcZkIE_EJ2LBQ4","source":"ziprecruiter","full_description":"ABOUT US: We’re a recently acquired startup that is now part of a top diabetes technology company on the rise.Sugarmate is a consumer platform built to help people manage their diabetes and health. The app has a 4.8 star rating in the App Store and was recently ranked by users as the #1 patient-facing diabetes tool and the most frequently used method of viewing and analyzing diabetes data. Our user base is growing rapidly solely by word of mouth, and we have a lot more that we want to do.Tandem Diabetes Care is the maker of the most sophisticated and user-friendly insulin pump on the market, the t:slim X2 insulin pump with Control-IQ. It’s the only commercially available pump with a color touchscreen and an algorithm to automatically adjust insulin in response to predicted glucose levels. PITCH:Help us take Sugarmate to the next level as we continue to build out new, innovative features designed to help improve the lives of people living with diabetes and their loved ones. Help rapidly expand a lean software development team with the resources of a multibillion-dollar company.ROLE:You will take over responsibilities as the core developer of the iOS application and help build out the rest of the product development team. You’ll need to quickly become familiar with the code base and hit the ground running. QUALIFICATIONS:Bachelor's degree in Computer Science, Engineering, or Mathematics7+ years of software development experience5+ years of native iOS app development experience3+ years developing in SwiftProven ability to build production-level code, launch and iterate on apps under pressureExperience developing consumer-facing softwareCapable of translating high level requirements into well-designed implementationsAbility to convert designs into pixel-perfect interfacesSolid general programming and algorithm skills BONUS QUALIFICATIONS:Passion for building software in the diabetes, fitness, or medical spaceExperience with test-driven development and pair programmingCan be an advocate for optimized practices across the engineering organizationKnowledge of Core Data, HealthKit, or SwiftUIPERKS:A great company culture with smart and fun peopleRobust benefits packageEmployee stock purchase programIf you are applying for this job and live in California, please read Tandem’s CCPA Notice:https://www.tandemdiabetes.com/careers/california-consumer-privacy-act-notice-for-job-applicants"}