{"title":"Chemist - Junior Level","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAInrvpWWb7Zq0Ga_rUCgaLl76F6TeluqBpaSvJ9e5w6HhqEuyQN96nn48v3ONJnIxMLnCso24soKHY2JUrgGHeu3vB5_GLKef1E7FkEjLHKiSNaUzVE0nBkfh1qhDMCeNfaHfEOLwR8HfiFM-xhJgP9jcppMRQ_ZY6OrA8hBHGwY8fpzxhXdpbS3SRJgFcY","source":"ziprecruiter","full_description":"Tetra Tech Inc. is currently seeking a full-time, junior level Chemist for our Chantilly, VA office.Are you ready to take the next step in your career? Do you want to do meaningful work that improves quality of life? At Tetra Tech, you will work with high-performing teams who are passionate about using their expertise to find solutions to complex problems in water, environment, infrastructure, resource management, energy, and international development.  The selected candidate will/be:     Provide environmental analysis support and data validation for environmental site assessment and remediation projects, related to federal, state, municipal, and commercial clients.      Responsible for data management tasks, including tracking and validation of collected data, uploading to project databases, review of web maps and other data illustrations/data tables for consistency and accuracy.      Participate in field investigations as needed (including soil, water, and air sampling; drilling and subcontractor supervision, and coordination with analytical laboratories), construction and/or remedial action oversight, and preparation of technical reports.      A seller/doer and continuously seek to grow the business.      Prepare various technical deliverables including reports, letters, proposals, cost estimates, tables, and figures.     Be expected to follow company safety standards, participate in safety training, and implement site-specific health and safety plans. Job Requirements:The ideal candidate will have 2-5+ years of chemistry experience in a consulting role. In addition, you will have experience with/be:     Environmental data analysis, data validation, environmental due diligence, UST compliance monitoring, UST closures, and vapor intrusion assessments.      Ability to analyze and interpret chemistry and environmental data is required.     Prepare technical reports, memos, response to comments tables, and diagrams is required.      Working knowledge of the conceptual site model process is preferred.      Experience including CERCLA RI/FS and PA/SI is preferred.     Must be a competent technical writer.     Able to observe, evaluate, and document data consistently and concisely to clients.     Experience with federal, state, municipal, and private sector projects is preferred.     Ability to interface with clients, subcontractors, working groups, and internal customers required.      Able to communicate effectively and make evaluated decisions for the betterment of the client and the company.      High-level skill using Microsoft Office applications with emphasis on Excel and Access is required.      SQL Server (programming experience in SQL and VBA) is preferred.     Attention to detail and a focus on quality is required.      A problem solver, with an interest and ability to work in a collaborative manner, and the flexibility to adapt to changing situations.     Must be able to manage time well and work on tasks as part of a larger project team.     Ability to work extended hours based on the Company's needs is required.     Must have a strong health and safety ethic.     Strong verbal and written communication skills are required.     Self-motivated and able to take directions and work independently.     A strong drive to succeed and advance your career is preferred.      The ability to maintain a relatively consistent level of positivity, day to day.     This position requires you to drive.  In addition, you must be able to pass a motor vehicle records (MVR) background check.Education/Certifications     BS/BA degree in Chemistry or a related discipline is required.     OSHA 40-hour HAZWOPER Training is preferred.The work environment consists of:     Office and field work, with some field work requiring overnight stays.     Must be able to walk large project sites and must be physically able to carry up to 35 pounds of equipment (such as sampling tools, GPS unit, field screening equipment and cameras) during field work.      Field activities take place in a variety of weather conditions, including harsh weather, and can occur in remote locations and include areas of uneven terrain.       Must be a strong swimmer and able to work safely and comfortably in and around boats.     Field sampling and monitoring may include various media (soil, groundwater, surface water, sediment, soil gas, and air).     Must be able to work at a desk / computer in an office environment for office-based tasks.While we commend hard work, we are interested in people who are effective - who get the right things done at the right time. At Tetra Tech, you will work with people who come in every morning to decide what needs to be done to accomplish the goals we have all helped define, and then take ownership for the speed of the execution on those goals.  About Tetra Tech:   Tetra Tech is a leading provider of high-end consulting and engineering services for projects worldwide. We combine the resources of a global, multibillion dollar company with local, client-focused delivery in more than 400 locations around the world. We are Leading with Science to provide sustainable and resilient solutions for our clients.    At Tetra Tech, we provide a collaborative environment that supports individual performance, innovation, and creativity. We are proud to offer competitive compensation and benefits. Learn more by visiting http://www.tetratech.com/en/benefits.For more information on our company, please visit our website at www.tetratech.com. To apply, please submit your resume and cover letter on the Careers portion of our website at www.tetratech.com/careers.  We thank all applicants for their interest; however only those selected for an interview will be contacted. Tetra Tech is committed to creating a diverse environment and is proud to be an Equal Opportunity Employer. We invite resumes from all interested parties including women, minorities, veterans and persons with disabilities.  Tetra Tech is a VEVRAA federal contractor and we request priority referral of veterans for available positions.  EOE AA M/F/Vet/Disability - No calls or agencies                       Additional Information Organization: 103 EMI"}