{"title":"Client Coordinator / Customer Service Representative (Entry Level) NEW!","location":"","salary":"","description":"","term":"$980 to $2,120 WeeklyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAInhmCm6iOvuoDS4g88EjzejLhiLUCf2KgCsR6raD6yCwsiNByb2kRX6SYkq0OwqI_6DBQAVEbEiXo2xhNFKpIqkOKCZ2NGwEiJSRsAAXBKh0ggqBBf7dmMIqZct5phguWgIK3lxhIr7TCypyCrLQHEDyKM-iQVBoI8uwFvnQ3GYmR28PBhpH-KQHgmmnke","source":"ziprecruiter","full_description":"*This Role is not Remote*OUR TEAMHere at Leap, we pride ourselves on our ability to create quality long-lasting consumer-client relationships at low cost to our clients while developing tomorrow’s trail-blazers in the marketing industry. Through direct marketing strategies developed by some of today’s top leaders in the global marketing field, we provide services that other forms of marketing just can’t seem to match.Due to ongoing, rapid growth, we are looking to expand our team of professional sales executives and are currently seeking individuals to present and promote our market-leading product range.No previous experience is necessary as we provide all our Customer Service Representative market-leading training and on-going support on all aspects of the role.What we're looking for:Self-motivation.Positive friendly personality.A highly professional approach.What we offer:Industry-leading training.Ongoing support and development.Field sales Kit.Industry-leading commission package plus a base and paid training.Great incentives, bonuses, and awards.A structured career path and progression.At Leap, we are highly trained in many areas. The better results we get for our clients, the more our already impressive success level grows. This is why we provide daily training for our team to keep improving. We have highly trained account managers that are here to help each and every one of our team with anything they might need help with. With this daily training, we can ensure that everyone succeeds and results are guaranteed.Leap welcomes candidates from all backgrounds but primarily sales, marketing, customer service, and retail.If you believe you have what it takes to be a successful member of our fantastic team then please get in touch now!"}