{"title":"Senior Network Engineer Cloud VPN or Data Center ( remote / work at home )","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ36KtLETYBQcLcrHIL7OCUM-JAD4x5OrFm8ChKIHXRC9VqFmTw6hCFTkYrDkRiZB8zbJ8AS8G9cssCwOb1mEo-EDwWyO5QcHW_5UipMYdep9CWbRBtCg97XQFBDN18xj0iwWnLIuHLMDaUOModdu1LmnxXREHNDcxp2vse8zbupyGC4g6wosfnJrPNH_cP","source":"ziprecruiter","full_description":"**Description**The Senior Network Engineer develops and evaluates network performance criteria and measurement methods. Prepares the analysis of the short-term or long-term capacity needs for switching, routing transmission and signaling. Conducts network architecture design, feasibility and cost studies. Develops alternative routing scenarios and changes in required sequence of network activities. Conducts economic and population growth studies to determine impact on network capacity and development plan projections. Begins to influence department's strategy. Makes decisions on moderately complex to more complex issues regarding technical approach for project components, and work is performed without direction. Exercises considerable latitude in determining objectives and approaches to assignments. **Responsibilities**Humana is seeking a Senior Network Engineer who will deliver solutions for the future underlay fabric for the enterprise. This is an exciting opportunity for forward-looking technology leaders to make key contributions to the evolution and transformation of the company's networks toward next-generation technologies. This is a critical role within Humana's IT organization responsible for the engineering and design, planning, implementation, and establishment of operational and maintenance programs to deliver best-in-class next generation network infrastructure. This includes optimizing all aspects of network eco-system, including performance, resiliency, availability, resource utilization and innovation. This person will provide network design, engineering and administrative support of both physical and virtual networking devices within our SDI environments. This person will be responsible for leveraging state-of-the-art networking technologies, including virtualization and software-defined networking (SDN), to develop and deliver a robust, scalable, network eco-system. He/she will work with various leaders across the enterprise to coordinate network solutions to meet challenges of technology, regulatory, security, and competitive conditions.The scope will include the following areas of concentration:+ Network fabric for the internal Data Centers / Private Cloud platforms supporting multiple software defined network overlay technologies; + Planning, designing, and deploying new LAN/WAN network infrastructure and connectivity for managed services environment. + Overseeing and performing administration, configuration, and monitoring of all network equipment (switches, routers, firewalls, load balancers, VPN concentrators, etc.). + Remote Access VPN solutions (Aruba, Cisco AnyConnect and Aruba) + Support the elimination of existing datacenter dependencies to enable cloud/fastest-path access (i.e. VPN, Web Proxy, etc...) + End-User device connectivity architecture & implementations + Connectivity solutions for supporting a hybrid cloud strategy; + Remote site and campus network technology to support SDWAN and SD-LAN implementations; + Internal company wireless connectivity; + WAN circuit topology and telco/carrier technical integration; + Remote user network end-point technology.Engineering responsibilities for these areas of concentration include, but are not limited:+ Design for new solutions; + Standard solution configuration; + Technology roadmap development, management, and maintenance; + Documenting and updating all network infrastructure and supported business processes. + Capacity and performance planning; + Integration with related infrastructure engineering efforts; + Alignment and integration with information security requirements; + Definition and development of operational KPIs and metrics; + Disaster recovery/business continuity integration; + Continuous knowledge and skills improvement + Assist in motivating and growing the Network Engineering team to its next level of maturity, agility (NetDevOps) and scalability. Help build foundation and help define capabilities and processes to address network needs in tactical and strategic terms.Required Qualifications:+ BS/BA, preferably in a technical or scientific field + Network engineering certification such as CCNA through CCIE or the equivalent + 8+ years of technical network engineering experience, and 3+ years of project leadership experience + 5+ years of Layer 2/ Layer 3 network architectural design (LAN/WAN/VPN) and engineering experience + 5+ years of experience working with MPLS, BGP, OSPF, and other LAN/WAN technologies + 5+ years of 802.11 wireless infrastructure and administration + 5+ years of experience architecting large-scale wireless network infrastructure, with advanced experience designing carrier-grade WiFi + Strong understanding and support of 4G, LTE, 5G network deployments across remote sites + Strong experience supporting large-scale datacenters and remote sites + Strong experience with end-user device connectivity architecture & implementations (i.e. IoT, iPads, etc...) + Experience with Cisco networking equipment + Experience in VPN technologies + Knowledge of QoS and network security functions (firewalls, VPN, IPS, etc) + Ability to manage complex multi-organizational projects + Experience with implementing and operating a software-defined network environment (VXLAN, EVPN, etc.) + Vendor management skills (hardware/software security vendors as well as third party vendors)Preferred Qualifications:+ Programming/scripting languages and frameworks knowledge and experience, in support of automation (Python, Ansible, etc.) + Familiarity with cloud architecture network designs, implementations, and support (AWS, Azure, GCP) + Data Center infrastructure solutions: Cisco (R&S), F5 (LTM, APM, ASM), Palo Alto (NGFW + IDS/IPS functions), Infoblox (DDI), Citrix Netscaler (VDI), Cisco ISE and ACS campus LAN and WLAN solutions, also implemented on Cisco products, network segmentation and access control in remote offices + Experience with Arista, VMware NSX-T, and other SDN technologies + Experience architecting and implementing large-scale SD-WAN solutions + Demonstrated experience with DevOps, ITIL, and platform process & technology + Master's Degree in a Technical Field**Required Qualifications**+ Bachelor's degree + 5 or more years of technical experience + Must be passionate about contributing to an organization focused on continuously improving consumer experiences**Preferred Qualifications****Additional Information****\\#cloud****\\#LI-remote****Scheduled Weekly Hours**40"}