{"title":"Auto Mechanic B - Newark","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJEeFCc2_yWsVD-H9ibfvqVQSH0m7iDesKqy7TD0o9STamcL59gbopBcv_vzK0f625_kl_CLC4UotZeohkSWH7xtTxWliHkIVdbmUX14C9w4mvxWM27dBsUELHo_emtZ6wvfDIfINHcAunYmN3lm_2NxE2gYuLMXodbg4xAXJY74o9yiWLho1mF37o6pE0","source":"ziprecruiter","full_description":"General Responsibilities ***Sign on Bonus - $3000 total bonus after 90 days!***$1500 after 30 days$1500 after 90 days If you're looking for the benefits of joining an industry leader, with a high-charged, energy-filled environment, then you can stop looking, because you have found what you're looking for in the Mechanic B position. Bring your energy, drive, and motivation to Hertz, and set your goals on cruise control! The Hertz Corporation, a world leader in the car rental industry, currently seeks energetic team players to join our team. Essential Requirements A Mechanic B is primarily responsible for the following: + Oil changes, replace filters, tire work+ Jump, replace, and service batteries+ Replace bulbs, lenses, antennas and side view mirrors at Hertz locations+ Placing license plates, registration, moldings, etc+ Responsible for state inspections+ Cut duplicate keys, make road calls to start cars+ Assists and works with mechanics+ Cooperate effectively with fellow employees+ Maintain a courteous and professional manner and appearance We require the individual to be flexible with scheduling, which will include days, nights, weekends, and holidays. Schedule selections based on seniority. Candidates must have valid Driver's License. Driving history must meet Hertz standards and must have minimum of four years driving experience. Previous experience is preferred. o Hertz is a Drug-Free Workplace. All employment is contingent on successful completion of drug and background screening. o Hertz is an equal opportunity affirmative action employer and administers all personnel practices without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity or expression, marital status or domestic partnership status, disability, protected veteran status or military status, genetic information, or any other category protected under applicable law. Hertz is committed to taking affirmative steps to promote the employment and advancement of minorities, women, persons with disabilities and protected veterans."}