{"title":"Chemist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJB21tYxnS1vOA5i19aV9Ew5p_3gYxoV2ZpoE_8m0ijvj6ADU2rrF1fWs5Y-h9WOnMIyT3eKvwS25pnIm57opeDBYr0Pm7C-SjIclr0uKDuxIyx3ju_T5RpfhEddkN5dInAmiHXvooihZS3mMFwYP8JsGQe91hkm7xzTzUZb5gcA4NZGOcvn_KARDnKemuQ","source":"ziprecruiter","full_description":"EMSL Analytical, Inc., one of the largest environmental testing firms in the United States, is currently seeking a Full Time Chemist for its laboratory location in Indianapolis, IN.Responsibilities include but are not limited to:Assist with preparation of environmental chemistry and industrial hygiene samples.Analysis of environmental chemistry and industrial hygiene samples.Clean and maintain laboratory equipment.Follow all Quality Assurance and Quality Control procedures for the laboratory and test methods- will train.Support laboratory with sample organization and disposal of analyzed samples/Entry level analysis and cross training opportunities are available, depending on business needs.Work environment is a commercial laboratory setting involving the use of acids, solvents, and other reagents that require care when handling. Safety training is provided for all individuals. This job involves 50% standing for sample preparation and analysis and 50% sitting for reporting, reviewing and other required Quality Assurance paperwork.Some clerical work may be involved including filing, shredding, and logging in and data entry of samples.Requirements:Bachelor's degree in Life Science discipline, Chemistry degree is preferred.Some laboratory experience, academic or commercial laboratory, is a plus.Candidate must be able to distinguish colors in order to perform analysis.Must be able to work independently and with a team.Must be able to work in a fast paced setting, multi-task and prioritize assignments.Must have good communication, computer, typing and organizational skills.Available Shift: Monday to Friday 8:30 a.m. to 5:00 p.m., extra hours and/or weekend work may be required to meet business demands.As the nation's leading environmental testing firm, EMSL's network of nationwide laboratories has been providing quality analytical services since 1981. We offer a wide array of analytical testing services to support environmental investigations focused on asbestos, microbiology, lead paint, environmental chemistry, indoor air quality, industrial hygiene and food testing. Additionally, we also provide materials testing, characterization, and forensic laboratory services for a wide range of commercial, industrial, regulatory, and law enforcement clients.EMSL Analytical, Inc. is a stable and growing company that offers the opportunity to become a part of a close knit team where you can advance within and develop professionally. EMSL laboratories are throughout the U.S. and international with laboratory locations in Canada.EMSL offers full time benefits: medical, dental, 401(k), voluntary benefits, paid time off, holiday pay and a flexible spending account.To find out more about EMSL Analytical, Inc. please visit our website at: www.emsl.comEOE including Veterans and Disabled.Location: Indianapolis, INJob Code: 20-044-16L# of openings: 1"}