{"title":"Full Stack Software Developer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJ-J5bx_E4KGwD71whDp_X8UA4Brc5d8jRPRirOlBQ3p9Lj_tv5dyoOW1U1l1gxP-8rys1Svk6AtEQkZsdNNWpXN24O-z8XXYDa9sT-b0KZF6MWaE3UiIO3Q3wN4DTq8fb_eb2vqTL2aUkA-W0lUZrmXAu9HSf8iJ4JWQ7w2UgG2vz0_3OWcbdo0lln9oE","source":"ziprecruiter","full_description":"Company Industry: TechnologyOpportunity: The Mom Project is helping to source candidates for the above client who is looking for a Full Stack Software DeveloperCommitment Level: 40 hours per week, on-site, contract through December 2021Our Customer is an American business and financial software company that develops and sells financial, accounting, and tax preparation software and related services for small businesses, accountants, and individuals. They are laser-focused on their customers, live and breathe innovation, and champion those who dare to dream. Their Mission is powering prosperity around the world. They do it by attracting the world’s top talent, bringing vital partners into their global platform, and leaving the world a better place through exceptional corporate citizenship.Our customer is looking for a Full Stack Software Developer on a contract basis to support their ongoing business needs.What You’ll Do:• Work closely with product and development teams to create an amazing user experience• Build integration and unit tests along with code• Work in an agile development environment with short sprints and standups. Implement proof of concept, prototypes and production-grade software• Maintain and support existing software and hardware systems, infrastructure and production• Assist support staff and team members in troubleshooting software issues and implementing bug fixes• Takes ownership of the codebase• Work to continually improve code quality, and get bugs fixed and deployed rapidlyMust Haves:• Experience in or knowledge of Python, Celery, Go, Elasticsearch, PostgreSQL, SaltStack, Flask, Git, React, Elixir• Deep understanding and knowledge of virtualization (libvirt, KVM, Xenserver)• Excellent communication and interpersonal skills• Strong programming skills including software engineering methodologies and best practices. REST/API development• Strong experience with Python or other scripting languages• Experience working in a Linux development environment• Strong experience with relational databases, and specifically MySQL, Elasticsearch, Redis. Excellent HTML, CSS and JavaScript skills• Experience in consuming RESTful APIsEducation:• Bachelors DegreeHours & Location:Standard M-F, 40 hours/week. This role will be remote until Covid restrictions are lifted. At that time, It is expected that the candidate will be on-site in our customer’s San Diego, CA location.Now for the Perks!Health Benefits: Medical, Dental, Vision, 401k, FSA, and Commuter Benefits program."}