{"title":"Window Service Technician NEW!","location":"","salary":"","description":"","term":"$24 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKA-9kvfFj2vf7R7Ci3Ui5tE9Io3TfbV9-ciahA1CEMTYlifZatT_et3Msvxjp2iaUaZFk2Haj0KcjDBwZ470qf4PuN9Ipx1En0nYitqHn9A9zECBFByjEl9d6bx6jOyJPsxCJB_hRB0o7-mnnyfZW7MpUrNftfcD2p-UZajwx6o-ffABJGPHWvHpzdKq5f","source":"ziprecruiter","full_description":"Window Service TechnicianRenewal by AndersenCranford, NJCOMPANY OVERVIEW: Renewal by Andersen is the window replacement subsidiary of Andersen Corporation, a company that has revolutionized the window and door business for more than 110 years.Drawing on the Andersen tradition of over 100 years of quality, innovation and craftsmanship, Renewal by Andersen was founded with the objective of creating a different and better window and door replacement experience for homeowners. Our process begins with a free in-home consultation. We then custom-make beautiful, energy-efficient composite windows and professionally install them for optimal performance.JOB SUMMARY: We are currently looking to hire a Service Technician in the Cranford, NJ area. This is a field service position responsible for responding to on-site window and door service request. Assess, repair, and replace parts and components to ensure proper functioning. Work directly with customers, co-workers, and contractors to ensure excellent customer service.REPORTS TO: Service ManagerDUTIES AND RESPONSIBILITIES:· Trouble shoot, repair and replace window components, door panels, and hardware including sashes, door panels, hardware, operating mechanisms, caulking, adjusting product for better functionality, and trim replacement.· Communicate with office support staff the status of home visits, parts needed, and resolution of appointments· Provide exceptional signature service to all internal and external customers· Complete service calls in a timely manner and adhere to daily schedules· Ensure all company safety policies and procedures are being followed.· Must be able to work independently without supervision· Attend company meetings and trainings as required.· Perform any other duties or responsibilities deemed necessary by management.QUALIFICATIONS:· 3+ years of experience performing basic home repair work, window and door experience· High school diploma or equivalent, technical college degree preferred· Mechanical experience and aptitude required· Basic computer and excellent time management skills· Must have a positive attitude with a focus on providing customer excellence· Physical ability to lift and carry products weighing up to100 lbs., climb ladders, stoop, bend and walk on uneven surfaces.· Ability to sit and drive for extended periods, have a valid driver’s license and an insurable driving record· Comfortable with using electric and air powered tools.· Must have a vehicle that can transport materials and tools including a ladder and screen· Speak, write and communicate in English.BENEFITS:· Personal Time Off· Holiday pay· Medical, dental, vision· Voluntary life insurance and long term disability· 401k· Student loan reimbursement program· Car Allowance, cell phone allowance, gas card, fast track· Career opportunitiesPAY-$24/hour"}