{"title":"Hardware Developer, Power Systems RAS Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJcyLJQAOJ2wyi3o0wJzFnwAf51avcwH9APPj3I-WTRFZ08I_ANxjhzBniV4QbnOVmdWvjJ25Y7p3M1b5omDCKQfe-vo5FhqvQVRdGVgKEYT0g30CmLKtRq0qCcDUB19FYxFkloArZm-6S2GWtrs8iucZAtxUDTQPKtDynD2et0J8FXqllH9qWyRsF9TWEG","source":"ziprecruiter","full_description":"Hardware Developer, Power Systems RAS Engineer Country:USState:TEXASCity:AustinCategory:Hardware Development & SupportRequired Education:Bachelor's DegreePosition Type:ProfessionalEmployment Type:Full-TimeContract Type:RegularCompany:(0147) International Business Machines CorporationReq ID:360734BRTravel Required:Some travel may be required based on business demandMin Salary:Max Salary:Currency:Location:Austin, TX US View Full Description  Introduction The critical infrastructure running industries like transportation, energy, insurance, banking and healthcare needs to be intelligent, secure, flexible and resilient. Enterprise clients must transform to stay viable in this competitive landscape. At IBM we develop leading edge technologies and systems that provide our clients end to end Hybrid Cloud and AI Solutions. Come join an innovative team of engineering professionals with 28 consecutive years of US patent leadership.  Your Role and Responsibilities IBM is seeking a highly qualified individual who has applied knowledge of Reliability, Availability and Serviceability (RAS) engineering. The engineer will work on a team responsible for the IBM Power Enterprise Systems RAS architecture and design. The RAS Development Engineer will be involved from the initial High Level Design (HLD) concepts to the General Availability of IBM Power systems. The RAS engineer will monitor IBM Power Systems field performance and provide support to IBM client care teams to resolve high impact customer events. The RAS engineer responsibilities will include: Developing the Service Strategies for systems using an Enterprise Baseboard Management Controller (eBMC).Collaborating with firmware architects to develop and review eBMC Security architecture, Memory Preserving IPL dump, Graphical User Interface (GUI) and Command Line Interface (CLI) designs. Defining eBMC event logging, event reporting and LED service indicator architecture.Employing innovative and cost effective approaches to the eBMC I/O drawer monitoring and serviceability integration.Performing firmware design implementation reviews to ensure resiliency, availability, serviceability and security architecture compliance.Leading cross functional teams in developing and executing the Serviceability Assessment Test (SAT) to identify system service issues, mechanical defects and to provide inputs to the service cost estimates.Creating eBMC Service Documentation and Field Engineer Training course materials.Performing competitive analysis of eBMC Firmware and infrastructure management features. Working jointly with Offering Management, System Chief Architects, System Chief Engineers, Firmware Design Engineers, Hardware Design Engineers, Product Engineering and System Test. Required Technical and Professional Expertise The successful candidate will have good communication skills and is able to work in cross functional team environments. The RAS engineer will have demonstrated knowledge of: Bachelors Degree and a minimum of 6 years experience is requiredModern server configurations and service approachesBaseboard Management Controller (BMC) Features and FunctionsError Detection and Fault Isolation (EDFI) ArchitectureError Handling and Reporting MechanismsLinux and Aix operating system environmentsScripting languages (i.e Python, Perl, Shell, etc.) Preferred Technical and Professional Expertise The RAS engineer will have applied knowledge of or be proficient in: High Availability infrastructure designEnterprise Design ThinkingPowerPC RISC ArchitectureC/C++ programming About Business Unit IBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the world's most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio  designed for cognitive business and optimized for cloud computing.  Your Life @ IBM What matters to you when you're looking for your next career challenge? Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust - where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible. Impact. Inclusion. Infinite Experiences. Do your best work ever.  About IBM IBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.  Location Statement For additional information about location requirements, please discuss with the recruiter following submission of your application. IBM intends this job to be performed entirely outside of Colorado.  Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}