{"title":"REMOTE - Senior Full Stack Engineer - Profitable & No Layoffs! NEW!","location":"","salary":"","description":"","term":"$100,000 to $160,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALqdCstpFJFfxOxgIqQPgWBWHd3JboLCkpNULzUc2cXR6PWaE2x-XY-czblUpheBZYeHFXOqNuchUyeCwQRtRcd1lIDdt4dMrAuddFSOxASSseySweFQOLGm7lgivUGREDWX8BQFecFHS41aoFOtWaWvNlP7DcjSLm6hOeslrOiBY51vHYoojoerzN2STal","source":"ziprecruiter","full_description":"REMOTE - Senior Full Stack Engineer - Profitable & No Layoffs! WE ARE STILL ACTIVELY HIRING AND WORKING DURING COVID.Does working at a forward-thinking Fintech company that has never had a layoff (past 20 years) pique your interest?? If so, then you may be the type of person that we're looking for! With an office in Sausalito, we are a culturally diverse company that has been profitable for the past decade and provides investment services to ultra-high-net-worth investors!!Currently, we're looking for a Senior Full Stack Engineer who has experience with front-end development and OOP languages; preferably more experience with front end development but that's not a requirement.What's In It for You- Competitive Compensation Contingent On Experience - Health Benefits (100% Covered By Employer!)- 401k Matching- Unlimited Vacation - BonusWhat You Need for this Position- Experience as a Senior Full Stack Engineer or equivalent- Experience with JavaScript, HTML, and CSS- Experience with one or more OOP languages such as: Python, Java, Scala, Ruby, and/or C# - Experience with React (Plus)- Experience in an Amazon Web Services (AWS) ecosystem- Experience with Git- Bachelors degree in Computer Science/Computer Engineering (Plus)What You Will Be Doing- Provide consistent improvements to our codebase and choice of third-party enterprise software components- Write code that is easily understood and maintainable by other team members- Keep up to date with developments in technologies that we are using- Use Git (and a flavor of GitFlow) to keep track of software versions- Contribute to overall application design, from the way applications interact with users to the way data is stored in the database- Continuously improve CI/CD practicesSo, if you are a Senior Full Stack Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}