{"title":"PLC Controls Project Engineer NEW!","location":"","salary":"","description":"","term":"$35 to $45 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAIqRY77_3copRSm9lMQUGkE3wnC2nX8ENt9Vi-g42v2IXGzQW6WsS5MjKzy1Har3a54sN06RvwG38QAxw_PmhUWJiNsqSRU-2syMEiJjLgvTqnjiLgxw8oroJ1iU07iiGyUZU7UixkcrfyCNvGtYO5HxYfsZO_bAt8Xm0N6oRrGjfLm6CKjmOkx-TZisnyc","source":"ziprecruiter","full_description":"Help Toyota implement new model introductions and large scale capital projects at Toyota Motor Manufacturing, Indiana. Equipment installation, modification, PLC programming and commissioningThe project is in starting phase.12 months contract with a possibility of extension.10% travel required.Strictly onsite job with little bit flexibility.Must be a local candidateWorking on holidays and weekends as per business needs. 20% overtime on weekdays.Requirements:Necessary manufacturing engineer skills include project management ability, commitment to quality, and familiarity with safety and environmental standards. Study production and machine requirementsDesign and install equipmentIntegrate disparate systems (e.g. PLC, Robot, Automation)Resolve issues and delays in project between commissioning and SOP. Find ways to reduce costs and maximize quality during project implementation. Ensure that equipment specifications follow safety and environmental regulationsInvestigate project feasibility, scope, schedule and budgetCreate scope of work, bid package and project specificationsProcure equipment, track budget and project milestonesPreparation of equipment modification and commissioning planCoordinate and lead project installation with skilled trades, affiliate companies, engineers and equipment manufacturersFacilitate drawing reviews with Toyota and contractorsRequirements:Must be a local candidate 3+ years of related project management experience in a similar manufacturing environment. Well-versed in relevant software such as 2D CAD, 3D CAD, MS Office, PLC programming.Ability to occasionally work late shifts, weekends, and holidaysDegree in Engineering or equivalent experience Bidding specification preparation experience is bonus.Equipment installation, modification and commissioning experienceBenefits package includes PTO, sick time, top notch health plans, and 401k match.Location: Princeton, IN"}