{"title":"Customer Technical Support Representative NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIzNbGd206bPDcFPOHA57igfQVM81xrDZsJppkoB5_8J-YhQrndztn_cOaHpFP1sfwDUOltCjs9kKYMyeqApVkV26i5MmwvPR7d7JZ0gC4MgdyH0PqXJyv7RGRZMZW5M3KHte_q1kbVPAQWEogyMfTK5hQ5mBar0Zykl1AaqUoKtwoSCFxQUcX1cKAyfwg","source":"ziprecruiter","full_description":"Private Equity backed company focused on growth in an evolving marketplace. We are committed to helping our customers and doing what it takes to help them successfully utilize our products and services.Are you ready to make an impact every day in your career?We are looking for a Customer Experience Team Member that is willing to learn our industry and grow professionally within our Company.*** Temporarily Remote - but will be working from our Office in Argyle, Tx when our offices open back up.*** Are you good at managing multiple tasks?Are you thorough and accurate?Do you excel at problem-solving? If so, we would like to talk with you about joining our team to provide application and technical support to our customers with accuracy and efficiency.This is an early career role, with some experience preferred.We are seeking individuals who can learn quickly, be supportive to our customers with excellence and integrity, and become an important team player fast.Key Responsibilities:Provide Customer Support via phone, email, and chat communication.This includes at times high volume customer traffic and interaction providing product information, application orientations, and answering account questions.Resolve customer issues through high-quality service to ensure customer satisfaction.Do you have what it takes?Ability to continuously close open tasks while starting new ones.Teachable and Confident.Ability to resolve customer concerns and satisfy customer requests.Team-minded attitude.Education and Experience:Previous Customer Support experience preferred.Associates Degree or higher preferred.Microsoft Office skills and CRM skills a plusBenefits: PTO and Company HolidaysMedical & Dental Coverage401kActive team and special eventsThe Company:Rhino Fleet Tracking, is a growing private equity backed company and has been helping small business owners be smarter business owners via fleet tracking since 2007. At our core, we support the growth of our customers’ businesses by helping to make their workforce more profitable while protecting their business equipment. Our team is on a mission to deliver best in industry customer experience, setting our solution apart from all others.Our office is in Argyle, Tx. We offer a fun and professional working environment that rewards hard work and promotes a team atmosphere."}