{"title":"Core ADAS Hardware Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIBPj98vdPtuBugaoFtMi1dL38FcXsbXXJWYKkVtiH_RkJL00cfdCyxUHRyDMcYfx12fGc-iZHZX9V8nBL7vM6rPqmgBVbK2OdcaXh7g45ANXLXLpVflKRZGJW19cOaUZvQnuVSlD2DwJlAsE-KQMVqJdYMWIIiIqkz8PaMWBWAIWT62nGTxkIJp_RV8e_0","source":"ziprecruiter","full_description":"Job Title: Core ADAS Hardware Engineer Job Description & Qualifications: At Ford Motor Company, we believe freedom of movement drives human progress. We also believe in providing you with the freedom to define and realize your dreams. With our incredible plans for the future of mobility, we have a wide variety of opportunities for you to accelerate your career potential as you help us define tomorrow's transportation.Do you have what it takes to make smart vehicles for a smart world? Join the Ford Product Development team. Utilizing Design Thinking and User Experience methods, you will work to deliver breakthrough products and services that delight our customers. We are seeking forward-thinking, laser-focused professionals with a passion for bringing innovative, exciting and sustainable ideas to life. We have opportunities around the world for you to contribute to such advancements as autonomy, electrification, smart mobility technologies and more!What you will be able to doJoin us and help bring advanced engineering concepts to life. You will be a key member of the team that is designing and developing hardware and functional models that deliver best-in-class behavior for features like adaptive cruise control, automatic emergency braking, cross traffic alert, active park assist, and 360 camera systems. You will be responsible for the creation of new sensor and ECU hardware, which may include LIDAR, a driver-monitoring camera, an infrared camera or a central active safety ECU. You will:Develop technologies and specifications for new Advanced Driver Assistance Systems (ADAS) hardwareDevelop and oversee test methods and plansComply with Robustness Engineering Disciplines (e.g. Functional Safety, Quality History, P - Diagram, FMEA, etc.)Apply six sigma and 8D issue resolution processesConduct validation testing on components and subsystems on bench and at the breadboard and vehicle levelSupport the Sourcing Process (e.g. investment, piece price, tooling cost reviews, etc.)Release parts through the product life cycleSupport Change Control meetingsIdentify validation, durability and functional testsDefine and verify engineering prototype requirements at part levelReview/manage program design change requestsSupport prototype and vehicle launchesProvide suppliers with technical assistanceThe minimum requirements we seekBachelor's Degree in Electrical Engineering, Mechanical Engineering, Aerospace Engineering or Control Systems Engineering3+ years of experience developing complex hardware for the automotive industry3+ years of combined experience with engineering specifications, design validation and problem solving (e.g. failure mode analysis, 8D and/or six sigma)Our preferred requirementsMaster's Degree or PhD in EngineeringExperience in safety systemsCAD packaging experience Experience in CATIA and Team CenterOperational knowledge of desktop productivity and CAD softwareUnderstanding of production processesExceptional communication ad interpersonal skillsAbility to champion issue resolutionKnowledgeable about ADAS functionalityUnderstanding/experience with the design and development of automotive electrical featuresKnowledgeable about signal transfer and mechanical-electrical interfacesUnderstanding of vehicle electrical systems and electrical design/development processUnderstanding of circuit design and worst case circuit analysisFamiliar with CAN networking tools, diagnostic protocols and trouble shootingWhat you will receive in returnAs part of the Ford family, you will enjoy excellent compensation and a comprehensive benefits package that includes generous PTO, retirement, savings and stock investment plans, incentive compensation and much more. You will also experience exciting opportunities for professional and personal growth and recognition.If you have what it takes to help us redefine the future of mobility, we would love to have you join us.Visa sponsorship may be available for this position.By choice, we are an Equal Opportunity Employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.For information on Ford's benefit"}