{"title":"FPGA Engineer (New York)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK8DPYx__kwzztHxBZnHfwkpTqV5BNTIu12mQVoUGKDaG4-tV8Pd1gvz0uh99gtjQad8sEsPEqG8QBIc6IduIOLD5Tz7YR7DxVPazaRjO3qqZd7OHzqCbb6CTvPLMAXQgWvHxktGnPKJ_rPXlikoI3kiL9zrr7Nw953Cv11Nc9opmn6DFsyFY7wljAh8251","source":"ziprecruiter","full_description":"Qrypt is looking for a Hardware Engineer with expertise in FPGA development. You will be playing a crucial role in the design, development, testing, deployment and maintenance of our end-to-end encryption systems.As a Qrypt Hardware Engineer, you will successfully design, simulate, verify, and deploy FPGA RTL, by documenting requirements and designs, simulating the design and achieving test coverage, delivering coded firmware onto the hardware baseline, testing and supporting testing of the FPGA in situ, aiding audits of products for the baseline, and meeting schedules you set with the team. You will use systems engineering processes in a test-driven environment to assure product quality.ResponsibilitiesWork as part of a larger team to bring hardware systems from concept to product.Design and implement logic for control and built-in testing of quantum random number generators, critical infrastructure components, and cryptographic engines.Simulate and verify (using UVM and coverage-driven verification) all designs prior to hardware deployment for integration.Demonstrate problem solving ability leading to successful deployment and operation of designs.Test and verify designs on hardware, in concert with software teams.Provide recommendations for continuous improvement and automation.Provide support to product delivery and operations.Required Qualifications4+ years of experience in FPGA design, verification, and deployment; 6+ years preferred, in an environment requiring systems engineering practices.Experience in designing, simulating, and synthesizing working RTL in VHDL, Verilog and/or SystemVerilog using industry standard EDA development tools and scripting languages such as Python, Bash, and TCL. Experience with Xilinx Vivado toolset and Mentor Questa/Modelsim.Experience interfacing with high-speed, mixed signal circuits in FPGAs.Experience deploying a live critical infrastructure/safety of life system.Bachelor's degree in a technical discipline (mathematics, physics, electrical engineering, aerospace engineering, computer engineering, preferred); six (6) years of suitable additional experience in lieu of a degree.Preferred QualificationsExperience with constraint driven random verification methodology(UVM, OVM).Experience with DSP algorithms.Prior military or intelligence service strongly preferred.Experience with US Government -- specifically NASA/DoD/IC.AttitudeYou are comfortable working in an environment built around security and privacy. You want to be part of a team creating products that impact the world for the better. You care about quality, and you value effective communication and collaboration as the way to make better products.You like being responsible for delivering smart, reliable, maintainable systems that secure our customers’ data and privacy.You're interested in working with leading technologies in the quantum information sciences: quantum random number generation, post-quantum cryptography, secure messaging, and privacy preservation techniques.Benefits & PerksCompetitive PayPaid Time OffMedical and dental plan participationStrong 401K matching programAbout QryptQrypt is an early stage technology startup building the next generation of cryptography to protect from the threat of quantum computers and those machines and mathematics yet to be invented. Our passion is to help organizations and people keep their data private – forever. We securely build, design, and deploy safe systems that provide Everlasting Security (TM) and defend our users’ privacy. Together, we will transform the way the world safeguards data and communications!Powered by JazzHR7l7K4hlOjG"}