{"title":"Network Engineer III (DCNE)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ9mvLjtv2h3DM-f4LMb-jE_f_xoCLe_UmOex_mbk0RK-tVaz6IZMAA1AUF8x5N-y5kNG1RsRcHwQWP0tbBkohoIVspYB_rIj2xA4TdXU0AlUjfZFeduMxceACMjuURxnDudfLZ-A3SN9jx7bfrhCCZcPdqjko8jsjytCRdGJ1K8ILkVEZHsBEwYCXYlgY","source":"ziprecruiter","full_description":"Network EngineerMSI is working with one of the world’s largest, fastest growing, best companies in the world to hire top tier individuals with a background in network engineering, design and deployment. The Network Engineer will be working as part of a dynamic team and will play a critical role in a best in class, Fortune Top 20 company.Overview Looking for best-in-class Network Engineers to help deploy, scale and automate one of the world’s largest and complex networks. We are expanding at a tremendous rate it is our responsibility to maintain quality and reliability while developing innovative ways to automate the scaling of our network. The ideal candidate is highly autonomous, possesses strong written and verbal communication skills, strong project management and time management skills and has a successful track record of designing simple, scalable solutions and troubleshooting complex network problems and delivering innovative solutions. The desire and ability to work in a fast paced, collaborative environment is essential.ResponsibilitiesBe responsible for deploying network infrastructure across all of our network fabrics that supports the retail, payments and other services.Deploy, scale and automate our network across multiple global datacenters. This includes existing footprints and greenfield locations.Drive scaling of current network designs to meet the demand of our customers.Create simple, repetitive deployment processes that increase both velocity and quality.Work closely with our internal customers on designs/solutions; bringing those designs/solutions from concept to production.Create and update our network standards and ensure that the network is deployed to these standards.Create and implement changes on the network.Work closely with our automation teams in defining the tools that allow us to scale at unprecedented volume.Required SkillsShould have a minimum of 7+ years industry experience. The ability to read and script in Python.Excellent IP networking fundamentals and extensive experience in the application of IP protocols.In-depth knowledge of and experience with major internet routing protocols; specifically, MPLS, BGP and OSPF.In-depth knowledge of and experience with major router platforms; specifically with Cisco 37xx, 49xx, 65xx, 73xx, 76xx, Nexus 7K and Juniper MX/EX/PTX platforms including all compatible supervisory and line cards for these platforms.Excellent network analysis fundamentals and robust troubleshooting skills.Candidates should also have had significant past experience with, and expertise in many of the following protocols & technologies: DWDM, T1/DS1, DS3, SONET (OC3, OC48), 802.2/3, 802.1d VLANs/STP, IPv4 & IPv6, TCP (internals & flow control), BGP, OSPF, HSRP/GLBP, PIMv2, IGMP, LDP, TACACS, IPSec & VPNs, NetFlow, DNS, HTTP.Experience with mission critical multicast systems is highly desired.Experience designing network and data center installations.Experience working with customers to diagnose a problem, and work toward resolution.Needs to be a highly motivated to learn.Needs to have strong written and verbal communication skills.Ability to multitask effectively.Strong logical thinking skills, with the ability to adapt as new information becomes available.Ability to operate efficiently under pressure.Preferred SkillsStrong UNIX skills and the ability to script in Perl, shell, C or C++ is desirable.Network automation."}