{"title":"Mechanical Engr #37705 1 yr contract NEW!","location":"","salary":"","description":"","term":"Temporary","detail":"https://www.ziprecruiter.com/k/l/AAJX1qaVU0oo4bHiWFWSjmMQ-K92ijzpp_YyDpwby3VnwrlSfEr2L8qAG9jwAORw2bd-B2zpc4cg4vMvF6ZDBlGp1XW1Ai7AMFHNEjmKZCJsbdpH1B7lFhRhmsrdUssfukgbanntNNRzJUnTodjDUIrOduZzrUEApGVBeM_Tyd5hySvep0N41SEg9BYWmVE","source":"ziprecruiter","full_description":"Mechanical Engr - San Diego, CA1yr contract40hrs week#37705Must haves; Plastic and Sheet Metal designCAD SolidWorks, New Product Development , Med DeviceLocal Candidate will need to go to the office occasionally7-10 years' experienceWork with Device Engineering Design and Manufacturing groups to develop robust, sustainablesystems and products that meet customer expectations that are cost effective to manufacture.Mechanical Engineer:• As an individual contributor, demonstrates advanced knowledge of Mechanical Engineering principles and their application in solving novel or complex assignments requiring the development of new or improved techniques and procedures.• Assesses the feasibility and soundness of proposed engineering tasks, creates a resource plan for completion of these tasks, and tracks progress as required.•Applies statistical techniques and utilizes design of experiments.• Performs CAD modeling of electromechanical assemblies to support the release of new designs and creates improvements to existing designs.• Manages the release of engineering documentation.• May be required to consult on a technical specialty, type of facility, equipment or program function.• Receives supervision and guidance related largely to overall objectives, critical issues, new concepts and policy matters.• Consults with supervisor concerning usual problems and development.• Performs other duties as assigned.Qualifications:• Bachelor's degree plus 10 years related experience, or the equivalent in appropriate education and experience. 10 years of experience using CAD systems, preferably SolidWorks. Ability to utilize analysis tools such as FEA, etc., are required. Experience in a highly-focused team environment on a large development project is preferred. Material selection and mechanical part fabrication processes. Experience with DFSS Six Sigma, sheet metal design and fabrication, plastic injection molded part design tooling and qualification; tolerance analysis, GD&T.• Ability to read, analyze, and interpret common scientific and technical journals, financial reports, and legal documents. Ability to write speeches and articles for limited publication and to present technical information and to effectively present proposals to all levels of management.• Mathematical Skills: Ability to apply mathematical concepts to such tasks as statics, kinetics, strength of materials reliability testing, and statistical analysis.• Reasoning Ability: Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagrammatic form and deal with several abstract and concrete variables, including nonverbal symbolism such as formulas, scientific equations and graphs."}