{"title":"Quality Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK27ERNlnT-A86O5d7i71TUetkRU6UW2zEJZv6iPXgUZrFBZH3mrRYlOr6_sLpydK1uhQVwB4NRjTbN0UDiwPJx6FJ9hqkyvcWPKCnfBcDnGFn2OA_g9JmuqZuZNW8KsR2X_mzOwuu9nVHpqE5JNSI0CCPreYYxisjAXHfRtxREttdWGvq_pa7CZU_DSuxR","source":"ziprecruiter","full_description":"Summary: Responsible for owning and executing quality system processes in support of quality objectives. The Quality Engineer will utilize a data driven approach to define or improve quality systems, quality processes or overall product quality.Duties/Responsibilities: Facilitate or perform documented customer complaint investigations and complete any required customer responses.Quality lead for customer-based planning of new product launches, legacy product maintenance and customer related change control. Typical responsibilities include but are not limited to revising existing or creating; Control Plans, pFMEA, Gage R/R, final product acceptance inspection plans, and performing process capability studies in addition to meeting customer specific deliverables.Primary quality representative for site supplier management and resolution of supplier nonconformances.Support internal and external audits to maintain regulatory, customer and company procedure compliance.Coordinate CAPA and SCAR investigations and closures in compliance with regulatory, customer and company requirements.Participate in Material Review Boards. Identify non-conformance trends and develop technical investigation plans.Investigate and analyze customer/internal complaints for trends and potential improvements.Responsible for the development and execution of qualification and validation protocols. Summarizes results in reports.Utilize standard statistical analysis and problem-solving techniques to determine product acceptance and evaluate process capabilities.Establish and support a work environment of continuous improvement that aligns with the Quality Policy, Quality System, and the appropriate regulations for the areas they support.Education and/or Experience: Bachelor’s Degree in engineeringThree (3) plus years of relevant quality experience Experience with Medical Device manufacturing preferred"}