{"title":"Staff Network Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJgF6vpXR-9Ri6fyOBqt1-ZcpveCj7mGidF7wzmkaL9uzZ2lkdLIPRjEDuuy2jgNRHzj69ZIh6KtJA3oJFnl04_bt_YgjLunnRbwl3X5arfK2KdGjUnSm28GoUgY0ng3G0yMWT9Zq2GI48aEJE-K9gwZKnApSHAlvWhdz_8lGus0--GpPRbSMB7W9ppr-2s","source":"ziprecruiter","full_description":"Position Summary:Illumina is looking for a Staff Network Engineer who can demonstrate skills and experience with complex global LAN/WAN network architectures, Enterprise Class Data Centers and Cloud Environments. The candidate must have a comprehensive understanding of network protocols and best practices with respect to highly available and customer-focused networked systems. Candidate must be able to support our 24X7 global network operations environment while assisting with geographically dispersed projects and initiatives. Candidate will join a global network team responsible for Cisco LAN/WAN/DC, Aruba wireless, F5 load balancing, Cisco & Palo Alto firewalls and SD-WAN.Responsibilities:Assist in the implementation of next generation enterprise LAN, WAN, SD-WAN, Cloud, wireless, load balancing, and security architecture and strategies to support business growthContribute in the design and architecture of Enterprise, Data Center and Cloud NetworksSupport the global network within the scope of a larger globally-dispersed team in a fast paced environmentAbility and desire to grow technical expertise in all areas of networking quickly and efficientlyPerform network maintenance and system upgrades including patches, hot fixes and security configurationsCreate and update network documentation; troubleshoot complex problems and develop innovative solutions to solve critical business challenges in a timely mannerAdhere to corporate change management policies and practicesPerform 24X7 on call responsibilities in a global follow the sun modelAbility to work effectively in a dynamic, fast-paced environment; potential for domestic and international travelMust be able to handle multiple projects simultaneously while dealing with frequent interruptions and working in a high-pressure environmentExperience:10+ years' experience with enterprise-level IT network engineering/operations and 5+ years' experience working with a global teamKnowledge of TCP/IP, ACLs, ZBFW, DMVPN, MPLS, VoIP, QoS, SNMP, VPC, and VSSHands on experience with Cloud Networking (AWS, Azure, GCP)In depth knowledge of Cisco IOS/NX-OS configuration and troubleshooting across multiple platforms including routers and switchesKnowledge of LAN Switching, including VLANs, VLAN trunking, port channels, port security, HSRP, and Spanning TreeExperience in administrating and supporting load balancing technologiesMust have good network routing protocol troubleshooting skills (EIGRP, BGP), switching technologies, firewall technologies (VPNs, Security Policies), WAN, LAN, and Wi-FiExperience with using scripting such as Python and/or Ansible for network automation a plusExcellent troubleshooting skillsResults oriented and self-motivated with the ability to take ownership of IT projects and deliver them on time and within budgetEducation:Bachelor's Degree in Computer Science or engineering preferredAdvanced network certification (or equivalent training) preferred, CCNA, CCNP, (CCIE a plus but not required)AWS Advanced Networking Certification a plusAt Illumina, we strive to foster a diverse and inclusive workplace by cultivating an environment in which everyone contributes to our mission. Built on a strong foundation, Illumina has always been rooted in openness, collaboration, and seeking alternative views and perspectives to propel innovation in genomics. We are proud to confirm a zero-net gap in pay, regardless of gender, ethnicity, or race. We also have several Employee Resource Groups (ERG) that deliver career development experiences, increase cultural awareness, and demonstrate our collective commitment to diversity and inclusion in the communities we live and work. We are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you require accommodation to complete the application or interview process, please contact accommodations@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}