{"title":"System Administrator NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALJ21xmZk8Gb7BO-dXYBVphr5_YLPDujFdyyg6gqnxkesc0MBMJr81kNwporR35vjI_9wdKtnWAAseH1Flh7Zf8ekoSBRUkP4YmdWbA6vJlR1BUBV3jMRPknzxaB_8y7lBH1KCFbWPSTeLqQZfRMGdR_Y4HUbtkdWO5WKDfnPKNvNR1li3wvOHpSzUj3bg","source":"ziprecruiter","full_description":"UniTek is a leading full-service provider of permanently outsourced infrastructure services, offering an end-to-end suite of options for the telecommunications field in the United States and Canada. We are a growing company moving operations to the Dallas Fort-Worth area, and need energetic, experienced IT staff to take us to the next level. This will be a highly visible role with significant interaction at all levels of the organization and offers the opportunity to improve performance across IT. If you are looking for a career and not just a job, this is the opportunity for you! The System Administrator takes care of the user accounts, permissions, access rights, and storage allocations. They offer technical support and troubleshoot any hardware and software problems related to server and storage devices. The professional will handle issues concerning application and database server operations. They do thorough research on upcoming products, service protocols, and standards in support of systems software procurement and development efforts. Additional IT system administrator requirements include the following:Installing, configuring and maintain servers and networks;Overseeing system performance and troubleshooting issues;Creating a backup and safeguarding the data if there are any hindrances;Performing system upgrades following new releases;Maintaining internal documentation;Performing account setup;Sustaining network integrity, server deployment, and security;Monitoring and maintaining network servers such as file servers, VPN gateways and intrusion detection systems; andEnsuring high-level security and efficiency resulting in 100% output.Educational QualificationsA bachelor’s degree in computer science, information system management, information technology or other related fields."}