{"title":"Analog Test Engineer Level 2","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL-ov37SsAeqyV0OEY8e-EtcniEyIlibYf1VIin79IEJNiqF_u081-uGzDx7BFMTxEHztn4XFJazdyBGUX6MjnUiJa-M3lyywcI1oKH2JsVhEAe3UrJk8nThxNsxgkoONxTUWS3dbcGr8JGFoileQUxeFCBsXgq5A6LTAvlrqc5zAHhQaxjMKdDszBtCV3X","source":"ziprecruiter","full_description":"POSITION DESCRIPTIONPosition Title: Test Engineer IILocation: Wichita                     FLSA Status: Exempt  POSITION SUMMARY Plan, design and evaluate test development projects in collaboration with internal and external customers to ensure that all specifications meet customer expectations and organizational requirements.   KEY RESPONSIBILITIES/ESSENTIAL FUNCTIONS INCLUDEDevelop semiconductor component-level test plans that determine methods, procedures, and conditions to ensure coverage of device specifications that meet customer application requirements. Develop Automated Test Equipment (ATE) test program hardware and software to test semiconductor devices per customer approved test plans.Configure and/or program bench level lab equipment as needed to meet test requirements.Work with the Sales Team to accurately cost quote device test development engineering hours, test platform hours, and the test hardware required to meet customer approved test plans. Work with the Operations Team to determine engineering feasibility and cost effectiveness for production-level test programs. Resolve technical problems using device/test debugging technics, and collection of test characterization data to reach engineering conclusions for driving corrective actions.  Flexibility to perform other duties as assigned. JOB REQUIREMENTS INCLUDE Education: Bachelor's degree in Electrical Engineering preferred; however, a combination of education and experience wherein the skills and abilities to perform the responsibilities and functions have been adequately demonstrated is acceptable.  Experience: 2-4 years of the following experience is required: Developing IC test solutions on automated test equipment such as Teradyne, Advantest, LTX-Credence, etc. platforms.Test program development of digital, analog or mixed signal integrated circuits.Utilize knowledge of programming techniques, electronic, test equipment, and test specifications to develop test programs to a set schedule.Read, analyze, and interpret semiconductor datasheets and test specifications to estimate test program development time and material costs.Program manage individual test developments from initial stage to completion while accurately reporting status to all stakeholders.Maintain a high level of attention to detail and accuracy to ensure data integrity. Utilize effective communication skills with internal and external customers to achieve required results.Effectively and efficiently utilize Microsoft Office and other computer products and programs. Knowledge/Skills/Overall Competences: Job Knowledge:  Developing professional engineering expertise, applies company policies and procedures to resolve a variety of issues.Possesses and applies knowledge of engineering products, product direction, principles, practices and procedures of a particular field of specialization to the completion of assignments.Technical Skill Has mastered engineering skills in his/her field and easily applies knowledge to determine and develop an approach to meet objectives.Competent at coding, testing, or integration tasks without error.Design/Planning: Task Definition, Design, Project Planning Understands company technical goals and direction and how it applies to individual work.Ability to define projects and tasks but may need help from more senior level staff to identify the scope and design approach.Work is organized and tasks completed in a systematic fashion for thoroughness and quality.Tasks are scheduled and completed to meet internal goals, schedules and meet customer demands.Ability to identify resources and create development schedules.Job Complexity Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors.Work assignments are moderately difficult and require evaluation of technical data in order to make non-routine decision and/or recommendations on procedures, processes on designs.Exercises judgment within defined procedures and practices to determine appropriate action.Builds productive working relationships internally and externally.Problem Resolution Identifies and resolves problems and issues within assigned area but may need to escalate.Provides practical solutions to a wide range of difficult problems.Knows the organization and how to get problems solved within the appropriate organization structure.Communication: Verbal/Written Ability to communicate effectively within the group and with customers.  Recommends solutions.Asks the right questions and listens actively in addressing and relating to immediate needs, interactions, and problems.Demonstrates ability to effectively present information pertaining to immediate area of job responsibility both in one on one or in a group situation.Assists with training of new employees in lower or equal level positions.Teamwork Consistent contributor in discussions to identify and share improvement ideas.Promotes positive teamwork by his/her own actions and encourages the actions of others.Suggests ideas or methods that add cohesiveness to the team.Supports decisions that have been made by the team regardless of his/her own personal opinionPersonal Leadership: Influencing, Impact, Affecting Change, Coaching Contributes ideas to product improvement in assigned area.Influences co-workers and manager on some issues.Sound decisions or recommendations result in successfully achieving program or department objectives.Begins to coach and/or develop others in areas of expertise.Supervision Required Normally receives little instruction on day-to-day work, general instructions on new assignments.Usually works with minimal supervision and conferring with leader on unusual matters.Ability to work independently and to complete most assigned tasks without assistance.Has latitude for decision making within the scope of his/her work project.  SUPERVISORY RESPONSIBILITIES Total Number of Employees Directly Supervising: _0__ Number of Subordinate Supervisors Reporting to Position: _0__ This job description is intended to describe the general nature and level of work being performed. This is not intended to be an all-inclusive list of responsibilities, duties, skills required of employees so classified.  In addition, this is not an employment contract and should not be construed or interpreted as creating an implied or expressed guarantee of continued employment.  The employment relationship at Integra Technologies LLC is by mutual consent (Employment at Will)."}