{"title":"Shop Diesel Technician / Mechanic NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALal8bCnYYMJ6wsEnIyJLM7DXEN2q_PHD_3s1Hopq9dgBlsh2JJQ3eGdP8gRQDWp51PQcVznj2dSCqn7c6jOlJMxtDek6kiwXfngQUZ1I9Dgmg6wDdpaHdyQWgaMm9HosL3TyOHkqpVWpjGxRHVwkOBcVGmiW3m4FbjoLeepVVVW4VVbnpgZRQS_Gui-enb","source":"ziprecruiter","full_description":"Rocky Mountain Truck Centers is seeking an Experienced Diesel Technician/Mechanic for our Brighton CO location. This is a dedicated Shop service and repair position. Monday - Friday, 7am - 5pm.Under general supervision, a technician will perform preventive maintenance services and inspect, diagnose and repair vehicles and equipment.Duties and Responsibilities:To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Other minor duties may be assigned. Works under limited supervision and selects from written instructions and established procedures to accomplish assigned tasks.Performs repairs and assigned preventive maintenance services.Performs inspection, diagnosis and repair of electrical, hydraulic, suspension, brake and air systems on vehicles and equipment.Utilizes vehicle computer electronics systems to diagnose issuesConducts safety checks on vehiclesBenefits:Insurance- Health, Dental, Vision and LifePaid Holidays and PTOTechnical Career Path TrainingEducation and Experience:Education: Not required.Experience: 5+ years of Diesel Technician/Mechanic work experience.Certificates, Licenses, Registrations or Other Requirements:Must have Valid driver's license and clean driving record.Legally eligible to work in the United States.Ability to perform physical requirements of the positionSuccessfully complete pre-employment drug screen, physical, and background check, which will include previous employment check, criminal history and motor vehicle record review.ROCKY MOUNTAIN TRUCK CENTERS OFFERS:Competitive benefits: Various medical, dental and vision plans, short- and long-term disability, life insurance and more.Strong values: In business for over 20 years and with continued growth, we value our employees and maintain a culture based strong values.Top Technology: State-of-the-art service trucks, the latest technology, state of the art repair information, dealership grade technology for all makes & models, paperless workflows, and much more.SupporTech: Technical Support via Augmented Reality for our technicians, Roadside and Shop by our own Technical Advisor.Accelerate your career: History shows that strong performers can advance to a Lead or Manager roles, as well as the option to follow other paths within our company.The stability of an industry leader: Our passion for quality work and excellent customer service have helped us to lead our market. Our customers include some of the nation's largest trucking companies.·"}