{"title":"Sr. iOS Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIYnpQe5vnFvOZbTk78pzZGOkvYDV9ZjoMn3tv_3BLktDSxHplvMiPegYgm_za-lZJhXSUsAlMnS1BCRmVmcox8EZTOYd-EkQw_eYIg22zQ9B4dwfw-3A-pUY4qujr33cSnYcwegVy8Z3q1uVKMSp-_b50I79QdC5KEs4FW3_TM5xfz26riR1DOK8uh9JvM","source":"ziprecruiter","full_description":"Company Description:Traeger Grills, headquartered in Salt Lake City, has been revolutionizing BBQ grilling and outdoor cooking for 30 years. We obsess over providing world-class experiences to not only our customers, but also to our retail partners and vendors. Recently voted as a 2016,2017, & 2018 Best Company to Work For, and a Top 25 Fastest Growing Company by Utah Business Magazine, we're looking for individuals who are committed to winning. We pride ourselves on maintaining a culture based around teamwork, quality, innovation and constant growth and development. We cook together and we win together!This role will be based out of our SLC, UT officeJob Description:Our team builds and maintains the Mobile Apps and Web Services that power all of the digital experience platforms for Traeger customers internal and external. We are looking for an experienced mobile developer who can design, build-out, and maintain our iOS App, to support marketing, and its interface to all other departments.This position is a critical role on our team and requires a combination of strategic architectural design, along with technical skills to implement our iOS app, integrated with back-end services. Strong interpersonal skills to work with the business groups to understand and troubleshoot issues that arise.Sr. iOS Developer Responsibilities:Design and build applications for the iOS platform for each of the common form factorsEnsure the performance, quality, and responsiveness of applicationsCollaborate with a team to define, design, and ship new featuresIntegrate with backend services, authenticated and openIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatizationManage code for backwards compatible device typesIntegrate deployment into the application's CI/CD pipeline.Qualifications:5 years of experience iOS mobile appsStrong experience with integrations, REST & GraphQLStrong understanding/working knowledge of the public cloud infrastructure and services in AWS (IAM, VPC, KMS, CloudWatch, Systems Manager, S3, RDS, Route53, Lambda, AWS Config, etc.)Ability to troubleshoot distributed systemsExperience leveraging the logging and monitoring solutionsPast experience with the serverless approaches is a plusRelevant security and AWS certifications are a plus What We Offer:Generous 401(k) planFull medical/dental/vision package to fit your needsOpen-PTO PolicyTuition ReimbursementCell Phone ReimbursementIndividual professional development programs and initiatives that help you grow and develop professionallyA positive and supportive team to work withCompany provided meals throughout the week, Utah Gold Ski and SLC City Golf passes, Discounted Gym Memberships, generous Employee Discount Program, company sponsored Community Service opportunities, and much more!"}