{"title":"State Affairs Manager","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL7bGMrdTBwaaLKD_NtRf4g9ONcH8kC7Asob-_geptlQm3uk16xyqwKRIoBSuXw32c8UVEHcOKiafpof7zh8ObHTI_lvPoJoAGzYOfauA74lMk9WJO5m51M8cY0NaaE4UisIrzJn-wPHwzQTKoSBDUz_-BoqSVEHFJ4G2PVl9_mNyAkRgl7O6AozO_mwMc","source":"ziprecruiter","full_description":"Position SummaryThe position is responsible implementing the day-to-day activities of the American Chemistry Council’s (ACC) State Affairs and Political Mobilization, including state legislative and regulatory tracking of various issues impacting member companies. The position is also responsible for monitoring state legislative and regulatory agency activities, developing advocacy materials for grassroots and lobbying efforts, interacting with contract lobbyists and consultants as well as representing the ACC before legislative and regulatory negotiations. The position reports directly to the Director, State Affairs.Major Duties and ResponsibilitiesMaintains and improves the current advocacy tracking website as well as identifies potential tools to enhance overall online state advocacy efforts. Manages the day-to-day operations of the grassroots program, including websites, in coordination with State and Federal Affairs staff.Coordinates and works with ACC’s communications staff to develop and prepare various materials for members and external audiences.Communicates frequently with the State Affairs staff, ACC issue managers and teams to ensure the accuracy of information on StateTrak.com. Identifies and writes articles/stories on state legislative, regulatory and/or political news as well as copy writes and edits newsletter content, as necessary. Monitors the activities of public policy groups, industry trade associations and other advocacy groups for purposes of ensuring ACC’s ability to defend issues/positions or participation in meetings.Develops and maintains strong working relationships with ACC staff, member company representatives, and various consultants/vendors.Engages in direct advocacy activities, including lobbying legislators and regulators.Works with allied trade groups and other relevant stakeholders in developing coalitions to support advocacy efforts. Ensures all lobbying and campaign filings, registrations and related expenses are in full compliance with state and/or local laws.Performs other related duties as assigned. Qualifications/RequirementsRequiredBachelor’s degree political science, public relations, communications, marketing or related field.Four years’ relevant experience.Familiarity with legislative and regulatory processes on a state level.Experience in campaign and grassroots organizing. Ability to prioritize and manage multiple issues, projects, tasks, and information/requests.Strong written and verbal communication skills.Experience working with internet applications, including website management.Working knowledge of Microsoft Office including Outlook, Word, Excel, PowerPoint and Access.Ability to travel, as needed, within the United States.PreferredState government relations, legislative, communications and/or monitoring experience.Corporate or trade association experience and/or legislative staff experience. Experience working with databases."}