{"title":"Senior Android Software Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIwpB32VlTMxIhyvSzSQa83KI0pwr-9IPlGnapMFEUjvdxSaE0ao9nFB90VvmLDExn12l8VgjyClQgWtgd8E01jyI2HslfwzB2WJd53BBfkOpPUTaL6BRRxxPGXPwlz_EJSNw_p2g2tEhBAdwqerCQkumXKdtzQmOh1yAgUZEJPHN-hu0-t02xFKkbFgPQy","source":"ziprecruiter","full_description":"Insulet started in 2000 with an idea and a mission to enable our customers to enjoy simplicity, freedom and healthier lives through the use of our Omnipod product platform. In the last two decades we have improved the lives of hundreds of thousands of patients by using innovative technology that is wearable, waterproof, and lifestyle accommodating.We are looking for highly motivated, performance driven individuals to be a part of our expanding team. We do this by hiring amazing people guided by shared values who exceed customer expectations. Our continued success depends on it!Position Overview:The Sr Android Engineer is responsible for developing software applications and assisting others in development. These roles are responsible for building secure smart phone SDKs and cloud-based platform based solutions for a variety of healthcare and Internet of Things (IoT) problems.Responsibilities: Develop Android software applications using Java. Collaborate closely with the multiple technology and cross-functional groups within and outside the organization. Able to translate customer and market needs to efficient and secure mobile solutions. Design and build out the next generation smart-phone cloud-based platform that can support future patient/device centric products and applications. Scope work, break down into modules, and estimate efforts working closely with Program management. Effectively present and demonstrate various concepts and solutions to customers, partners, and leadership. Perform other duties as required.Education and Experience:Minimum Requirements: Bachelor's degree in Computer Science, Computer Engineering or equivalent education plus experience. 4+ yrs Native Android development Java SW development on Android platform Demonstrated proficiency in developing solutions and platforms that leverage wireless communications and Smart phone technologies. Demonstrated work experience with Web services, Cloud and API technologies. Ability to quickly grasp & learn new technologies and develop POC/prototypes. Drive and own technical design and development of cross-functional, multi-platform applications.Preferred Skills and Competencies: Excellent communications skills and extensive experience working with technical teams and management. Experience with Agile software development preferred. Demonstrated experience in successfully launching products in FCC & FDA regulated industries preferred Mobile apps or Cloud apps software development toolsPhysical Requirements (if applicable): None"}