{"title":"Automotive Mechanics, Technicians","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIsL67qp5szP8YzzFDRJ8eq5a39dowW8I4uw1haSfp3-NIqqLd7Dta5WBdPAi8zXZVxyxEboazjdh0ueAgaW7F2_s-4aKDkwnKrjy8xt5fV33oTzQlzYlxQ4EMjZETFxQOrkXKB4t9nPbDcyI8OKMx6xhd84neFp-wSYYBJrLFdCtiH41t8Q3WnME6DSpn5","source":"ziprecruiter","full_description":"15235 Statesville Road, Huntersville, NC 28078AUTOMOTIVE SERVICE TECHNICIANS/ MECHANICSFlat Rate of Pay Start in February and get 2.5 weeks of PTO for 2021 Air-conditioned shop with updated lifts and equipment Tool-Relocation AssistanceWalk-in Applicants are Welcome!Parks Chevrolet in Huntersville has a substantial presence in the North Carolina market and is proud to be to be part of Parks Automotive Group. When you join Parks Automotive, you are joining a dealership that is currently in high growth and expansion mode.We believe culture makes a difference and we strive to build lasting relationships with our employees, customers, and the community. We value our employees and invest in their success and are hiring now for Service Technicians/Mechanics, who can come in and start work immediately. OUR SERVICE BUSINESS IS BOOMING!!We offer:Flat rate of pay2.5 weeks of PTO after 1/1/2021 if you start before MarchTool relocation assistanceMedical, Dental, Health and Wellness401(k) retirement planPaid time off and VacationEmployee vehicle purchase plansDiscounts on products and servicesGreat family atmosphere!Air-conditioned facilityOpportunities for career advancementResponsibilities - Service Technician:Inspect vehicle and diagnose problemsPerform quality repair and maintenance work on recalls, general maintenance, and diagnostics within book time rates and meeting dealership and manufacturer standardsProvide estimate of time and parts needed for repair/maintenanceLearn new technical information and techniques in training sessionsRepair broken or worn mechanical and technology componentsInstall equipment, components, and systemsRepair electrical wiring, circuits and fixturesKeep shop neat and account for dealership owned toolsOther duties may be assigned according to skill level and certificationQualifications/Requirements - Service Technician:Automotive repair experience for a minimum of 2-3 yearsGM experience is a PLUS!Must be versatile in skills and tasks performedWorking knowledge of shop equipment such as wheel and tire equipment, alignment system, diagnostic equipment, A/C equipment, etc.Must provide own toolsMust be analytical with good problem-solving skillsValid driver's license and clean driving recordHigh school diploma or GEDUpload resume and complete online assessment for immediate considerationMust pass pre-employment testing to include background checks, MVR, and drug screen.We are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."}