{"title":"Wireless Technical Support Engineer NEW!","location":"","salary":"","description":"","term":"$80,000 to $120,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJthcIox1uKZ6az5ju_QtO1Se0464JWBvljFl6_NWYCV4kgY-SAdGOd9_aAyHEGULueILEkdVb28RPt-15SvPi-hPdvMmpdZsE3bwX31og8qnUBmCNHLADq4NJFHIDk4nsX2rHIkQts-jb8GvbjnTfbQodoNA5oQTUvyD3k-GCVPM-Y2ZfsmS8I5H4SWzI","source":"ziprecruiter","full_description":"Location: Remote, US As a key member of the BLiNQ Design Team, you will work closely with Digital, RF and antenna design engineers towards delivering cost-effective and leading-edge wireless product solutions. You will be part of the Radio System Integration team responsible for the optimization and verification of the radio platform. You will interface with hardware and software engineers as well as integration engineers and other product verification engineers, in order to produce cost effective and highly functional products.This position requires strong problem solving skills, self-motivation and strong inter-disciplinaryteamwork skills. You must demonstrate the ability to work efficiently on multiple product development platforms and with tight project schedules. If you like to work in a fast paced environment with opportunities to learn and develop new skills which you won’t find anywhere else, please apply.Primary Responsibilities:• Serve as technical support engineer for customers including trial support both in a lab environment and outside in a field deployment• Plan customer trials and prepare necessary documentation• Develop verification tests for wireless systems covering LTE standards, RF, L2 Ethernet, higher level protocol transport over Ethernet, traffic scheduling, user interfaces (SNMP, CLI, WebUI)• Automation test plan definition and execution• Understand, recreate and debug issues related to the above.• Triage above issues for test and support team members and provide direct guidance on all of above• Test BLiNQ products in outdoor real world application tests• Communicate fluently with development engineers and customers on all aspects of BLiNQ’s wireless productsRequirements:• Master of Science degree• 5+ years wireless product technical support experience (with 3 years’ experience with LTE)• Expert knowledge of wireless systems operation• Experience with EPC/SON/EMS• Fluent in L2 and L3 networking technologies including Switching, VLANs, Q-in-Q, 802.1p, Routing• Experience with test tools such as Spirent and Ixia• Experience with Python• Proven understanding of the service model and service role• Excellent communication skills, both written and verbal• Strong organization skills, ability to multi-task while maintaining attention to detail• Passion for Quality Assurance with a solid work ethic and team player attitude• Ability to work creatively and analytically in a problem-solving environment• Willingness to travel up to 25% of the time"}