{"title":"EU MDR Development Engineer (Medical Device Engineer) NEW!","location":"","salary":"","description":"","term":"$45 to $60 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAI5E-zFhG24UYd_4ptkp3Obsa9U9PmcEnDOdFrjK1_UlhUDX3el3Xo66XUF0hIAwLWOJhvWYaoxrNq_NjE1JPa86xhsF9qTNIadmWOhq1CjRmsrQBv7BDrQ7gSKDuM4z9ESn_LvCmwZA4ihYH8oPWqlgC1gGPDPWA0w_gqLLfpV9xnCYCH3HYwW7PwQ5qk","source":"ziprecruiter","full_description":"My name is Josh Stock and I represent The Fountain Group. We are a national staffing firm and are currently seeking an EU MDR Development Engineer for a prominent fortune 500 client of ours. This position is located 100%/ Austin, TX. Details for the positions are as follows:Job Description Manager updates:· Can be fully remote and sit anywhere· Can evaluate and review Design History Files to determine if they are meeting current standards· Needs to evaluate designs from an Engineering standpoint – needs to critique worst case scenarios.· Most of the requirements are Mechanical devices· Needs and Engineering background – preference to Mechanical Engineering Degree· Experience working with orthopedic medical devices would be ideal. If they don’t have the Mechanical background, this would be great· Needs Product development background for developing devices.Required 4+ years serving as a Product Development Engineer / R&D Engineer supporting design control teams with a BS degree.2+ years experience creating product design specifications (i.e. drawings using Creo/Pro Engineer or Solidworks).2+ years experience with a Master’s degree.Preferred Six-Sigma or equivalent green/blackbelt certificationPower-BI-Data VisualizationThe perfect candidate-Product DevelopmentExperience with MDR remediationExperience in orthopedic medical device product developmentRemoted working environment experienceExperience with Agile PLM systemSix-Sigma or equivalent green/blackbelt certificationPower-BI-Data VisualizationDescription:EU MDR – Development EngineerRESPONSIBILITIES INCLUDE:Assure product design history files meet the regulatory requirements of Medical Device Regulations (MDR 2017/745, internal quality system and other applicable regulations).Work to update legacy product design history file to comply with EU MDR 2017/745 focusing on product design documents. This includes but is not limited to Product lists and product specifications.Ability to analyze post market data and update design inputs as required based on current design and data.Assess or perform, where necessary, design verification and validation to support acceptable design risk mitigation, which may include hazardous materials assessment, human factors analysis, and lifetime evaluations.Work with Research and Development to produce evidence that products meet the requirements of applicable ISO, ASTM, IEC specifications.Aid other groups to ensure that literature and labels reflect requirement of EU MDRWork with packaging team to ensure packaging material risk is mitigated and captured with Product specifications as required by internal procedures and regulations.Actively participate with cross functional teams to mitigate risk to acceptable level with adequate documentation. This includes but is not limited to Microbiology, Biocompatibility and Clinical.Ability to identify products included in project based on planning an project charters/product families.Apply knowledge of FDA’s Guidance document for Design Control, ISO 14971 Risk Management; IEC 60601-1 Medical Electrical Equipment and collateral standards, IEC 62366 Usability, and IEC 62304 Software Lifecycle; and other applicable standards to sustaining engineering projects.Serve as primary development engineer on one or more EU MDR project teams. Ensure that required documentation/evidence is available in coordination with activities, and interfacing with project team members including engineering, regulatory, marketing, change management, post market surveillance, microbiology, biocompatibility, Clinical Affairs and production.Prepare, evaluate and critique technical documentation including design justifications and rationales based on sound scientific or engineering principles.Makes decisions and proposes solutions based on calculated risks identified through data analysis.Evaluate procedures and processes within the quality system to identify areas for improvement. Recommend solutions to identified problems.Coordinate activities with Management and Project Management Office (PMO) and report regularly on the progress of activities.Participate in meeting departmental goals and objectives; on time project delivery per release project scheduleWork with counterparts in other divisions and countries.Work to respond to questions posted by the Regulatory Affairs group and agencies with specified time.Travel requirement: Occasional domestic travel may be required less than 10%EDUCATION REQUIREDBachelor’s degree in engineering or equivalent scientific disciplineQUALIFICATIONSRequired QualificationsClear and concise written and verbal communication Ability to multi-tasks, prioritize, meets/exceed deadlines and hold themselves accountableSelf- starter, with the ability to work independentlySoftware programs - Microsoft Word, PowerPoint, Excel, Project.Experience with managing documents within electronic PLM systemCorrective and Preventative action experience including root cause analysisExperience with working with cross functional teams.Standards and RegulationsEU MDR 2017/745EU MDD 93/42/EECISO 1348521 CFR Part 820ISO 1497121 CFR Part 820FDA’s guidance document on Design ControlsIf you are interested in hearing more about the position, please respond to the email address with your resume attached Please forward this email to any friends or colleagues as we do offer a Referral Bonus for any candidate hired."}