{"title":"Outside Sales Representative","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKU0jI0uNxpKXzHM4A1Ah5JhhGLMa0xC8wZtJTwXpq1WPShAOjeBk6fgz_7LwADkRTaBv3SlYhyC_abF6U_3HcslbLp3XYCd7U0AAnYizwO7ZQHOueO2WsDbOU3Fprx1P8d9piBdSqpTBwoeD2VXUx3Lu7xK-NRieXpveU-C722MCQTRb5C5NkIiXqWZ53M","source":"ziprecruiter","full_description":"LeafFilter, the largest gutter protection company in the United States, is looking for Sales Representatives in San Diego, CA to meet with prequalified and quality customer sales leads. This is a prime market for our product, and the office is up 110% in 2019. Come interview and join the immense growth! Reply ASAP with your resume.Why Work with LeafFilter?Working with LeafFilter is more than just another job - it’s an opportunity to earn a sizable and consistent income, freedom to grow your career on your terms, and a chance to put down roots in your community. We’ll supply you with pre-qualified leads and the necessary tools for success so you can set out and start earning!! While you’re helping homeowners by introducing them to the best gutter guard on the market, you’ll be backed by the support of the largest gutter protection company in North America. Are you looking for a company with unlimited compensation opportunity, weekly pay, and advancement to management roles? Because we’re looking to grow our team of Sales Representatives TODAY! Sell a product that sells itself with preset appointments that are provided to you! Our highly successful, multi-channel lead generation platform provides you with high converting, and quality present sales appointments. We provide you with a proven 10 step sales system with an average close rate above 50%. Our best Sales Reps have lifetime average close rates over 60%. Best of all most sales close in an hour or less.What’s in it for me?Prequalified scheduled leads – we provide all the leads, you just close the saleShort sales cycle – appointments take one hour including paperwork with install as soon as same daySuperior product – LeafFilter is patented and factory direct…there is no comparison!Financial Freedom – earn an average of $75-100k in first year…our top rep earned $198k in 2018Weekly Pay – we pay weekly through direct deposit, no more waiting weeks or months to be paidRecognition – performance based yearly trips to recognize top performers (Orlando, Washington DC, etc.)Advancement – 95% of our Sales Operations Managers started out as a Sales RepEssential Duties and Responsibilities:Meet with prospective customers using established sales methodology to educate, consult, inform, and sell the gutter protection system that will fit their needs within the initial sales consultationResponsible for using established sales methodology to sell customer the proper gutter protection system that fits their needsDevelop a rapport and conversation with the customer to facilitate one visit closeLeverage industry leading product samples, support and technology to assist you in closing the saleCommitment to an outstanding customer service experience from beginning to endEffectively self-manage sales calendar for prompt arrival at all scheduled appointments Minimum Skills and Competencies:2+ years of experience in outside sales, commissioned sales, in-home sales, or a related fieldExcellent communication and organizational skillsEnergetic and engaging interpersonal skills with the drive to succeedAbility to overcome objections in the sales processTravel within the assigned territory Are we your company?LeafFilter is dominating the gutter protection industry and we continue to grow. We work hard and play harder. We’re a big company with a small company feel. We have ambition and drive and we’re in constant development. For us, we strive to be better than the best and we want you to join in our success! LeafFilter is the #1 rated gutter guard system in the nation as evaluated by the leading consumer publication. Since 2005, LeafFilter has grown from one small office in Hudson, OH to North America’s largest gutter protection company and a leader in the home improvement industry. From marketing to sales, installation, and service, we have the best team, right along with the best gutter protection solution.LeafFilter Awards and Accolades: (2019)Inc. 5000’s fastest growing companies in America for eight straight yearsQualified Remodeler Magazine’s Top 500 List: 4th Largest RemodelerRemodeling Magazine’s Top 550 List: 3rd Largest RemodelerTop Workplace by Cleveland Plain DealerPlease send resumes to rkohl@leaffilter.com for immediate consideration. #IND123"}