{"title":"Lead Android Engineer - Equinox Plus","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJOGmDWGQC5RFFQfKyu4474MKB77rz-4nuWycFlNo9KXGecwpbYTqmSu5nU7YoHzWNUsWJcK1sKqgR-TcSAJgsluD4iTNXmpqnG-ik1Tp7VjWV2YKNa4WzUc9bDx2nULznnrLHWnIFgXgN3Sqfr4gE-yYARc-jCin1WzrJyR0634psydpdCb75zzdlNEXDq","source":"ziprecruiter","full_description":"Company Description It is an exciting yet critical time for our teams at Equinox Plus and we're looking for a Lead Android Engineer who will lead the team responsible for the development and evolution of the SoulCycle at-home bike application. This is a unique role that will help our teams invent new ways of connecting people to the communities and fitness that they love through the intersection where mobile development, content, and hardware meet. Our team embraces a true entrepreneurial spirit; operating with humility, perseverance and care for one another. We strive to continuously deliver the best results and focus on how every action taken helps push our mission forward of helping our members pursue Fitness everyday. If you're the type of leader who likes to be hands-on, wants to own the development of the software application and play a significant role in evolving the hardware along with other partners, then this is the right role for you. Job Description Our app is a native Android application written in Kotlin that utilizes MVVM with Clean Architecture. We are looking for an Engineering Team Lead who has a strong technical background, the ability to lead a team of engineers, has experience building native Android applications that integrate with many other systems, and a track record of delivering high-quality software.As Lead Android Engineer, you will split your time between leading a team of engineers and contributing code to deliver new features and functionality. This is a hands-on role that over time can evolve into an Engineering Management role as our team grows. Day-to-day you will collaborate with engineers, product managers, designers, marketing, operations, member experience, and outside partners. You will play a big role in hiring and growing the team to support the growth of the business.What You Will Do:Lead Android engineering for the SoulCycle at-home bike for EquinoxPlusManage a team of mobile engineersWrite clean, well-architected, self-documenting codeSupport team members and mentor other Android Engineers through code review, knowledge sharing, and leading by exampleCommunicate clearly and effectively with all members of the teamActively participate in all major technical discussions related to the platformCreate a culture of observability within the team, constantly keeping an eye on the performance and stability of the platform Qualifications More About You (if you don't meet 100% of these qualifications but have the relevant experience, that's OK -- we still encourage you to apply):8 or more years of software development experience2 to 4 years of experience leading a remote team You have deep knowledge of Android design and development patternsYou have experience with the Android SDK and KotlinYou have experience with MVVM Clean Architecture or equivalentYou have experience with Kotlin CoroutinesYou have experience working with RESTful APIs in an agile environmentYou have a strong understanding of git and its popular branching modelsYou have a strong understanding of testing and CI/CD practicesYou have experience working in an agile environmentYou have a strong sense of ownership and take pride in knowing all applications inside and outYou are passionate about technology, learning, and finding the best solution in a collaborative environmentBonus Points!Curious about integrating software and hardwareExperimented with Bluetooth and Ant+Knowledge of OTA software updatesInvolved in the open source community and familiar with custom Android forksExcited by GraphQL! Additional Information At Equinox Plus, we believe that a diverse, equitable, and inclusive workplace makes us a more resilient company. We celebrate unique points of view and experiences across age, gender identity, race, sexual orientation, physical or mental ability, and ethnicity in building the future of our digital business. We aren't just a company; we're a community vested in each other's successes. We value humility and a team approach at every level of the company. We want to inspire a workplace where individuals embrace their differences and similarities, where we are building products and experiences that inspire and improve people's lives.Check out more about what we're building on Instagram and EquinoxPlus.comQualifications: More About You (if you don't meet 100% of these qualifications but have the relevant experience, that's OK -- we still encourage you to apply): 8 or more years of software development experience 2 to 4 years of experience leading a remote team You have deep knowledge of Android design and development patterns You have experience with the Android SDK and Kotlin You have experience with MVVM Clean Architecture or equivalent You have experience with Kotlin Coroutines You have experience working with RESTful APIs in an agile environment You have a strong understanding of git and its popular branching models You have a strong understanding of testing and CI/CD practices You have experience working in an agile environment You have a strong sense of ownership and take pride in knowing all applications inside and out You are passionate about technology, learning, and finding the best solution in a collaborative environment Bonus Points! Curious about integrating software and hardware Experimented with Bluetooth and Ant+ Knowledge of OTA software updates Involved in the open source community and familiar with custom Android forks Excited by GraphQL!Responsibilities: Our app is a native Android application written in Kotlin that utilizes MVVM with Clean Architecture. We are looking for an Engineering Team Lead who has a strong technical background, the ability to lead a team of engineers, has experience building native Android applications that integrate with many other systems, and a track record of delivering high-quality software. As Lead Android Engineer, you will split your time between leading a team of engineers and contributing code to deliver new features and functionality. This is a hands-on role that over time can evolve into an Engineering Management role as our team grows. Day-to-day you will collaborate with engineers, product managers, designers, marketing, operations, member experience, and outside partners. You will play a big role in hiring and growing the team to support the growth of the business. What You Will Do: Lead Android engineering for the SoulCycle at-home bike for EquinoxPlus Manage a team of mobile engineers Write clean, well-architected, self-documenting code Support team members and mentor other Android Engineers through code review, knowledge sharing, and leading by example Communicate clearly and effectively with all members of the team Actively participate in all major technical discussions related to the platform Create a culture of observability within the team, constantly keeping an eye on the performance and stability of the platform"}