{"title":"Battery Engineer - System and Hardware","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALR7_b7r3m2tGnJsgPjF1Hn7UVk67ZWHkEvxOImp9OHGpoV_A71dQC_x_pcXxye-JTONt6H-IY8vchLu2I3WugbomQZcT4xouA5Zs2hu8NLbjMX4dHB3usbBMb9K-ydb4P7AXSO8uw-cRGnf2_kaEwqs6yPD7rfkBWcvJM6obGZRtqe_kJgr1W5ipAitMPm","source":"ziprecruiter","full_description":"Position Summary: Toyota Material Handling is looking for a motivated person to design and implement both system and hardware design for existing and new energy systems for material handling equipment. The position requires a strong technically-oriented individual with good communication and a strong ability to work on a team. The engineer that would fit best in this position is hard working, detailed orientated, humble, honest, open-minded to opinions, and driven to succeed. A successful engineer in this role would always put the customer's needs first, and would be engaged in the work she or he completes. This engineer takes responsibility for mistakes and shares successes with the team, and strives endlessly for improvement. Lastly, the ideal candidate is dynamic and adaptable and is open to taking on new challenges every day.Essential Position Duties:Study system design of current products and create requirements for alternative energy systems.Investigate battery systems and work with experts in the related fields of study to generate requirements for implementation.Specify and review Hardware requirements needed to meet system level requirementsSpecify and review battery management system and performance needs to integrate forklift, battery and charger.Coordinate suppliers, reviewing regulation compliance, hardware component designs, R&D efforts, and system design.Work with firmware, mechanical teams and testing teams to guide design.Create software for proper reporting of energy system conditions.Conduct feasibility studies for requested features before confirming functional requirements.Maintain detailed schedules that support overall product schedules and properly communicate status to management.Create and update technical documentation, test plans, and test results.Diagnose and troubleshoot hardware and software components of controllers and other electronic devices related to OEM forklifts.Analyze test results and provide conclusive reports.Develop test fixtures and test software for data acquisition as needed.Manage and contribute in the review of technical documentation, test plans, and test results.Work on a team to complete projects with high quality while maintaining schedules.Education & Experience:Requires BS Degree or higher in Electrical Engineering, Computer Science, or related field of study.5 years of system or hardware design experience required.Knowledge of battery system design and key metrics including thermal management, power management, charging profiles, and others.Experience with Lithium Ion Batteries, DC power electronics, and charging systems, and UL Regulations for Lithium Batteries.Development experience with C/C++/C# required.Experience with CANBus, including J1939 and others is preferred.About Toyota Material HandlingLet Toyota take your career to new heights. Toyota Material Handling provides employees with the opportunity to make a meaningful impact through innovation and creativity in an unmatched culture.Based in Columbus, Indiana, Toyota offers a full line of high-quality material handling equipment sold under the Toyota brand for over 50 years. We are proud of our large and diverse workforce. We seek individuals committed to excellence with talent, skill and innovation. We offer a competitive salary and benefits package with a pleasant and challenging work environment. Life is better at Toyota. Benefits that set Toyota apart:Competitive Salary + bonus programLow cost Medical with Free Dental and Free Vision InsuranceFree On-Site Medical CenterOn-Site PharmacyFree On-Site Recreational ComplexAffirmative Action Responsibility:It is the Company's policy to afford equal employment and advancement opportunity for all qualified individuals without distinction or discrimination because of race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, protected veteran status, or any other characteristic protected by local, state, or federal laws, rules, or regulations."}