{"title":"Data Network Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI7lkL9oO9TppWZb9R9WdbaTVvdMXytCZzi50Qpz5j1GW3FQU93ZkB3COl17iZgMPHB6vw056aHC-zFQPyzivoQQ7VtANDGPrvlut-jyKg0gcl6vle7j-iqeSIb-qoyYVBawiyur2pTNoZw1b9ob26KyqHIstNmyNkG3pQOwyVg7nrhxILb9f905fRsKozz","source":"ziprecruiter","full_description":"Position Title: Data Network EngineerLocation: Plainfield, IN (Must train in Indiana then Remote Work)Job Type: ContractSalary Method: W2Job Duration: 12 MonthsWork Auth: USC, GC, GC EAD, TNJob Description:Develop and maintain routine work procedures and define standard designs, installation, support and upgrade methodologies for Data network. Responsibilities may include evaluation, acquisition, design, installation, integration testing, upgrading components, operational support and performance monitoring of the data network environment.Responsibilities:Provides engineering/technical expertise and guidance in the identification, analysis and resolution of problems. Design of Cisco networks. Understanding of Layer 2 and Layer 3 switching. Understanding of Spanning tree protocols. Understand subnetting. Understanding of the layers of the OSI model. Understanding TCP and UDP. Understanding of Access control lists. Understanding of how and when to use certain statements on Cisco routers and switches. Understanding of EIGRP, OSPF and BGP. Understanding of routing protocols, what types and when to use.Contributes to team decision-making in the accomplishment of business goals and objectives through effective planning, organizing, estimating, scheduling and monitoring of work activities;Conducts engineering and related studies; completes routine projects with minimal oversight with increasing ability to independently manage project schedules and interfaces; increasingly competent to design, operate and maintain systems with moderate impact on existing systems.Possesses and applies the fundamental concepts, practices and procedures; proficient in technical and analytical competencies. Design and implement metrics and reports to effectively monitor systems. Recommend and design solution to resolve issues.Additional Preferred QualificationsCisco Certifications a plusUnderstanding of cisco routers and switchesExperience with Microsoft (MS) Windows Operating Systems and MS Office.Develops and applies telecom technologies for the business.Working knowledge of the telecommunications systemsInter-personal skills (listening, conflict management, approachability, negotiations) with ability and willingness to share information and transfer knowledge to others.About Us Skiltrek is an award-winning IT staffing firm and the staffing partner of choice for many leading companies across the US. At Skiltrek, we promise you the perfect opportunity of building technical excellence, understand business performance and nuances, be abreast with the latest happenings in technology world and enjoy a satisfying work life balance. Skiltrek is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Skiltrek is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}