{"title":"Software Engineer - Kubeflow NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKha029ZlfWMjggJsMO7X6zqmTrYOgmzzaaY78_7iB1j2bagL8Sk9yypZ3jFz_woubpozh_MBXg_w26ng4fEO0knMbk1vd4fchYihrT2fbcd-XxoaXOtWU5tHb81do1w1oa9PQSQ9fVIly5Us7cxln5yR8DVAZdllCelAI7QndFOLSFZy2do9gCMxNM-QU","source":"ziprecruiter","full_description":"SummaryThis is an exciting opportunity for a software engineer passionate about open source software, Linux, Kubernetes, and AI/ML. Come build a rewarding, meaningful career working with the best and brightest people in technology at Canonical, the growing international software company behind Ubuntu.As a software engineer on the Kubeflow team you'll be building Charmed Kubeflow - a suite of open source Python operators for the Kubeflow ecosystem. Your work will bring Kubeflow to a wide range of users and and computing environments - from embedded devices to public cloud environments and GPU-accelerated bare metal. This role requires a python software developer with a passion for machine learning, and a desire to make it more accessible to more people.On the Kubeflow team you will gain experience with a wide range of AI/ML technologies and real world use cases. Canonical is a technology agnostic cloud leader, incorporating leading solutions to provide the best machine learning experience available. You'll be working with upstream projects to select and deliver the right combination of open source software to enable the best experience from deployment to day-2 operations.What you'll doCollaborate proactively with a distributed teamWrite high quality code to create new featuresDebug issues and interact with a vibrant communityWork with helpful and talented engineers including experts in many fieldsAttend Industry conferences like Kubecon representing KubeflowWork from home with global travel 2 to 4 weeks for internal and external eventsWho you areYou love technology and working with brilliant peopleYou have a Bachelor's or equivalent in Computer Science, STEM or similar degreeYou have interest and experience with KubernetesYou are a python programmer interested in open source developmentWe are proud to foster a workplace free from discrimination. We truly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better platform for our users and customers. This is something we value deeply and we encourage everyone to come be a part of the world of Ubuntu."}