{"title":"Chemist - Oligonucleotide","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALANDpgeLWZXbZrANSFKrDQJYO0dy2MoBACfZfr9fSVkt3Y_kQCRmrMn6OJWgke9CoGR84h1MGChes2gazWbmsaGx9gtkG5MzrHuq40iyJrp1yBetn6XshWLoA4iYeZEk97lH1ClYIXM2Vh5YVrn_7kJl9D4ndJAFRkRVqXh0IXF5PcTyd2miai2S8ieyU","source":"ziprecruiter","full_description":"Sirnaomics, Inc. is a leading clinical stage biopharmaceutical company in the discovery and development of RNAi therapeutics for treatment of cancer and fibrotic diseases. We are seeking synthetic chemist candidates with experience in phosphoramidite synthesis to fill a newly created position. The successful candidate will be deeply experienced with performing efficient oligonucleotide synthesis using DNA/RNA synthesizers and experienced in downstream purification of the oligos. The position will be located in Gaithersburg, MD.The successful candidate will prepare synthetic RNA and chemically modified synthetic RNA oligonucleotides using DNA/RNA synthesizers on demand and perform downstream purification and characterization of the oligonucleotides by cartridge, HPLC and other methods. This person will also analyze data using analytical instruments including NMR, DLS, HPLC, MS. UV/vis, etc., and maintain detailed documentation records and batch records and other materials to facilitate tech transfer and regulatory submissions.To be considered for this position, the well qualified candidate will have an advanced degree to include either a Masters’ degree (MS/MA) in Chemistry or Biochemistry OR a PhD with in-depth expertise in nucleic acids chemistry and oligonucleotide synthesizer method development OR equivalent, plus two or more years of industry experience in operating DNA/RNA synthesizers for nucleic acid chemistry, synthetic organic and analytical chemistry. The lead candidate will have experience with oligonucleotide/siRNA purification and characterization techniques using analytical instruments including HPLC, MS, NMR, UV/vis, etc., and (optionally) have experience in conjugation chemistry applied to biological systems (peptide chemistry experience will be a plus.)*Sirnaomics is an Equal Opportunity Employer, and offers a fast paced/dynamic environment, growth opportunity, competitive compensation and a full benefits program."}