{"title":"Senior iOS Engineer (Remote) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJqSNi0cWifYjHOT1-kbYJmgyw3RlU9YPh33PeQpp6SWp8Ldq-tEoHs6sBicwrr3sYnktEOloCh1hCK3c9ew_xtu_F9LMDBBD4Rm55KEPvVnTMo3xmCbtF_p1ZyhF0axjiWGKooz0gXZZJMq0d-3s4LZXimbg_eT2Bm0epx43lLdNyH4O74cBTAMkcaAVI","source":"ziprecruiter","full_description":"Backstory, launching to the public soon, reinvents our images. By using Backstory, our organized videos and photos, and those shared by our partners, friends and family, become the foundation upon which we can all relive our backstories. As a Senior iOS Engineer, you will utilize your extensive native mobile experience to develop, release, and maintain iOS apps written in a combination of Objective-C, Swift, and Flutter. You'll be excited to learn Flutter if you haven't had the opportunity to utilize the UI toolkitWorking at BackstoryBackstory is a small, scrappy start-up founded by proven entrepreneurs who sold their last small, scrappy start-up to a publicly traded company. We believe that life is too short to not love where you work. When all colleagues champion respect, humility and passion, great things happen.We are not a meetings-based company (honestly, we can't stand most meetings); we're an actions-based company.We roll up our sleeves, work fast, hit our goals and get back to friends and family.We've practiced and advocated for remote work (work from home) since 2010. We firmly believe that amazing experiences and awesome software don't need to be created in an office.Learn more about Backstory here.Success at BackstoryYou pride yourself on your kindness, humility and principles.You self-start, take initiative, stay focused, move fast, and get things done.You're savvy within your department and Backstory at large.You're great at collaborating, but get most of your energy from action, not from interaction.You voice your opinion, seek compromise, and are proud to say, \"Thank you. You've changed my opinion.\" You're self-aware and thrive off constructive feedback.You challenge, mentor and learn from your peers.A contagious commitment to Backstory's success.The RoleYou should enjoy crafting elegant and engaging experiences, backed by good quality, readable, testable, and well-documented code. We expect team members to have the discipline to test their own code with a combination of automated and manual testing. We enjoy challenging each other and collaborating on architecture, design, and best practices. You should too. What Sets You ApartA github account with open source projects created by youExperience developing image-based applicationsFamiliarity with Ruby on Rails and web technologiesExtensive experience working remotelyEqual Opportunity EmployerBackstory is proud to be committed to a diverse workforce. We do not discriminate on the basis of race, color, national origin, gender, sexual orientation, age, marital status, veteran status, religion or disability."}