{"title":"Pharmacy Senior Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKi8AqSSgwR7gGIsragCa7b_nwSdS3YvjdZEl4DfXGR7XU-8if2vQuMLDyn_Xt4joO4hfYptDE4tN47m5M6JyWRoBZTtuRiknz0c4ezkIiUFbzlMhPlThtsqVMr1chdgU9zh_1ucpdwxeU-ft_m28WMxpXWB-QCfMwm_bfd2ZpGtM5W3Ivpr0XkBqgR1dVF","source":"ziprecruiter","full_description":"Alluvion is hiring for a QC Senior Chemist located in Pompano Beach, FLJob Summary:Under general supervision executes responsibilities in accordance with applicable regulations, company specifications, procedures, policies and current industry practices.The Sr. Chemist will work within the QC Laboratory and R&D Laboratory as needed based on business priorities. Development and validation of Analytical Methods for drug substance, finished goods and Cleaning validation and verification. Demonstrated ability to work successfully in a highly collaborative, team oriented, customer focused environmentMain Responsibilities:Responsible for the development and validation of analytical methods for drug substance, finished goods.Responsible for the assessment of worst-case scenarios for cleaning validation and verification.Responsible for the development, protocol writing and validation of cleaning validation/verification studies. Responsible to maintain a safe and efficient working environment.Trouble shooting of laboratory instrumentation.Performs testing required for samples of raw materials, in-process product, and finished product following written procedures and applicable pharmacopeias. Prepares samples for shipment to contract laboratories as required. Data documentation and/or review as assigned.Prepares and standardizes test solutions, standards, and reagents. Performs calibration checks and performance checks of analytical instrumentation and devices such as pH meters, balances, and refrigerators.Performs testing in support of product development projects, investigations, monitoring of utilities systems, and the stability program. Writes and/or review laboratory investigations and deviations. Assists the lower level QC Chemists. Supportive FunctionsIn addition to performance of the essential functions, this position may be required to perform a combination of the following supportive functions, with the percentage of time performing each function to be solely determined by the manager based upon the particular requirements of the plant:Participates in cross-training in QA and QC areas of responsibility. Participates in the Safety Program to evaluate chemical aspects of safety, responsible as member of Emergency Response Team under the Emergency Response Plan. Promotes safe operating and working procedures. Counsels and trains QC Chemistry employees in safety awareness, ensuring that safety devices, equipment and personal protective equipment are used as required.Specific Job Knowledge, Skills and AbilitiesThe individual must possess the following knowledge, skills and abilities and be able to explain and demonstrate that he or she can perform the essential functions of the job, with or without reasonable accommodation, using some other combination of knowledge, skills, and abilities:Must be proficient in analytical methodologies including HPLC, GC, UV/Vis spectrometry, wet chemistry, and FT-IR spectrometry and its associate software applications.Able to write assess, develop, write, and execute analytical cleaning validation protocols and methods. Able to resolve incidents found during validation exercises. Must have experience in method validation life cycle, Analytical Cleaning Validation/Verification, USP <1224>, USP <1225>, ICH guidelines, 21 CFR 211. Excellent oral and written communication skills.Technical writing skills. Strong decision-making skills with the ability to solve problems.Ability to work with others to accomplish goals.Experience and Qualification StandardsBS degree in Chemistry or related science field with a minimum of 10 years of hands on experience or equivalent mix of education. Technical writing, chromatography, method development and validation, cleaning validation background a must."}