{"title":"Chemist: Peptide Synthesis","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJYRbaSMWhMLc0I1b3TWQP4sUr_z1VaF4QN5-zUvZ7VHZRY4jv9VZMPc9BVcilTiiRRU5ht3Re_rRbJpyuorv-ckdKHfZwes8dbSjZCXwfzzvQokxeOXJ23CSvErHip3ywi2_LPmG_dU_MIZ5fdBKm7PXZo4N-mijTgh-trCSR1ZUfJXSl4CHb1GfF0xOtH","source":"ziprecruiter","full_description":"Company Description Eurofins Scientific is an international life sciences company which provides a unique range of analytical testing services to clients across multiple industries. The Group believes it is the world leader in food, environment and pharmaceutical products testing and in agroscience CRO services. It is also one of the global independent market leaders in certain testing and laboratory services for genomics, discovery pharmacology, forensics, advanced material sciences and for supporting clinical studies. In addition, Eurofins is one of the key emerging players in specialty clinical diagnostic testing in Europe and the USA.Group's key figures are approx. 3 billion Euros turnover, 400 laboratories across 44 countries and more than 35.000 staff. Job Description The successful candidate will possess the experience or develop the skills to:Utilize state-of-the-art peptide synthesis methods and equipment to drive peptide generationSynthesize target peptides, perform purification and characterizationAccurately document experimental procedures and results in eLN and other necessary databasesCollaborate with peptide chemists and scientists from other disciplines in lab and team environments Qualifications Demonstrated understanding of and laboratory proficiency with peptide chemistry or medicinal chemistryWorks effectively with others in a team settingStrong oral and written skillsStrong scientific, analytical and project management skills requiredAdditional skills and experience that will be beneficial: Experience with peptide synthesis instrumentation, purification and analysis by HPLC and mass spectrometry is highly desirable.Bioconjugation of fluorescent labels, carbohydrates and/or proteins to synthetic peptides, may be beneficial.  Additional Information Position is full-time, M-F 8a.m.-5p.m., with overtime as needed.  Candidates currently living in a commutable distance to Indianapolis, IN are encouraged to apply.What we Offer:Excellent full time benefits including comprehensive medical coverage, dental, and vision optionsLife and disability insurance401(k) with company matchPaid vacation and holidaysEurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer.Qualifications: Demonstrated understanding of and laboratory proficiency with peptide chemistry or medicinal chemistry Works effectively with others in a team setting Strong oral and written skills Strong scientific, analytical and project management skills required Additional skills and experience that will be beneficial: Experience with peptide synthesis instrumentation, purification and analysis by HPLC and mass spectrometry is highly desirable. Bioconjugation of fluorescent labels, carbohydrates and/or proteins to synthetic peptides, may be beneficial.Responsibilities: The successful candidate will possess the experience or develop the skills to: Utilize state-of-the-art peptide synthesis methods and equipment to drive peptide generation Synthesize target peptides, perform purification and characterization Accurately document experimental procedures and results in eLN and other necessary databases Collaborate with peptide chemists and scientists from other disciplines in lab and team environments"}