{"title":"Junior Scientist (Forensic/Analytical Chemistry)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALvOOYRuXruWwUKnyx17P-r_f2Qutt09FOAT2UmIt-k1esx55vBxaH6AmVh9RV84Qze8_LIIiW9ZhYRsZnZvFYXewi3KVkV27DXZVDqIePndtA1EeJTqoNx9tV7KznC7AZ2Ix3QNguVDgxquPJo8Vyv9PeZTuJug-QI6O62PrBX9UwXwPAbvM-lAQTfzms3","source":"ziprecruiter","full_description":"Junior Scientist (Forensic/Analytical Chemistry) + Jobs+ Login+ Sterling, VA, USA+ Salary+ Full Time BluePath Labs Offers an extensive benefits package Email Me Similar Jobs Email Me This Job Overview: BluePath Labs is a fast growing research and management consulting company focused on the challenging research problems for both government and private sector clients. This position requires supporting a key government client with expert analytical chemistry assistance to aid in its mission to stem the flow of opioids into the United States. The Junior Scientist will support a 24/7 watch floor operation. There may be shift work and work schedules may vary depending on mission requirements. Employees may need to remain on call even when not scheduled. Candidates must be able to pass a technical evaluation and a government background investigation to be considered. This an exciting and fast paced opportunity to have a positive impact on the Nation. US CITIZENS ONLY. The position is located at a government site located near Sterling, VA. Responsibilities: + Performs analysis of FTIR and Raman spectra with reference libraries. + Identify FTIR spectral features based on chemical name. + Reports findings of FTIR and Raman spectra analysis. + Prepares and gives oral and written reports on findings as directed within given time and mission parameters. + Prepares monthly reports of reachback activity and chemical identifications. + Provides troubleshooting and technical support for field chemical screening devices. Qualifications: + Bachelor's degree from an accredited university or college in a physical science or an equivalent combination of education and work experience. + Successfully completed one semester of organic chemistry and one semester of analytical chemistry. + Good written and oral communication skills. + Proficient in MS Office suite and computer skills. + Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access and suitability."}