{"title":"Chemist II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIRmc7MaOigpD7u8VQtw0NhAJc34kcy04X1jHDgopUyi7kUCZUF-rdOJkeqIOJ368wNtTpcFevkjTQ_Z_6_5e47i7okiZV6YSsRl3OhedwMDk7XP-TCR96xr6jx4j3bMF8ZoEqZynyQ5BZaxK1IWwEdlSySGz0HoJP7m83-orKkF_a9R5cMlNdwCFFsD2my","source":"ziprecruiter","full_description":"Chemist II Apply now (https://secure.dc4.pageuppeople.com/apply/674/gateway/default.aspx?c=apply&lJobID=515742&lJobSourceTypeID=796&sLanguage=en-us) Job no:515742 Work type:Staff Full-Time Location:Alachua Categories:Agriculture/Life Science/Vet Medicine, Research/Scientific/Grants Department:60460000 - AG-SCHL FOR, FISH, & GEOMATICSClassification Title: Chemist II Job Description:+ Chemist conducts analyses on water samples from Florida lakes, streams and near shore coastal waters to evaluate their limnological characteristics. Individual is responsible for conducting multiple chemical analyses as described in the American Public Health Association's Standard Methods with adjustment to these methods described in Florida LAKEWATCH's Standard Operating Procedures, focusing primarily on total phosphorus, total nitrogen, ammonia, nitrate-nitrite, chlorophyll, specific conductance, color, pH, total alkalinity, and chloride analyses+ Chemist will enter, edit and manage data from analyses, using Excel spreadsheets while maintaining Quality Assurance and Quality Control procedures for all laboratory analyses. Where needed the applicant will analyze existing methodologies, formulates hypotheses about methods/data, and recommend modifications to existing procedures accordingly.+ Chemist will be responsible for maintaining the chemical inventories for the LAKEWATCH laboratory along with ordering all supplies as needed. They will also be responsible for using Gator Tracs which compiles all LAKEWATCH laboratory chemical and safety information into a database that allows UF Environmental Health and Safety personnel to search for specific chemicals to identify safety issues and run regulatory reports without asking for special inventories from researchers+ Chemist will prepare test solutions, compounds, and/or reagents needed by laboratory personnel to conduct analyses. This position will also determine minimum detection levels (MDL) and practical quantitation levels (PQL) for LAKEWATCH's quality assurance and quality control requirements+ Assist the Scientific Laboratory Manager in laboratory operations as needed.+ Other duties as assignedExpected Salary: $40,000 commensurate with education/experience Minimum Requirements: Bachelor's degree in chemistry or a closely related field and three years of relevant experience; or a master's degree in chemistry or a closely related field and one year of relevant experience; or doctoral degree in chemistry or a closely related field. Preferred Qualifications: + Must be able to operate and maintain auto analyzers (e.g. AA3), spectrophotometers, other laboratory equipment and all computer software associated with laboratory equipment.+ Must have excellent computer skills including creating macro programs in Excel. Data analysis skills using JMP a statistical package created by SAS institute highly desired.+ Must have two or more years experience supervising personnel and the ability to work well with a diverse group of staff and citizen scientists. Special Instructions to Applicants: In order to be considered, please upload cover letter, degree transcript, CV and/or resume, 2-3 professional letters of reference.Application must be submitted by 11:55 p.m. (ET) of the posting end date.This is a time-limited position. Health Assessment Required:No Advertised:10 Feb 2021Eastern Standard Time Applications close:12 Mar 2021Eastern Standard Time"}