{"title":"Automated Chemistry Technologist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ4oZBME5hpmvtcJgztjCgx3ke9hLuWzpCrCeFWHWqSsIKGNu3_i21vSDpQUzA6VCRQY3_b8o2-94BpnEeODPmsIlExyHsm1mzN8S0uDosE3J5aAvkBFFg4B9PMhhFooXNbk_bxEBwI3Bsa6V5ODiYSWBFshTGf_57RhNjxEX4CPdoewQbEHBHD8FZZB-U","source":"ziprecruiter","full_description":"OverviewWe are looking for a Chemistry Research Scientist (Automated Chemistry Technologist) with automation experience and expertise in modern organic synthesis to work at our North Bethesda, MD location.Ideal candidate will be working in a highly creative chemistry technology environment developing advanced synthesis and isolation platforms aimed at transforming work that has been traditionally the domain of the manually attended chemistry hood. The role will require an ability to apply a broad knowledge of chemical synthesis, and technological innovation. The ideal candidate should be independent and well-trained in the field of synthetic chemistry or medicinal chemistry. The candidate will be responsible for developing and validating automated synthesis platforms in a highly integrated environment working alongside team members with a focus in facilitating and advancing translational research objectives in coordination with the team leader. Previous experiences with advanced synthesis platforms and/or involvement in their design and implementation would be highly desirable. The candidate will need to work in a cross-disciplinary team environment, requires strong communication skills, and conducts their work in a respectful, thoughtful, and diverse workplace environment.Axle Informatics is a bioscience and information technology company that offers advancements in translational research, biomedical informatics, and data science applications to research centers and healthcare organizations around the globe. With experts in biomedical science, software engineering, and program management, we focus on developing and applying research tools and techniques to empower decision-making and accelerate research discoveries. We work with some of the top research organizations and facilities in the country including multiple institutes at the National Institutes of Health (NIH) Qualifications: + Position requires a Masters or PhD degree in chemistry and/or a minimum of two years' experience in an advanced chemistry research laboratory.+ Willingness to work in a multidisciplinary environment - interacting with analytical chemists, biologists, automation engineers and software engineers.+ Previous direct experience running a broad range of organic synthesis reactions and synthetic targets.+ Previous experience in an environment focused on automation development in a research setting would be desirable.+ Broad range of experience with both common (e.g. balances, glassware, fume hood manifolds, etc) and specialized (e.g. LC/MS, Microwave reactors, etc.) synthetic chemistry equipment.+ Experience collecting and interpreting data from analytical equipment (LC/MS, HNMR, other?)+ Demonstrated ability to learn, operate and troubleshoot complex laboratory equipment.+ Demonstrated ability to multi-task effectively in the laboratory (e.g. setting up and running parallel experiments)+ A demonstrated proclivity towards improving processes and delivering practical solutions.+ Experience with electronic notebooks (desirable). Benefits + 100% Medical, Dental & Vision premium coverage for Employees + Paid Time Off (Including Holidays) + Employee Referral Bonus + 401K Match + Tuitionreimbursement and professional development opportunities + Flexible Spending Accounts: + Healthcare (FSA) + Parking Reimbursement Account (PRK) + Dependent Care Assistant Program (DCAP) + Transportation Reimbursement Account (TRN) The diversity of Axle's employees is a tremendous asset. We are firmly committed to providing equal opportunity in all aspects of employment and will not tolerate any illegal discrimination or harassment based age, race, gender, religion, national origin, disability, marital status, covered veteran status, sexual orientation, status with respect to public assistance, and other characteristics protected under state, federal, or local law and to deter those who aid, abet, or induce discrimination or coerce others to discriminate. Accessibility: If you need an accommodation as part of the employment process please contact: Email: careers@axleinfo.com Disclaimer: The above description is meant to illustrate the general nature of work and level of effort being performed by individual's assigned to this position or job description. This is not restricted as a complete list of all skills, responsibilities, duties, and/or assignments required. Individuals may be required to perform duties outside of their position, job description or responsibilities as needed. ID: 2020-1746 External Company URL: www.axleinfo.com Street: 6116 Executive Blvd"}