{"title":"Technical Writer (Job ID: 21-02522) NEW!","location":"","salary":"","description":"","term":"$35 to $40 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAJgDwtsbS3pFoiDas1gZNUchcqg43v7ltTaKa0BcjbR9ahqvAheuo4fJQOdVJVLALmvBmuuSIqzwPEByxWl6fQXXafAWpdU9BSRl1f32d8HHeYPIZVECA0HB1uVHjz0ldNoW3haXDBqaikmm5WSqbQLdl4Cq9gRQdZHBz6pi7sfyF312nyRIEduzp20m5Y","source":"ziprecruiter","full_description":"Our client, a leading medical devices company is looking for a Technical Writer. This is for an initial duration of 12 months and is located in San Diego, CA.Qualifications:· Bachelor's degree in English, Journalism, Communications, or other liberal arts degree.· Experience working in a regulated industry such as pharmaceuticals or medical devices.· Extensive experience with regulatory compliance processes. Strong background in supporting regulatory requirements to ensure adherence to regulatory guidelines.· Demonstrated ability to be highly collaborative with marketing, clinical, quality, and regulatory reviewers.· Five or more years writing and editing hardware/software user guides (print and online) and other technical product documentation.· Ability to effectively manage the delivery of prioritized tasks.· Ability to demonstrate a high level of initiative to gather information for developing documentation.· Ability to work independently with minimal supervision.· Effective at thinking independently and solving problems with product core team members.· Ability to work under compressed deadlines and must be able to deal with unresolved situations, frequent project changes, delays, or other events.· Ability to handle multiple projects with excellent follow-up and project management skills.· Familiarity with electro-mechanical concepts and software application usage.· Experience in device labeling and/or packaging content development is a plus.· Familiarity with large company engineering change control processes and Agile software development methodologies.· Experience with Microsoft-based applications (Microsoft Office 365™)· Minimum of two years' experience writing for online help· Experience with SAP, Oracle, or similar enterprise resource planning (ERP) system.· Experience in version control systems (VCS) such as, Perforce, Apache™ Subversion™, Microsoft™ Team Foundation Server, or GitHub.· Knowledge of screen capturing, photography, and image editing software such as Microsoft™ Paint or Adobe™ Photoshop™.· Skilled in both electronic and hard copy markup (Acrobat, tracked changes in Microsoft™ Word™, standard editorial and proofreading symbols).· Knowledge and experience with desktop publishing (DTP) software applications (MadCap™ Flare, Adobe™ FrameMaker™, Adobe™ InDesign™, Adobe™ Illustrator™) as applicable for technical documentation.Qualified candidates please send your word format updated resume at the earliest to sangeeth.k@sunrisesys.com. Thank You."}