{"title":"R&D Chemist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIokrJdWzBDzYYxp054yBtlKr9-qSYiC0E9IV9N-cpRMk0sYVfPhy8xjyNeoxlO0kLy_yY2bWSXI56bQKI5XKDWM6GwPo1LKLFuXlH2pVoADW3SxmNY96u9Hv2n4hKy6o4qhKCbCTpcK1PvAoR4bAIIN_FVeix4j2cIPppcS064B_oc_WR-kzukRKnEkI8","source":"ziprecruiter","full_description":"Our client, one of the world’s leading producers of color glass mosaic, Venetian enamel, gold leaf tesserae and engineered stone surfaces, is hiring a R&D Resin Chemist for their Sebring location.Principal ResponsibilitiesOversee the technical aspects of manufacturing process of agglomerate slabs to include resin formulation, mixing and product quality. Part of a team that recommends process changes based on test results and specification criteria. Responsible for monitoring results obtained in conducting research from plant and lab operations. Organizing and conducting research as directed to meet product development objectives.Essential Duties and ResponsibilitiesEvaluate and review materials, processes and results, compile comprehensive reports on research results. Evaluate alternative raw materials/chemicals to reduce cost and improve quality.Evaluate manufacturing process performance and equipment/systems capabilities.Oversee mixing of resin formulations for manufacturing characterization experiments and apply fundamentals of process knowledge to determine processability against controls.Prepare sample of materials for evaluation.Perform complex, inter-related experimentation and basic statistical analyses.Setup and maintain all lab equipment, calibrate and perform routine preventative maintenance items along with calibrations.Maintain product recipes/formulas.Assist in assuring proper inventory levels maintained for all raw materials and chemicals.Assist in product development activity in manufacturing.Develop timelines, complete technical work request meetings.Establish timelines and report results to Senior Management.Ensure compliance with company environmental, occupational health and safety policies and procedures and relevant regulations.RequirementsPolyester resin experience requiredUV Chemistry for Inks and Coatings applications is preferredComprehensive working knowledge of ChemistryComprehensive working knowledge and skill in the calibration and maintenance of all the laboratory’s analytical equipment.Proficiency in computer production control systems and Microsoft Office experience required, especially MS Word and Excel.Prefer a 4-year degree in Chemistry or Engineering with a minimum 1-2 years’ work experience. We are also willing to look at individuals with a 2-year degree and at least some experience.Personal AttributesSelf-starterHands onAnalytical orientationFlexibleAble to juggle multiple projects, work independently on assignmentsQuality orientatedDetail orientatedSafety consciousGood observation skillsAbility to interact inter-departmentallyGood math skillsOverviewCompetitive compensation based on experienceRelocation assistanceGreat company cultureAdditional perks"}