{"title":"Sr Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK9pKDGBf5s9cqy2e5yCaWE8NYvV3pEjNA_StG7ZmA-wEj4jLV0BX0xCvFQInK1RkqKsXJ5mFBg_Db9_Z0YeO16YycQ9ixv5GN6XdvdvYm0me2WvvJV9l5_t3TXV6j9GZEm3tvrHEatHkaUR1eHqzkVZH8-0ysRm1S2hfuVZFb13wAQ5GyZHxjAZuIU0XQ","source":"ziprecruiter","full_description":"Business Title: Sr Software Engineer Posting Location: United States - Colorado - Englewood Posting Job Description: JOB SUMMARYDesign, develop, modify, enhance and implement software systems designed to support new or existing business initiatives.  Projects are usually of considerable complexity and require a mastery of development tools. Perform maintenance and provides technical assistance and advice on existing software solutions. MAJOR DUTIES AND RESPONSIBILITIES Actively and consistently supports all efforts to simplify and enhance the customer experience.Code and perform unit and integration testing of software to ensure proper and efficient execution and adherence to business and technical requirements. Write programs according to automation and orchestration specifications, and define specifications for complex programs.Develop and maintain technical documentation.Serve as final escalation point to resolve incidents and problems for delivery pipeline supported by the team.Collaborate with internal customers, technical and architecture teams to solve complex software problems. Provide system users and management with DevOps innovation and improvement recommendations.  Identify and recommend system requirement needs for DevOps automation and orchestration pipeline. Implement, monitor, test, and audit new software programs to maximize efficiency of software systems.Participate in continuous performance improvement sessions to discuss opportunities to improve processes and/or standards.Coordinate with technical teams to analyze and resolve DevOps related problems causing operational difficulties, advising on specialized features and functions.Follow established configuration/change control processes.Participate in retrospectives and inspect and adapt agile ceremonies to identify continuous improvement opportunitiesMentor and coach junior team members.REQUIRED QUALIFICATIONSSkills/Abilities and Knowledge Ability to read, write, speak and understand EnglishStrong experience with open source and commercial RDMS and NoSQL databases and MQ technologies. Strong experience working with DevOps engineers to build and deploy infrastructure on premises (VSphere).Strong Understanding of Scrum/Agile development methodologies.Capable of delivering on multiple competing priorities with little supervision.Experience with DevOps tools (CHEF, Terraform, Artifactory)Experience with monitoring technologies (Prometheus, Jaeger, NetCool).Experience with programming languages (Python, Ruby, Golang).Experience with scripting languages (Perl, Shell).Experience with Scrum/Agile development methodologies.Experience with infrastructure automation technologies (Docker, Kubernetes).Experience with build automation technologies (GITLab, Jenkins).Experience with cloud solution providers (AWS, Google Cloud Platform).Ability to collaborate with and contribute to a common culture of excellence.Ability to understand test methodologies and automated testing frameworks (TDD, BDD). Must be capable of delivering on multiple competing priorities with little supervision.EducationBA/BS in Information Technology, Computer Science, related field or equivalent combination of education and experienceRelated Work Experience 5 years IT Experience5 years Experience with Software Development MethodologiesPreferred QUALIFICATIONSRelated Work Experience                     Telecommunication experience     WORKING CONDITIONS Office environment    Requisition #: 275235BR Job Code: ESW325 Sr Software Engineer Position Type: Full Time Area of Interest: Information Technology, Software Engineering Business Unit: Corporate -CCL - CORPL Location: 14810 Grasslands Dr FCC Unit: 13541 Account Code: C04-170-7100-874 Controlling Establishment ID: 01093 - Englewood Grasslands Dr More on Spectrum: The health and safety of our employees and candidates is very important to us. Spectrum has adopted virtual mobile recruiting tools that allow us to continue meeting new candidates. We look forward to \"virtually\" meeting you.The Spectrum brands (including Spectrum Networks, Spectrum Enterprise and Spectrum Reach) are powered and innovated by Charter Communications. Charter Communications reaffirms its commitment to providing equal opportunities for employment and advancement to qualified employees and applicants. Individuals will be considered for positions for which they meet the minimum qualifications and are able to perform without regard to race, color, gender, age, religion, disability, national origin, veteran status, sexual orientation, gender identity, or any other basis protected by federal, state or local laws. Work State: Colorado Work City: Colorado - Englewood Posting Job Title (Do Not Exceed 250 Characters): Sr. Software Engineer Zip Code: 80112"}