{"title":"Senior Android Engineer (REMOTE)","location":"","salary":"","description":"","term":"$140,000 to $175,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKvtwkwfAypJx_xtvcNrZu-tbR-61UxQ829pFjPxfQXdFLHI5CJCpRDN4ppOeW2DnYs-rEqUaqpu_XEHW-CEpcTMsZ1J8Ma8ZMKbzd4rFr1TjDIDkGAW3Y5zu7aSlxXSZ3Up-YGjJ5T9OggocAOJgbKy1f_CMS-gntaR7WmgCWrFEtrj_6Jd5jXQhuWe4Q","source":"ziprecruiter","full_description":"Senior Android Engineer (REMOTE) Headquartered in Orange County, CA we are a retail/eCommerce company that's bringing our Webby Award-wining mobile app development in house! We are doing an entire rebuild from scratch while also expanding into the European Market for the first time.Due to growth demands, we are hiring for a Senior Android Engineer who has at least 5 years of experience and is local to Orange County or located in Pacific or Mountain time zones and interested in working remotely.Top Reasons to Work with Us- Join a stable company and growing team- Competitive comp ($140-165k base)- 15% annual targeted bonus- Medical, Dental, Vision, 401K + MOREWhat You Will Be DoingDesign solutions and implement requirements within defined infrastructureMaintain developed apps, enhancements, bug fixes, etcCreate solutions to drive efficiencies across the company, stay up on latest techMaintain communicates between departmentsWhat You Need for this Position- BS/MS in Computer Science, Mathematics or related- 5+ years of mobile Android development- Kotlin, Java, Android Jetpack, C++- Http, Firebase Analytics- Modular design, Component-based architectures- Reactive programming, SOLID- MVC, MVVM- CI/CD testing + release automation - Expert understanding of Android operating systems(+) .NET, Xamarin (+) Azure..So if you are an Android Engineer with experience, please apply today and email caroline.veillon@cybercoders.com with the best time and number to reach you! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}