{"title":"Fleet Mechanic (Preventative Maintenance Mechanic)","location":"","salary":"","description":"","term":"$15.55 to $16.55 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJLrrE7Orrt_Za1Ry7uBkgAkL5LuxZu-Mc3K9enoslXAtNuZa1BxiXoLntGbbGBqH2D3Kk2bSPV8fpmg06g8qvKdLhvMMF_PJ-wjqGA8GikFIvNeSfOZE4mhbILImwRO0FXYBSiZkUxOKPKDRcAJs2CYbMu__DRrt42O2u1nw0f5d0XFNKGSBKQE3jN2tHk","source":"ziprecruiter","full_description":"APPLY AT www.usd266.comMECHANIC NEEDED TO SERVICE AND REPAIR SCHOOL VEHICLES.Click on \"JOBS\" link in upper right hand corner.Preventative Maintenance Mechanic needed for Maize USD 266 Transportation department. Mechanic will work on school vehicles including buses, vans, and trucks.Preventive Maintenance Mechanic at Transportation Department.Purpose Statement The purpose of the job of Preventive Maintenance Mechanic is to keep the district’s vehicles in such a state of operating excellence that they present no problems or interruptions to the educational program.Essential Functions ___1. Diagnoses and repairs all school vehicles to keep them operating safely and efficiently. ___2. Performs preventive maintenance on all school vehicles to ensure efficient operation. ___3. Complies with the set-up for the receipt and issuance of parts and supplies in order to meet district guidelines. ___4. Maintains an inventory of own hand tools in the Transportation Office to maintain organization. ___5. Promotes high standards of safety and good housekeeping methods in all work-connected areas in order to maintain safe practices. ___6. Assists in the development of recommendations for future transportation needs so the transportation department runs effectively and efficiently. ___7. Communicates directly with bus drivers concerning conditions of the vehicles so that vehicles can be maintained. ___8. Assists transportation department with traffic, disabled buses, driving, etc in order to ensure safe transporting of students. ___9. Performs other duties as assigned for the purpose of ensuring the efficient and effective functioning of the school district.Other Functions ___1. Helps with the fueling and cleaning of vehicles so they are ready for use.Minimum Job Requirements Knowledge, Skills, Abilities Advanced knowledge of the repair of gasoline and diesel powered vehicles.Education, Certification-High school diploma, Basic computer skills, Commercial Driver’s LicenseExperience Evidence of successful experience repairing gasoline and diesel powered vehicles.Physical Demands, Working Environment Heavy lifting is common. Occasionally work is done in extreme conditions. Generally the job requires lifting, carrying, pushing, pulling, kneeling, crouching, stooping, and working with fine finger dexterity. The position requires 5% sitting, 10% walking, 80% standing.Attendance Requirements: • Must maintain regular and acceptable attendance/punctuality as required by the Board of Education policies and regulations. • Must be regularly available and willing to work 40 hours per week, or such other hours as the district determines are necessary or desired."}