{"title":"Technical and Content Writer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALIZfRcXeuzJBenolHOer0vHweTTOWjfpZ2Jf_FmINo4gm3wv_36bz8PBW5Ae2M1NWQqJukGSQ1s94kWRyxEch1HKTBOdekLlr8YMIjztOFW1ex_MecaWNpecu8mQjsU-g_9qStXaclawM7abcj_YBk_AhL04h0CAOONogO8-IXcSQA6jC8TnGkEoUn9_8","source":"ziprecruiter","full_description":"Development of communication programs to promote Oracle's products & services.Integrate advertising into the marketing campaigns, exercising judgment and business acumen in selecting methods and techniques for best practice / creative solution. As a recognized authority and leading contributor maintain regular interface between the division and Corporate. Plan and manage pan-geography corporate and local campaign media plans. Plan, manage and implement corporate and local campaign advertising creative. Manage tier 2 local advertising and arrange sign off with Corporate. Integrate all advertising across the communications mix. Maintain and communicate brand advertising guidelines. Oversee partner advertising. Develop and manage brand communications audit. Measure advertising effectiveness.Leading contributor individually and as a team member, providing direction and mentoring to others. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. 8 years relevant work experience. A proven track record in advertising across line-of-business and/or geography as an account manager, with experience of creative production and media buying.*This is a remote/office based position which may be performed anywhere in the United States except for within the state of Colorado.**Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.*The Technical and Content Writer will be the primary line writer and editor for the majority of the content that will turn Oracle into a special place for developers. You will help maintain a unique style and will be the final decision maker before we release a podcast, post, or video. Your challenge? Inspire and engage a world of developers.Responsibilities: Lead, define, and execute high-quality content (web pages, blog posts, news, in-depth stories, users guides, etc.) that reflect the voice, tone and goals of developers. Facilitate new ideas, tactics and strategies related to storytelling, content presentation and outreach. Conduct research and SEO guidelines, using your high level of creativity and data-driven insights to define, write and edit content that will engage with developers. Run content programs from start to finish: setting up strategy sessions, building content programs, leading teams and relationship with our developers, writing and editing, measuring and optimizing results. Work across departments and teams to enhance and improve our content. Create and maintain relationships with external sources that can provide unique and authentic content to our website. Help define new processes and workflows to expand our multimedia capacity and bring original strategies to improve our content.Qualifications: 5 years of experience in content-related field 4 years of experience as writer and editor Great writing, editing and digital marketing strategy skills Proven track-record defining creative editorial strategy for brands, planning and leading developer programs Ability to grow an external network of writers and contributors within the developer space Passion for story and content as well as a creative mindset Ability to research and assess data to create visualizations, maps and other interactive experiences Avid consumer of all types of media Excellent written and verbal communication skills Strong attention to detail Able to write in explanatory and procedural styles for multiple audiencesGreat sense of humor and an appetite for unexpected opportunities.Job: **Marketing***Organization:** **Oracle***Title:** *Technical and Content Writer***Location:** *United States***Requisition ID:** *2100088I***Other Locations:** CA-Canada"}