{"title":"IOS Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJg3CUW_UFKsU3Giusn2BQfLtcIrJ6KqYIlVK8P9X8JCJK02fxWyGjdIncUydiPcjn6xGl1FJV81r1h_QhuMPEf6tdk1rF2z9MEvXJXrgc0jheKQ9sGvcZYP7h8wnvACLP7fK7DM6DVytgGvhhFUro2v5SGNjJP0Q2OIAGHVgLoDxqAa_Ycph3lrQq5oFJG","source":"ziprecruiter","full_description":"Overview Title: IOS DeveloperLocation: Columbus, OH Job Description:The iOS developer will be engaged in all phases of the development lifecycle including requirements gathering, specification review, and approval, working with interaction designer, application architecture, collaborating with external teams to make applications work together, application implementation and debugging/troubleshooting, fixing defects and supporting test team, application deployment, and maintenance, scrum and agile concepts, refactoring, working closely with our business partners, writing clear maintainable code that works, documenting using a wiki, continuous integration, unit testing, code reviews, automated builds and functional.8+ years of hands-on development experience on the iOS platform with a strong understanding of the iOS Architecture Experience with all phases of the development life cycle.Able to develop Native iPhone applications and Frameworks using Objective Created 2 or more applications available in Apple's AppStore or Google's Android Market Familiarity with Agile development including daily scrum and weekly iteration reviews and planning. Familiarity with how to optimize code for phones, testing with phones, challenges with phonesFamiliarity with several languages: C# 3.5, Java, Objective C, JavaScript, Python Experience with GIT source control management. Experience consuming SOAP web services Advanced communication skills with the ability to clarify application requirements via phone/email with business partners in addition to relying on technical requirements documentationHave experience working on successful co-located delivery teams Have experience and a passion for test-driven development Experience delivering products across multiple releases Experience with automated acceptance/regression testingResponsibilities:Complete development assignments on time with an appropriate level of quality to support project efforts. Concurrently participate in multiple technology projects from concept to implementation, and through all phases of the software development lifecycle.Act as a primary point of contact for development projects with other technology teams. Provide business teams input into project requirements, design, and other critical project documentation.Responsible for exceptional verbal and written communication including Project risks and issues Project status Triage technical issues and lead teams toward solving problems.Create work estimates based on technology concepts and requirements documentation. Should have a good understanding of Hybrid Application Architecture and a hands-on skill working with HTML5/CSS3/jQuery Mobile is strongly desired.Should be able to understand the memory usage, object references, and performance-oriented coding Should be able to work on developing views and UI for iPhone and iPad applications,Should understand the Apple user interface and coding standards Able to work on Agile and Test-driven development.Able to work on unit testing, code coverage tools for Objective C Good in communication - written and verbal communication skillsCoordinate with the Technical Director on current programming tasks. Collaborate with other programmers to design and implement features. Quickly produce well-organized, optimized, and documented source code. Create and document software tools required by artists or other developers. Debug existing source code and polish feature sets. Contribute to technical design documentation. Work independently when required. Continuously learn and improve skills. Attention to detail is essential and all tasks must be carried out to the highest standardFlexon Technologies is a leading end-to-end technology solutions provider to IT and Non-IT industry. We specialize in providing \"Total Solutions\" encompassing technology and services combined with unparalleled domain knowledge that gives our clients a distinct advantage. We offer integrated business solutions, enabling clients to optimize their business with greater efficiency, and increased responsiveness. Our offerings are designed to cater to the entire range of clients' technology needs. We deliver end-to-end solutions that can build, manage and support our customers' IT systems across the entire value chain infrastructure, applications and business processes. The range of our offerings extends to software (including systems and application software development, implementation, maintenance and frameworks), IT architecture, network consulting, Staffing etc. These technology offerings backed by the domain solutions and knowledge to ensure maximum business alignment, allowing you to derive maximum benefits out of the IT investments. Benefits that Make a Difference:Medical, Dental and Vision plan options 401(k) Life Insurance Flexible Spending Account (FSA) Commuter Benefit Program."}