{"title":"Senior Software Engineer (Python)","location":"","salary":"","description":"","term":"$150,000 to $170,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJK9effAV3LE-uhIYTa7cFQxjhEtuVHEDEBpADxDqYAdtmWAxhJKWeFP3SOSCdhWsneHyKtGQuHMzgAMDxfDzv-q27_etPQx0m5OiBwqC0rfvXjD276lDeWwc07bmtncEcOi0wfSxpHps-lU3uN0z8a8sYnWIYiT_NfxrcEtyro5qTtJHkZSHKjGjPHx8I","source":"ziprecruiter","full_description":"Senior Software Engineer (Python) If you are a Senior Software Engineer with Python experience, please read on!We are located in the Washington DC area and we are a cutting edge technology and data/analytics company. We have been improving since our start and have been serving commercial, government and international clients with the high class technology that are passionate about. Our team is comprised of some of the brightest minds in our space and highly prioritize working with modern technology to do what we love!We need a skilled Senior Software Engineer who is well-versed with Python and that has great technical leadership and problem solving skills to help bring our technical product to the next level. This person will be designing and building new infrastructure to build and test client-server applications and will need to be highly skilled with API's. We will need someone that has a passion and strong focus for automated operation so that we can continue to work with and develop new innovative technology!Top Reasons to Work with Us-Work with highly innovative products! -Work with cutting edge technology-Significant room for growthWhat You Will Be Doing- Lead the charge on development of software to improve infrastructure - Design and develop new processes and procedures for client testing applications - Design API's- Develop unit and integration tests for the entire infrastructure - Build out automated systems to help with providing a consistent and efficient productWhat You Need for this Position- 8+ years of overall professional development experience- 5+ years of Python development experience - Experience working with API's and Flask- Must have experience with NoSQL databases such as MongoDB, Postgres, etc. Nice to haves: - ActiveMQ- RabbitMQSo, if you are a Senior Software Engineer with Python experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}