{"title":"Telepsych + Onsite practice - INTERVIEWING NOW!!!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJldlrxv9JOfcWkaEpdTJoZLSYZuYwmupc2wqbdyYUdSAyrJMJTXVBxv_BAsLcD3pFci5mbi53yXqkIbFuHUSSRpyZ8XREQE7-ARNiezL_uX2AlyFjNFeCUgMMOkDmD_hDSNxZNjA3vhOyYTY8icFOBSLL13pwVYpYEKDjunq-IYhtF6qb2XJDKCwHPboUe","source":"ziprecruiter","full_description":"LifeSource provides its clinicians with the opportunity to practice autonomously but with a full clinical, billing and administrative support team allowing the clinician to focus on patient care.***Must be licensed within Georgia******Prefer Dual Certification FNP or AGNP and PMHNP certification for this Position!***Open to FNP or AGNP with 3+ years of psych experienceInterviewing nowFull Time opportunityImmediate Practice Opportunity Great Benefits Package AvailableFlexible SchedulingNo Nights or Weekends RequiredCase Load Provided for YouFull Administration Support Team ProvidedFlexible SchedulingClinician Testimonial(s) w/ video: https://lifesourceinc.org/career-lifesource.lassoWork for an organization that is passionate about quality care and providing a thoughtful approach to improving the lives of the geriatric community. Our clinicians provide mental health services to residents within long term care, nursing and skilled nursing facilities.Benefits of working with LifeSource:Practices in multiple locations ready and waiting to be staffedAll administrative tasks completed by LifeSource allowing you to focus on Patient Care!No more billing worries or interruptions in cash flow!Flexible schedule – full or part-time practices available immediatelyElectronic health record for easy and efficient documentationTriage providedClinical autonomy, yet access to a network of experienced colleaguesEducational programs offered quarterly with CME/CEU credit providedCase Review and support from a group of clinical peersExcellent compensation packagesHealth, Vision, Dental and Life InsuranceShort Term & Long Term disabilityCME/CEU budgetNo nights or weekendsWe currently have a team of professionals who would be happy to speak with you about the positive experience they are having as a LifeSource clinician. LifeSource believes in servicing all of its “clients,” our patients, our facilities, and especially our clinicians. We are extremely focused on providing the highest level of service in each of these areas.Please see what a few of our clinicians have to say about their personal experience with LifeSource. These clinicians would also be available to speak with you directly.“I would recommend this company to my best friend, and have! I love the high level of commitment that exists throughout the organization. Clinicians are valued and provided for with services and support that can’t be matched.”– Arlene Gallan, PhD. North Carolina LifeSource Clinician“Having been in the field of psychology for sixteen years across settings to include; non-profit private practice, state department of mental health and large school districts as school psychologist, I can honestly say I have never found a better setting in which to work than LifeSource. When they say they will build you a private practice, and do all the administrative work, they mean what they say. It is truly a clinician’s dream come true.”- Robert Nelson, PsyD. South Carolina Clinical DirectorClinician Testimonial(s) w/ video: https://lifesourceinc.org/career-lifesource.lassoBehavioral Health Psych Mental Health APRN ARNP APN NP-C FNP AGNP ANP Psychiatry Geriatric"}