{"title":"Senior iOS Engineer -100 % REMOTE!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJBd-gGgwJO4dSLHuE1ywc_9Ks_LLrc9mw2ly9dpymENIQJ9wy9ro4Nh7k3I8S35VwuvnF6v57rZsiP-XeLUnN_GMumtc_VQHmVwVQ6ES0-JevJcjAiOkSz4lH4EUaktH7zqDAW9h5tnZB_3Yo9LUu0k1A5JUbF5CqBCfFWLh7L0wXKE2_hGnFxKh2dwaI","source":"ziprecruiter","full_description":"Senior iOS Engineer -100 % REMOTE! If you are a Senior iOS Engineer with experience in Swift and JSON, please read on!Located in Bellevue, Washington, we specialize in providing fingerprints, for anything other than a human! We find that a lot of items go missing in a lab and in the real world, so our goal is to be sure that objects are fingerprinted, too. We have been in business for over 5 years, and specialize in our proprietary software/application that gives us the ability to track our objects once fingerprinted.We are looking for a sharp Senior iOS Engineer who is going to have a strong background in Swift and JSON. Your responsibilities will include creating and designing our software for all iOS users! We expect our engineers to understand a full software development life cycle. In addition- we work work collaboratively in a team over here, so someone who enjoys working cross-functionally will enjoy it.-This role is 100% remote during and post-COVID-What You Will Be Doing-Designing and creating software-Utilizing heavy iOS background-Working collaboratively in a teamWhat You Need for this Position- SQL- CoreGraphics- CoreData- CoreImage Filters- JSON- IOS- SWIFT- CombineSo, if you are a Senior iOS Engineer with experience in Swift and JSON, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}