{"title":"Engineering Manager - Android (Dubsmash)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALibSd_hiJu48rC6DmtYW7OJYZCV1pLKa020Inbn-KIE3rwZVM4UbTa37Ps439xKZ7tYvjnQZAL-UKGIbSijU0B6jM0ALzLXSDSIwgayi_PfRmGfdu765FltGoOylDR4e6tV4mTnABj9970jof-ISW1kZwg83bfH4al8a6AvgaBiaHZwNeS7-jrY1e-ekU","source":"ziprecruiter","full_description":"Dubsmash is the short video platform that elevates underrepresented communities and helps them earn a living. In December of 2020, Dubsmash was acquired by Reddit Inc. and is now shaping how communities come together with video at the core. A lean and high output team, an estimated 25% of all Black American teens use the app on the monthly basis, with 30% of its daily users creating video. Last year, the company reported hitting the milestone of 1 billion video views. Dubsmash is a largely autonomous unit within Reddit, running independent processes that focus on shipping high quality products with cutting edge technologies, every two weeks. Over the past 2 years, the team has shipped over 60+ versions of the applications to its customer base. In 2021, the team will be shipping huge updates to the product, transforming the way consumers interact through video. Being a part of this team, you will benefit from seeing your output live on the App Store every two weeks, while enjoying the benefits Reddit Inc. has to offer. Engineering is at the core of what we do. We are looking for an experienced hands-on Engineering Manager that is ready to lead our fast-paced Android team, which is powering delightful experiences for millions of users world-wide. You are:Ambitious. You are eager to build a first-class Android experience at Dubsmash using state-of-the-art technology. You thrive in a fast-moving, dynamic, results-oriented environment and aim high.Execution driven. You love running a well-planned sprint, delivering high-quality features with your team and tuning the process you work in. Delivering a well-built release on time is one of your top priorities.Passionate. You are passionate about Video and building a fun & entertaining experience online for communities to find each other. You love the Android platform as much as we do and want to make it even better with the apps you are building.A team player. You enjoy working with functions across the organization and strive in a cross-collaborative work environment. You communicate clearly & openly and can arrive at great solutions with your team-mates amidst different priorities.You will:Lead the Android team at Dubsmash in building a first-class mobile experience across a broad range of devicesBe hands-on involved in building new & innovative features and drive technological advancements in Dubsmash' Android experienceHire & manage a team of highly skilled Android EngineersAdvise the Product & Design team on best practices on the Android platform & ecosystemWork closely with the whole Engineering team to improve on existing processes & continuously evolve our techstackWe're looking for someone who has:6+ years of experience in building native production Android applications, preferably in Kotlin recently1+ years of experience managing high-performing mobile engineering teamsPrevious experience in building native mobile video experiencesPassion for developing scalable, well-designed software that adapts as it growsExcellent communication, planning & collaboration skillsWhat you can expect from us:Competitive Healthcare Benefits PackageQuarterly Dependent Care or Pet Care StipendFamily Expansion Benefits4 Months Parental Leave with Flexible Return-To-Work ProgrammingProfessional & Personal Development StipendsUnlimited Vacation, Annual Travel Stipend, and 10 Paid HolidaysOnsite Wellness Classes and Wellness Stipend401k Plan with Employer ContributionsMonthly Commuter StipendMonthly Cell Phone AllowancePaid Volunteer Days, plus Reddit For Good Volunteer Opportunities"}