{"title":"Smart Factory - Technical Leader","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJPGMdFPog0QYm8tj6NI9aj6RWcdqTjxYo2lFl6VU6nLRFknESdFwk154sjoU6RG-Kjy10PdKgd_YbOGvvNICBhzwAxkrIcINYd7Nedi2IST6wOK96BC1df-PUZgghJC1nmEJ3KIVG3jg0DByTvPgkGWguiCtJkPCbarbdhjtUcO169VB3Io1WeRIUy2IVN","source":"ziprecruiter","full_description":"Our client is one of the world's leading management consulting firms. They have teamed up with Wichita State University to create an immersive and cutting-edge experience center at The Smart Factory @ Wichita. The innovative space will be designed for customized, interactive client experiences, and will be furnished with Industry 4.0 technologies from leading manufacturing hardware and software solution providers, in pursuit of enhanced performance and value.They are currently seeking an experienced, hands-on Technical Manager to own the design integration and daily operations for The Smart Factory facility and its immersive environment. This role will work closely with teams across the organization to deliver an immersive experience for the consulting firms clients, alliances, sponsors, and partners. This role is self-directed, providing autonomy over the project management process as well as the application of technology throughout the experience center and the smart factory floor. Additionally, the Technology Manager will assist with coordinating, customizing, and leading client/visitor tours.The ideal candidate has a combination of manufacturing / supply chain technical (automation), operational, and client facing experience. This candidate should be a seasoned, dynamic leader and experienced project manager with a passion for creativity and strong working knowledge in design, engineering, production systems, project management, and the application of automated manufacturing technologies (Robotics, MES, PLCs, HMI, IIoT and emerging technologies such as AR/VR.Qualifications Required: Experience in manufacturing operations including software and hardware prototyping tools. Direct experience implementing Industry 4.0 technologies, both in the context of strategy and mechanical application Experience managing the maintenance and/or repair of the technologies showcased in the experience center and factory floor. Executive level experience Expertise in manufacturing enterprise systems such as enterprise resource planning, product lifecycle management, manufacturing operations management, manufacturing execution systems, supervisory control and data acquisition and building automation system as well as control systems and automation technologies. Preferred: Ability to solve complex problems, demonstrate critical thinking skills, and apply supply chain knowledge to smart factory concepts. Ability to effectively communicate through a virtual environment and is comfortable leading and speaking in front of medium to large groups. Familiar with a wide variety of basic manufacturing processes including machining, stamping, injection molding, etc. Basic knowledge of digital manufacturing technologies such as digital twin, artificial intelligence, and machine learning Consulting experienceATC-HOTJOB#ZRAffinity-55344"}