{"title":"Senior Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALItf3LN7NukVJaCusgPgUpjzN2ChB3ZHhl3-NAxCJmaRV73wtSH1jyRuuyA5o9gdzc1vh-Uu4Tt8UZybrJ7h6z1zsAV2wOcavnP3iulHYTcvZ9HHNsuq6uvAYNFqpInCPXPCCqvMaT_KUQ6LJg4w09MMCAaZFYsgzJ1UEp07YOrllGs0caK1HC5XUL0pUg","source":"ziprecruiter","full_description":"Senior Network EngineerInformation Systems DepartmentDirect Hire salaried role with Premium-Free benefitsCompany Overview: Subaru of Indiana Automotive, Inc. or \"SIA\", located in Lafayette, Indiana, is the only Subaru vehicle manufacturing facility outside of Japan. SIA is a 4.4 million square foot automotive OEM - meaning our manufacturing process begins with coils of steel and ends with the high-quality vehicles you see out on the roads. We employ 6500+ Associates, both production and administrative, all under one roof.SIA is the safest automotive manufacturing plant in the United States and is also a pillar in the community due to its numerous fundraising activities held onsite, donations to local charities and plentiful volunteer opportunities. SIA is a frontrunner in environmental conservation being the first Zero-Landfill automotive manufacturing plant and the first to have its campus designated a backyard wildlife habitat. SIA has grown tremendously since its 1989 beginnings and continues to be an example of success within the automotive industry.Outline of duties:Design and deploy networks (LAN, WLAN, WAN).Configure, and install software for firewalls, servers, routers, switches, wireless LAN controllers, and other network devices. Monitor network performance and its integrity.Troubleshoot issues through tiers of support.Ability to escalate by troubleshooting cloud and local infrastructure. Automate tasks, deployments, and monitor their effectiveness.Assist team members on technical issues, reporting network status to stakeholders.Maintain complete technical documentation.Suggest improvements to network performance, capacity, security, and scalability. Collaborate with multiple contractors while maintaining network standards.Develop network standards. Perform disaster recovery operations.Replace faulty network equipment when required. Schedule and communicate software and hardware upgrades and replacements.Minimum Qualifications:AS degree in Computer Science or Information Technology.5 years of experience in Cisco systems, WSA, FMC, ISE, BGP, LAN, WLAN, WANPython programmingMicrosoft Azure virtual networksVMware virtual routingExperience with various networking toolsAbility to repair, punch down, terminate, testing network cable.Project Management skillsPreferred Qualifications:Professional certification CCNP, CCDEBachelor's degree in Computer Science or Information TechnologySubaru of Indiana Automotive, Inc. is an equal opportunity employer committed to employing a diverse workforce."}