{"title":"Software Developer - Cloud NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJI1shj0W0hz85qpFpWslpJv4eYQMJ0j5XbTZADjkob6rpy3nynHxrb9o-iyzvi4zWcaqv3-8OZiaThP6QGpkLMJLaQAedQ4Ew7MkGdi-S3wq4t1Seh-ptlMaQdVN4TRuyABkgBXv10I_fho984mrCFHZHIyZlTQgH6MIxkhyf3PJIUzej7ocUaqCQTrgg","source":"ziprecruiter","full_description":"Software Developer - Cloud Country:US State:NEW YORK City:New York Category:Software Development & Support Required Education:Bachelor's Degree Position Type:Professional Employment Type:Full-Time Contract Type:Regular Company:(0147) International Business Machines Corporation Req ID:361162BR Travel Required:No Travel Min Salary: Max Salary: Currency: Location:New York, NY US View Full Description Introduction Software Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of. Your Role and Responsibilities As a Software Developer on the Cloud Pak team, you will be working as part of a full-stack team developing the next generation of AI-infused infrastructure management features used in our premier hybrid cloud management product. Working in an agile environment, you will be part of a multi-disciplinary squad working on the core management framework within the large global development product group. Your work will involve close collaboration with Architects, DevOps Engineers and Offering Managers across our global organization. Responsibilities Include... Work as part of a development squad to deliver quality software product for enterprise IT management Follow Agile development methodologies/best practices to produce quality code and documentation deliverables Participate and present at regular playbacks to the broader team, showing the output of the squad Contribute to and implement functional specs/designs to feed into a larger system architecture Deliver customer value through innovative solutions that address customer business problems as well as working with the Customer Support team to help resolve issues that customers encounter Today's operating environment demands a stack that's responsive to the innovative enterprise - one that can leverage all data types & access the latest technologies. Be part of a diverse and global team of thinkers and doers - people who want to make an impact, cultivate their expertise and collaborate with some of the world's top business and technology professionals. We're hiring ...JOIN US. Keywords... #architecture @IBMCloud #vm #infra #SCRUM #k8s @caffeinate_adam #openshift #agile @LifeAtIBM #docker #linux #icp4d #swdev #opensource #ManageIQ #icp4mcm #containerization #PostgreSQL #RoR #rspec #manageIQ #golang #cplusplus Required Technical and Professional Expertise 5+ years experience developing software products in the enterprise IT domain, specifically dealing with infrastructure management 5+ years experience in open source development, having directly to contributed to a leading open source project and having attained status in a well-known community Deep expertise in traditional VM based infrastructure (VMware, KVM, Open Stack), in containerized infrastructure (Kubernetes, OpenShift, Docker), and in a wide variety of cloud providers (Amazon, Google, Microsoft, IBM) Expertise in Ruby on Rails development in large scale projects Expertise in SQL, preferably PostgreSQL Knowledge of unit testing frameworks, preferably RSpec Knowledge of distributed version control systems, preferably Git Strong communication skills and the ability to work in a fast-paced environment with remote office locations Willingness to roll up your sleeves and do whatever it takes Preferred Technical and Professional Expertise Expertise and status in the ManageIQ community About Business Unit IBM's Cloud and Cognitive software business is committed to bringing the power of IBM's Cloud and Watson/AI technologies to life for our clients and ecosystem partners around the world. IBM provides you with the most comprehensive and consistent approach to development, security and operations across hybrid environments-with complete software solutions for business and IT operations, development, data science, security, and management. Our experts and software capabilities help organizations develop applications once and deploy them anywhere, integrate security across the breadth of their IT estate, and automate operations with management visibility. With IBM, you also have access to new skills and methods, governance and management approaches, and a deep ecosystem of industry experts and partners. Your Life @ IBM What matters to you when you're looking for your next career challenge? Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust - where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible. Impact. Inclusion. Infinite Experiences. Do your best work ever. About IBM IBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. Location Statement For additional information about location requirements, please discuss with the Recruiter following submission of your application. IBM intends this job to be performed entirely outside of Colorado. Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}