{"title":"Technical Report Writer, Temp","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIJJsZDBgpI10_LwvMS-javDXSbZwGY7KyfFS7fu22LkPPAc3OT80wrBQo6GLfizLL1sRzPdlU_4bZapYjmr7A-tg2rkkXhr0EgKvUUmkur8o4SFlpSidleC8WEQaFRj8isLYsW3pbx7F9AIYC4s-AfJeb4vcszIrZz7V1HbHeIcRq4xIcwTbJwY1GjCuLm","source":"ziprecruiter","full_description":"**Overview**Element has an opportunity for a **Technical Writer, temp** to join our growing team. This Technical Writer is to produce high quality written reports that detail test processes and results to meet client expectations.**Responsibilities**+ Produces high quality written test reports that detail test processes and results to meet client expectations, applicable standards, and are appropriate for their intended audience + Organizes material and completes writing assignment according to set standards regarding order, clarity, style, conciseness and terminology + Selects photographs, drawings, sketches, diagrams, and charts to be included in publications + Reviews and incorporates charts, graphs, or forms into reports + Adjusts documentation as necessary and proofreads reports for grammar and spelling + Ensures report fields flow in the correct sequence + Maintains records and files of work and revisions + Edits, standardizes, or makes changes to material prepared by other writers or personnel + Consults with customer representatives to establish technical specifications and to determine subject material to be developed for publication + Works collaboratively with technicians, engineers, and management to ensure that end product meets customer needs + Applies the principals of 5S (Sort, Set In Order, Shine, Standardize, and Sustain) in the performance of daily work responsibilities to ensure a clean, orderly, and safe work area + Abides by and ensures that all duties are performed in accordance with all Safety, Health, and Environmental (SHE), Trade Compliance, and Quality practices, policies, and regulations + Maintains client confidentiality at all times**Skills / Qualifications**+ Bachelor's degree from a four year college or equivalent combination of education and experience + Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or government regulations + Ability to write reports, business correspondence and procedure manuals + Ability to effectively present information and respond to questions from groups of managers, clients, customers and the general public + Self-disciplined and self-motivated + Proficiency in Microsoft Applications (Word, Excel, Outlook) + Ability to maintain professional candor at all times and remain calm when faced with mounting pressure related to deadlines and multiple priorities + Well-developed verbal and written communication skills to meet a variety of communication needs + Strong and effective interpersonal skills that foster open upward and downward communication built on mutual respect + Ability to interface with clients to determine their needs and provide a satisfactory outcome + Experience working with Quality Management Systems (i.e. ISO 17025 and ITAR Regulations) and Trade Compliance Regulations (i.e. ITAR or EAR) is desired but not required + Exhibit professional sense of organization, cleanliness, and presentationWe are pleased to offer the selected candidate a comprehensive benefits package inclusive of medical, dental and vision, 401(k) retirement, and Life Insurance/AD&D in addition to a basic salary between $41,600.00 and $52,000.00 USD.NOTE: This position requires access to export-controlled commodities, technical data, technology, software, and services. U.S. citizenship, U.S. legal permanent resident status, protected person status under 8 U.S.C. 1324b(a)(3), or U.S. Government export authorization is required. Any offer of employment is contingent upon the employer obtaining the necessary export authorization, including, if required, an export license from the U.S. Department of Commerce's Bureau of Industry and Security, the U.S. Department of State's Directorate of Defense Trade Controls, or other applicable government agency.**Company Overview**We are Element, one of the fastest growing testing, inspection, certification and calibration businesses in the world.We deliver critical services in Materials Testing, Product Qualification Testing, Certification, Device Calibration and Advisory Services to the Aerospace, Oil and Gas, Transportation, Industrials, Fire and Building product, Infrastructure and other leading sectors, where failure in service is simply not an option.Everything we do helps our customers to build better products; get their products to market on time; save them time and money; and minimize the risk associated with product development and production.Our mission is simple: to be the best testing partner in the world and together we strive towards a common vision of becoming the world's most trusted testing partner.We have four values that we strive to live by every single day.+ Safety - We keep our colleagues and visitors safe + Integrity - We act honestly and fairly to do the right thing + Excellence - We set new standards of excellence in everything we do + Partnership - We work together for the benefit of our customersWhen combined with our mission and vision, the ethos this creates, enables Element to deliver one thing. CERTAINTY. We exist to help make certain that the materials and products we test, inspect, certify and calibrate for our customers are safe, quality, compliant and fit for purpose.**Diversity Statement**At Element, we always take pride in putting our people first. We are an equal opportunity employer that recognizes diversity and inclusion as fundamental to our Vision of becoming \"the world's most trusted testing partner\".All suitably qualified candidates will receive consideration for employment on the basis of objective work related criteria and without regard for the following: race, colour, age, religion, gender, national origin, disability, and/or protected veteran status, or other characteristics in accordance with the applicable governing laws.**TIC Council Statement**Element is proud to be a full member of the Testing, Inspection & Certification Council (the \"TIC Council\"), an international association representing independent testing, inspection and certification companies.Members of the TIC Council must implement and abide by the TIC Council Compliance Code. Element has therefore issued an overarching Code of Conduct which is supported by our Compliance Programme. A copy of the Code of Conduct and more information about our Compliance Programme can be found in theGovernance and Integrity (https://www.element.com/about-element/governance-and-integrity) section of www.element.com .**Job Locations** _US-CO-Longmont | US-WA-Bothell | US-CO-Longmont_**ID** _2021-6433_"}