{"title":"Embedded Hardware Engineer","location":"","salary":"","description":"","term":"$60,000 to $96,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAI8SxywoF1qkd1wne4pMaRLn4tvcwT0iBN3Oa6ln6SSD_Q7GoOc3gGRo8HCmlZ7AQhidsH5MD9OZakYITabs4FS6EHHiXyQSk_giMnBn6-JODPIfYpgMCxUC7I70NPAZbfCGx4-8RAVDPy5qDdYaDQhC2pE3SJXpsr0yzBaFcrN354d7dnNGWEtw9HkTlg","source":"ziprecruiter","full_description":"We are looking for an Embedded Hardware developer who is also knowledgeable in the field of software development for embedded devices. While your main task will revolve around electronic circuit design and hardware testing, you may also assist in the development of software to test your hardware as well as software tools for writing our firmware in production. The selected candidate will be an integral part of the entire process from the initial idea to the finished product and should be prepared to work with manufacturers and PCB design subcontractors as necessary. Deep expertise in firmware development is a plus. This position requires a high degree of flexibility as well as analytical and interpersonal skills. If you are interested in contributing to the success of our IoT product, we are excited to hear from you.Required Skills:· Excellent coding with C and C++· Proficiency working in an embedded Linux environment· Some experience with ARM, RTOS, YOCTO and/or embedded Linux· Experience in both user and kernel space.· Experience writing automated tests for embedded systems· Excellent communication skills and attention to detail· Debugging and troubleshooting skills using GDB, OS trace tools, protocol analyzersNice to Have:· Experience developing test plans and procedures for complex systems includingrequirements/test traceability· Able to work effectively in a remote work environment and deliver on all key milestones/goals· Prior experience with ISO26262, functional safety, code coverage and static analysis, safety-oriented coding standards· Strong understanding of HW process· Ability to read a schematic and implement compatible software features· Automotive software development experience· Experience with basic peripheral interfaces and protocols such as USB, WiFi, GPS, CANExperience:software engineering: 1 years (Preferred)c++: 2 years (Preferred)c: 2 years (Preferred)"}