{"title":"Hardware Engineer - Electrical/Electronic Job","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKj9b9PuaHv5d4eDQqBJ8eNHIIkcVIFoRTO1WWGRpHRn7Vcg2-LMogmvjI6XsTVdTHbWK9Wt0Xv5izzVIA9tKy8D1ujeEbdzmf3fLsyKFVyDJZlBjL0SixmHfmW7fTtjo7gi_-C8okZhSt_cyqxsb9DMUO2KW1LB9nFdSa0uXXvKYBRoYEx0aLrSS0aKiep","source":"ziprecruiter","full_description":"WHAT DOES IT TAKE TO FEED A CHANGING WORLD?Our business has always been about solving practical farming challenges. As a provider of intelligent, transformative, farmer-centric solutions, we are primed to meet the needs and demands of our ever-changing world. All across the agricultural value chain, we collaborate with forward-thinking producers who share our vital purpose: to help feed the world with smart solutions for sustainable agriculture.WHO WE ARE LOOKING FOR:We are seeking a Hardware – Electrical / Electronic Engineer for our Hesston, Kansas location. In this role, you will be responsible for coordinating the identification and resolution of complex issues with an objective, fact-based and professional approach, ensuring work processes are organized, proactive and structured, facilitating processes to build trust with stakeholders and lead by influence and work successfully in a multi-national, intercultural teams environment. WHAT YOU WILL DO:Evaluate electrical and electronics hardware trends and help provide direction for Hardware needs and vehicle integrationCoordinate specification and selection process of embedded ECUs, gateways, electrical components, electronic modules and required Functional Safety levels for worldwide applications.Outline and evaluate design options, research existing solutions and interface with suppliers to procure embedded electrical and electronic hardware and software modules or components. Collaborate with teams physically located in other countries and will work in an agile team setup within a scrum team.Provide technical support in the investigation of eventual field issues.WHAT YOU WILL BRING:Bachelors' degree in electrical engineering or comparable field of study.3+ years'electrical and electronic hardware design or specification, validation and integration experience.Experience with analog and digital circuitry and microcontroller technology.Experience in ECU specification and development, CAN, Serial, and Ethernet communication protocols.Experience defining requirements for safety-critical systems.A PLUS IF YOU HAVE:Experience and/or a strong interest in automotive, agricultural machinery and working in agile teams.Knowledge of ECU's for AUTOSAR and/or ROS needs and related processing.Experience with automotive and/or off-road vehicle hardware integration optimized for EMC/EMI requirements.Experience with nuances of sensor interfaces and response rates. Experience in hardware homologation processes.Experience in Environmental Standards for qualification of embedded electronical and electronic hardware (ex: ISO 16750, AEC Q100/Q101…)WHAT WE OFFER:Experience our global diversity and enterprising spirit while helping us create innovative technologies and a positive impact that helps feed the world's nearly 8 billion people. From the day you decide to join AGCO, we want to engage and excite you and we're clear on where we want to go as a business and we trust you to help us there. Whether you want to learn a new skill or you aspire to do something different, we can help you develop the skills you need to take your career - and our business - to the next level.We also invite you to “Make the Most of You” - Benefits include: health care and wellness plans, flexible and virtual work options (where available), 401(k) Savings Plan with company match, paid holidays and paid time off, flexible spending accounts, reimbursement for continuing education, company philanthropic programs, company perks programs, and much more…Please note that this job posting is not designed to cover or contain a comprehensive listing of all required activities, duties, responsibilities and may change at any time with or without notice.AGCO is proud to be an Equal Opportunity Employer.We maintain a drug-free workplace and perform pre-employment substance abuse testing.AGCO is a global leader in the design, manufacture and distribution of agricultural engineering with a portfolio of exciting international brands which deliver solutions to farmers in 140 countries through a full line offer from tractors and combine harvesters to protein production systems and smart farming software solutions – to an environment where the future is happening now."}