{"title":"Sr. Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALo_uQe-__O-Ok9HhXUSntgPf_Cy4MH_mk2fiZAsI45FXlJGjDgohLfwQGtELBeOBXH6LoFV0UGIyF78OqiYe4JEwOz2jG51av0lQfhXkGYAqbbXeaViElcwPCYHHmvxY4ZqtykIHc_SbhgBc6xSv7YXbjGF4cAp172rPNunifXJx_hUgYXgi5e-UZgip2E","source":"ziprecruiter","full_description":"Sr. Software Engineer (Ruby on Rails) Sr. Software Engineer (Ruby on Rails) - Skills Required - Ruby On Rails, API, JavaScript, REACT, Ember, NODE, SQL, PostgreSQL, MySQL, EalsticSearchIf you are a Sr. Software Engineer with Ruby on Rails experience, please read on!We are a quickly growing software company that is helping to fill a gap in the industry we service. We're innovators that have created a solution to a problem wehre our customers can stay engaged through the process to make their business more efficient and create a long-lasting relationship with the people they transact with. We have a team with long standing experience that have helped to grow our business and product to new heights. Our culture is everything to us and are looking for someone to to join our team that enjoys what they do and also loves to have fun at work!This Sr. Software Engineer will be responsible for developing exciting new software and web applications specifically with full stack technology. You will be assisting in helping to continually advance and improve our product as we have been growing substantially and are expecting much more to come. In addition, you'll collaborate with an experienced team to ensure our support process is more efficient, get projects done in a timely manner and work as a team to be an integral part in the success of the company.Top Reasons to Work with UsGreat Compensation/Benefits -Steady room for growth -Make high-end tech products -Awesome family like cultureWhat You Will Be Doing Continue to develop and grow API's through features and enhancements - Work on and complete projects in timely manner collaborating with team and autonomously - Help maintain code and quality of our product - Scale the applications to ensure they can be maintain and advanced - Develop and come up with solutions for our web and mobile productWhat You Need for this Position4+ years of experience with: Ruby On Rails - API - JavaScript - SQL (Postgres, MySQL)Any of the below technologies are a huge plus: React - Ember - Node - Angular - EalsticSearch - Go - PythonSo, if you are a Sr. Software Engineer with experience, please apply today!Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.*Sr. Software EngineerCO-DenverJS25-1563180*"}