{"title":"Sr. Scientist / Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKB_Zu8g6byuVsYpv59AaFyTF9kKFr-HaV3w4OSjaUYmDE7rgt1nQb9Jv2_PAFvYJxr16_7GqpLljoK1hbw701j4V4ZzSVRPpcPLD0HnZbE7ETzf43c428Lb-ZB5OQueU1ETQ-d3EEjqPcP0_WGCS_wNJtzJc5SMZfwUicFPrnJMDqejN-RCz5xerZSHRQd","source":"ziprecruiter","full_description":"Overview Gryphon Technologies is a premier engineering and technical services provider supporting National Security programs. Gryphon is the federal Government's partner working in support of mission critical systems in every phase of their lifecycle. We are proud of our ability to help shape tomorrow, while ensuring today's U.S. and coalition forces can carry out their critical missions and tasks. Gryphon is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. Responsibilities We provide Scientific, Engineering and Technical Assistance (SETA) support to Defense Advanced Research Projects Agency (DARPA) in Arlington, VA. For sixty years, DARPA has held to a singular and enduring mission: to make pivotal investments in breakthrough technologies for national security.  We have an immediate need for a Sr. Scientist / Chemist in  support of the Defense Advanced Research Projects Agency's (DARPA) Biological Technologies Office (BTO).  The Scientist will support the development and management of current and planned programs at the intersection support the development and management of current and planned programs involving chemistry, advanced materials, scare resource harvesting, infectious disease, and chemical biology.  Existing programs are focused on atmospheric water extracting using novel Sorbents, the development of antiviral countermeasures using therapeutic interfering particles, and the development of antibiotic countermeasures using protein degradation strategies.   Ideal candidates will have experience in chemistry, materials science, infectious disease, antibiotic development, medicinal chemistry, drug development, protein degradation biochemistry, and/or chemical biology.  Duties will include but are not limited to: Supporting a program(s) within the Biological Technologies OfficeBriefing support and general administrative actions in support of the program(s)Travel may be required up to 10% of the time Qualifications REQUIRED EXPERIENCE: Active Secret DoD Security ClerancePh.D. in a field relevant to the support of chemistry, biochemistry, materials science, and/or chemical biology research related to programs for the DoDStrong technical writing skills, ability to communicate complex scientific ideas to broad audiences, digest basic and applied research across areas of biotechnology and apply to defense capability gaps, and a willingness to explore the scientific literature for emerging biotechnologyAbility to handle a wide variety of tasks, to include briefing development in PowerPoint and general administrative tasks One must have good written communication, interpersonal, problem-solving, analytical, mathematical, and organizational skills. Ability to follow directions is a must. Applicants must be able to work well alone and as part of a team. An Active Secret Security clearance is required. U.S. Citizenship required."}