{"title":"Senior Software Engineer - Backend","location":"","salary":"","description":"","term":"$140,000 to $180,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALpOUuzNLJOwuOj9crMymDZkDQmUZ3O7Jc1S9tDcnQB1z1LKRTFRfUW5CU-H1jpH_xaH4IbgKYO5_9qWGjYDTfq8x7_DwXAPhRnrlUX0Nz78o-w8BZNwzZkOl1HUjeAlY_Ez9Nio2vWSUS2kYWp6X73gvDd__DXGRNDatok3LfCAfWohbCW8EnhGmcGxs4","source":"ziprecruiter","full_description":"Senior Software Engineer - Backend If you are a Senior Software Engineer with backend expertise, please read on!Headquartered in booming Austin TX, we are a well-funded start-up focusing on fintech solutions for the mortgage industry! Due to growth and demand for our services, we are urgently looking to add a Senior Backend Engineer!Top Reasons to Work with Us- HUGE opportunity for growth!- Competitive base salary and equity! - Cutting-edge tech!- Well-funded start-up!What You Need for this Position- 5+ years of professional experience in software development- BSCS or equivalent technical degree preferred- Expertise with modern backend programming, including mastery with Node, Golang, Ruby, or Python- Experience with modern full stack JavaScript- Strong experience with AWS- Experience with Docker- Experience with Git- Experience with Microservices architectureWhat's In It for You- Competitive base salary ($140-180k DOE)- Equity!- Comprehensive benefits package (Medical, Dental, Vision)- 401k- PTO- Cutting-edge tech- Industry-disrupting software- Fun and innovative company cultureSo, if you are a Senior Software Engineer with backend experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}