{"title":"Software Engineer - MicroK8s NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKmIw4tVkw1x61P3XQLvgZ_u25lVTHNuC32SbkcwSVekKggIraAs5nIrD8bQ7J0aPbhdCHX8usvVSVK_rh8sA8lw7cThRZFMLpAcWVYPFHLPnj-sNWCZJfI15ZlUYCnQ-OgL0NZMb8-ywT73t0b1_ur8xg_G9sYgCdDKfJAMaj5tZWut21REM4GZTAjm4g","source":"ziprecruiter","full_description":"SummaryThis is an exceptional opportunity for a software engineer passionate about open source software, Linux, and Kubernetes. Come build a rewarding, meaningful career working with the best and brightest people in technology at Canonical, the growing international software company behind Ubuntu.As a software engineer on the MicroK8s team you'll define Kubernetes at the edge building MicroK8s, our popular low-ops, self-healing, highly available Kubernetes. Engage the Kubernetes community, represent MicroK8s and Ubuntu at KubeCon, and use your Python and Go skills to deliver exciting new features to thousands of enthusiastic users. Join our globally distributed team and help build the next generation of container technology for devs, cloud, clusters, workstations, Edge and IoT.What you'll doCollaborate with a distributed MicroK8s team and wider Canonical engineeringWrite high quality code to create new featuresDebug issues and interact with a vibrant communityWork with talented engineers including experts in many fieldsDiscuss ideas and collaborate on finding good solutionsWork from home with global travel 2 to 4 weeks for internal and external eventsWho you areYou love technology and working with brilliant peopleYou have a Bachelor's or equivalent in Computer Science, STEM or similar degreeYou have interest in and experience with KubernetesYou are a Python programmer with interest or experience in GoWe are proud to foster a workplace free from discrimination. We truly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better platform for our users and customers. This is something we value deeply and we encourage everyone to come be a part of the world of Ubuntu."}