{"title":"Java Developer III NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJmzrmDTFT6mPbRHd7TbsrfgNoXL5WB-0eErdTi7RRQnXDTJ6WOsmojkETxDfSPdInvAHfL03EnLS0IYI2DB8aqj3OcpSCsw9oYUshP9W_x43pWVKZnH07ARdyLXW9A6pMeZRhrDoK3YzqwP9q-7eE6mAsWIYrPiuZjbOIO1Dt0aqmBjvrpASp_YQTsLQ","source":"ziprecruiter","full_description":"Developer III - Estimated 6 Month ContractDescriptionFinding innovative solutions is the goal of a Developer III, and you will collaborate with your project team, senior management, and clients to get there.Responsibilities/Expectations:Solve complex problems; take broad perspective to identify innovative solutionsLead teams or involved in complex projects as requiredAnalyze and develop short and long-term solutions to information technology (IT) needsCoordinate with users to determine IT requirements and provide IT services to internal clientsReview system requirements and business processes; code, test, debug and implement software applicationsProduce quality functional and technical documentationCollaborate effectively with clients, project team and senior management to develop solutions that facilitate the integration of business processesRecommend solutions based on business requirements within an enterprise environmentProvide technical leadership within a wider virtual team, mentors other team members and ensure projects stay on scheduleOther duties as assignedTechnical Requirements:5 – 8 years’ of IT experienceMinimum of five (5) year experience programming in Java, Object-Oriented programming concepts and design patternsMinimum of five (5) year experience programming in browser technologies including HTML5, Angular, Javascript, Jquery, CSS3Minimum of five (5) year experience programming in database technologies including MS SQL Server 2008 or higher, or Sybase/ASEDemonstrates excellent organizational/interpersonal skills and safety as the utmost priorityOther Requirements:Work location is Houston, Texas. Remote working is not currently accepted.Education/Years’ of Experience:Required: Bachelor’s Degree in IT-related field or equivalent experience."}