{"title":"Chemistry Analyst II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIGGAqA04j2HW-9EcJf84XGr5iC-nLN_FXdWhnzY-tfbeBk5npcOicj6mzTiHq9Gi9Sfhlk2iM6npf5N-BkW775039F23th7BIPfnDwEq5kPJ0NIfnCBy9HWS7gL8-Q_nDY8llrOONDOoKoZ-2ryZldw80Kl-qRsUyWPLVEgH0T5Lc3_0mCBgEO5dDVH46-","source":"ziprecruiter","full_description":"FLSA Status: Non-ExemptPosition Summary:Will work under limited supervision performing chemical and instrumental analyses or be partnered with an experienced analyst to perform wet chemistry analyses, preparation of reagents, standardization of solutions, and instrumentation testing and documentation in a cGMP environment. May be cross-trained to work in other laboratory areas as dictated by the needs of the department.Essential Duties & Responsibilities: Chemical and instrumental analyses of pre- and post-sterilization solutions and raw materials Verify routine testing for completeness and accuracy. Investigate inconsistent results and propose possible causes and solutions, including documentation of the investigation via applicable laboratory investigation/exception report documentation system. Maintain accurate records and compile reports using lab data. Resolve production problems through special projects, in conjunction with supervisor. Evaluate analytical data to determine compliance with established specifications. Complete daily room check to verify TS, S expiration dates and calibration dates. Train new analysts in daily operations and paper flow. Perform preventative maintenance (PM) and trouble-shooting of all instruments used in the laboratory. Set daily and weekly short term goals to ensure timely release of test samples and documentation. Responsible for daily housekeeping, organization, and lab safety. Adhere to cGMP's, SOP's and plant policies/procedures. Lead and/or support projects as assigned. Perform other related duties as assigned or required.Knowledge, Skills & Qualifications: Must have technical writing capability and be familiar with validations and qualifications. Capable of operating complex instrumentation with limited supervision. Must be able to apply standard scientific principles, methods and techniques to trouble-shoot and resolve common analytical problems and technical service requests. The individual is expected to resolve routine analytical and quality problems with limited assistance and supervision. Position requires an understanding and capability of performing maintenance on laboratory instrumentation on a daily and monthly basis. Must be able to manipulate algebraic equations on a daily basis. Must be able to use mathematics to solve routine problems. Must be able to trouble-shoot and resolve a myriad of routine instrumental problems. Must be self-directed and demonstrate good organizational and time management skills. Must possess good communication and writing skills and be able to work effectively with all levels of individuals within the organization. Must be able to perform tests quickly and efficiently without sacrificing accuracy, safety or quality.Education and Experience: Bachelor's Degree is required: Chemistry, Chemical Engineering, or Chemical Science (other science degrees will be considered). Two to three years recent analytical instrumentation experience; or a BS degree in Biology with 4 years recent analytical instrumentation experience.Minimum Qualifications: Must be at least 18 years of age.Travel Requirements: Typically requires travel less than 5% of the time.Physical Requirements and Work Environment: Must be able to work flexible schedules, including overtime, in response to work demand. Types of problems encountered: Individual will generate data that will be used as the criteria in the decision to continue or stop manufacture of solutions and filling process. Office and laboratory environment. Must be able to lift 20 lbs unassisted.ICU Medical is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.**Title:** *Chemistry Analyst II***Location:** *TX-Austin***Requisition ID:** *21300125*"}