{"title":"Contract Quality Chemist NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AALo7CVcloH8VRhCKCBVt506KImIzpsILNfm9vr53GO3emqNKYgD3gYnrXsGsxwmfQqqxuokfdvZljNZ9G4dd-qVLxFi9AIaBWjPbZI3KvPW6bcb23wEQ3rSpMEZZxcKrW-tsdj16iGTFYmEsYGySxypEklifZQoZvBcbz9LALGctwrZIj5qNmJX_TKZ72M","source":"ziprecruiter","full_description":"Title: Contract Quality Chemist (2nd or 3rd Shift)Location: Orangetown, NYDuration: 12+ Month ContractAbout the Company: A global pharmaceutical company Benefits: Real Staffing offers medical, dental, vision, 401K, voluntary life insurance, short term/long term disability.The job of the \"Chemist\" is simply described as an individual contributor who performs testing of samples of various types using various techniques or equipment in the QC laboratory. The job itself may be further modified on an individual assigned basis or sometimes to specific testing group. The role may be further modified based upon individual education, training, experience or a combination of all three.Responsibilities of the \"Chemist\" include but are not limited to the following:Conduct routine testing or other analysis in the group or department setting.Conduct advanced testing or critical testing, as required.Participate in investigation activities.Ensure compliance to all data integrity and cGMP practices, procedures, and expectations.Specific duties and responsibilities as assigned by the department.Qualifications include:Must have High-Performance Liquid Chromatography (HPLC) experience Bachelor's degree (BS or BA), physical sciences preferredProficiently communicate and understand (read and write) scientific / regulatory based 'work\" in EnglishHave excellent organization, learning and teaching skills required to work in teamsAbility to understand and analyze complex data sets.Strong desire towards continuous improvementKnow how to use Microsoft Office programs and other scientific based software.Working conditionsThis role works in a cGMP laboratory or manufacturing environment, where personal protective equipment is required, which may include uniforms, lab coats, safety glasses, respiratory protective equipment, hearing protection, etc. Work with or around solvents, powders, or other materials commonly found in a pharmaceutical laboratory or manufacturing facility is required. Sthree US is acting as an Employment Business in relation to this vacancy."}