{"title":"Chemistry Modeling Scientist Intern (6 months beginning in Summer 2021 NEW!","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AALFcSfjjhxsrwtgc0tAxwwNOmh5zdYdoukxb8K2D9eNTVsLXDLBgQ6a--vtf4E-VpeAn-ue3jN19Ctu_pQLuVdQriYYcrAtjwS8s0ADPd0Nd6xIqCrfVH-tfFvn7wrhIVUC8izFx51q8BueMcC-MNEsKST1PoGoRMZQcFyyD8bzUangVD1b0iB7DrdEHyQ","source":"ziprecruiter","full_description":"null Job Title:Chemistry Modeling Scientist Intern (6 months beginning in Summer 2021Job Description:Responsibilities: Build chemical models to better understand and optimize dispensing and coating processes. Modeling potentially adsorption, electrochemical, and chemical reactions on semiconductor surfaces (metals and dielectrics). Building chemical models into simulation software to optimize tool design. Interfacing with development team to define project strategy and deliverables. Fully documenting work in order to provide colleagues with enough detail to maintain engineering simulations and/or code. Strong emphasis is placed on candidates that can find solutions to difficult problems through structured project management while working in a team environment. Good communications skills are considered critical. The candidate will communicate project goals and status updates internally.Typical Education and Experience The candidate is pursuing a M.S. or PhD degree in Chemistry, Physics or equivalent field specializing in the area of Computational Chemistry. Must be legally authorized to work in the US without Sponsorship.Requirements: The candidate is pursuing a M.S. or PhD degree in Chemistry, Physics or equivalent field specializing in the area of Computational Chemistry. Knowledge of Fluid Dynamics, Solution Chemistry, and Quantum Chemistry. Experience modeling atomic interactions with Molecular Dynamics software. Experience with LAMMPS software is desirable. Experience with Coarse-grained modeling is desirable. Knowledge of the semiconductor industry is desirable. Knowledge of directed assembly on substrates is desirable. Prefer a candidate available for 6 months, minimally for summerPhysical Demands and Work Conditions The physical demands described herein are representative of those that must be met by an employee to successfully perform the essential functions of this job. This job operates in an office setting. This role routinely uses standard office equipment such as computers, phones, photocopiers, and filing cabinets. This is a largely sedentary role; however, some filing is required, which would require the ability to lift files, open filing cabinets and bend or stand as necessary. This position requires the ability to occasionally lift office products and supplies, up to 35 pounds. This position also requires 4 to 6 hours per day at a computer screen/keyboard.Diversity creates an innovative culture. TEL US is an Equal Employment Opportunity / Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.Equal Opportunity Employer/Minorities/Females/Disabled/VeteransState/Province:TXCity:AustinSubsidiary:Tokyo Electron America, Inc."}