{"title":"Auto Mechanics","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJR8xX3zjGqFHyhkI0D4LU_90s26NoFGkD6VWGGd91m4C8KkNhs9OfvJAnGjdQlCV1jq8hLSJEcIyDkzm4N5BgmLHeb9qyMl8R1mlawJU8KsDP4IjaCB-4WPxogPQxiIepprldmhZDwnhZlcBX1XXBi17A4i9PMzeYe1-Xv82AulE3QxVsi2ty8c9nY4NA","source":"ziprecruiter","full_description":"925 N Rawhide Drive, Olathe, KS 66061AUTOMOTIVE MECHANICS Competitive Pay and Benefits!Bud Brown Volkswagen is locally owned and operated and we've been in the Automotive Dealership business for over 50 years. We are the top-rated Volkswagen store in Kansas City area. We believe that culture makes a difference and we focus on building relationships that last. That means relationships with our employees, our customers, and our community.What we offer: Competitive Pay Plan!Health, Dental and Vision Insurance401(k) Retirement savings planPaid vacation after one yearFamily-like work environmentOn-going Volkswagen trainingOpportunity for Advancement!Responsibilities - Mechanic:Receive repair orders from dispatcher and take to stall area.Perform work as outlined on repair order.Ensure that all repairs required are made accurately and efficiently.Diagnose malfunction and perform repair.Keep abreast of factory technical bulletins.Keep shop area neat, clean, and be able to account for all dealership-owned toolsQualifications - Mechanic:High priority must be put on customer satisfactionAt least 2-3 years’ experience as a mechanic requiredHigh school diploma or the equivalent.Valid driver's license and a good driving record.All applicants must be authorized to work in the USA.Must pass pre-employment testing to include background checks, including MVRWe are an equal opportunity employer and prohibit discrimination/harassment with regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."}