{"title":"Juniper Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKRNKB-g5hatYVE1fpFI2obYeD7ttVss9AnDd-TZEJMGUGjkeDqDMzPqXrmn4ynYOKTwVvZ82rQrLOsKApCNe9r9IeIi2RQjnrk2eWi6-pcYe1N7ELIfjK7DkL9cI8vziBGmOo-GzGMe5_d6N_Ri7bviqYL4SlCUCPDL3-3F43TYJDWs0y25-8xcT-6iEep","source":"ziprecruiter","full_description":"The Network Engineer will be responsible for maintaining several small networks used in a development and testing lab environment. The network engineer will work with system administrators, system architects, production WAN service provider, and information assurance (IA) teams during the software development lifecycle to implement network changes as required for development and testing, and make recommendations regarding hardware and software acquisition to support network operations, reliability, and security. This is a full-time client-site position; remote work may be authorized as needed to comply with Covid-19 restrictions, but expectation should be to support daily core business hours in the lab.Required Qualifications:Bachelor’s Degree in relevant field (e.g., Computer Science, Information Technology) and minimum of 5 (five) years of work experience in the Networking, System Administration, or Information Technology field. Relevant master’s degree or additional years of experience may be substituted for a non-IT-related bachelor’s degreeFamiliarity with networking monitoring tools, troubleshooting, network design, maintenance, and industry best practicesExperience with network configuration management, firewall troubleshooting, and implementation of security best practices as outlined by DoD guidanceUnderstanding of TCP/IP routing, subnetting, and layer-2 switching infrastructureAdvanced technical troubleshooting skills, analytical problem-solving ability, and organizational skillsStrong oral and written communication skills in technical, business, and client interactionsAbility to explain complex networking concepts to less-technical stakeholdersCompTIA Security+ certificationAdditional Desired QualificationsMicrosoft MCSE, Microsoft Azure Solutions Architect, and/or CCNA certificationsJNCIA-JunOS / JNCIA-SEC preferredCore responsibilities include: Maintaining network configurations, updating configurations as needed, troubleshooting issues that arise on the networksDeveloping and maintain physical, logical, and dataflow diagrams/documentation for various networksDeveloping Standard Operating Procedures (SOP) for each work item.Serving as the network SME and liaison for the lab environment Establishing a network backup policy, monitor, troubleshoot and improve current Network Monitoring Solutions, and comply with DoD issued regulationsConsulting with individual system architects and providing recommendations for network design and integrationModifying switching and routing infrastructure to support multiple overlapping development and testing effortsWorking with System Administrators, Integrators, and Information Assurance teams within the lab to achieve project goalsAbout Bowler Pons: Bowler Pons Solutions Consultants, LLC is a fast-growing Minority-Owned, Veteran-Owned 8(a)-certified Small Business based in Annapolis, MD. We provide cutting-edge solutions and comprehensive support for our client's toughest challenges in the fields of physical and cyber security, IT and network administration, and systems engineering. Find out more at www.bowlerpons.comPowered by JazzHRsfu2B9BhTH"}