{"title":"Technical Specialist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKgdqG0_OOj3u8eJo-bQGbDFYc3YDKYzwiBA6Ivj95OuCYNb2ahmgy6D7WBUCBfJZ3JaNHgXa-0VXhYiHDw5KRrDee1Lo3rKQnVHAIOQJCYnyN7eT7HGJrC3sGchyKB-yJxBHO-a-CVUE8A_RUec1zo3phElNs8IsCti618ZO6gVyeApLFBM4NBdzEe8Ttp","source":"ziprecruiter","full_description":"Technical Specialist United States New Information Technology12 hours agoPost Date21201102Requisition #Apply for JobShare this JobSign Up for Job Alerts CTG is seeking to fill aData Analyst opening for our Fortune 100 client.Project Location: Remote, Eastern time zone preferredProject Duration: 12 months+As a Technical specialist, you will be responsible for the following:* Hybrid Cloud, RedHat background with focus on Data Management * Enhancement and usage of sizing tools related to the IBM data management suite of offerings. * Provide sizing support and consultations to field reps and business partners for the products/solutions related to data management suite of offerings * Assist in planning and budgeting for a deployment of IBM products in cloud, on-premises, and hybrid configurations. * Prepare technical write-up for tool development to convert existing tools to new platform(s), analyze existing tools formulae, workflow, and inner workings and direct product development teams to create applications in new platform(s) * Overall understanding of IBM Hybrid Cloud portfolio, knowledge of IBM Cloud Paks preferred * Provide Architecture Review assessments and assistance to the field reps * Review performance reports to enhance / update / maintain existing tools Roles & Responsibilities:* Develop and maintain spreadsheet and online-based sizing tools * Update performance data * Interface with field reps, business partners, and clients to gather expected workload volumes and other functional and non-functional requirements * Develop and deliver recommendations based on client input, best practices, and performance modeling * Maintain relationships with product management and performance leaders to keep sizing processes current * Engage in development of new offerings and tools for Technical Sales community Technical Skills and Expertise:* Strong skills in RedHat - certification preferred * IBM Cloud Pak for Data preferred * JavaScript * TypeScript * React * Node.js * Microsoft Excel * The specialist should have skills related to the performance and architecture of data management offerings including: * Db2 * Db2 Warehouse * InfoSphere Information Server including Information Analyzer * Cognos * Master Data Management AE and SE * Ruby or Python * Deployment of these offerings in a container-based environment including OpenShift and understanding of IBM Cloud Pak common services is a plus * Programming skills for maintaining sizing tools and performance data: * Proficient at Excel spreadsheet programming, macros and/or Visual Basic, Access for spreadsheet-based tooling * Programming experience using Python and/or JavaScript for maintaining on-line tools and for analysis of performance data * Familiarity with target deployment environments including: * IBM Cloud and competitor cloud offerings including Amazon AWS and Microsoft Azure * x86 and Power server configurations for on-premises deployments * Strong written and oral communications skills * Working and networking with different teams such as Performance Engineering, Product / Offering Management, Technical Sellers, Business Partners, Lab Services, GTS/GBS, executives to grow and evangelize the Service Offerings as well the business is a key objective for this position. Suitable candidates should demonstrate proven experience. Excellent verbal and written English communication skills and the ability to interact professionally with a diverse group is required.CTG does not accept unsolicited resumes from headhunters, recruitment agencies, or fee based recruitment services for this role.To Apply:To be considered, please apply directly to this requisition using the link provided. For additional information, please contactRoberta Allegrino at 888-284-6551 ext. 2113 or roberta.allegrino@ctg.com. Kindly forward to any other interested parties—thank you!CTG’s Benefits Plan allows you to select insurance coverage that best suits your lifestyle, and take part in our savings programs and educational plans. We offer Flexible Spending Accounts, a 401(k) Retirement Plan, and an Employee Stock Purchase plan. Our educational plan comprises access to more than 2,000 web-based technical, professional and business development courses. CTG (NASDAQ: CTG) has developed a reputation for responsiveness and reliability - traits that our clients say set us apart - since our founding in 1966. As one team, we create and deliver information and technology solutions that make our clients more successful and cultivate a workplace that attracts and develops the best people. Our vision is to be an indispensable partner to our clients and the preferred career destination for information and technology experts. CTG has operations in North America, South America, Western Europe, and India and regularly posts news and other important information online at www.ctg.com.Our culture is a direct result of the people who work at CTG, the values we hold, and the actions we take. In other words, our people are the culture. It's a living, breathing thing that is renewed every day through the ways we engage with each other, our clients, and our communities. Part of our mission is to cultivate a workplace that attracts and develops the best people, reflected by our recognition as a Great Place to Work-certified company across many of our global operations.CTG will consider for employment all qualified applicants including those with criminal histories in a manner consistent with the requirements of all applicable local, state, and federal laws.CTG is an Equal Opportunity and Affirmative Action Employer. CTG will assure equal opportunity and consideration to all applicants and employees in recruitment, selection, placement, training, benefits, compensation, promotion, transfer, and release of individuals without regard to race, creed, religion, color, national origin, sex, sexual orientation, gender identity and gender expression, age, disability, marital or veteran status, citizenship status, or any other discriminatory factors as required by law. Our Affirmative Action program serves to promote occupational equality and diversity through good faith efforts. CTG is fully committed to promoting employment opportunities for members of protected classes. Additional Information * Job Function: Data Science & Analysis * Education Level: High School Diploma/GED (11 years) * Work Remote: Yes * Travel: No"}