{"title":"Part-time Faculty, Chemistry","location":"","salary":"","description":"","term":"Part-Time","detail":"https://www.ziprecruiter.com/k/l/AAL4_Kkb0jAlsbzr4rMLiIVJ-KmXTHOa-q2EdjaMNIaHFVzwdKPQCq6ofZO4T-FfI3cKEJlVeIy1Mzihq0P6cajps-niFLsvTALLN2_5jH9NbJRW9icIlGVMDXDOZA6FOg8V7RrK0W0pqa5DaxWVWZDmfsvzYOrwdMnoMOCZNFbJtlgntOlr3qv81zRTqoM","source":"ziprecruiter","full_description":"Chamberlain College of Nursing is pleased to announce new part-time teaching opportunities in undergraduate Chemistry courses for our Bachelor of Science in Nursing program at our campus in Troy, MI. Join us as we educate and empower extraordinary healthcare professionals who transform healthcare worldwide! Do you remember the professor who encouraged you to believe in yourself and in your ability to be the successful professional you are today? Now you have the unique opportunity to be that professor, to create the \"a-ha\" moment of sudden insight and comprehension that will change a nursing student's life forever. As part of our faculty team, you'll inspire our motivated students to realize their educational and career goals. Classes will meet 2-3 days per week online and include lecture and lab in 8 week Sessions, beginning in 2021. When we return to site-based teaching, face-to-face interaction in the lab and classroom will be blended with technology for an enhanced learning environment. The typical course of instruction may include: Introduction to General, Organic & Biological Chemistry with Lab (CHEM-120)This is a survey course that covers the lower division chemistry disciplines of general and organic chemistry and introduces the upper division discipline of biochemistry. The general chemistry section of the course seeks to build an understanding of basic chemical processes and states of matter by starting with the definition of matter and progressing through the atom, molecules, intermolecular interactions, chemical equations, and accounting. The organic chemistry section presents the major categories of organic compounds, including saturated and unsaturated hydrocarbons and oxygen- and nitrogen-containing compounds. In the biochemistry portion, students are exposed to the four major biological macromolecules with some coverage of enzymes and the central dogma of biology. Lab exercises relate to topics discussed. If you are passionate about helping others learn and advancing your career through the power of education, we want to talk with you today. + In this role, you will: + Become part of a dynamic team of educational professionals, teaching Nursing Students in a dynamic classroom/online hybrid setting + Implement and embrace Chamberlain College's Care philosophy, curriculum and course objectives by engaging students + Establish an environment conducive to student engagement by effectively planning and preparing for classes, responding quickly to student requests for assistance and ensuring that students enjoy a powerful learning experience + Identify opportunities to enhance student engagement through collaboration with colleagues who provide academic and professional guidance + Promote student success by demonstrating a flexible style and exhibit a passion for teaching by devoting time and energy to develop scholarly excellence + Engage with a diverse student body comprised of a variety of ages, cultural backgrounds, ethnicities and academic preparation + Foster a positive learning environment by keeping accurate records, submitting grades on time, and enforcing academic and attendance policiesYou are encouraged to explore this opportunity if you: + Earned a master's or doctorate degree in Chemistry or very closely related field with a minimum of 18 or more graduate credit hours earned directly in Chemistry.+ Have at least 15-credit hours of higher education teaching experience (highly preferred) + Possess genuine passion for nursing, education, and lifelong learning+ Have exceptional subject matter expertise as well as excellent written and verbal communication skills+ Are eager to serve students and colleagues with passion, respect and care+ Operate with a sense of responsibility and purpose with the desire to enrich colleagues, students and the broader community + Have a strong work ethic, learn from mistakes, build positive spirit and always look for a better way+ Put the team first, appreciate diverse points of view, assume positive intent, collaborate and communicate openly+ Are able to provide official transcripts (or course-by-course US equivalency evaluation by a NACES-approved evaluator) for all earned degrees from a regionally accredited institution Thank you for applying for this outstanding opportunity today! We are proud to be an EEO employer M/F/D/V. At Adtalem, we welcome everyone and have a strong commitment towards diversity and inclusion. We encourage our Colleagues to be their true authentic selves and support laws that prohibit discrimination everywhere we do business. We also maintain a drug-free workplace.Chamberlain University has a 130-year history and the mission to educate, empower, and embolden diverse healthcare professionals who advance the health of people, families, communities, and nations. We're 99,000 strong, with 31,000 students and 68,000 alumni armed with the skills, passion, and determination to make a difference in today's complex healthcare environment. By living Chamberlain Care, we've built a culture in which colleagues and students thrive and we graduate extraordinary healthcare professionals who transform the health of people worldwide. Our regionally accredited University is comprised of the College of Nursing and the College of Health Professions. Our College of Nursing offers a Bachelor of Science in Nursing (BSN) degree program at 22 campuses and online post-licensure degree programs and certificates including RN to BSN, RN to MSN, a Master of Science in Nursing (MSN) with six Specialty Tracks, and a Doctor of Nursing Practice (DNP). Our College of Health Professions offers online options with a Master of Public Health degree, Public Health Certificate programs, and a Master of Social Work degree. Learn more about Chamberlain University, part of Adtalem Global Education, at www.chamberlain.edu. Commitment to Diversity and InclusionWe pride ourselves in nurturing a culture that encourages everyone to bring their full selves to work each day. To us, diversity and inclusion needs to be intentional to be impactful. We don't just welcome differences, we celebrate them. #WeAreAdtalem To learn more about our commitment to Diversity and Inclusion, click here to visit our Diversity page. Req Number: 2021-117235 Department: Faculty FLSA U.S./Global Status: U.S. - Exempt"}