{"title":"Senior Electrical Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALtAclJYdP9ppI8glDaLLMoUn-XHbNw0tmXB_UQu_0Hr43ExpmRvCHUFIgbXw1kxz1Ut1cIYWPGwVCLH4rwfN5yIiNZEZVBrxDf-k7VI4XbRdORkJESJ9hH9pegBsMWun9CwFof12MlJlZ3oUengD-U8dfgG4B7Mo4zbwkmN2SGdjfSZpotDfuGuYFclhc","source":"ziprecruiter","full_description":"This opportunity is located in Tucson, AZ.  Remote friendly during COVID-19 You can apply to the job with this email address: senior_hardware_engineer_0c71eccd2@ivy.greenhouse.ioCompany OverviewCome join a higher calling and find a deeper purpose! As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking. While inventing the framework of Autonomous Driving, our current fleet of autonomous Trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy. TuSimple was founded half a decade ago with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable Autonomous Freight Network. Opportunity Overview The Electrical Engineering team at TuSimple is responsible for developing and integrating enabling systems as part of our self-driving overall systems. Our multidisciplinary team interacts with a number of teams across TuSimple and our supply base to create cutting edge productsRole ResponsibilitiesParticipate in system architecture definitionParticipate in system development, component selection, schematic design reviews, board layout reviews, signal/power integrity simulation reviews, bring-up, and debug of hardware and software systems integration.Collaborate with cross functional teams to support the product development, bring-up, debug, and release to productionDevelop functional specs, procedures, and other documentation required for integrating complex computing modules into self-driving systemsLead and supervise manufacturing boardsLead and supervise systems build, test, and debugSupport existing production products as requiredSupport EMC, functional safety, and worst case circuit analysis tasksInterface with our partners, JDM/ODM/OEM, & suppliersExperience & Skills Required Degree in Electrical Engineering or a related fieldExperience with DDR4 or LPDDR4Complex FPGA design including impedance matchingExperience in hardware development, testing & boards release to production.Systems experience in robotics, transportation, aerospace, servers, networking/communication, or similar industriesExperience in defining board circuit specification, designing PCBAs or guiding, selecting components, reviewing signal/power integrity simulationsDesign experience with automotive processors, storage and Ethernet productsExperience in designing, debugging, and managing high speed designsExperience in high available resilient redundant systems developmentExperience in release to production of complex productsProficient with schematic capture and layout tools. Altium, Mentor Graphics, Cadence or equivalentProficient with standard interfaces like, S/RGMII, SSD, PCIe, LP/DDR4, USB, I2C and SPI Bus.Experience with discrete switching/Linear regulators, and DC-DC convertersFamiliarity with WCCA, DFMEA, MTBF/FITFamiliarity with Linux operating systemsFamiliarity with high-speed signal integrity simulation and measurements methodologyGood debugging skills and problem solvingPreferred Skills and ExperienceExperience in system architecture definition Familiarity with CPLD/FPGA design Microcontroller programming skills (C/C++) TuSimple Benefits100% employer-paid healthcare premiums for you and your familyWork visa sponsorship availableRelocation assistance availableBreakfast, lunch, and dinner served every dayFull kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and moreStock options / equityGym membership reimbursementMonthly team building budgetLearning/education budget Employer-paid life insuranceEmployer-paid long and short disabilityTuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.This opportunity is located in Tucson, AZ.  Remote friendly during COVID-19 You can apply to the job with this email address: senior_hardware_engineer_0c71eccd2@ivy.greenhouse.ioBrown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,"}