{"title":"Software Developer - Campus Recruiting NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI98A_S29gJwca1iVJ8o0gqhl4ITrL1ahEVNAq-mpVmqwjSAGOkA3xv5bKaDhtN32nYwdRgrXpPgQumYAeHB5yNXee_uhQ9E3R_TE_XAS3UQ5UfG0m0IE__y-WPyeM6bXVeY_-4i9B1SNxlZRvqh_aIwtG-KNIqlmLWL2iiosrD0M4DnKUZQUEcbaoTkoY","source":"ziprecruiter","full_description":"Software Developer - Campus Recruiting Create your Profile | Sign in + Activate Career AlertsShare thisFind similar career opportunitiesSoftware Developer - Campus RecruitingCategory: Development/EngineeringCity: Denver, Colorado, United StatesPosition ID: J0820-1863Employment Type: GraduatePosition Description:Do you have a demonstrated interest in information technology and a passion for learning? Are you a go-to problem solver that is motivated to make a difference by tackling complex technical challenges leading to the creation and design of cutting edge solutions for our clients? If so, joining CGI as a Software Developer could be the ideal opportunity for you. As a Software Developer you will join one of our many account teams and work in a highly collaborative environment to provide expertise in designing, developing and executing solutions to enhance the quality of IT products and services for our clients. At CGI, you can explore your full potential - not confined by borders or pre-defined paths. You're empowered to solve problems in your own unique way which is not only valued and respected but encouraged.Your future duties and responsibilities:Requirements/Design Develop technical prototypes and assist in the creation of software documentation including requirements, design, and user manuals Understand and apply software design patterns Collaborate with team members to find better, more efficient ways of doing things Development Develop software solutions for business problems by leveraging the latest tools, such as Microsoft .NET, Java, and open source technologies Develop database, ETL, and reporting solutions by leveraging the latest database technologies Participate in peer-led engineering and code reviews Quality Assurance Develop an understanding of the benefits of quality assurance within enterprise software applications Assist in the development and execution of test cases and system test plansRequired qualifications to be successful in this role:A bachelor's degree in a relevant field (i.e.: Computer Science, Computer Engineering or a similar major with extensive computer-based or technical content) Experience with SQL, Java, C++, J2EE, C# and/or .Net development The ability to learn and understand new technologies quickly A great attitude and desire for learning Excellent problem solving, written and verbal communication skills Flexibility and ability to deal with ambiguity Ability to work within a team environment Ability to work in the U.S. for an indefinite period of timeEst. Salary Range (Colorado Only): $53,000 to $75,000*Disclaimer: In accordance with Colorado's Equal Pay for Equal Work Act, effective January 1, 2021, a good faith hourly or base salary range must be posted for all positions where the work may be performed in the state of Colorado. Therefore, this good faith salary range will only apply where this described position will be performed in the state, and should not be considered the compensation range in other locations or for other positions.At CGI we call our professionals \"members\" to reinforce that all who join our team are, as owners, empowered to participate in the challenges and rewards that come from building a world-class company. CGI's benefits include: Competitive base salaries Eligibility to participate in an attractive Share Purchase Plan (SPP) in which the company matches dollar-for-dollar contributions made by eligible employees, up to a maximum, for their job category 401(k) Plan and Profit Participation for eligible members Generous holidays, vacation, and sick leave plans Comprehensive insurance plans that include, among other benefits, medical, dental, vision, life, disability, out-of-county emergency coverage in all countries of employment; Back-up child care, Pet insurance, a Member Assistance Program, a 529 college savings program, a personal financial management tool, lifestyle management programs and moreWhat you can expect from us: Build your career with us. It is an extraordinary time to be in business. As digital transformation continues to accelerate, CGI is at the center of this change-supporting our clients' digital journeys and offering our professionals exciting career opportunities.At CGI, our success comes from the talent and commitment of our professionals. As one team, we share the challenges and rewards that come from growing our company, which reinforces our culture of ownership. All of our professionals benefit from the value we collectively create.Be part of building one of the largest independent technology and business services firms in the world.Learn more about CGI at www.cgi.com .No unsolicited agency referrals please.CGI is an equal opportunity employer.Qualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, pregnancy, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity and gender expression, familial status, political affiliation, genetic information, or any other legally protected status or characteristics.CGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at USEmploymentCompliance@cgi.com . You will need to reference the requisition number of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a requisition number will not be returned .We make it easy to translate military experience and skills! Click here to be directed to our site that is dedicated to veterans and transitioning service members.All CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held. CGI will consider for employment qualified applicants with arrests and conviction records in accordance with all local regulations and ordinances.CGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with CGI's legal duty to furnish information."}