{"title":"FIFRA Environmental Fate Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKzM0Oik-_Bl4hEblCVOzOcvs0up4bzF4J9cFRe9qr-YaP8ae1Es8YWue1lcJEfkqJFMZ_2UiGVpQvjZ5Wk-dc-e5ulGdkyaWHM_11ncAuyZNwSs8DlPw4q_UPZ18iXIhopfXMyfSUI0wUA_lB_CxFl_sZuFIcQ0e-7YQRLMScHfUeHIP0Gr8ow10pQoNPg","source":"ziprecruiter","full_description":"Exponent is a leading engineering and scientific consulting firm that brings together more than 90 different disciplines to solve the most pressing and complicated challenges facing stakeholders today.  Our vision is to engage the brightest scientists and engineers to empower clients with solutions for a safe, healthy, sustainable and technologically complex world.  We leverage over 50 years of experience in analyzing accidents and failures to advise clients as they innovate their technologically complex products and processes, ensure the safety and health of their users, and address the challenges of sustainability. We employ experts from top programs at over 500 universities and from a variety of industries.  We are expanding and are excited about your interest in joining our team! Key statistics:1100+ Team members900+ Consultants550+ Ph.D.'s30+ Offices globally We are currently seeking an experienced FIFRA Environmental Fate Chemist for our Chemical Regulation and Food Safety Center in Washington, DC.  In this role you will work as part of a team on pesticide-related technical consulting projects, including study design, study monitoring, and risk assessment. The preferred location for this position is Washington, DC, but other locations may be considered. This position offers significant opportunities for professional growth, development, and marketing activities. You will be responsible for: Leading pesticide environmental fate efforts in the US for North American workProviding strategic scientific advice to clients on North American regulatory environmental fate risk assessment issuesAnalyzing data gaps, waivers and position papers, develop testing strategies, and monitoring environmental fate studiesSummarizing and interpreting data, including study reports and published literature in the area of environmental fate, drawing sound scientific and regulatory conclusionsProviding verbal and/or written inputs to multi-disciplinary project teams and contribute to providing high level strategic advice to clients and high-quality outputsProviding high level technical documents to support/justify the scientific/regulatory position for clients, including peer review of colleagues workDeveloping a client base for providing high level environmental fate/environmental risk assessment services including identifying additional environmental fate business development opportunitiesMentoring staff to support their growth and professional developmentPresenting at scientific conferencesYou will have the following skills and qualifications: M.S. or Ph.D. in Chemistry, Biological Chemistry, Environmental Sciences or related fieldsMinimum 5-10 years of relevant experience in the agrochemical industryExtensive knowledge of pesticide degradation in soil, sediment, water, and airUnderstanding of chromatography and metabolite identification techniquesFamiliarity with EPA guidelines for conducting environmental fate studiesExperience in conducting FIFRA laboratory and/or field studiesExperience working with contract research organizationsExperience with regulatory agencies such as the USEPA and state agencies such as CDPRExcellent oral and written communication skillsStrong computer skills, specifically with Microsoft Word, Excel, and Power PointAbility to manage multiple assignments under rigid time constraintsAbility to manage client projects independentlyAbility to manage and participate effectively in large team projectsWe value and encourage diversity and inclusivity across all facets of our firm.  Having a team built of people with different backgrounds, skills and perspectives allows us to provide better value to our clients and enjoy an enriched work environment. Our firm is committed to offering a variety of programs and resources to support health and well-being. We believe that providing competitive benefits as well as compensation and recognition programs empowers our staff to do work that makes a difference.Exponent is a proud equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, veteran status, disability, sexual orientation, gender identity, or any other protected status.If you need assistance or accommodation due to a disability, you may call us at +1 (650) 688-6968 or email hr@exponent.com."}