{"title":"Network Engineer III","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKTCwkV7gedPoaoDGn789YA7SgY02uTVrmLV1HJSgrgA2RhPRx0znotymk80PMMQBNgri3io4ZW_SJNEW862lL5ozpoRGQc6ZBLV0-Ma0s2a7xXDvzB2BwwUW3cFsu_TSIDDPoqcxyOLUvgUPp6Ez0mfw3RdEy0PKGFMtaW2yZOYMEe9Y55g3D6sxPdQ9OS","source":"ziprecruiter","full_description":"Description We invite you to Explore the Potential of being part of something Clearly Essential! At Compass Minerals, we harvest, mine and produce essential minerals that deal with nature's challenges, including - but not limited to - highway deicing salt for the winter months, water softening salt and plant nutrition that improves the quality and yield of crops. We transform Earth's resources that ultimately help keep people safe, feed the world and enrich lives, every day. With our company headquarters in Overland Park, KS, Compass Minerals operates in 27 locations throughout the United States, Canada, Brazil & the United Kingdom. We're committed to creating an inclusive workplace where everyone's voice matters. We believe in work that creates value for all stakeholders, encourages collaboration at all levels and focuses on a high-performance environment where employees are challenged to be their best. Summary: The Network Engineer II will be responsible for daily administration, support, on-going maintenance and establishing the corporate wide network to include: installation, maintenance, Integration, deploying hardware, troubleshooting the environment, using best practices for stability and reliability, performance monitoring, and security of the systems to meet auditing/security requirements. Engineer will be responsible for the management of simple projects or single site projects with broad network impacts to other applications. Essential Job Functions: Include but are not limited to the following: (Management reserves the right to add or modify the duties and responsibilities at any time.) + Maintains, monitors, and supports the infrastructure environment and/or facilities. Coordinates and works on multiple cross-functional base work initiatives and projects. Diagnoses and resolves complex hardware, software and connectivity problems. Supports multiple systems or applications of medium to high complexity (complexity defined by size, technology used, and system feeds and interfaces) with multiple concurrent users, ensuring control, integrity, and accessibility. + Creates automation of routine maintenance tasks for infrastructure systems and cloud environments such as backups, switch builds, router builds, firmware updates/hot fixes, capacity planning, license management, disaster recovery planning, alert creation for proactive system monitoring, log aggregation and management.  Collaborative continuous learner, willing to experiment with new ideas and solutions advancing a dev ops culture. Up to 10% travel may be required to implement engineered solutions/designs. + Other duties as assigned. Qualifications + Bachelor's degree or technical institute degree/certificate or equivalent work experience. Typically requires 3-7 years of relevant enterprise level experience deploying and/or administrating Network solutions, relevant certifications are preferred. + Must demonstrate a strong knowledge and experience either Juniper or Cisco Switch routing and design. Both preferred. + Requires 3-5 years Network engineering experience or equivalent certifications for most of the bold subject matters below: Networking Equipment (Cisco, Juniper) Routing Protcols: (IGRP, EIGRP,OSPF,BGP) Firewall Mangement: (Juniper, Fortinet) + Additional beneficial experience and preferred skills Load Balancing- (F5) Automation/Configuration Management ex: (Ansible, Puppet, Chef) Coding- ex: (Perl, Bash etc) Version Control Systems: ex (Gitlab, Github, AzureDevOps, BitBucket) Physical Requirements: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Compass Minerals is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, disability, age, sexual orientation, gender identity, national origin, veteran status, or genetic information. Compass Minerals is committed to providing access, equal opportunity and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. To request reasonable accommodation, contact 913-344-9200 or careers@compassminerals.com. Job: IT Primary Location: US-KS-Overland Park Work Locations: Overland Park, KS USA 9900 W 109th St Overland Park 66210 Organization: Corporate Job Type: Full-time Schedule: Regular Shift: Standard Day Job Travel: Yes, 10 % of the TimeReq ID: 21000022"}