{"title":"Day Shift Diesel Mechanic NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKXYFfAgBytffkynxyuoSRV0N_CmLkryelWVhDmvf7XCjZS60MhQ8zudezBrfZCuT9o8aE1juC8vGGr4lutoStmDDCfH8cAm-lmSJ1z8TMCYQkTDKIJgTkw0DXbmAcHRvFGhbyJ2-025lppcWFFhPeQFxjmATZ4xrmGF2rReQkcPlgHIbK64t_IBoJRff_O","source":"ziprecruiter","full_description":"RAC transport is currently seeking a Diesel Mechanic for our Commerce City, CO terminal location.The Diesel Mechanic will perform maintenance, diagnosis, and repairs on cars, trucks, and trailers in a safe, efficient, quality minded manor. Repair work may consist addressing breakdowns, malfunctions, and emergency roadside repair in a safe, efficient, and quality manner.Perform operation test prior to repairs to verify compliantDiagnose cause of any malfunction and perform repairs to manufacturers specifications including engines, transmissions and clutches, suspension and steering, fuel and ignition (diesel), electrical systems, brakes, and HVAC systemsFollow proper procedures including documenting correct mileage/hours, save and tag all warranty and core parts, document all repairs on work order using complaint, cause, and correction format, follow parts ordering/billing procedures.Perform final operational test on all vehicles to quality-check all repairs.Perform required inspections and preventive maintenance on vehicles and equipment to maximize the safety, productivity, and life of the unit.Perform DOT inspectionsPerform preventive maintenance on trucks such as fluid changes, lubrication, safety inspections, and brake repairs.Perform preventive maintenance on equipment such as lubrication, adjustments, cutting tip replacements, and safety inspections.Examine vehicle to determine if any additional safety or repair work is needed.Perform maintenance and repair welding on equipment. Fabricate parts as required including any design work neededInspect for cracks or damage to assess needed repairFabricate parts as needed to complete repair including any design workPerform welding repair to manufacturer’s guidelinesAll other duties as assigned.Job RequirementsHD truck technical training or 2 years related experienceCurrent and valid commercial driver’s licenseDOT Certification Knowledge, Skills and AbilitiesKnowledge of engines and controlsKnowledge of transmissions and controlsKnowledge of brakes and suspensionsKnowledge of hydraulics and ANSI A92.2 guidelinesSkilled in welding and cuttingSkilled in DOT inspectionsAbility to operate various pieces of equipmentAbility to stand, sit, walk, bend, reach • Ability to push/pull • Ability to lift /carry up to 100 lbs. • Ability to grasp toolsAbility to discern colorBENEFITSMedical, Vision, Dental, Supplemental, and Life Insurances available.Paid time off, paid holidays, 401k retirement planWHO WE ARERAC Transport is an LTL trucking company with over 40 years of experience in the industry. The company is proud to serve customers throughout Colorado, New Mexico, and parts of Texas. RAC prides itself on providing friendly, quality service and strives to provide on-time delivery to its customers. RAC is a member of the North American family of companies. Our family of companies provide direct service throughout the Upper Midwest, and Western regions; along with parts of the Southwest region."}