{"title":"Field Service Technician","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJumUwkRis3q30YPYZ8jt1VZii_LDch5hS3k4Mx0XBs9vOPkRG-UPp3yT4JqqAHm-HkC7L-UcgRLAAsU89jNI293BzZ9Mhqs0uw4F7wrpjY559RKccIb7n6Gzkav0C9P3V0QCtdWJGlMYtypcLVbF2ph4uRPWsR1VaMUCizqTqxokt25ruPMgvxXjzdFufy","source":"ziprecruiter","full_description":"As THE leader in transit technology, Clever Devices' vision is to make meaningful contributions to worldwide mobility. Our goal is to be the leading provider of exciting technology that improves the quality of mobility in communities around the world. We are continuing to grow, and are looking for a Field Service Technician.The Field Service Technician is responsible for field service calls, diagnostic repairs and maintenance updates on Clever Devices electronic and computerized equipment at the customers or Transit Authority?s facilities. The Field Service Technician is additionally responsible for managing spare parts inventory as well as the care and service of the company vehicle. This position will require travel up to 75%. Primary Responsibilities: + Handles all service calls and completes diagnostic repairs and maintenance updates + Manages spare parts inventory + Responsible for care and maintenance of a company service vehicle+ Maintains a thorough working knowledge of Clever Devices electronic and computerized equipment as well as associated software+ Configures, repairs, maintains, updates and installs Clever Devices equipment on a regular basis+ Serves as point of contact at customer location for any and all service inquiries+ Anticipates and trouble shoots any issues to ensure continual quality for the customer+ Proactively reports trends in repairs and maintenance to supervisor+ Creates and maintains a log of all service repairs, maintenance and updates+ Ensures all repairs and maintenance are completed to customers satisfaction+ Works onsite at the customer facility or at the Transit Authority, and maintains business etiquette standards of Clever Devices+ Ensures they maintain a clean work site whether at customer facility or Transit Authority.+ Position may require weekend, overnight, and on-call shifts Skills Required:+ 3+ years experience as a mechanical service technician+ Hands on experience with electronics and computer systems+ Working knowledge in networking and software applications+ Clean driving record that is maintained as such for insurability+ Superior trouble shooting and problem solving skills+ Strong computer skills including working knowledge of, MS Office including Word and Excel, and ability to learn new programs such as Axapta or customer specific software+ Strong organizational skills+ Good interpersonal skills+ Strong time management skills+ A.A.S or equivalent+ Ability to travel up to 75% within the United States."}