{"title":"Network Engineer, Wireless NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALoC3wWV8-H59a7BMGdtRQSb7MfWZcXn1tiaiYRf1E4xaEPhEurV6EDW9nh9jmH_eVX3M6-8wdCwa3kLRe0U_KmlydDOHIW80QldJc4O1UYa1-kM84iu3C8oCHSH3ltU1Ojh8hvnuovqxv2SkVPgkLMs4_SbmqgaEnH9dyhmjw3v7XdQNfPy5OFSBI6Lq0","source":"ziprecruiter","full_description":"Do you enjoy learning about new technologies and how they can be used to provide cutting edge services to the Air Force and DOD customers? If so, then look to join the Stellar Innovations and Solutions team! The selected applicant will become part of an existing team, in an environment that will challenge you, force you to continuously innovate, and work on solutions that make a difference. There is a future for you here to support highly visible and strategic programs at SIS! You will realize the rewards of conquering a new challenge in a dynamic and highly-technical working environment. Stellar believes our people make the company great and we put them first in decisions to promote from within, host team building events and support a work-life balance. If you love technology and want a career making a difference supporting meaningful Air Force and DOD programs then Stellar Innovations is the company for you.Join the SIS family, and we will support you with expert training, innovative tools, and a fantastic corporate culture. Our team of great people is ready to cheer you on your road to success!Job Function• A complete Wi-Fi heat map of all 711th HPW buildings• Install, test, deploy, manage, update and maintain the wireless network for 711 HPW Defense Research and Engineering Network (DREN) and communications interfaces to external networks as coordinated with the 88th Comm GroupDREN System Administration duties to include:• Creating accounts• Managing security groups• Printer and print queue management• Assisting other systems administrators with software patchingEducation and Experience• Two to three years of experience in Network Engineering, with at least one year, focused on Wireless• Experience on the DREN a Plus• Experience with VISIO a plus• Be able to work under pressure• Organizational/management skills a plus.• Must be 8570 compliant. Prefer CCNA Wireless certification, but Security+ certification is acceptable.Security Clearance Requirements• Must currently have and be able to maintain a Secret Clearance.Hardware / Software• Familiarity with NETSCOUT Air Magnet Survey, and related programs is desired.• Experience with CAT 6a cabling.• Familiarity with Cisco switches and access points is a plus. Specifically Cisco 3800 access points."}