{"title":"Work From Home_Technical Support/Customer Support_.","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJcYPOygvDEFhO4BJ-xJpMJ70_sdooalHvMoobdFWgd2mkkjGhk3UmK3UJeBaV6svWIQjXLMZNQI56aCRtsT-OkxMqemDps_rJBIZLc_omd2EYwiKajkEUtaAUhAEOi1iO0hCdWprZBgLc4_n5CWonY4itPz1HLFXziNR8Tp7daRv-elvzxR8jOak_d298m","source":"ziprecruiter","full_description":"Job Details:Job Title: Technical Support/ IT Service Desk Practitioner - Analyst, IT OperationsLocation: Grandview Heights, OH 43212Duration: 18 months (Possible Extension) Working hours: 8 hrs. per day | 40 hrs. per week Start Date: April 12th 2021 Work from Home till COVID 19 Shift TimingsAdditionally hours of this position could range from open 6:00 AM EST to close 9:30 PM EST , unless business need changes and hours need to be adjusted to correspond to the need.Job Description• IT Service Desk is an inbound call center supporting 30,000 plus associates/contractors and 100,000 plus agents. We provide break fix and troubleshooting support for passwords, network, connectivity, hardware, software, and mobile apps to name a few. Our group is comprised of about 100 associates in both Columbus and Des Moines.Ideal candidates for these roles will have:• Experience providing customer support• Desire to gain information technology knowledge and skills• Focus on continuous learningJOB SUMMARY:Under moderate supervision, performs moderately complex tasks associated with IT Operations. Tasks include monitoring and operating a computer console and/or online terminals, provisioning and providing first and second tier technical support to end users on moderately complex issues regarding computer operations and networks, installations, setups, error messages, on-line transactions, system status, and downtime procedures, etc. Participates in problem/change management activities to minimize impact of service disruptions on end users.CORE DUTIES AND RESPONSIBILITIES:Provides technical support to diagnose, analyze, research and resolve moderately complex computer incidents for internal and external customers.Responsible for recognizing, researching, isolating, resolving and documenting problems with information systems products and services.Executes incident and change management processes for moderately complex PC, server, or mainframe applications and hardware.Provides the preventative maintenance, troubleshooting, root cause analysis, and resolution for moderately complex technical incidents in order to ensure satisfaction.Documents and routes moderately complex customer escalation's and recommend appropriate technical team or resource.Consults with network services, desktop/systems engineering, and/or applications development to restore service and/or identify and correct core systems problems.Provides ad hoc technical training to customers groups on company technologies, infrastructure, hardware, and software applications.Performs all other duties as assigned.MINIMUM JOB REQUIREMENTS:Education:Undergraduate studies in computer science management information systems, business administration, insurance or related field is preferred.Knowledge:Proven knowledge of mainframe, microcomputer and/or network technologies and applications.Must understand customer business and product environment.Must understand business systems, data processing, and customer service concepts and practices.Certification/ Designation:Certification in Microsoft or an equivalent designation is preferred.Experience:Two years of experience in a related field. Customer service experience is preferred.Skills:Must have good verbal and written communication skills to effectively interact with customers and all levels of personnel.Must be able to provide technical support to diagnose, analyze, research and resolve moderately complex computer problems while minimizing the impact of service interruptions.Must be able to analyze moderately complex error conditions and/or abnormal situations and report malfunctions to management.Must have the ability to utilize computer operation system software commands to troubleshoot and resolve moderately complex issues related to application and hardware/peripherals.Must have good analytical and decision-making skills.Values:Regularly and consistently demonstrates the Values and Guiding Behaviors.JOB CONDITIONS:Extended periods on phone and personal computer.May be required to work non-standard hours based on hours of operation and schedule.May be required to carry a cell phone and respond to pages Overtime EligibilityADDENDUM – Due to COVID-191. Must be able to perform duties below from both in office (NW facility) and from home.a. Must have adequate technology, connectivity. For member facing roles the required speed it a minimum of 30 Mbps down/2 Mbps up and a hard-wired connection.b. Must have appropriate workspace – distraction free, meeting safety and ergonomic standards and providing for protection of assets –may request to inspect a work environment (require pictures of work area for ITSD).c. Job duties must be able to be performed without supervision (for ITSD this would exclude individuals in initial ITSD training, Launchpad and until performance and quality metrics are within acceptable ranges).d. WFH is not an alternative for dependent care, as the individual should be fully focused on work.e. All Flexible Work Options are subject to ongoing review and may be cancelled, suspended, or altered at any time by management.f. If an associate has power or connectivity issues, analysts are expected to take steps to resolve the issue as soon as possible and find an approved alternative location while the issue is being resolved."}