{"title":"Senior Manager, GMP Process Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKgfw4T3uhOrMq4XuhytZhs3zS02dzzs5upi4TAtnMSMAgwKR8Lb4psEGtMx1jyxSouceVkNFXTADWQRONXa_39-CVr7GfWydJcTHKjSP4ns9Y6-3P4glaAKNQiQnw0KfuHQ9vZjCcJl7ozcVTt0TN7xuU-pFNjAeJ8RhwEEM4WWQIdXgdkYML60EixqJvy","source":"ziprecruiter","full_description":"Cayman Chemical Company is a biomedical research company based in Ann Arbor, Michigan. Cayman helps make research possible by supplying scientists worldwide with biochemical tools used to understand cancer, neurochemistry, oxidative injury, endocrinology, atherosclerosis, and other human health challenges. We specialize in assay kits for the measurement of hormones and bio-markers. In addition, Cayman offers a broad range of specialty biochemicals used as research reagents and qualified standards. Cayman performs generic drug development and production in both Ann Arbor, Michigan and Neratovice, Czech RepublicWe are currently seeking candidates for a Senior Manager GMP and Process Chemistry:Responsibilities and Duties:Direct all activities of the Phase 1 and 2 GMP Process Chemistry Production LabManage the day-to-day multi-disciplinary efforts and tasks of a team of seven ScientistsOversee general upkeep of the lab and maintenance of laboratory equipmentEvaluate and recommend scientific equipmentInteract with all necessary departments to fulfill process development as well as GMP responsibilitiesAct as a direct liaison with the Chemistry Management CommitteePartner with the Senior GMP Project Manager to prepare estimates for third-party businessMeet and greet external customers during site visitationsPrepare and review reports for regulatory submissions and report in support of third-party businessCalculate and maintain the capital budget for the GMP Process LabEvaluate new technologies that could be useful either internally or in support of expanding the third-party businessPrepare scientific papers, patent experimental sections, and technical reports for publication and presentationAttend conferences and reports back information acquired from the conferenceObserve and assist in the enforcement of the company's policies and proceduresServe as primary backup for Senior Director GMP and Process ChemistryAttend in-house Management Development coursesKeep current with relevant scientific topics Requirements:Education: Bachelor’s Degree or advanced degree in ChemistryExperience: Minimum 10 years in the Pharmaceutical IndustryMastery of Spectroscopy, NMR, Mass Spec, IR, UV and HPLCKnowledge and understanding of Quality Systems, relevant ICH Q7 and FDA regulationsCommunicate clearly and effectivelyAbility to prioritize tasks, be organized, and pay attention to detailExcellent management and mentoring skillsIn-depth understanding of cost analysis and bid preparationPositive attitude, a strong willingness to lead and assist others What we Provide:   Competitive compensationMedical, dental and vision insuranceLife and disability insurance plans401(k) plan with company matchFlexible spending accounts for medical and dependent care (FSA)Generous paid time-off for vacations, sick and/or personal reasonsFun employee events all year longOver 10 paid holidays per yearEducation assistanceFlexible work schedulesEmployee assistance programCasual dressOnsite Gym FacilityCayman Chemical Company is an equal opportunity employer. Cayman does not discriminate with regard to employment decisions based on an employee's or applicant's race, color, sex, sexual orientation, religion, national origin, age, height, weight, disability, genetic information, citizenship, marital status, protected veteran status, or other protected characteristic. This includes, but is not limited to, recruitment, hiring, training, disciplining, promoting, transferring, or terminating employees."}