{"title":"Hardware Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIa7Nz9oKzf3smtPJgdQgBvFvrLsvTD5PCphudjxxO9zZ5cuBFAKUJ8e_1czT6knqce9yn4nmOTq6wgNFMeCGStzQpn8VxZno3ScneDkQGFK1BSmLpYS-Box061iWuDfguzfuf87-lEcjLf8FVHCGwYL1vaVR6mihXRNWoAJHaMz5DQyNB_cMUWwmDosT7R","source":"ziprecruiter","full_description":"Job Description:Kratos is a fast paced, entrepreneurial environment that is team oriented and relationship driven to foster innovation and creativity. Our motto, \"From Strength to Success,\" reflects our commitment to continually leveraging our technical and intellectual strengths for the ultimate success of our customers. The Federal Solutions Group is a leader in satellite command and control solutions provider focused on DoD, Civil (NOAA/NASA), and National customers.The qualified candidate will work with a small team responsible for the hardware engineering to sustain and upgrade multiple systems with respect to SATCOM, ground and SDA. The major system this position will work on is the Command and Control System - Consolidated (CCS-C). The candidate will develop hardware engineering experience as they work closely with system engineers, developers, test, and on-site user support personnel to support system updates, analyze and resolve system issues, and ensure project objectives are met.Responsibilities include but are not limited to:Validate physical and logical interfaces on all new or replacement hardwareIntegrate and assemble COTS hardware including cable fabricationCoordinate and support hardware installationsPrepare hardware-related documentation updatesSupport hardware-related system architecture studiesProvide engineering analysis for hardware-related system change proposals**Experience and Skills:*** Bachelor's degree in engineering, computer science or related field. Minimum of 2 years experience in hardware engineering required. Candidate should be self motivated, capable of working independently or as part of a team. Experience with DoD installation standards is desired. Proficiency with AutoCAD desired. Able to articulate technical concepts in both written and oral forms. Active Secret clearance required.* Position located in Colorado Springs, CO.U.S. Citizenship and the ability to obtain and maintain a U.S. Government Security Clearance is required.Kratos Federal offers challenging work, an excellent environment, & great benefits! Kratos Federal is an affirmative action / equal opportunity employer that recognizes the importance of diversity. We are committed to maintaining an inclusive environment and strongly encourage minorities, females, veterans and individuals with disabilities to apply. All qualified applicants will receive consideration for employment. Please, no phone calls, agencies or recruiters.Job Tracking ID: KSTC-20-017Location: Colorado Springs, COJob Type: Full-Time/RegularDate Updated: December 08, 2019Job Level: Mid Career (2+ years)Level of Education: BA/BSStarting Date: ASAP"}