{"title":"Electro-Mechanical Assembler - Morning Shift NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKy_QqOO-qKHEFcQ6m7q4D9GD4wTGWldWfUrFhzskmWtGPsACqpp5PrCJFQtpY8qlzgZx6BF5i5zfvwYVXIEo8PaT8giwQ5iiokOLhJg71_2Gf-H-AOti70xiRIuUxxw9_FhLvZRgqXTixV4a8vqZuA2vObFbZaow6UGhOdM6uIA1M4II6Wn_1QSDojwyY","source":"ziprecruiter","full_description":"About this PositionSeeScan is seeking an Electro-Mechanical Assembler with prior electro-mechanical and troubleshooting experience to work in our clean room during the morning shift. In this position, you will perform a variety of repair of mechanical and electronic components and subassemblies on our SeeSnake diagnostic camera heads.ResponsibilitiesPerform disassembly, troubleshooting, repair, and re-assembly of mechanical components, electronic subassemblies, and electro-mechanical assembliesTrack inventory used during the repair processUse a wide variety of hand toolsPerform functional and pressure tests on repaired camera headsPerform other related duties as assignedQualifications Prior experience working on electro-mechanical components and subassembliesCapable of following procedures and meeting quality and safety standardsProficient in the use of a wide variety of hand tools and test equipmentComputer proficiency is desiredAble to work in a fast-paced environmentEffective communication skillsExperienceMinimum of six months’ prior soldering and/or assembly experiencePrevious experience in troubleshooting components or subassemblies, mechanical at minimumWe OfferA position within an established company, growing from humble beginnings in our founder’s garage to a team of over 300A culture of transparency, growth, and innovation – read more about it below!Medical, dental, and vision coverageTraditional and Roth 401(k) investment options, with a current company matching contribution of up to $50 per paycheck (biweekly)Flexible Paid Time Off plan with no cap or “use it or lose it” requirementIf this position is of interest, please apply online at https://careers.seescan.com. In your application, please include your resume and a thoughtful cover letter explaining why you are the ideal candidate for this position. We are looking for a long-term, in-house team member to join us, not a contractor or consultant.About SeeScanModern life depends on the infrastructure that brings water, electricity, gas, and communications to our homes and businesses. SeeScan’s mission is to deliver the highest quality products that protect these vital services. We are an original equipment manufacturer in San Diego, CA that builds diagnostic and utility locating equipment from the ground up, from initial product conception to prototyping, testing, and final assembly.What is it Like to Work at SeeScan?Working at SeeScan is unique. We have the stability of a larger company—we’ve been in business for over 30 years!—but our company culture has a small family feel that thrives on transparency, collaboration, and innovation. Our mission is to create the best products in our industries and continue our growth – not to line shareholders’ pockets.There is a reason why our turnover is so low. We know that SeeScan is more than a collection of facilities, technologies, and products. SeeScan is a community of people. Working here, you’ll be part of a group of people who take pride in their work and their community. We’re passionate, but there’s more to it than that. We have a sense of ownership of SeeScan’s success and a shared commitment to continuous improvement. You won’t just be a cog in a corporate machine here – you’ll be our most critical investment, and we’ll do our best to empower you with the tools you need to find success at SeeScan.NotesNo recruiters, contractors or consultants, pleaseNo relocation assistance or visa sponsorships available for this positionSeeScan is an Equal Opportunity Employer"}