{"title":"Hardware Engineer - 32753 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJMNEEjTnAF3_sWC7f6T0Wqow3N_B5k5USApRZ0OVXYxK8lK4dPA_ioAecWo4gaSGxa-6HPa4eJyTBuyXAEMtDF-e1klthgk1ZcQi9Riv575ycritC4mhXaLZG-dck0-3kWa8SYgtWmkoK9WxxdSrtVAjubaKpM9yz7KpRRzsQNw7Wmb7hS6_RFsrU6omtd","source":"ziprecruiter","full_description":"Job DescriptionAlionis seeking Sr. Hardware Engineer's with experience in Xilinx, Altera, Lattice or other devices. This individual will be responsible for the development of standalone and integrated FPGA systems. These systems use FPGAs to collect data from and control hardware. Candidates must have solid experience with FPGAs and embedded processors. The FPGAs external communications will be via PCI or PCI Express, Ethernet or high speed serial. It is desired that the candidate have experience working with FPGA's for data acquisition and digital signal processing.Experience with digital signal processing, software defined radios, DRFM technologies and RF receiver and transmitter designs are highly desired. Other unique engineering skillsets may be desirable for this and other potential positions.Candidates must work well with mixed disciplined teams and must be able to lead projects when required. QualificationsBachelor of Science Degree in Electrical Engineering, Computer Engineering10+ years' experienceAbility to work with a team or alone as the projects dictateGood time management and leadership skillsGood analytical, critical thinking and problem solving skillsGood verbal communication skillsRequiredImplementation of control systems using FPGAsDigital signal processing (DSP)Software defined radioDRFM designsRF receiver and transmitter design (Communication and Radar systems)Electronic Warfare and Radar conceptsFPGA data collectionFPGA communication via EthernetFPGA interface with PCI and PCI ExpressFPGA communication via high speed serialExperience with both VHDL and Verilog, ISE and VivadoPCB design and layoutsLab view/Lab windows experienceDesiredC++,C,C#Assembly languageJava, Visual Basic, QT, PythonSecurity Clearance: SecretQualifications: Alion is seeking Sr. Hardware Engineer's with experience in Xilinx, Altera, Lattice or other devices. This individual will be responsible for the development of standalone and integrated FPGA systems. These systems use FPGAs to collect data from and control hardware. Candidates must have solid experience with FPGAs and embedded processors. The FPGAs external communications will be via PCI or PCI Express, Ethernet or high speed serial. It is desired that the candidate have experience working with FPGA's for data acquisition and digital signal processing. Experience with digital signal processing, software defined radios, DRFM technologies and RF receiver and transmitter designs are highly desired. Other unique engineering skillsets may be desirable for this and other potential positions. Candidates must work well with mixed disciplined teams and must be able to lead projects when required., * Bachelor of Science Degree in Electrical Engineering, Computer Engineering * 10+ years' experience * Ability to work with a team or alone as the projects dictate * Good time management and leadership skills * Good analytical, critical thinking and problem solving skills * Good verbal communication skills Required * Implementation of control systems using FPGAs * Digital signal processing (DSP) * Software defined radio * DRFM designs * RF receiver and transmitter design (Communication and Radar systems) * Electronic Warfare and Radar concepts * FPGA data collection * FPGA communication via Ethernet * FPGA interface with PCI and PCI Express * FPGA communication via high speed serial * Experience with both VHDL and Verilog, ISE and Vivado * PCB design and layouts * Lab view/Lab windows experience Desired * C++,C,C# * Assembly language * Java, Visual Basic, QT, PythonEducation: Bachelor's DegreeEmployment Type: [\"FULL_TIME\"]"}