{"title":"Senior Technical Writer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAITMr2uE_2abWkCgp4komh-mRkjfTBXP9zZXdflTE2soun1P3hnAcbmcK052KBNHpXLaAD6j5_9sFhEtCZVCb52YpabbQ5DYCbl2ASTquoeQEjufe26Ij7uv8JySSGjAP7khB1qOjwH8x9Sk6JcV4Z_2_MhOpTu0PJIP_OisqRqWEmuHyXnJX0OPwsCtjI","source":"ziprecruiter","full_description":"FICO (NYSE: FICO) is a leading global analytics software company, helping businesses in 90+ countries make better decisions. Join our world-class team today and fulfill your career potential!Job SummaryWork with Scrum Team Leaders and Product Management to define and create the appropriate documentation deliverables to meet release requirements. The deliverables may include user guides, administrator guides, developer guides, API references, installation guides, reference guides, videos, tutorials and examples as appropriate to illustrate targeted use cases.Job DescriptionThe Opportunity\"Bring your passion for learning new and emerging technologies to FICO where you'll be part of an innovative product team with hands-on access to the product.Our Technical Writers create documentation deliverables for leading edge software products deployed in Cloud, SaaS, ASP, and hosted environments. The deliverables may include installation guides, user guides, API reference guides, tutorials, examples, videos, and blogs.\" - Director, Technical PublicationsWhat You'll ContributeProactively learn about the FICO products to which you are assigned.Research, write, and edit documentation deliverables.Coordinate the production and handoff of all final deliverables.Author technical notes for the knowledge base.Frequently interact with Product Managers, Development, and QA teams, subject-matter experts, and the Technical Publications team. Interaction is both scheduled and ad hoc in our iterative development environment.Work with other technical writers across FICO to look for ways to continually improve our processes and procedures.What We're SeekingBA/BS degree in Technical Writing, English or Computer Science.Solid technical writing or software development experience, or the equivalent combination of work experience and education-all candidates will be asked to provide writing samples.Proven ability with English spelling, grammar, punctuation, syntax and composition rules and a clear business/technical writing style.Familiarity an object-oriented programming language.Familiarity with XML and HTML is a plus.Experience working in an Agile environment a plus.Our Offer to YouA culture and work environment strongly reflecting our core values: Act Like an Owner, Delight Our Customers and Earn the Respect of Others.The opportunity to make a difference by leveraging your unique strengths.Highly competitive compensation and rewards.Flexible work options, opportunities to give back to your community, social events with colleagues and a comprehensive benefits program inclusive of progressive parental leave.Why Make a Move to FICO?At FICO, you can develop your career with a leading organization in one of the fastest-growing fields in technology today - Big Data analytics.  You'll play a part in our commitment to help businesses use data to improve every choice they make, using advances in artificial intelligence, machine learning, predictive and prescriptive modeling, and much more.FICO makes a real difference in the way businesses operate worldwide:Credit Scoring - 150+ billion FICO Scores have been sold to date, making it the most used credit score in the world.Fraud Detection and Security - 2.6+ billion payment cards globally are protected by FICO fraud systems.Lending - 3/4 of US mortgages are approved using the FICO Score.Anti-Money Laundering - our solutions check more than half a billion transactions a day to prevent criminal schemes such as terrorist financingGlobal trends toward digital transformation have created tremendous demand for FICO's solutions, placing us among the world's top 100 software companies by revenue. We support many of the world's largest banks, insurers, retailers, telecommunications providers and other firms reach a new level of success.Our success is dependent on really talented people - just like you - who thrive on the collaboration and innovation that's nurtured by a diverse and inclusive environment. We'll provide the support you need, while ensuring you have the freedom to develop your skills and grow your career.  Join FICO and help change the way business thinks!Learn more about how you can fulfill your potential at www.fico.com/CareersFICO values the benefit that diversity and a culture of inclusion bring to our workplace.  We are an equal employment opportunity and affirmative action employer and we're proud to offer employment and advancement opportunities to all applicants without regard to race, color, ancestry, religion, sex, national origin, pregnancy, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status."}