{"title":"C/C++/Java Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL3PsuoV7uJsrC7e_QvyIlsdLS1vyfPpHaYm5sEemqw0_lrICiL87cQHnduQrWxLy58ADzTnM__DruemBXgV3LACuvGxIhIEPJUrm0YHtiPnHQq-tE0o8Tq51Gi1hTB1TfmGotV-i1Fcf59kz_CIEaEgA-YyxluI2kqZ58VhUNKzjc3AmcsQNed2KAGQY4w","source":"ziprecruiter","full_description":"DescriptionSAIC is seeking a C/ C++/Java Engineer to join our team in support of work taking place for the Army in Huntsville, AL (Redstone Arsenal).This is an opportunity to join a team of employees that are working on a system being built from the ground up, while using the latest Android Tactical Assault Kit (ATAK) technology hosted on a customized, hardened Linux/Android Hybrid Operating System.Note: Position is temporarily remote due to COVID but work will permanently be onsite in Huntsville, AL once everyone returns back into the office.Responsibilities Include : Candidates should have a working knowledge of the Linux OS. Be familiar with bash scripting, system daemons, and the Linux / UNIX file system. Candidate will be familiar with OS Containerization. Be capable of using terminal commands, the VI editor, and GDB debugger tool. + Candidates should be familiar with using a debugger to perform simple operations such as setting breakpoints, single stepping, and examining variable values. + Candidates will be expected to understand the software development life cycle, be familiar with UML, and use standard UML diagrams in application and design documentation + Candidates will be expected to work in an agile environment, and have the ability to plan, design, build, and test software components with minimal direction. + Candidates will be expected to break down software tasks into small clearly defined components, which can be coded and tested incrementally. + Candidates will be expected to develop unit test strategies on components they have been assigned.QualificationsREQUIRED EDUCATION AND EXPERIENCE:Bachelors and two (2)+ years or more experience; Four (4) additional years of related experience will be considered in lieu of a Bachelor's degree.Clearance : Must be able to obtain a Secret Security clearance; Interim Secret is required for day one with the ability to obtain a full Secret ClearanceRequired Skills: Linux experience and experience with one of the following: OS (RHEL), Wind River, Solaris or Red Hat. + C, C++, JAVA Application Development experience.Optional Skills/Qualifications: Applying SE Linux PoliciesREQNUMBER: 213433 SAIC is a premier technology integrator, solving our nation's most complex modernization and systems engineering challenges across the defense, space, federal civilian, and intelligence markets. Our robust portfolio of offerings includes high-end solutions in systems engineering and integration; enterprise IT, including cloud services; cyber; software; advanced analytics and simulation; and training. We are a team of 23,000 strong driven by mission, united purpose, and inspired by opportunity. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $6.5 billion. For more information, visit saic.com. For information on the benefits SAIC offers, see Working at SAIC. EOE AA M/F/Vet/Disability"}