{"title":"Entry Level Outside Plant Engineer NEW!","location":"","salary":"","description":"","term":"$15 to $30 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALZTEps95bRfc26eEZOhc5ntlCZYp1C_5t54flNq9lZjOMozdp6WEfZNNH-ddmkL3KQkwKiBgEb6JeI3KTtMboPXhGL67-8ugWleKlbqGjr4Y5D1c2rioPNjKbYLG6K4uXtoZXFdPIn0DCtey0Ta0QuPku7XCyvH9cS5iFprFhC2FEHfcQFPKimv5ssOQ","source":"ziprecruiter","full_description":"Job title:Entry Level Outside Plant EngineerReports to:Project ManagerByers Engineering Company has an immediate opportunity for Entry Level Outside Plant Engineers in Columbus, Ohio.Duties:Responsibilities of the OSP Engineers include design of buried and aerial cable systems and OSP supporting structures. Candidates must be proficient in Microsoft Excel and other Microsoft applications. Experience or coursework in AutoCAD or GIS preferred. Experience using Java, Cobolt, C++, Python is a strong plusWorking Conditions:• Work in a TEAM environment• Work a schedule that parallels the hours of the work schedule of our customer• Work outside in all kinds of weather• Work mandatory overtime and holidays as service conditions require• Dress in a business casual mannerQualifications:• Experience in AT&T systems and design of outside plant, both copper and fiber preferred• Bachelor’s degree in Telecommunications, Engineering, Industrial Technology, or related field is preferred, OR Telecomm, Engineering, or Drafting completed courses and diploma from a technical school or community college, OR Experience in a related field• Basic operating knowledge of CAD systems a positive/priority• Qualify on pre-employment screening• Obtain satisfactory results from a background/employment history investigation and drug screening• Able to be trained in ongoing telecommunications OSP design and engineering practices• Possess a valid state driver’s license and non-negligent driving record• Have reliable transportationSkills:• Possess STRONG communication & PEOPLE skills• Demonstrate good defensive driving skillsOffered salary:Compensated on a unit-based commission, and $20 per hour for Holidays and Vacation.Benefits:Depending on coverage requested, we offer paid vacation, paid Holidays, paid Leave time, matching 401(k) plan, Medical & Dental insurance"}