{"title":"Senior Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL0085p10Wz5ndAPDLBVOS6RbWO0YKrCJY9H7lQn2ikrgGC77MBAkpbKrrTWL0PKxCu6oQBzQgSUoAoIg802gcaEnpV-KFNno1nLOMG3If4HuvPRo1aAW_56lyisfK4XVJxrh70fvAhHdxHoYnaKFHK4eUxF3xZtzM8_EUEvCGWCVARjYie52cxIjhIB6Yl","source":"ziprecruiter","full_description":"**ROLE SUMMARY** The Senior Chemist is responsible for laboratory scheduling prioritization and workload distribution in the drug product lab, including stability, vaccine, drug product and raw material testing. They will also perform LIR supervisor duties for atypical, OOS, questionable and invalidated data occurrences and will cover data integrity responsibilities. The chemist will also be responsible for process improvement for DP release and stability testing. The Chemist represents and/or leads the lab unit or the entire lab organization on high complexity projects and project teams both within and outside of Quality Operations, to include but not be limited to data integrity initiatives, PQS compliance requirements and continuous improvement projects. This role provides leadership and technical expertise to assist the laboratory with troubleshooting, investigations, computer validation and instrument qualifications. The Chemist may be involved in second checking of data and will perform assays as needed. The Chemist will be directly involved in implementation of system conversions (i.e. Empower 3, gLIMS), they may also assist with method improvements as well as other infrastructure support functions. This role has the responsibility of serving as Management Designee and will have limited input into the OTE colleague performance assessment process. The Chemist may defend QC Laboratory Quality Systems during audits and inspections.**ROLE RESPONSIBILITIES** Leads and documents laboratory investigations for procedural deviations, atypical, OOS, questionable, and invalidated data occurrences. Assures adherence to data integrity initiatives. As a Subject Matter Expert (SME), represents the lab unit or the entire lab organization on high complexity projects and project teams both within and outside of QO. Leads medium or high complexity project teams within QO tasked with improving laboratory or other quality systems. Assists QO Lab leadership in determining scheduling priorities and workload distribution to ensure customer needs are met. Performs data quality inspection through Quality audits and 2nd check of laboratory data packets Performs analytical assays during times of need. Demonstrates a technical mastery of one or more techniques in fields such as: wet chemistry, chromatography, physical chemistry, or spectroscopy as well as a complete knowledge of laboratory operations including both technical and compliance aspects. Applies knowledge of advanced techniques and procedures with recommendations and implementation of new or modified procedures or instrumentation for improved lab efficiency. Trains others in the theory and practice of both laboratory techniques and quality systems including investigations, instrument qualifications, etc. Independently writes SOPs, technical reports, project plans, instrument qualifications, etc. Serves as management designee and will have limited input into the OTE colleague performance assessment process.**BASIC QUALIFICATIONS** BA/BS, or MS in Chemistry, Biochemistry, or related science preferred with a minimum of 5 years related experience in Quality Operations.**PREFERRED QUALIFICATIONS**+ LIR / RAAC / MIR Author + Trained to execute and record check multiple Chemistry laboratory technologies + Prior experience with Equipment Qualifications**PHYSICAL/MENTAL REQUIREMENTS** Job requires sitting, standing, walking, ability to type, and dexterity for handling glassware/laboratory equipment.+ **Other Job Details:** + **Last Date to Apply for Job: March 18, 2021** + Eligible for Employee Referral Bonus: Yes**Sunshine Act** Pfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider's name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative.**EEO & Employment Eligibility** Pfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer.Quality Assurance and Control\\#LI-PFE"}