{"title":"Remote Pega Engineer (EST)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK6LvMJMkh1M5txI4I8_VrxSlAxTfBTapxuwHZMiMltE8txRG_PQsSnIPjDBaZS7QJvhKM-ODLAofzkE7Eg0mrSDjXMrU1-e71H7IaKpsO6DwMa7COPI_pymVJQ1OHCFTr9-yceGqtd1aqRfLsSvrvTklkKFtYaQ_JHZ6JJbKpen0TBD4E2hA7dAY5imds","source":"ziprecruiter","full_description":"Remote Pega Engineer (EST) - Contract The end client is unable to sponsor or transfer visas for this position; all parties authorized to work in the US without sponsorship are encouraged to apply. A Global Credit Union is seeking a Remote Pega Engineer (EST). Role Description The Systems Support Pega team is responsible for the administration and tier 2/3 support of the Pega Platform, Pega Marketing, several Pega components and production support of several Platform/RPA/RDA solutions developed by several development teams. Our team is responsible for the administration, installation, configuration, maintenance, monitoring and support of Pega Platform 8.5.x, Pega Marketing, Deployment Manager, Robot Manager, Sync Server and Package Server. * Provide on-call production support services as needed * Advanced troubleshooting of live production issues and short-term as well as long-term solution implementation. * Problem and incident analysis, troubleshooting, resolution and communication. * Pro-actively monitor and minimize outages to ensure business is not impacted Skills & Requirements * 5+ years experience with Pega  * Experience supporting an enterprise-level environment * Understanding of the architecture/environment needs of Pega Systems-based applications * Demonstrated ability to support the production needs of a Pega-based application * Experience successfully collaborating with Pega developers and business partners on support needs and/or best practices * Experience with Pega installs, upgrades, and configurations * Experience supporting Pega Robotic Solutions (RPA/RDA) * Experience troubleshooting Runtime issues * Strong verbal, written, and interpersonal communication skills * Knowledge and understanding of Agile * Knowledge and understanding of production support in a highly critical environment * Knowledge of Azure technologies * Desired - Pega Marketing experience * Desired - Pega certifications (PCSSA, PCSA, PCRSA, etc.) Why Hays? You will be working with a professional recruiter who has intimate knowledge of the Information Technology industry and market trends . Your Hays recruiter will lead you through a thorough screening process in order to understand your skills, experience, needs, and drivers. You will also get support on resume writing, interview tips, and career planning, so when there's a position you really want, you're fully prepared to get it.  Additionally, this position is a contract role where Hays offers you the opportunity to enroll in full medical, dental or vision benefits. * Medical  * Dental  * Vision  * 401K  * Life Insurance ($20,000 benefit) Nervous about an upcoming interview? Unsure how to write a new resume? Visit the Hays Career Advice section to learn top tips to help you stand out from the crowd when job hunting.  Hays is an Equal Opportunity Employer. Drug testing may be required; please contact a recruiter for more information."}