{"title":"Sr Network Engineer - Cloud Solutions NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ-fIpkMO5oeGGqzVkwBbM6TPKDNxm5bszjaNG2deyYcXu978VKU3c-nVDvCB69yVxC3vehujv0Fnq0WQzmSDGEjaGnnknfnBbqaCdsbCTjtvra1oNE4UVw0vE7xpUWNiDvnXouti7bzmMf-rQnftD-4CMGC_otyXyCuIhNlkxxtEAI7iPzWwdAjcb2aw","source":"ziprecruiter","full_description":"**Description****Position Summary** The primary purpose for this position is for design and integration of Cloud based solutions to the client. This position is responsible for working directly with Sirius customers and our talented Sales team to understand and answer our clients' needs regarding Application Integration in the cloud and on premise. This role is also responsible for qualifying, designing, and proposing a wide range of cloud solutions as well as security solutions for Sirius' customers. **Primary Duties & Responsibilities**+ Advises and leads our clients on Application Integration and Application Development in the cloud and on premise by meeting with them, understanding their needs, and applying knowledge and research to solve their business problems. + Designs detailed and well-formed architectural strategies and describe, defend, and lead adoption of those strategies with our client leadership. + Installs, maintains, upgrades, and troubleshoots cloud-based solutions, including but not limited to enterprise-level AWS or Azure services. + Assesses client workloads and technology landscape for cloud suitability + Develops business cases and cloud adoption roadmaps + Defines migration strategy to move workflows to cloud + Designs the overall Virtual Private Cloud VPC environment including server instances, storage instances, subnets, availability zones, etc. + Designs the AWS or Azure network architecture including VPN connectivity between regions and subnets. + Designs HA / DR cloud strategies. + Design and deploy Data Center Networks utilizing Cisco Application Centric Infrastructure (ACI) + Design and deploy security solutions utilizing products such as Cisco FirePower, Cisco ISE, Palo Alto NGFW, or Check Point Maestro + Create Design, Implementation and Acceptance Testing Plan documentation + Manages solution Quality Assurance (QA) tasks for all projects delivered against assigned project deliverables + Provides project coordination duties for assigned projects to include providing detailed implementation/migration planning to client, knowing and meeting client timetable, coordinating vendor installations, etc. Facilitates communication between product team members. Proactively monitors and reports status of project efforts, anticipates, and identifies issues that inhibit the attainment of project goals and implements corrective actions + Develops and reviews advanced technical manuals for standard install processes that are directly related to specialization and discipline on the job as needed + Develops and reviews project scope to include work services estimate, services, resource assignments and allocations, and statements of work for assigned projects **Position Requirements** **Basic Qualifications**+ Bachelor's degree in Telecommunications, Engineering, Computer Science, Management Information Systems or a related field + At least five (5) years Information Technology work experience in a Solution Architect, Lead Developer, or similar role, to include all of the following: + Experience specific to AWS or Microsoft Azure Platform + Experience providing Architecture leadership around the AWS or Azure Platform, being involved in the full life cycle from need to adoption + Experience with Route/switch Networking Solutions + Experience with Cisco FirePower, Palo Alto NGFW, or Check Point Maestro + Experience with virtualization platforms, such as VMware or Citrix + Experience with SDN controllers **Other Position Requirements**+ Demonstrated ability to understand a client's requirements and present appropriate architectural options to technical, as well as non-technical audiences+ Demonstrated ability to lead technical workshops, architectural sessions, and conversations with the goal of recommending integration solutions while staying open to discussing alternative solutions + Demonstrated ability to accurately and objectively recommend alternative and/or additional vendor products as needed + Demonstrated experience assisting with the creation of accurate cost estimates, including labor and software sizing, compliance, and licensing+ Experience designing, architecting, planning and implementing routing, switching and security solutions and strategies + Experience with configuration management tools, such as Ansible, Puppet, Chef or similar + Experience with protocol stack that includes skills in layer 2/3+ Network design experience, to include demonstrated troubleshooting capabilities + Demonstrated ability to multitask and to prioritize workload under tight deadlines in a fast-paced environment + Demonstrated organizational, time-management, problem-solving and follow-up skills + Demonstrated ability to perform technical skills/knowledge transfer to client + Demonstrated ability to oversee project work activities + Demonstrated ability to manage and escalate technical issues to appropriate vendor support team + Demonstrated ability to work under minimal supervision, independently and/or as a member of a project team.+ Demonstrated presentation, problem solving, and communication skills **Preferred Qualifications:**+ Amazon AWS Certified Solutions Architect, Professional + Microsoft MCSE Cloud Platform Infrastructure + Consulting experience+ Knowledge of project estimation and scoping experience+ Cisco Certified CCNP or higher certification + Cisco ACI/SDx training/experience + VMware Certified Professional (VCP) or higher certification + Cisco FirePower experience + Palo Alto NGFW experience + Check Point Maestro experience **Essential Functions** The position exists to provide technical consulting solutions to customers and as such requires the ability to travel to and from customer sites and interact with customers on an ongoing and regular basis. **_The above primary duties, responsibilities, and position requirements are not all inclusive._** Sirius is an equal opportunity employer that values diversity. As a government contractor, Sirius takes affirmative action to employ and advance in employment qualified women, minorities, individuals with disabilities, and protected veterans; maintains a drug-free workplace; and participates in E-Verify. Sirius will not sponsor work eligibility for this position.Equal Opportunity Employer/Protected Veterans/Individuals with DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-1.35(c)"}