{"title":"R&D Intern - Analytical Chemistry NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIVWo2tierGWBsAzxyMgcJM3fQ7VOs9Gcz7ALDSoo4hErGn6SgzWH14baqVbpP3y_ViT778HUHc_K10I2Wl_Y0j780xHhdrBWhgs4y_c3hXroVVAmcf8kQkJd8u3LCR1dh9k6ivjy4AWdob-YJOI3bDTDYErv9m7qx-fLIFeKtiQmJIHHHsesuhZHdkcEk","source":"ziprecruiter","full_description":"Job Summary:The Intern - Research & Development is responsible for supporting the business of Alcon's customers through efficient, effective and innovative engineering, scientific, technical or mathematical solutions. This role will be responsible for assisting in the development, testing or necessary implementation for the assigned R&D project within the following R&D organization: PCD Device AnalyticsThe PCD Device Analytics group is looking for an intern with analytical and polymer sciences interest to develop and investigate analytical characterization techniques and methodologies to support the unique challenges of the internship project.Responsibilities:Characterization of raw materials, lens material formulations, and development lens designs and ISO11979-5 supporting analysis methodsKey skillsets include gas chromatography (GC) and high-performance liquid chromatography (HPLC) using Empower softwareKnowledge and Skills:Familiar with gas chromatography, HPLC, or mass spectrometryStrong knowledge of Microsoft Suite (Excel, PowerPoint, Outlook, etc.)Strong communication skills (both written and oral)Ability to work on cross-functional teamsAbility to read, write, understand and communicate in EnglishEducation:Current undergraduate or graduate student enrolled in an accredited universityField of study in Analytical Chemistry, Polymer Chemistry, Physical Chemistry, or other related field of studyWork Experience:No experience requiredAlcon is an Equal Opportunity Employer and participates in E-Verify. Alcon takes pride in maintaining a diverse environment and our policies are not to discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity, marital or veteran status, disability, or any other legally protected status. Alcon is also committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please send an email to alcon.recruitment@alcon.com and let us know the nature of your request and your contact information."}