{"title":"Associate Engineer - Network Operations Center NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKiYLpmzydwC3dxwRuMhvHFiYOlT5OYaQV7wCFASh8RmkXErySulh4IFfUjt0xl1zemjRfgWUVrb5IEr7AEA5dIx5XutHv2mFMcGN5btpKYEp76myUE8XD7fEzw5_EpQINHrc0Rn_fWBbATNDzJoqd--vvLGpxFz3ygLyKYZ-mLU9WJP-pfo2ItGFG9Lcg","source":"ziprecruiter","full_description":"Job DescriptionZendesk is a service-first CRM company that builds powerful, customizable software designed to improve customer relations. At Zendesk, we encourage growth, innovation and believe in giving back to the communities we call home.The ideal candidate will want to join a growing team. You have some experience with web software development and want to learn distributed systems, AWS infrastructure, and digging through logs and telemetry. You should be excited to solve urgent problems with a team of dedicated engineers and teach others what you learned.What you get to do every day:Discover problems within distributed cloud native applications using logs, telemetry and alertingMitigate urgent problems and work with teammates to solve underlying issuesWrite code to automate the mitigations and improve toolsTeach others how to detect and fix repeat problemsProvide and institute proven practices around reliability, remediations, and troubleshootingBuild vital and efficient tooling to lower the barrier of entrance for engineering teams to plug in and enjoy the benefits of ReliabilityWhat you'll bring to the role:Studies have shown that women and people of color tend not to apply for jobs unless they feel they meet exactly all items in the job description. We are most interested in finding the best candidates, and they may come from a nontraditional background. We encourage you to apply, even if you don't match everything listed in the job description.One or more years in a Software Development and/or Site Reliability Engineering roleExperience with monitoring tools such as Datadog, Grafana, AWS CloudWatch or similar tools.Experience with Linux command line environmentInterest in debugging difficult problems across complex systemsExperience with AWS infrastructure, cloud native software design, backend systems and Kubernetes preferredEnjoyment from learning and improving through pairing, code review, tech talks etc.The desire to learn new skills and pass those lessons on to others.Flexible working a shifting schedule (rotating weekends and occasional holidays)About UsZendesk builds software for better customer relationships. It empowers organizations to improve customer engagement and better understand their customers. Zendesk products are easy to use and implement. They give organizations the flexibility to move quickly, focus on innovation, and scale with their growth.Interested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.#LI-OB2Zendesk builds software for better customer relationships. It empowers organizations to improve customer engagement and better understand their customers. Zendesk products are easy to use and implement. They give organizations the flexibility to move quickly, focus on innovation, and scale with their growth. More than 150,000 paid customer accounts in over 150 countries and territories use Zendesk products.  Based in San Francisco,  Zendesk has operations in the United States, Europe, Asia, Australia, and South America.Interested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.  Zendesk is an equal opportunity employer, and we're proud of our ongoing efforts to foster global diversity, equity, & inclusion in the workplace. Individuals seeking employment at Zendesk are considered without regard to race, color, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, medical condition, ancestry, physical or mental disability, military or veteran status, or any other characteristic protected by applicable law.By submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes.  Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesk's use of your personal information.   Employment Type: [\"OTHER\",\"FULL_TIME\"]"}