{"title":"Technical Writer Supervisor - Manufacturing NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL9aywY8nbZKFJ_fN-XFN8j9S-o8kTGZ8KFgIGswapAV8jPZWdjN0E0WNcvrTEWCxG7IbXp1joTaILsej_4I-Ut7SlP-gRQ5Cr94GrLbmwrtj_wMPygpCGRnPxxuv5PV7crtKzeqqkYR95mcWsJ0vc3x1r8plAzFsBcylf1X3JyO-BYefs7pKTQ4c4fBgc","source":"ziprecruiter","full_description":"Technical Writer SupervisorFairburn, GA Material in MotionEmployment TypeFull-TimeJob Description:The Technical Writer Supervisor is responsible for the supervision, and guidance of the department. They are responsible for meeting all Departmental Service Level Agreements (SLAs). They are responsible for improving SLA times. The Technical Writer Supervisor is responsible for setting Departmental Goals, and to ensure that the department goals are met. They are responsible for developing, and maintaining the Technical Writer’s training by selecting outside courses, or doing the training. They are the primary contact for the Department, and responsible for attending required meetings. They are responsible for ensuring that all documents are complete for future builds by comparing the builds required documentation versus current documentation.They will be responsible for training new employees on how to create/update Work Instructions, how to use a camera, provide direction to the Technical Writers, handle employee issues, create a career path, and train a backup for their position.Works closely with the customer on NPI projects to develop work instructions both temporary and final versions. Develops relationships with customers and operations to promote instructional and QA documents before full fledged production begins. Involved in projects to verify the accuracy of the work instructions. Any discrepancies should be addressed and documented to resolve the issue. The Technical Writer Supervisor will ensure that logs of changes for traceability are maintained, works closely with line leads, supervisors, and Engineering to make sure latest revisions are current to the factory floor. He/She is responsible for ensuring that shop floor routing, required work instructions, diagrams, schematics, and special projects are completed on time.The Technical Writer Supervisor is responsible for Customer and Internal Tickets (Bugs) assigned to their team. They are responsible for auditing the work of technical writers in the group to ensure that the Work Instructions are complete, and that the technical writers are following the Work Instruction Template, Style Guide, Naming Conventions as well as standards in technical writing. They are responsible for the yearly reviews of their employees, and handling employee issues in a timely manner. They are to lead the group by example, and provide a positive image for the department. The Technical Writer Supervisor job duties are:The Supervisor is responsible for directing the department, meeting deadlines, setting goals, being the Primary Customer Contact in meetings, employee training/development, and handling employee issues, plus special projects.The supervisor is responsible for setting formats and graphic standards while ensuring correct order, revisions, clarity, conciseness, terminology, and grammar.The supervisor is able to interpret drawings, specifications, mock-ups, and product samples to integrate and delineate technology, operating procedure, production sequence and detail. The supervisor uses these skills to create Work Instructions, and train employees on the process.Trains employees on how to Analyze and interpret information/data to determine appropriate syntax, style, and grammatical usage. Information may be produced and/or presented on hard copy or electronic medium.Participates in planning/coordination meetings to analyze and define customer specification, assembly and inspection requirements.Gathers and researches technical information, including engineering and new product development information, for use in documentation activities.Creates graphical images, flowcharts, and diagrams for inclusion in documentation and coordinates with technical publication personnel or vendors to produce documentation.Uses a camera to capture images of the product, and then uses these images to develop appropriate Work Instructions, including editing photos.Can work with MIM Management, New Product Introduction, Process Engineers, Quality Engineers on the Manufacturing Floor to develop Work Instructions.Maintains configuration management of documents produced and review, edit, and proofread materials written by others, provides suggested revision.Trains new technical writers.Reviews the work of the other technical writers to ensure accuracy, and that they understand the template, and style guide.Works with the team lead to set priorities for the group, and ensures that the other Tech Writers in the group understand the priorities, and meets them by monitoring their work, and setting up the workload.Trains new technical writers in Photography, and editing techniques. Sets up the classes, and does the training. Ensures that of the technical writers in their group are fully trained in photography.Responsible for Process Improvements which may include new software, camera, or other equipment.Interview, and select candidates for the team.Work with all levels of employees, and the customer.Be a leader.Knowledge/Skills, and Abilities:Written Communication; The selected applicant should be able to:Write clearly and informatively concise, descriptive and instructive technical instructions in a timely manner.Establish and manage relationships from document to document, within document content, or to other points of reference for information.Manage reviews of procedures with multiple departments.Lead the group when the Lead Technical Writer is out.Expected Areas of Competence:Knowledge of or ability to quickly learn the company’s quality system and processes.Able to take action in solving problems and making decisions while exhibiting judgment and a realistic understanding of issues, able to use reason.Demonstrated ability to communicate effectively (both oral and written) in a clear and concise manner.Ability to establish relationships quickly with a broad range of constituents. Must possess a collaborative style to work effectively throughout the organizationAbility to withhold actions or speech in the absence of important information: deal with unresolved situations, ambiguity, frequent change, delays, or unexpected events.Able to create positive energy and motivation.Ability to work with various departments to obtain information needed to complete assigned projects.Proficient in Photography and responsible for training others on how to use the camera, and take the required pictures. Responsible for yearly refresher courses in photography, and new Technical Writer Photography Training.Train new Technical Writers on the templates and the Style Guide used by the Technical Writing Team, and provide feedback during the reviews of the other Technical Writer’s Work Instructions.Ability to set priorities for the department, and handle multiple tasksLeadership skillsQualifications required:Excellent verbal and written communication skills.Required, 1-2 year’s experience with Microsoft Word, Visio, and Google Documentation/Sheets.Detail oriented, and motivated individual to lead their team.Technical terminology (computer hardware field).Manufacturing and concrete business experience mapping out processes.Experience using a camera to develop Work Instructions, and the ability to teach others.Supervisory, or Equivalent Experience.Ability to quickly learn our processes.Qualifications strongly preferred:Prefer 3 to 5 year technical writing experience working in manufacturing or electronics industry.ISO 9001 compliance understanding in support of Hardware Manufacturing.Experience with documentation such as SOPs in support of electronics testing and debugging.Experience working in manufacturing, understanding of Bill Of Materials.Education:Bachelor’s degree in technical writing or communication, or another degree may be considered with combined professional technical writing experience. Advanced degree may be considered to offset some, not all, years of experience."}