{"title":"Senior Android OS Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALaiISkGbRBMMiVGrFj4-W3LCLHFhoaU6PKjZ1O937jGn4tDnv8otgXoC-nYMJiJRN5g0HozD5nPP2E0ScM9L7_UasKzF0YZvRO4aPIXBzC1PhHaaZBmpYwCbAaio7VsbYNcX1yvDzDVU3PxXj-6K7smVrLeCWy4MRo04T9WvM3DQ9wf6rnljhC_4VDrP4","source":"ziprecruiter","full_description":"Overview https://www.GeeksAndNerds.com/Recruiter@GeeksAndNerds.comAbout GaN: The mission of Geeks and Nerds (GaN) Corporation is \"to deliver innovative and superior services and technology solutions for our customers, Nation and community.\" We are seeking an exceptional candidate for Senior Android OS Developer for our government services division.  GaN is an employee-owned ESOP company.  We believe the success of our corporation is directly tied to the well-being and success of our employee-owners. We have been recognized as one of the Top 100 Companies in the United States by the US Chamber of Commerce, Technology Business of the Year by the Huntsville/Madison County Chamber of Commerce, and a BBB Ethics Award recipient. Our Founder, Dr. Kim, has been recognized as the Chamber of Commerce Executive of the Year, IEEE Professional of the year, and Entrepreneur of the year. In addition, our innovative culture has produced over 10 U.S. Patents. Our proven track record of success is only made possible by our extraordinarily talented and dedicated employees. Join us and become an owner of an exciting company with an important mission! Job Overview: GaN is hiring a Senior Android OS Developer to join the MCE team located in Huntsville, AL (Redstone Arsenal). The MCE system is being developed by the Army, with SAIC as the Prime Contractor, as a direct replacement for the currently fielded Joint Battle Command Platform (JBC-P) system.  It will be a state of the art battle command information system that provides integrated, on-the-move, timely, relevant Command and Control / Situational Awareness (C2/SA) information to tactical combat, combat support and combat service support commanders, leaders, and key C2 nodes.  It is being built from the ground up using the latest Android Tactical Assault Kit (ATAK) technology hosted on a customized, hardened Linux/Android Hybrid Operating System. MCE ATAK is a map-based Situational Awareness (SA) software application for Android platforms (smart phones, tablets, etc.) that provides non-satellite type Blue Force Tracking (BFT) and tactical capabilities for Special Operations Forces (SOF). Responsibilities Candidates should have an understanding of the Android OS- Understand Broadcast Receivers, Broadcast Intents, and the manifest file. Be capable of using Android Studio, the Android SDK to build APKs. Be able use ADB to push and execute APKs on the system.Java application developmentCandidates should be familiar with using a debugger to perform simple operations such as setting breakpoints, single stepping, and examining variable values.Candidates will be expected to understand the software development life cycle, be familiar with UML, and use standard UML diagrams in application and design documentationCandidates will be expected to work in an agile environment, and have the ability to plan, design, build, and test software components with minimal direction. Qualifications Requirements (minimum): Bachelors and five (5) years or more experience; Masters and three (3) years related experienceJava, Java Application DevelopmentAndroid OS DevelopmentLinux OS (RHEL)Bash shell is a plusPython is a plus  Desired Skills: DI2E tool suite: GiT, BitBucket, Jira, Confluence,Build systems/tools: Jenkins, BitBake, Gradle, LunchIDEs: Eclipse, IntelliJ, Android StudioScripting languages: Bash, PythonWorking on large defense related projects Special Requirements: Must be a U.S. citizen.Must have the ability to obtain and maintain a Secret Security Clearance, Active clearance preferred Equal Opportunity Employer: Geeks and Nerds Corporation is an Equal Opportunity Employer. We are pleased to consider all qualified applicants for employment without regard to race, color, gender, sexual orientation, gender identity, religion, national origin, age, marital status, veteran status, disability, genetic information or any other legally protected classifications. Geeks and Nerds Corporation participates in E-Verify."}