{"title":"DevOps Intern NEW!","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AAIFa-mvvaXvdQWkl8PZpNymvjeRUqmaNAOqo8aF5PbIVdUZHxUPJ8mYk69g7FNpcElLmf7maCxt7IV4nJwK7TafYRd2B138sUAENvXIvxt3Ddp8aulDj1X0JzBJyuDAWSRVkmrq5PW6kkzyoTHI0NncResuAfYLMQwjx2W1ggzGaOWyjLoUCZKwgkODyWdy","source":"ziprecruiter","full_description":"Description Position: DevOps InternLocation: RemoteFor over 10 years, Zscaler has been disrupting and transforming the security industry. Our 100% purpose built cloud platform delivers the entire gateway security stack as a service through 150 global data centers to securely connect users to their applications, regardless of device, location, or network in over 185 countries protecting over 3,500 companies and 100 Million threats detected a day.We work in a fast paced, dynamic and make it happen culture. Our people are some of the brightest and passionate in the industry that thrive on being the first to solve problems.  We are always looking to hire highly passionate, collaborative and humble people that want to make a difference.  About the team: The Cloud Reliability - DevOps team is engaged in developing and deploying applications and tools to automate Zscaler purpose build cloud operations and management.Responsibilities:As a part of the Cloud Reliability DevOps team, you will work on developing and implementing highly scalable, reliable and secure web based applications for Cloud operations and management.Interact with the Cloud Operations team to understand their pain points and devise software solutions to their needs. Maintenance and support of the existing DevOps applications.Work with Development and QA teams in automating the entire CI/CD pipeline.Requirements:Must remain enrolled in a Bachelor's/Master's degree program for the duration of the internshipGood analytical skills and problem solving attitudeGood OO programming skillsExperience in Java or any other Object Oriented programming language.Experience in web development technologies  - HTML/JS and experience on Angular or other web development frameworks.Experience in developing Restful APIsExperience in SQL and database design Experience in Python is highly desirableExperience of Linux OS and shell scripting Knowledge of  Networking and cloud computing is highly desirableVersatile and fast learner with ability to take early code and help with early integration testingExperience with REST API, Python, Perl, Expect and scriptingUnderstanding of networking protocols - TCP/IP, HTTP, HTTPS, DNS, RTSP, FTPMust be very hands on, passionate about quality and willing to collaborate with multiple teams for system testingGood verbal and written communication skills to partner with local and remote engineersWhat You Can Expect From Us:An environment where you will be working on cutting edge technologies and architecturesA fun, passionate and collaborative workplaceThe pace and excitement of working for a Silicon Valley UnicornWhy Zscaler?People who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we'd love to talk to you about joining our award-winning team.Learn more at zscaler.com or follow us on Twitter @zscaler. Additional information about Zscaler (NASDAQ : ZS ) is available at http://www.zscaler.com.  All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability."}