{"title":"Software Developer (DevSecOps)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJUvufc1KY5fwmiN74pfmm0L0y6UK41w7j7-YxmKQUZR4EtoCb1TKy5m3j3Fuy8h-8cZR82stLue-sdchLNtX6ecgEwDjBskQE4YwavzqT2r4S-ve79olr0t4Nyz6lftSWzGMgKSzhx6WtsEL5XhP_2nMKLsEvUed9RC4gQhUmYMD9frknoYd29v3S0DvE","source":"ziprecruiter","full_description":"Software Developer (DevSecOps)Job Category:Information TechnologyMinimum Clearance Required to Start:SecretEmployee Type:RegularPercentage of Travel Required:NoneType of Travel:NoneJob Description:General DescriptionCACI's Agile Solution Factory (ASF) is looking for a Software Developer for the pipeline Automation (DevSecOps) team supporting a key CACI DoD program.ASF programs thrive in a culture of innovation and are constantly seeking individuals who can bring creative ideas to solve complex problems, both technical and procedural at the team and portfolio levels. The ability to be adaptable and to work constructively with a technically diverse and geographically separated team is crucial.We are looking for talented individual to join our technically diverse team responsible for Continuous Integration/Continuous Deployment (CI/CD) and automated testing frameworks. Your willingness to develop CI/CD automated processes, learn, stay abreast of industry DevSecOps standards and apply innovations will contribute to this team. We are looking for a technical developer that recommends and applies creative ideas to solve complex CI/CD challenges, both technical and procedural. You will work as an integral part of an Agile Scrum team-a highly productive team of technical professionals who thrive on supporting the customer's mission and growth objectives through CI/CD automation opportunities. You will work in close collaboration with software developers on the CI/CD team, other product teams, shared services teams such as cybersecurity, and other stakeholders within agile methodologies to support and improve upon the automation of the software scanning, build process, and installation activities.Responsibilities:Serve as software developer delivering quality software code through the CI/CD pipeline automation development team. You will work closely with members of the development, test, operations, and other shared services teams to troubleshoot build breaks, enforce software quality standards, and communicate package installation steps to operations concerning both non-production and production environments. You will write tasks and tests related to a specific user story to ensure requirements are met within standards. You will estimate assigned work and report status and barriers at daily Scrum team sessions. Additional responsibilities include:Research, design, develop and/or modify pipeline automation software systems in direct support of contract product deliveries.Produces detailed specifications and writes software code.Works closely with business analysts, designers, and subject matter experts to understand functional requirements.Creates and executes test cases and authors technical documentation related to the CI/CD pipeline.Ensures adherence to program configuration change control standards.Understands the structure and functionality of the COTS applications (i.e., Oracle).Writes interfaces and conversion routines leveraging the application programming interface (API).Researches and analyzes third party vendor software tools for implementation within the CI/CD processes.Continue development and maintenance of the automated software build processes to improve operational practices and procedures.Work closely with each product family or shard services team to develop and employ new CI/CD features and capabilities.Assist with metrics tracking completion, defect reporting, defect prevention, root cause analysis, and development efficiency and quality.Contribute to an atmosphere of cross-functional teamwork within the organization's agile project lifecycle.Required Skills:Must be a U.S. Citizen, with an active secret DoD security clearanceCollege degree (B.S., M.S.) in Information Assurance, Computer Science, Information Management Systems or a related disciplineMinimum of 5 years related technical experienceExcellent written and verbal communication skillsStrong collaboration skills and desire to work within a teamHighly responsible, team-oriented individual with very strong work ethic; self-starterPrior experience with continuous integration, test automation and/or CI/CD, cybersecurity scanning apparatus on iterative software development projectsAbility to design and document technical solutions related to CI/CDExperience using source code control technologies and best practicesFamiliar with test automation toolsFamiliarity with automated build processes and debugging Continuous Integration build failuresExperience with agile project management toolsProficient with Microsoft Office suite of productsAbility to work in a fast paced, constantly changing environmentSolution-based thinker; capable of resolving complex technical challengesWorks well with limited oversight from manager, Business Analyst, or Scrum MasterDesired Skills:Acts independently to expose and resolve problemsCertified Scrum DeveloperInstallation package developmentPractical experience in AWS or similar cloud technologies as related to CI/CDAutomated Deployment experience on Windows Server / Linux RHEL platformsWhat We Can Offer You:- We've been named a Best Place to Work by the Washington Post.- Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.- We offer competitive benefits and learning and development opportunities.- We are mission-oriented and ever vigilant in aligning our solutions with the nation's highest priorities.- For over 55 years, the principles of CACI's unique, character-based culture have been the driving force behind our success.Company Overview:At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}