{"title":"PCB HW Engineer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AALZzwbLvJHsMwSjNZ3x9-ydjm11Ghn2pOviDbI6gCQzIMQWwd3r6awG0KcIsHmFSsO1MGkvBefv3nJDX-RxkdQnIvOGDfXupY46zmVCVW66xyjG26FIsoeYvUcUpeMbOvrOtUt8khoB_OBRqO-9LogyUYZy_sgDoirZaqt8gLXJPQYEhoqQ31bBclzMOeOG","source":"ziprecruiter","full_description":"PCB HW Engineer in Cleveland, OH at APEX Systems Date Posted: 1/8/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: Cleveland, OH + Job Type:Other + Experience:Not Specified + Date Posted:1/8/2019Job DescriptionJob #: 912347 Apex Systems is seeking a Sr. PCB HW Engineer to sit in Cleveland, OH for one of our top Industrial clients. This is a contract to hire role. If interested, please submit an updated resume to djackson@apexsystems.comJOB SUMMARY: Design digital, analog and power printed circuit boards. Position involves supporting the advancement of the Hardware and PCB design process, design techniques and related technology. The position requires understanding of the fundamentals of hardware and printed circuit board design, the associated tools and electronic component packages utilized. A global Design for Manufacturing mindset is essential for this position. Must have the ability to organize, plan, and coordinate design stages that are involved in a product development and the ability to make solid technical decisions that affect the direction of a design. The candidate will independently contribute to business goals & objectives as well as process improvements (lean concepts). Engages and contributes to the Hardware and PCB Design development on assigned projects. ESSENTIAL FUNCTIONS: + Support setting the direction for designing complex high speed digital, analog and power printed circuit boards, based on industry standards, developing technology and the client's specifications. + Ensures departmental compliance to quality requirements. Inspect and review PCBs for manufacturability and testability. + Helps reach consensus and achieve results within a project team. + Assists in the investigation of new tools and technology. + Creation, interpretation and editing of technical documentation not limited to schematics, technical publications, instructions, specifications, etc. + Evaluate design tradeoffs for design optimization considering performance, cost and manufacturability requirements. + Drives the development of Hardware and PCB Design automation with the design tools. + Drives process improvements to increase team capabilities and efficiency. Develops new methods and procedures for Hardware/PCB Design team. Evaluate and test new processes, procedures, and materials. + Communicates assignment status, concepts and issues and matches the message to the audience. + Provides input to PCB Design project requirements and schedule estimates. + Represents PCB Design on new/legacy product project teams. + Collaborates with Hardware Engineers, Mechanical Engineers, and Signal Integrity & EMC Engineers from product concept to post-layout validation. + Provides advice, consultation and training for members of the PCB Design team and other departments. Defines PCB Design work practices.EXPERIENCE AND EDUCATION: + B.S. in Electrical Engineering, B.S. in Electrical Engineering Technology, B.S. in Electronics Engineering Technology. + One to two years of industrial electronics exposure. + Experience with PCB board layout & associated CAD package. + Knowledge of hardware design, computer-aided (CAD) tools, methods of PCB design. + Proficiency in communication of technical and business ideas through engineering drawings as well as written and spoken English. + Minimum of one to two years' experience with manufacturing technically advance products. Preferably in electronic assembly.PREFERRED/DESIRED QUALIFICATIONS: + Experience with Signal Integrity and Power Integrity analysis. + Familiarity with SAP preferred. + Experience with Mentor Graphics Suite is a plus. + Background in Geometric Dimensioning and Tolerance a plus. + MS Office 365 experience.TRAVEL Position may require some travel (10%, possibly international). EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}