{"title":"Construction Estimator / Business Developer (Concrete) NEW!","location":"","salary":"","description":"","term":"$90,000 to $150,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAL5f_e8UCLoNSuGSaH8j0_GemLGkF00ZiJ4hKDKBhMOBMWE_PXu1DP9trw7Zfr3qANNHwjdmXRPpYE9-DEWbRevKi_7IvL74LLPHnMPoBBjw9Hfqk5VKpZ3uVUPrlQbzuF7mC-O96_MkbeXNMXOZeI_BR_Nhg2_ntx64kqmzJ6YnvuXF3zK13d1FL5oNsIt","source":"ziprecruiter","full_description":"Construction Estimator / Business Developer (Concrete) If you are a Construction Estimator / Business Developer (Concrete) with experience, please read on!$90k- $150k Depending on Experience--Concrete Experience Required--HQ - Overland ParkTravel - Yes, ~ 25%Relocation - YesWhat You Will Be DoingWe are on a mission to build out / build up our Construction Subsidiary.We are seeking anyone who can bring a rolodex / relationships / high level business development skills / High Level Estimators negotiators closers to our team relating to;1)Industrial Construction Mechanical (Structural Steel, Equipment Setting, Piping, Precision Millwright - We self perform)2)Industrial Construction Concrete Foundations (We now self perform and need to immediately build our backlog)What You Need for this Position- 3+ Years of Estimating - 3+ Years of Business Development- Concrete experience- Industrial Construction experienceWhat's In It for YouSalary= $90k - $150k+- Great work environment- Amazing/Generous compensation package- Generous PTO- Full Benefits- Career Growth+Bonus--Relocation Packages Available--If you're interested, please provide the following to get the ball rolling:1) Updated resume2) Salary requirements (a range would suffice)3) Interview availability this weekMy email is Justin.Johnson@cybercoders.com - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}