{"title":"Chemist IV","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIuW3iGt8TpbIcLzwInh1HWIdv3aZ_pp3lQziVIPIHA9fCR59hKY_RiLs-DWBTmUf7OYlAt7gjItjF3oYwhSv-06VoAkPOFbrfRK7xzCJ8_NND-v-fxtbjOTYBjCPO40GgcM1jE6Ill9_6UTuaJpBlrspJ3FmutzcudAQK5D1-c6Cq1VY0UrlMSGpPRMHYm","source":"ziprecruiter","full_description":"Chemist IV Apply now (https://secure.dc4.pageuppeople.com/apply/674/gateway/default.aspx?c=apply&lJobID=515840&lJobSourceTypeID=796&sLanguage=en-us) Job no:515840 Work type:Staff Full-Time Location:Main Campus (Gainesville, FL) Categories:Research/Scientific/Grants Department:29680400 - MD-CTSI-SECIMClassification Title: Chemist IV Job Description: Essential functions of the position includePlan, develop and carry out complex research projects using LC-MS/MS methods for a variety of biomedical studies, including structural identification and quantification of small molecules. Processes data and prepares statistical analysis to be presented to clients in a report format. Evaluate and improve upon existing analytical methodsConsult, coordinate and communicate with SECIM service clients regarding research projects, taking the lead in quantitative projects from initiation to completion and sending final project reports to client.Grant writing. The senior chemist is expected to identify 3-5 funding opportunities per year, discuss those opportunities with the lab director, and take the lead in the grant writing and application process.Manuscript preparation and submission. The senior chemist is expected to prepare and submit manuscripts for publication in coordination with faculty and resulting from the development of novel and other research methods. Chemist is also expected to present these research findings at national meetings8% Daily operation and maintenance of the instruments. Ensure that instruments are functioning as they should on a daily basis. Maintain instrument maintenance logs. Consult with Lab Manager regarding scheduled maintenance and service calls.Direct, coordination, advise and train new students and other research personnel. As needed with new staff and/or instrumentation and methods.Promotion of services offered by SECIM. Continuous effort to promote the center and lab. May be required to attend meetings outside of the state, and create advertising and promotional materials. Expected Salary: $68,000-$75,000 per year; commensurate within this range based on qualifications and experience Minimum Requirements: A bachelor's degree in chemistry or a closely related field and thirteen years of relevant experience; or a master's degree in chemistry or a closely related field and eleven years of relevant experience; or Doctoral degree in chemistry or a closely related field and eight years of relevant experience. Preferred Qualifications: PhD in analytical mass spectrometry preferred.Applicant must be proficient in bioanalytical chemistry employing LC-MS/MS. Knowledge of metabolomics a plus. Special Instructions to Applicants: In order to be considered, you must upload your cover letter and resume.Application must be submitted by 11:55 p.m. (ET) of the posting end date. Health Assessment Required:Yes Advertised:17 Feb 2021Eastern Standard Time Applications close:10 Mar 2021Eastern Standard Time"}