{"title":"Technical Support Engineer - ResWare NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIWfJHYdd1NysBtHg3y2rP7dlbdsMk6QCNE-rUbbG3xNvX1VbC_CYdM3hqTVDSg7dafgILRJdn56-Vne7obKgxx6bEhWtW28llQnO1eLa5_iifziqYJmKXQEz5BPhn757dVg2scjD5M8C_sb6Ra7d-_EBzsUDmQg1Y1jmeU3dZrPJwZwLzei5QmLgKknHFJ","source":"ziprecruiter","full_description":"At Qualia, we've built a new class of real estate technology that simplifies home buying and selling into an easy, understandable, and secure process. Our products bring together users from across the real estate ecosystem-homebuyers and sellers, lenders, title and escrow agents, and real estate agents-onto a single shared platform, providing greater clarity and transparency to real estate transactions. Today, millions of consumers use Qualia to close on homes every year.WHAT YOU'LL WORK ONAs Qualia embarks on its next phase of growth, we are seeking a Technical Support Engineer to help fuel our continued success and provide value to the customers of our robust, yet customizable ResWare product. The Technical Support Engineer will support administrators and users of our ResWare production platform. This is an extremely important role for us. One of the reasons our customers love us so much is because of our support - it's a high-touch and quick-response team. The ideal candidate for this role is someone who can help continue to grow this reputation.You'll make it easier for our customers to operate our software while respecting their time and unique needs. You will be obsessed with and focused on problem-solving and efficiently resolving customer issues. You are highly empathetic - you understand the stress that is inherent in the home buying process, and are a natural educator. RESPONSIBILITIESProvide timely and highly-satisfactory customer service including identifying issues, recommending solutions, offering workarounds, and/or providing hotfixes for problems which impact customer operationsProvide administrative assistance, diagnose problems, and offer solutions in a Microsoft-based environmentDiagnosis and troubleshoot supporting infrastructureMaintain productivity and quality standardsContribute to a work environment which fosters pride in being a part of a winning team and promotes personal growthBe responsible for stewardship of sensitive customer informationYOUR BACKGROUND THAT LIKELY MAKES YOU A MATCHExperience supporting, troubleshooting, and configuring complex software and the interaction with supporting hardware and networkingExcel and enjoy helping people solve their most challenging technical problemsStrong technical/software skillsExperience with SQL Server administrationAbility to write and diagnose SQL queriesBackground in system administration, technical support, and/or developmentExcellent organization and interpersonal skillsExcellent verbal and written communication skillsAbility to work with all levels of customers, including end-users, management, and executivesExperience in the real estate, title, and escrow business a plusHome address within reasonable driving distance of Superior, Colorado though remote work is a possibility depending on experienceEXPERIENCE IN ONE OR MORE OF THESE AREASStrong SQL experienceProficiency in IIS and MS Office productsExperience with ResWare, our platformRemote PC troubleshooting experience using RDP, RemoteCall, GoTo Meeting, etc.Network troubleshooting of routers, firewalls, network layers, web technology; use of WireShark and FiddlerDesktop and server virtualization administration and troubleshootingCitrix, Terminal Server, Hyper-V, VMWare, VirtualBox, etc.Coding or scripting experience and interestC#, Perl, Python, Powershell, etc.WHY QUALIAQualia is made up of incredibly bright, mission-driven coworkers who are passionate about using technology to solve real-world problems-and we're growing quickly. In order to continue building an engaging and dynamic organization, we're committed to giving everyone the support they need to do great work.Our benefits package is designed to allow our team members to be their best selves, both in and out of the workplace. In addition to comprehensive health plans, a 401k program, and commuter benefits, we prioritize family and personal well-being through professional development, parental leave, and a flexible time off policy. The team is temporarily remote during the pandemic, but Qualia offers a robust online onboarding program to train new hires, biweekly all hands meetings, daily meditation sessions, and a variety of internal virtual events to keep employees connected.We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. Qualia is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status."}