{"title":"Technical Editor - Mechanical Labor","location":"","salary":"","description":"","term":"$17 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKr64W4sSj54heK9c7DbnX1G6vNbIZEhmug3KiQV2W4IExlYaIfjqhheNbYTkR2T4b3t8a_AZoa4NC1worQ_rGYX007B1WwIr8vWbS9OpJXONd2RYqmnFzl3hRUi-1LX0Gfly3CNKJrQN19DdUN-t6OmHN84CyydZPqFf4xtMzo2-Ff1NMitGA12uDfS2H2","source":"ziprecruiter","full_description":"PrideStaff San Diego has a great opportunity with one of our best Clients in San Diego!Title: Technical Editor - Mechanical LaborAs a member of the Labor Information Creation Team, research, develop, and edit automotive labor information for incorporation into the Client Repair database.Assignments monitored by Coordinating Senior Editor or Senior Editor or Team Lead. Reports directly to Coordinating Senior Editor, but usually receives daily direction from Senior Editor.Essential Responsibilities:Using Clients Electronic Publishing System, research and compile labor and other pertinent data and input into on-line computer system. Information must be technically accurate and input in a format consistent with established guidelines.Will work in a team environment, contributing toward the achievement of team goals and objectives. Team goals and objectives are defined by the product update schedule and budgeted hours per project as outlined in the current year budget and communicated by Coordinating Senior Editor or Manager.Inspect vehicles to validate labor data as necessary.Keep abreast of industry changes.Handle customer service activity pertaining to labor data.Suggest improvements and/or enhancements for Clients Mechanical Estimating products in response to customer input or based on field knowledge of user needs.Represent Client at industry and association meetings as required.Observe repair procedures and compile time studies as required.Maintain knowledge of comparable competitive products.Prepare and submit project status reports for each assignment as requested.Maintain professional and cooperative attitude within the Mechanical Estimating Department and with all support groups.Meet established guidelines for productivity.Experience and Educational Requirements:High school diploma.AA or Vo-Tech degree, with mechanical repair emphasis preferred.ASE or equivalent trade certification.Minimum 8 years combined industry/editorial experience.Sufficient automotive knowledge to determine labor information relevant to mechanical repair application.Knowledge of latest automotive systems, diagnosis and repair procedures.Computer experience relative to input (keyboard and mouse) 30-35 WPM, minimum.Excellent organizational and communication skills.Ability to work with minimal supervision.Working Conditions/Physical Requirements:Office and repair shop environment.Some traveling may be required.Overtime as required to meet business needs (including Saturdays).This is a temporary to direct opportunity, starting hourly rate is $17.00 per hour with potential overtime including Saturdays.Due to the high volume of responses, only those that meet the qualifications above will be contacted."}