{"title":"Principal Applications Engineer - Wireless Charging Hardware NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIC-nSj3Bo__0Kt6kks4Rd3t1oj9Uk9sG-kQrjigK3dCNfBIoqKMcNtGc-f1EMwpSa9KgzLsAIwAd-CfqtfGz7IdytshQXdC96wQfTEaj5W4X0Wj4rVJLwOJux7V62QdYS0mK7JMOsgMuQ8PmrsC-agJLW-IMAKDoRzsvz3_6Q15U90OXP7mYGZsO0y4rP9","source":"ziprecruiter","full_description":"Principal Applications Engineer - Wireless Charging Hardware Principal Applications Engineer - Wireless Charging Hardware Join a team focused on developing leading-edge solutions for the current and growing Wireless Charging market by contributing to the release of products conforming to the latest standards.  Apply online now Location: San Jose, CAJob ID: 315215 Operating department: CYSC PSS EPIC WCS AS PMAHire4IFX: Yes Job descriptionIn your new role you will:Design, development, testing and certification of Wireless Charging Evaluation and Validation boardsDefining next generation silicon devices for Wireless Charging TransmittersDevelop customer facing technical collateral (Datasheet, Application Notes, White Papers, Technical Presentations) for Wireless Charging ApplicationsDefine, evaluate and test tools that customers would need to build Wireless Charging TX designs including design calculatorsProvide product design-in support for key customers including debug of hardware and firmware issuesPerform competitive analysisCross-functional work with Firmware Engineering and Design Engineering to build customer reference designsYour profileYou are best equipped for this task if you have:Bachelor's degree in Electrical or Electronics engineering 12+ years of related work experienceComplete knowledge of Wireless Charging Protocol (Qi) and associated compliance testing methodsExperience with Power Conversion and Power Distribution circuits with focus on DC-DCExperience with passing conducted emissions and radiated emissions testing for Wireless Charging Designs is preferredStrong Analog and Mixed Signal Hardware experienceBackground in Magnetics design and simulation is a plusStrong PCB design background with experience in optimizing layout for EMI, thermal and noise performanceInfineon Power & Sensor Systems (PSS) semiconductors play a vital role in enabling intelligent power management, smart sensitivity as well as fast and reliable data processing in an increasingly digitalized world.Our leading-edge power devices make chargers, adapters, power tools and lighting systems smarter, smaller, lighter and more energy-efficient. Our trusted sensors increase the context sensitivity of \"things\" and systems such as HMI, and our RF chips power fast and reliable data communication.- We drive leading-edge power management, sensing and data transfer capabilities -Click here for more information about working at PSS with interesting employee and management insights and an overview with more #PSSDreamJobs.Part of your life. Part of tomorrow.We make life easier, safer and greener - with technology that achieves more, consumes less and is accessible to everyone. Microelectronics from Infineon is the key to a better future. Efficient use of energy, environmentally-friendly mobility and security in a connected world - we solve some of the most critical challenges that our society faces while taking a conscientious approach to the use of natural resources.Cypress Semiconductor Corporation is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), gender identity, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition, family care status, military or veteran status, marital status, domestic partner status, sexual orientation, or any other basis protected by local, state, or federal laws. Applicants with questions about access or requiring a reasonable accommodation for any part of the application or hiring process should contact the Talent Network by phone at (408) 503-2194.Employment at Infineon is contingent upon proof of your legal right to work in the United States under applicable law, verification of satisfactory references and successful completion of a background check and drug test, and signing all your on-boarding documents .In some instances, if applicable, U.S. export control laws require that Infineon obtain a U.S. government export license prior to releasing technologies to certain persons. This offer is contingent upon Infineon's ability to satisfy these export control laws as related to your employment and anticipated job activities. The decision whether or not to submit and/or pursue an export license to satisfy this contingency, if applicable, shall be at Infineon's sole discretion.IMPORTANT NOTICE:Infineon Technologies takes data privacy and identity theft very seriously. As such, we do not request personally-identifiable information (PII) from applicants over the internet or electronically. Please kindly refrain from disclosing your PII electronically during the application process or to unauthorized websites that may purport to be Infineon or any of our affiliates. Does this sound like just the right challenge for you? If so, we look forward to getting to know you! Apply online now (It only takes 90 seconds)"}