{"title":"Senior PHP Devops Engineer (URGENT) NEW!","location":"","salary":"","description":"","term":"$150,000 to $250,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKeGRP12VEqKi8GEo2uPJDq5iZzRLQ-ePUk7AejOAHwpwv-XtIkGD-TgAH752rSbquTz1GTEkkR_j8t_Lq3aNuBU36QLm70T7pVi1H6-Yy0IwOOPyLux7pNAoZDHjmPtSN1J-e1T6ei5Iu8CmnVSSnlUxiEdQPXCqS8y8RA5MZYvHUsUVxeLRxA7Ss-lw","source":"ziprecruiter","full_description":"NO C2CMust Have: PHP Experience (the biggest reason for rejection is due to lack of recent PHP experience)Strong Communication SkillsMust be able to work through issues that come up, and direct the team on what must be done to fix the itemSelf StarterThis role would be the 2nd in command only reporting to the CTO. Will have at least 3 direct reports under them located onshore and offshore (Ukraine, Philippines) .Interview Process1) Zoom meeting with the COO and CEO (Get to know each other meeting and assess communication)2) Onsite interview with the Hiring Manager and COO3) A coding exercise via ZoomPerks: Dog Friendly Office, Casual Dress Code, Commuter Benefits, Swimming PoolWe are hiring a Senior PHP Devops Engineer to join our Technology department. This position will report to our CTO as second in command and will provide senior leadership over all things technology. This includes overseeing technology best practices, organizational IT, system administration, and hands-on development. A passion for cybersecurity (SOC2/PCI) is a huge plus!This role will be responsible for assisting the CTO in all manners of technical team operations and management. Infopay is a rapidly growing company and the sky’s not the limit when it comes to future growth opportunities for the right candidate in this role.*This is not a remote position.Responsibilities: Responsible for being proactive on initiatives such as: Keeping tabs on high-value projects, understanding how the business makes money, is a part of trimming the fat (unused technology, servers, etc…), creative ideas on expanding the business, making sure all aspects of the tech team’s work is valuable and scalable.Must be able uphold the rules and understand Agile & Scrum (training included).Must be communicative and transparent to the entire team especially upper management.You will be working closely and assisting the CTO.Help hold the team members responsible in moving tasks forward with high quality.Help keep multiple balls rolling (multi-tasking on different subjects).Help to support the tech team in building best practices and moving forward.Help to understand each team member’s needs and to positively grow each individual.Ability to help coach the team.Must be able to switch gears from a Senior Developer Role to a Senior Ops Role; managing Amazon, Linux systems, creating new services, etc…Must be able to know the latest technology trends and best-case scenarios to use new technologies.Most importantly, must maintain a positive and team-working atmosphere!Requirements: The right candidate will be a strategic thinker, collaborative partner, and strong personnel manager. Strong communication and interpersonal skills will be vital for this role.Excellent written and verbal communication skills.Strong leadership skills and the desire to move into a leadership role.High level of personal integrity.Agile (preferably Scrum) experience.7+ years of experience with PHP, Linux, Ubuntu, System Admin.Excellent skills in object-oriented PHP environmentMYSQL, MongoDB, JavaScript, JQuery, OOP, REST/SOAP, API/XML/JSON, SVN/GIT, Netbeans, AWS, Google Cloud, Azure, YiiAbility to multitask in a meaningful way and prioritize demands.Strong analytical skills."}