{"title":"Android Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALhunPI9yzrV3O_OuNMNA9G9tSTnqPjkrePXDMkw131gcJXs46TnVknY-opqGBNLWy_M9GkFyYdefMGSjyPo7LLo8ezkU6idT6UyaWuTfYWCiz2Qq10BDS-IWZYg35Sk6DuElTeKkZ9z_V9pZI61JmlIh3O1Mup2AOO9MXFhB3vcbIbbkdFNaQxYzlqNPAl","source":"ziprecruiter","full_description":"Our Digital development team is focused on creating experiences and services that are innovative, market disruptors, and game changers. Both Apple and Google rank us as one of the top 5 finance apps - and we're still not happy with it. We want developers to write code for humans - clear working code, well documented, and maintainable.  You would be working on internal frameworks incorporated into banking and financial apps that are used by millions of our customers and clients worldwide.RESPONSIBILITIES:       Complete development assignments on time with an appropriate level of quality to support project efforts.       Create work estimates based on technology concepts and requirements documentation.       Support project releases.       Agile Software Development:  Participate in Daily standups, backlog refinement, sprint planning events to discuss daily progress and support deliver efficiently.       Create architecture diagrams based on business requirements and flow charts to design solutions for mobile Android applications.       Develop frameworks that can be testable, promote test-driven development, using Java and/or Kotlin. Participate in code reviews and adhere to coding standards.       Implement component specifications to identify behavioral analytics.       Participate in defect triage calls to ensure all requirements have been appropriately met and ensure there are no potential defect that may cause potential impact.       Assist with release validations to ensure key project milestones are identified to mitigate risk before launch to customers.       Troubleshooting and identifying the root cause of issues under time pressure       Efficiently translate requirements into efficient code.REQUIREMENTS:       5+ years of experience designing and implementing native applications and frameworks       5+ experience with Data Structures and Multi-Threading.        3+ years of combined software/application development experience with Java and Android       3+ Experience building localized, multi-tenant solutions       3+ years of experience working with API integration3+ years of experience with 3+ experience of build systems such as Gradle, Jenkins       Git/Bitbucket version control or comparable (SVN etc.)       2+ years of experience collaborating with cross-functional stakeholders       2+ years of experience with unit testing libraries (like Mockito)       Working knowledge of architectural patterns such as MVP and MVVM       Working knowledge of application design patterns - Gang of Four patterns       BS degree in Computer Science or equivalent experiencePREFERRED:       Experience with RxJava       Prior experience working on agile teams       Pair programming ability       Created an application that is available on Google Play Store       Proficiency with Mac OS X       Experience with scripting languages       Experience with iOS development       Experience with Web Full-stack development"}