{"title":"Manufacturing Engineer NEW!","location":"","salary":"","description":"","term":"$60,000 to $85,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALcGufMEp1aQsmvbXuS9mPzBylgrLxYuaUmuAcIfONOKadd8kaX4-MVf55q7rF4DI8gsjJpbroRgxNTMeSMake5nteI20ejQjyKYvOooJfTlhdWAFDT28yoPKSWDfqhBIIbaNTxgO-Ou_6eROypolrmQ7IbS5fMx3tqHmXVftn5Z4TZ-R1V_FHNK1GaJcq5","source":"ziprecruiter","full_description":"Manufacturing Engineer Direct Hire$60,000 - $85,000 Milton, Fl.Manufacturing Engineer Job Summary The Manufacturing Engineer will be responsible for developing and improving the manufacturing processes for the business. Other necessary Manufacturing Engineering skills include project management ability, a strong electro-mechanical background, a commitment to quality, and familiarity with safety and environmental standards. Responsibilities Evaluate and improve manufacturing and assembly processes based on quality criteria, efficiency, and speedOptimize facility layouts, production lines and production equipmentInstall production equipment and toolingMaintain monthly preventative maintenance on equipment and work closely with production daily to ensure equipment is running efficiently and properly supported.Work with Quality Assurance on Root Cause Analysis to properly address any production defectsLead continuous improvement efforts, finding ways to reduce costs and maximize qualityDevelop, recommend and test effective automated and manual systemsUpgrade systems and processes with new technology where possibleTrain staff in new and existing processes such as IPC standards related to the production of cable assembliesEnsure that manufacturing procedures follow safety and environmental regulationsAssist the commercial procurement team from a technical perspective when new products are requested from customers that have not been previously purchased.Provide technical support for customer and or supplier related issuesCollaborate with other engineers, contractors, and suppliersRequirements:3-5 years experience as a Mechanical Engineer Hands on experience maintaining manufacturing equipmentPrevious experience in a cable and/or cable assembly production environment preferredKnowledge of manufacturing processes including over molding, ultrasonic welding, and cable assembly preferredCommitment to health and safety standards and environmental regulationsWell-versed in relevant software (e.g. CAD, MS Office)Project management skillsProblem-solving abilityTeamwork skillsAbility to occasionally work late shiftsB.S. in Engineering or related technical background"}