{"title":"Software Engineer, Frontend","location":"California","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">2+ years of practical experience writing client-side JavaScript.</li>\n <li>Collaborate with <b>engineers</b> to spec, write, test, and deploy code that integrates with the Slack…</li>\n</ul>","term":1,"jk":"e38b0347fb3b2277","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=e38b0347fb3b2277","source":"indeed","full_description":"Slack is looking for a Software Engineer, Frontend to join Slack's Rimeto team. Recently acquired by Slack, Rimeto offers an advanced enterprise directory, automatically integrating information from across your organization to deliver rich profiles of every employee, their skills, experience, and current projects. Rimeto brings together everything you want to know about your colleagues and makes it easy to find the people you need and understand the humans you're working with. Rimeto is a fast growing business that is strategically important to Slack's long term growth plan.\n\nWhat you will be doing\n\nCollaborate with engineers to spec, write, test, and deploy code that integrates with the Slack and Rimeto platforms\nBrainstorm features with product managers and designers and guide decisions based on your knowledge of the codebase\nLearn about, use, and teach new web technologies\nReview code and have your code reviewed\nMentor and be mentored by other engineers\nWork multi-functionally with other teams to set and achieve company-wide goals\nHave opportunity to work \"full stack\" and implement features end-to-end\nLike the work you do, enjoy collaborating with your coworkers, and go home on time\n\nWhat you should have\n\n2+ years of practical experience writing client-side JavaScript\n1+ years experience with React and/or TypeScript\nExpertise building responsive layouts with CSS and HTML\nExperience building and debugging complex systems in both individual and team environments\nExperience with modern browser technologies\nStrong UX and design sensibilities and an interest in sweating the small stuff\nStrong problem-solving skills and a tenacious attitude towards open-ended challenges\nExcellent communication skills and a collaborative mindset\n\nBonus points if you have experience with\n\nExperience working on consumer facing products\nExperience working with GraphQL or Node.js\nOptimizing the JavaScript performance of large-scale, high-volume systems\nAccessibility, internationalization, or localization\nThe Git workflow, including pull requests, code reviews, and CI/CD systems\nAny of the technologies we write about on our blog at https://slack.engineering/\n\nSlack has a positive, diverse, and supportive culture—we look for people who are curious, inventive, and work to be a little better every single day. In our work together we aim to be smart, humble, hardworking and, above all, collaborative. If this sounds like a good fit for you, why not say hello?\n\nSlack is an Equal Opportunity Employer and participant in the U.S. Federal E-Verify program. Women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Slack will consider qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance."}