{"title":"Android Full-Stack Software Developer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AALPR_bVxo0fRUZrVgjH6SzJ-oz3AS4baY_Un43tK-ubKaj8qGb7XuS2B0lNeuqpQyTqpv0mThYNEKbZ4U7Ke_XEkBmytB7WofbhzCEfP6YS1pqzqv_9hm4p9vQyth1yfC3M8NRCeYR1chWkqyvSQV4QMqqI6qus86QXMQMR9_AQxiJjfd0qIjIHRDyB5rQ","source":"ziprecruiter","full_description":"Android Full Stack Software DeveloperOur client is looking for an experienced Android Full Stack Developer to join their team! This is a great opportunity for anyone who enjoys a high energy and fast-paced working environment. As a Full stack Developer, you will have the opportunity to design, build, test, maintain, and have a direct and meaningful impact on the roadmap of the digital platform. You will be responsible for design and development of Orchestration service layer of highly scalable eCommerce web application. The Full stack Developer strives to continuously improve the software delivery processes and practices and be a role model and demonstrates the company's core values of respect, honesty, integrity, diversity, inclusion, and safety of others.Location: Remote then onsite Duration: 12-month Contract to hirePay Rate: $63-66 hourly W2NOTE: U.S. Citizens, GC, and those authorized to work in the U.S. are encouraged to apply.We are unable to Consider OPT or H1B Visa Candidates for this position.Key Responsibilities:Identify and uphold Fullstack engineering best practicesCollaborate with designers & product managers to iterate on the design & implementation of our productWork with Engineers from our consumers to build and ship featuresDesign a framework for creating services that grows with the needs of the companyMonitor performance, watch for traffic drops related to usability problems & rectify the issuesReview app and feature code, and plan future API upgrades with the development teamAssist in the development of applications & features that will be put on the website, mobile app, and external client appsStay up to date on emerging technologiesRequired SkillsExperienced web dev with Kotlin expertise to build out server-side analytics mapping and other capability development to support product maturation to server-side architecture.Preferred skills/experience: - JavaScript - Java and/or Node.js and/or Kotlin services experience8+ years of Server-side development experience with Node.js and Java/SpringSignificant knowledge of Frontend web development stack with JavaScript/CSS and Angular or ReactKnowledge of SQL Database and NoSQL Databases (MongoDB/Cassandra)Strong analytical problem-solving skillsExperience with modern micro-service architectureProven Experience in building RESTful APIs and a deep understanding of REST principlesDetail oriented and work well in a team and individuallySelf-starter with strong initiative and ability to work under pressureUnderstanding of the entire development process (design, development, and deployment)Excellent written and verbal communication skillsAbility to prioritize work and complete tasks with quick turnaround timesExcellent organizational, time, and project management skillsBusiness-minded approach to time, costs, and deadlinesCategory Code: JN008#zr"}