{"title":"Embedded Software Developer","location":"Poway, CA 92064","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Work directly with senior <b>developers</b> for task assignments, code reviews, documentation, and other development activities.</li>\n <li>Experience with Git for versioning.</li>\n</ul>","term":1,"jk":"40d5cda94b0135e6","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=40d5cda94b0135e6","source":"indeed","full_description":"Who We AreWe are driven by a passion to design and manufacture the highest quality grid-scale power converters available. Rooted in this passion, we provide our customers with inverters and DC/DC converters from 250 kW to 6 MW. Everything we make is 100% developed by our engineering team in San Diego. Today, power electronics are more than ever becoming the core technology within major growth sectors such as renewable energy, energy storage, and electric vehicles, etc..What We DoEPC is located in the center of a high-tech commercial park in Poway, CA to meet the demands of its rapidly growing customer base. The R&D team is focused on developing robust and reliable power conversion solutions to real-world customer problems, and doing it in a smaller, more powerful footprint than anything else available today. We enjoy what we do, and we encourage a creative, healthy, and highly collaborative environment. Our goal is to work together as a fun, creative, and professional team; learning from and encouraging one-another as we push the state of the art forward in power electronics.Job DescriptionEPC is looking for an upbeat, motivated, embedded software developer to join our software & controls group. Must be a team player. This small team is entirely responsible for developing and maintaining real time embedded software running megawatt class inverters for industrial and renewable energy applications. The team also develops and maintains associated desktop commissioning tools, build tools, automated testing, documentation, and release process tools. Our inverters, including the software, are regularly certified for UL, IEEE, and other required standards before deploying. This in part makes our software development both challenging and rewarding. You will be an important contributor to the continued success of EPC products.ResponsibilitiesWork directly with senior developers for task assignments, code reviews, documentation, and other development activities.Participate in multiple sync up discussions throughout the week.With a fair amount of independence, document, design, develop, and test new features.Participate in investigating and fixing new and existing bugs.Interact with the wider organization [engineering, manufacturing, testing] to solicit needed informationSupport testing and customer activities as needed.Maintain and contribute to further development of unit tests, integration tests, and other software development best practicesBe a team player, participate in regular scoping activities, elevate concerns quicklyQualificationsB.Sc. or M.Sc. in computer science, computer engineering, or similar technical field5+ years experience related to job responsibilities, skills, ...Adept in CExperience developing real-time embedded microcontroller softwareWorking knowledge of PythonExperience with Git for versioningDesired SkillsExperience with power electronic controls such as inverters, motor drives, power suppliesExperience with TI Delfino C2000 DSPs and Code Composer StudioTesting [unit, integration]CI [Jenkins]Embedded ethernet stack / LwIPLinuxARMFPGAsMulti-core and distributed processingModular code designReal Time Operating Systems [TI-RTOS, FreeRTOS, CMSIS,...]BootloadersDeveloping design documentationTest Driven DevelopmentAgile/Sprint/Scrum based software development workflowFamiliar with typical embedded hardwareGPIO, External Memory [Flash/RAM/EEPROM], Power Supplies, AD converters, amplifiers, signal conditioning, Communication [RS-232, RS-485, CAN,Ethernet, Modbus], JTAGPeripherals: I2C, UARTs, data busJob Type: Full-timeBenefits:401(k) matchingDental insuranceDisability insuranceEmployee assistance programFlexible scheduleFlexible spending accountHealth insuranceLife insurancePaid time offRelocation assistanceTuition reimbursementVision insuranceSchedule:Monday to FridayCOVID-19 considerations:In order to ensure the safest environment possible for all team members during the COVID-19 pandemic, team members are provided hand sanitizer, gloves, face masks, alternative work schedules and whenever possible isolated work areas.Education:Bachelor's (Required)Experience:Embedded Software: 5 years (Preferred)Willingness To Travel:25% (Preferred)Work Location:One locationWork Remotely:Yes, temporarily due to COVID-19"}