{"title":"PQR - Technical Support","location":"","salary":"","description":"","term":"$24 to $25.36 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAKeWwjPjXJFykHaYRBTv49JrTVgP9X3gfIH_ziUW3dR2ZxKsHlpwSx1N0ySUZgfO1c91YuzgdvT6Ty02Dz5X-LO3NrvPCSoGdNuY5L1glO74DE47S2cFBLtLq4ifrRtqkAq2ZNHV-28xjJ7Ttp39q3vky3ZFRP2EAB0uVrb4bfZ51QMuX9uCIo5uI06TNI","source":"ziprecruiter","full_description":"Are you the next best Product Quality Representative? If so, we’re looking for you!Our client is actively seeking a talented Product Quality Representative to work at their location in Cary, NC. This is a five month contract to start. Hours would be 10am-7pm, 11am-8pm or noon-9pmJob Overview:The Product Quality Representative (PQR) provides the initial technical support contact to all internal and external customers who use, install, sell and service CWS products. The PQR will implement standard call greetings, workflow, follow-up commitments, call closing and follow-up execution in accordance with established best practices.The PQR assesses problem severity and documents all customer interactions within the customer relationship management (CRM) system in accordance with quality system requirements. The PQR delivers timely resolution of technical & non-technical issues by applying product knowledge, analytical skills, communication techniques and available tools, keeping customers continuously informed of issue status.The PQR will schedule and perform remote upgrades and services, managing these efforts to ensure efficient and successful outcomes.The PQR will develop broad product expertise and stay current on feature and patch evolution through consistent study of available documentation and routine training activities. Issues outside of PQR knowledge or technical ability are to be escalated promptly in accordance with established processes. The PQR will perform logistics duties such as parts orders, RMA processing, purchase order authorization, etc. as required.The PQR will participate in after-hours 24x7 on-call rotations, and be available to work flexible shifts as needed. The PQR will deliver on individual, team and corporate goals in accordance with established objectives and standards of performance.Key Responsibilities:Provide efficient technical support to internal and external customers via phone, email, web inquiry and other contact channels as presented.Document customer interactions, troubleshooting details and service activities thoroughly and accurately within cases in the CRM.Dispatch field service resources with proper handoff of customer ownership.Escalate technical issues properly to facilitate rapid resolution. Process routine and expedited parts orders, RMAs, and secure purchase orders.Perform remote upgrades and deliver remote services accurately.Serve in 24x7 technical support on-call rotations, ability to work flexible shifts.Achieve individual and team metrics, and contact center key performance indicators.Strive to exceed customer expectations and deliver consistent customer satisfaction.Requirements:Associates Degree in an IT, computer, technical related field of study or industry specific technical certification i.e. A+, N+, MCP, MCSA, etc.1-3 years of Technical Support experience preferably for an external customer (not internal desktop support)Excellent computer skills and experience with remote services, MS Office, AutoCAD, Visio, etc.Ability to work independently within a team environment, effectively multitask to meet deadlines and competing priorities.Exhibit good interpersonal and diplomacy skills, excellent verbal and written capabilities.Experience working in an FDA regulated environment is a plus.Foundational Knowledge in several of the following areas:NetworkingTCP/IP, Routing and Switching, Subnets, Security.Enterprise hardwareServer/Client OS, SANS, RAID.TelephonyPBX, VOIP. o Wireless & RF technologies.SQL, Scripting, Reporting Engines, AnalyticsMiddlewareRhapsody, etc. HL7Job Requisition # 30192"}