{"title":"Sr Software Developer iOS","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKXzW2ugTEFROb2ZBfz5P8Xt0iGuiExUMdLszUO9DmVtx3bgyXV-_str7Tuyssv9m_xzNKpI4ygd9fjInpPOv3COx40VI3IrR2NRPKY_I3CV7ILgbq8TJshIUIeJTIJXIN-AhveknpGXSX2LfFPoZOl1WIhM0AynPzuYSMBJ_s7yyJNizz6qgHgGLEURV4k","source":"ziprecruiter","full_description":"Overview The Brand that Gets You to What's NextExpress is the vibrant, confident lifestyle brand for ambitious people, providing the latest fashion for style-obsessed men and women since 1980. Our mission is to provide inspiration and confidence through fashion to help people get to what's next in their day, and their lives. With more than 600 retail and outlet stores throughout the United States, Puerto Rico and Latin America, and a best-in-class online/mobile shopping experience at www.express.com, Express brings city-inspired style to customers across the globe. A Workplace To MatchWe think you'll like it here. We offer a competitive compensation and benefits package, generous associate discount, and casual work environment. Working at Express is much more than the 9 to 5. It is an opportunity to connect and engage with some of the smartest individuals in the fashion business doing work they are passionate about.  This is the Express Life and we're always looking for talented leaders at all levels to join our team; if this sounds like you, we'd love to chat! Responsibilities This position will be primarily responsible for crafting performant and resilient digital interfaces using a modern iOS technology stack. This critical role will need to coordinate work across multiple systems, teams, and departments in an agile environment. Strong communication skills will be needed for this position to integrate solutions across other engineering teams within and outside the organization, as well as work with business stakeholders and make Express's iOS application reliable and successful.  This position works in a cross-functional agile team and requires leadership skills to drive solutions that meet the demands of the business. This position works closely with product owners, business stakeholders, creative, and scrum masters.  This position will work with Swift, Objective-C, and React Native associated technologies (i.e., Redux, Relay, Apollo) on a day-to-day basis. All work done is expected to be fully covered by automated unit tests, so the candidate should have a strong understanding of testing methodologies and test-driven development. This position supports omni-channel objectives for customers and associates and will be using native mobile development best practices and cutting-edge technologies such as React Native.  An understanding of continuous integration and delivery, source control management, as well as internal and external app distribution models is a must, as this position will be involved in building and deploying applications to both internal company devices as well as customer-facing devices via the App Store. A background in computer science and software engineering principles is beneficial, as this position will be accountable for application stability and performance. Express is committed to delivering a world class experience for our customers and associates across all channels and this position will help ensure our iOS applications are on the cutting edge and become a benchmark our competitors strive to emulate.   Essential Tasks Write high-quality, test-covered code using Objective-C and SwiftPlan and execute conversion of portions of existing Objective-C and Swift applications to React NativeDemonstrate technical excellence in software development, with expertise in modern iOS development best practices and knowledge of paradigms such as functional, object-oriented, and imperative design.Integrate with, and refactor integrations with, new and existing GraphQL and REST APIs to ensure stable and performant behavior from applicationsPerformance enhancements via offline storage, thread optimization, and investigation of low-level system APIsIntegration and use of third-party and system frameworks such as Core Data and LottieProvide technical mentorship, and demonstrate technical expertise in Objective-C, Swift, application performance, application management and architecture, debugging, and interpreting crash logsResearch and implement new functionality, enhancements, and bug fixes.Be a customer advocate - think of the customer in all requirements and projects, including users with disabilities who need accessibility considerationsAdvocate for the usage of Apple design principles and interface guidelines within all Express applicationsWork with the development team, product owners, business stakeholders, and creative to define functional and technical requirementsContribute in the estimation process and help the team provide high quality estimatesAssist end users in resolving and identifying issues by providing application knowledge and technical expertiseRecommend appropriate solutions including risk analysis, work estimates, and proof of conceptsRecommend enhancements, patches or upgrades necessary to support stability and performanceProvide on-call support for iOS application across the business              Job Requirements Essential RequirementsEducation: Four-year degree in Computer Science or an equivalent combination of course work and job experience4 - 7+ years' experience working with UI and Mobile development teams - preferably in an Agile development environment writing highly available, functional software and applications.Compensation and seniority level will vary depending on software development experienceDisplays excellent communication skills to both technical and non-technical personnel.Helps scope engagement by providing detailed development time estimates and participating in the scrum process, i.e. grooming standups, etc.Ability to performance tune, debug, and troubleshoot medium to large scale mobile applications.Experience working on platform-native and React Native mobile applications.Familiar and comfortable with automated testing, writing unit test cases and achieving 100% test coverage.Familiarity with cloud message APIs and push notificationsExperience with iOS frameworks such as Core Data, Core Animation, etc.Experience with offline storage, threading, and performance tuningAbility to work in a very fast-paced environment while managing multiple responsibilities.Ability and willingness to learn new technologies.Performs development tasks with little supervision and is self-motivated and self-directed.Experienced and proficient with enterprise Node.js and server-side JavaScript, with experience with ExpressJS and GraphQL.Participate in 24/7 on-call support rotationExpert knowledge of HTML, CSS, JavaScript, and modern client-side development using APIs, HTTP requests, and JSON data structures.Single Page Application (SPA) experience (Angular, Backbone.js, Chaplin.js, Ember.js) with experience and preference to React, React Native, and React associated libraries and frameworks.Experience with JavaScript pre-compilers, i.e. Web Pack, Grunt, Rollup, and CSS pre-compilers, i.e. Sass and CSS Modules.Experience with modern JavaScript development, leveraging ES6, and ES6 design patterns.Conceptual understanding of Content Delivery Networks (CDN) and Caching, and their utility in offloading traffic and improving site performance.Participate in 24/7 on-call support rotation Preferred Requirements (skills and abilities)Knowledge of retail industryExperience and understanding of cloud based infrastructure, deployment, and code management.Knowledge of low-level C-based iOS librariesExperience in source code management, using Git and Gitflow.Experience in using and knowledge of Web services and APIs.Familiar with application performance monitoring, both client-side and server-side.Ability to set up continuous integration pipelines for mobile applications using tools like TravisCI or GitHub Actions. Closing As an equal opportunity employer, Express does not discriminate in hiring or terms and conditions of employment on the basis of any federal, state, or locally protected class.  Express only hires individuals authorized for employment in the United States.  Notification to Agencies: Please note that Express does not accept unsolicited resumes or calls from third-party recruiters or employment agencies. In the absence of a signed Master Service Agreement and approval from HR to submit resumes for a specific requisition, Express will not consider or approve payment to any third-parties for hires made. We can recommend jobs specifically for you! Click here to get started!"}