{"title":"Manager, iOS Engineering","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK8-se9yLhAW7NryfWC7T4rKD5ESBG6_tn_puJtlWthDYC8oFaqvY0wJTvjewkPkWKCbMjGlbbOmYb2CMP-Lq2vO-foVVLIJqIl156N7TOFDEbHt8RlDvfLrjMyo5pBXakjXjOonocGSiGTiaJWT0Pt8yVh7lgCJxWsdqwnfDtRGGOLKoaJgVXuxXQ6ei8","source":"ziprecruiter","full_description":"Description Software Engineering Manager, iOSPosition Overview:The Climate Corporation is revolutionizing the agriculture industry with a platform and products that are helping the world's farmers sustainably increase productivity with digital tools. We are looking for a highly organized individual to lead a team of experienced and talented software engineers responsible for the FieldView Cab app, which is changing the world of agriculture by helping farmers collect, visualize, and understand data from the field. You will also manage the corresponding roadmap and backlogs, reporting status to all stakeholders, and tracking and controlling the associated projects in an effective and transparent manner. If you are ready to lead a passionate team that is building a product with real-world impact, Climate is the place for you.What makes a successful manager at Climate?Invests in people - Someone who fosters a culture of inclusion, trust, mentorship, praise, constructive feedback and is able to continually build, develop and retain their team.Inspires - Someone who gains buy-in by listening to the thoughts and opinions of others and creates optimism and confidence in a clear and believable way.Think - Someone who uses critical thinking and strategic planning to make well-informed decisions. They create an environment where the right approaches surface from a variety of diverse opinions and perspectives.Achieve Results - Someone that can make plans and be proactive in order to get things done. They continuously improve the effectiveness of their team by setting achievable and specific goals, regularly evaluating results, implementing improvements and holding their team accountable. What You Will Do:Build and mentor a group of high-performing engineers with a strong team-oriented culture.Guide the professional development of each direct report through performance management and coaching.Develop responsive, robust iOS/iPadOS applications which interface with machine data sources to collect and visualize agronomic and machine information in real-time on maps, charts, and dashboards, while also syncing data to the cloud as a key element of Climate's data acquisition solution.Continuously develop and release application enhancements to the app store on a regular basis.Collaborate with Product, Design, and Engineering Leadership to conceptualize great tablet and phone experiences for the agriculture industry.Collaborate closely with other parts of the Engineering organization to build end-to-end data acquisition capabilities and ensure all parts of the solution work well together.Manage releases of the Cab App applicationDrive and maintain CICD pipelines, utilizing GitLab, YAML, and test automationBe a part of a distributed team that embraces best practices and modern tools for iOS development (Git, JIRA, Cocoapods, Swift Package Manager).Interact with customers and key partners to understand the market and improve the usability of the software.Learn about the agriculture industry and the key challenges that need to be solved.  Basic Qualifications:Bachelor's degree in Computer Science, or an equivalent combination of education and work experience2+ years leading and growing diverse groups of engineers5+ years of professional software development of mobile/ iOS apps.  Preferred Qualifications:Familiarity with CI/CD for mobile applicationsProficiency in Objective-C and SwiftExperience with internationalization and localizationPassionate about building scalable architectures using clean, robust, and testable codePassionate about creating beloved user experiencesStrong understanding of OO programming, design patterns (e.g. MVP, MVVM), data structures, and algorithmsExperience with Core Data, Cocoapods, Swift Package Manager, MFI, XCTestExperience with AWS, ELK, BluetoothKnowledge of agriculture and farming practices and business operationsClimate aims to create a welcoming and collaborative environment for our employees in which a diverse set of perspectives and voices are represented and celebrated.As part of our dedication to the diversity of our workforce, The Climate Corporation is committed to Equal Employment Opportunity and does not discriminate based on race, religion, color, national origin, ethnicity, gender, sex (including pregnancy), protected veteran status, age, disability, sexual orientation, gender identity, gender expression, or any unlawful criterion existing under applicable federal, state, or local laws. If you need assistance or an accommodation due to a disability, you may contact us at [email protected]#LI-BW1"}