{"title":"Data Network Engineer, Proxy","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALCtcktUqukT_CHR1iBlO3M1D2AYV092wo7-kxIGbMmkxpO4pCFTZou67k82BNLv-uQjRyxofmPraOrpX7I1-LNQvoIYPcjbVYCRD8FV_YbBfjDNtO88FSW4CvXQamH90bhkOW_wTfHYfZV1n2OKMjSfPVTQreCRdhmLW8szIIYNIoc29Z7pgGVQ_ACOPx4","source":"ziprecruiter","full_description":"Data Network Engineer, Proxy+ **Please wait...****Date:** Mar 4, 2021**Location:** Painted Post, NY, US, 14870Charlotte, NC, US, 28216**Company:** CorningRequisition Number: 44969Corning is one of the world's leading innovators in materials science. For more than 160 years, Corning has applied its unparalleled expertise in specialty glass, ceramics, and optical physics to develop products that have created new industries and transformed people's lives.Corning succeeds through sustained investment in R&D, a unique combination of material and process innovation, and close collaboration with customers to solve tough technology challenges.Corning Incorporated focuses on building a diverse global workforce where differences are celebrated, and employees feel safe bringing their \"whole selves\" to work. Our Diversity Network hosts 18 active and distinctive Employee Resource Groups. Employees have access to Allyship resources, podcasts, an internal video channel, digital learning series and trainings, all focused on building and celebrating global diversity and inclusion. Corning has been recognized as a leader in this regard and has been consistently recognized as a national employer of choice.SCOPE/PURPOSE OF POSITION:+ Develop, configure and support network devices and solutions to align with Corning's technology standards and meet the connectivity needs of our businesses.ROLES AND RESPONSIBILITIES:+ Serve as network subject matter expert, providing technical expertise, design skills, and expert operational support + Develop, test, implement, document and support data network solutions including: + Providing technical requirements as part of overall network solutions design and development effort + Creating, reviewing and/or vetting technical functional specifications and low-level network solutions design documentation, ensuring those are complete, correct and kept current + Assisting with implementation of new solutions, or upgrades to existing solutions, including communications, preparation of documentation and training + Maintaining and administering networks and related computing environments including software, hardware, and tools + Protecting data, software, and hardware by coordinating, planning and implementing network security measures. + Troubleshooting, diagnosing and resolving hardware, software, and other network and system problems. + Participating in root cause analysis on incidents, helping to drive identification of preventative actions meant to ensure problems don't recur, and delivering on the tasks within those actionsEDUCATION REQUIREMENTS+ 4-year degree, or equivalent combination of education and experienceWORK EXPERIENCE+ 5+ years of experience analyzing requirements for designing, delivering and overseeing network and/or network security functions/tools/processes in a large enterprise environment. + 3+ years performing network or network security functions in a large, enterprise class environmentREQUIRED SKILLS+ Ability to implement, administer, and troubleshoot network or network security infrastructure devices + Deep current experience with network infrastructure and network hardware including several of the following - Cisco, Aruba, Arista, Juniper, Palo Alto, CheckPoint, Riverbed, ZScaler, Infoblox, BlueCat, VeloCloud, Versa, SilverPeak, IoT and alternate connectivity mechanisms such as 4G/5G/Satellite + Practical knowledge of TACACS, AAA, IPSEC, 802.x, and public/private key encryption + Understanding of and practical knowledge of approaches to network security including packet filtering, access lists, firewalls, WAF, IDS, DDoS mitigation techniques + Excellent technical analysis, problem solving, and business relationship skills. + Must have good grasp on contemporary and emerging technologies/strategies and the application to enterprise. + Ability to think through problems and visualize solutions. + Ability to create accurate network diagrams and documentation for design and planning network communication systems. + Ability to work with all levels of staff within and outside of IT and outside the organization + Excellent communications, interpersonal and influencing skills + Demonstrated track record of on time delivery within budget; ability to drive projects to successful conclusion using influencing tools + Successfully navigate within teams across multiple initiatives, spanning various lines of business, geographic borders, time zones, and cultures + Must be a self-starter, able to work in team environment and motivate others + Must be willing to be on call available for after-hours support and an on-call rotation as defined by the team for any of the position responsibilities listed above.DESIRED SKILLS+ Experience configuring and using monitoring/alerting/forensic tools such as Auvik, Observian, Nagios, SolarWinds, Splunk, Cisco Prime, NNMI, HPNA, SolarWinds, NetBrain etc. + Knowledge of application transport and network infrastructure protocols including BGP and OSPF + Understanding of pertinent frameworks, including ITIL, NIST and COBIT + Knowledge of network securityTRAVEL+ Up to 30% travel required, generally in North America. May occasionally travel outside NAThis position does not support immigration sponsorship.We prohibit discrimination on the basis of race, color, gender, age, religion, national origin, sexual orientation, gender identity or expression, disability, or veteran status or any other legally protected status.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.**Nearest Major Market:** Corning+ **Please wait...**"}