{"title":"Contracts Specialists - Seattle Washington","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIgQKRzfSdglpsEGtw1tz1BWVJpbuG8UZKRLJhbItg8cnT_4YEiUXjvFM96eDSTJQ6CeRg5VK93ps1MavKKew7NwUcF6wsk5Xj5D1yCoHn43x6pmNMtwxg2PQ-B5V7qvs-EaMq9-t8CPm2yGW5-JH59QtxftyCTphL4xM0IEve500cIPjotjfoFOly6yQ","source":"ziprecruiter","full_description":"About the PositionIMSolutions is seeking multiple Contract Specialists (CS II & CS III positions available) to support our client in Seattle WA. The Contract Specialist performs various pre-and post-contract and procurement responsibilities pertaining to the procurement of supplies, services, and equipment, which may include most all functions from cradle to grave in the acquisition life-cycle. Functions may include acquisition planning, reviewing, editing, or assisting in writing statements of work (SOW), performance work statements (PWS) statement of objectives (SOO), request for information (RFI)/Request for Proposal (RFP)/Request for Quotation (RFQ) and Invitation for Bids (IFB), market research/analysis, selection and administration of contract terms & conditions, cost and price analysis, negotiation preparation, preparation of contract modifications, development of evaluation criteria, evaluation of contract performance, contract termination, and contract closeouts. Individuals, as required, will have experience with Cost Reimbursable, Firm Fixed Price (FFP), Time & Materials (T&M), Labor Hour (LH), Commercial, Indefinite Delivery Indefinite Quantity (IDIQ), and GSA FSS contracting. Individuals will possess a working knowledge of the Federal Acquisition Regulation (FAR) and agency supplements.Position Responsibilities:Applies established acquisition/purchasing regulations, policies, and procedures while assisting in the procurement of goods and services in a Federal Government environment. Provides support and assistance in essentially all areas of Federal Acquisition Regulation (FAR) based Federal procurement. Prepares or reviews pre-procurement packages. Actively participates in developing and managing acquisition plans. Prepares/researches support documentation. Makes quality recommendations to the Contracting Officer/Grants Officer. Handles problems through procurement action life-cycle through resolution. Research, analyze, and validate relevant data. Completes tasks needed to successfully advertise, solicit, construct, award, administer, and/or closeout Government contracts or task/delivery orders.Provide knowledge and practical resources to Stakeholders to ensure customer service provided is relevant, accurate, and timely.Supports the issuance of contracts, purchase orders, tracks status, and expedites orders according to customer requirements and in compliance with all related guidelines, policies, and procedures. Maintains and ensures acquisition/procurement file documentation in compliance with FAR and other related policies and procedures. May assist in special projects assigned by the procurement Acquisition Manager.POSITION SKILLS AND EXPERIENCE: Key Attributes Required:Strong research and analysis skillsDedication: Shows a sense of ownership and pride in work productAdaptable: Shows a sense of urgency, high degree of personal motivation for successStrong verbal and written collaborative skills ensuring a more knowledgeable and engaged team/workforce Positive professional attitude – demonstrating an ultimate desire to fulfill organizational objectives by providing a positive customer experienceIntegrity: Without it, no real success is possible   Required: The CS II positions require a Bachelor’s Degree plus 6 years’ experience.The CS III positions require a Bachelor’s Degree with 24 credit hours in Business- or Business-related field plus 10 years’ experience. Previous experience working for the Federal Government within this field is desirable.Relevant office experience including MS Office and Google platform product skills.  BENEFITS:IMSolutions is proud to offer a competitive salary, high-quality, broad, and diverse benefits, a generous Paid Time Off plan, and a corporate 401k plan. IMSolutions offers exceptional opportunities to develop a rewarding career. Equal Opportunity Employment: IMSolutions provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws.IMSolutions is an E-Verify Employer."}