{"title":"Field Service Engineer (14724) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALW9vqkL2QdZZZp7Jvmbh6hlhfx3_lzLr8wCxmp-o-WamvbJWtB6EDIJo94LW6y8-kjHGS32nzlsnAiCLgPWLQMmmwQnyBz4NaP6IH0E910ItAJG8oU-LLvJg7sJ6QZMscg3oRo4aRnpPbkmpsigwSq5KOzbWmI8hcdMR6EOPZBvh3LTg3WmEJlb2S0xF4","source":"ziprecruiter","full_description":"We're not like most. We don't just overcome obstacles - we don't see them. Instead, we see the potential in every person, and every situation. We don't wait for opportunity to appear - we create it. Meet ASM. A company that has been searching for people just like you.Who is ASM?ASM is a leading, global supplier of semiconductor wafer processing equipment. Our ambitious team is dedicated to delivering innovative technology solutions to the world's leading semiconductor manufacturers. We have over 2,200 employees based in 16 countries, including Belgium, Japan, Netherlands, South Korea, Singapore, Taiwan and United States. Together we work to develop Epitaxy, ALD, PEALD, Vertical Furnaces and PECVD thin-film deposition technologies for our customers. Our goal is to remain an industry leader by being ahead of what's next. We accomplish this by focusing on finding collaborative solutions to make integrated circuits, or chips, smaller, faster and even more powerful.ASM, an inclusive workplaceWe at ASM are a truly global organization that works diligently with an open-mind in all areas of our business.  We strive for a culture and work style that fosters trust and transparency. We put our people first, and that is how we will continue to succeed. We are an equal opportunity employer and value diversity. We recognize and value the differences between individuals, including gender, ethnicity, religious beliefs, sexual orientation, knowledge and experience, work background, age, skills, amongst others. Recruiting and developing a diverse workforce provides a wide range of perspectives.  This enables a culture of continuously exploring and adopting new technological ideas and innovations, and it also enables us to deliver excellent products and service to our clients. As a technician at ASM, you'll enjoy the perks of a stable and a diverse working environment amongst the brightest minds from around the world. With our astounding growth, come sizeable workloads - with short turnaround times. If you are up for the challenge, and possess strong communication and problem solving skills, this is definitely the place for you.Field Service Engineer Job Location:  Fishkill, NY or Malta, NY  Perform installations, preventative maintenance, and remedial repair maintenance on complex electronic / electro-mechanical semiconductor capital equipment at ASM's global customer locations. Create and maintain a high level of customer delight through advanced customer service skills, implementing fast, quality responses to internal and external customers while maintaining a safety first mentality. Travel is 75% and can be domestic or international.  From the very start of the semiconductor industry to the present day, we've been technology leaders who have pioneered innovation and brought new processes into mainstream manufacturing.  We are collaborating, creating, and delivering on our vision - a shared vision to drive innovation with new technologies and delivering excellence with dependable products.  By doing this, we'll create new possibilities for everyone to understand, create and share more of what they love.  Skills Basic troubleshooting techniques in repairing complex microprocessor-controlled electromechanical systems. Safety mentalityAbility to work with hand toolsWorking knowledge of Oscilloscope's and DVM'sStrong positive attitude with good customer service skillsClear and concise (English) verbal and written communicationsKnowledge of structured problem-solving techniquesWorking software knowledge of MS officeAbility to work in a team environmentAbility to work alone and/or with limited supervisionBe able to interpret electronic / electro-mechanical schematics and drawing EducationMinimum of an Associate Degree from an accredited school in electronics/electro-mechanical discipline or equivalent military technical training Experience3 years+ experience working directly with E2000 or EPI tools, preferably in installations and maintenance; or 3 years+ as a field service technician in the semiconductor industry. Knowledge in any or all of the following areas is a plus:  wafer fab, closed-loop gas, and vacuum control, RF induced plasma, electro-pneumatic controls, microprocessor-based controllers, robotics, basic concepts of software, toxic and/or flammable gasses, and acids. From the very start of the semiconductor industry to the present day, we've been technology leaders who have pioneered innovation and brought new processes into mainstream manufacturing. We are collaborating, creating, and delivering on our vision - a shared vision to drive innovation with new technologies and delivering excellence with dependable products. By doing this, we'll create new possibilities for everyone to understand, create and share more of what they love. Be part of our exciting future and join our team today!www.asm.com/en/careers"}