{"title":"          Accounting Associate Lead - Cash         ","location":"","salary":"","term":"$18 to $20 HourlyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAKMlJhkFHt_609Ra03itr5NQCH1G7MCusTuDfyZrtf2zD9gP69iDMw7NvVzpCq1lKx3DmqbbBKEmWoQcXjo1e9EJBvr0M2nEyZK5ujJUsZ9lF4s54gudhUU7kd5u82UEeT6S8HLPdVMAk2wXxVKrYLZ9trwLyXYtXJFXDHkyAGJtCFdsXL3NH0D-AOzU6Q","source":"ziprecruiter","full_description":"\n        Job SummaryThe Accounting Associate Lead – Cash is responsible for all activities associated with receipt and application of incoming payments.Tasks and Responsibilities (Essential Functions)Receive and deposit of all incoming payments.Research incoming checks with missing information.Key batches into the system.Review all keying on a daily basis.Process refunds to clients.Complete all reports on cash deposits daily and weekly.Process credits and write offs and fee checks.Communicate effectively with collection billing departments and occasionally with customers.Scanning batches of checks and providing copies of checks when requested.Performs other related duties as assigned.Job QualificationsHigh school diploma or equivalent required, some college preferredBS/MS degree in Accounting or Finance preferred.2-5 years of experience in finance or public accounting.Be proficient in using a 10 - key calculator.Cash handling or billing experience.Strong verbal, written communication and math skills.Working knowledge of PC software; EXCEL and Microsoft Word preferred.Detail oriented, takes initiative, resourceful and handles self under pressure with professionalism, calmness and tactAbility to;o communicate effectively with other departmentso prioritize and manage multiple requestso supervise a teamo provide one-on-one on-the-job training for team memberso to work well under pressure and meet deadline while multi-taskingo handle self under pressure with professionalism, calmness and tactAbout Compex Legal Services, Inc.:Compex is the nation’s leading record retrieval provider. We serve thousands of law firms and the largest insurance carriers to provide record retrieval, record summarization, IME interface, and deposition reporting solutions that reduce cost and cycle time. We empower our clients to make faster, more informed decisions by streamlining across claims, legal, and third parties.We are on a strong continued growth trajectory and attracting, retaining, engaging and growing our 700+ employees is key to our success. We are committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.DisclaimersWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.Compex offers its full time employees Medical, Dental, Vision, 401k and FSA. In addition, these benefits are fully paid by the company: Basic Life Insurance, LTD and EAP. The following supplemental benefits are also offered: Voluntary Life Insurance, AD&D, Aflac and Legal Shield. Compex offers full-time employee benefits including vacation; sick; and holiday.Compex is a drug-free workplace. Please visit us at www.cpxlegal.com.\n      "}