{"title":"Cisco/Network Engineer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAIDpYu2LA6R3_o2PeoNfKXc3kyFrh7-CqbXXpAdAauWeye4JcZG_z63xO0pL-J8xcT3VLSlvc5dpYUQDlL24c-PvAPwvn5qvYOLMRhnPaRib8jcS5fubsYch0MVwQtPShz6iwhFyqVjyj5zMy1kRyedNfenUNOEE7Nty9eNuQzuQxzIDf5AkR5NvS9uMsEu","source":"ziprecruiter","full_description":"Cisco/Network Engineer in Lexington, MA at APEX Systems Date Posted: 1/7/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: Lexington, MA + Job Type:Network Admin & Design + Experience:Not Specified + Date Posted:1/7/2019Job DescriptionJob #: 919982 Apex Systems combines with parent company On Assignment to make it the 2nd largest IT staffing agency in the country. Apex has an opportunity for a Network Engineering role in the Lexington, MA area. This is a 5 month contract to hire position and the pay rate is flexible depending on experience. Here are the details:For applicants who are interested in this opportunity; please send a Word resume to Andrew Morris, Technical Recruiter, at amorris@apexsystems.com. Position: Network Engineer Apex Job ID: 919982 Location: Lexington, MADay to Day Responsibilities: + Design, build, and implement network systems + Monitor and respond to complex technical hardware and software problems + Interface with vendor support service groups to ensure proper escalation during outages or periods of degraded systems performance + Provide routine testing and analysis of all elements of the infrastructure + Lead network operations teams and network infrastructure projects with equal vigor, set individual and team level goals, follow-up on progress, foster team work and individual growth opportunities + Assist in life-cycle planning of network environments for internal customers, develop and review procedures for network infrastructure platform in relation to capacity planning, performance, reliability and security + Support emergency operations on an as needed basis 24/7 & respond to all operational needs according to contract parameters Requirements: + Must haves: + 6+ years' experience as a Network Engineerrole with very strong background in network design, implementation and troubleshooting. An additional 4 years' experience may substitute for the degree + Ability to obtain a DoD Security Clearance + Active Sec+ strongly preferred + CCNA strongly preferred + Hands-on experience in design/configuration/installation/troubleshooting of Cisco routers/switches is required. 3800 series and 2900 series preferred. + Hands-on experience with OSPF, VRF, VRRP, QOS, VLAN, STP, Dot1x, IP access control lists, IPsec, Virtual Chassis/Stacking, is a must + Working knowledge of DHCP, NMS - Orion NPM/NCM, Cisco ISE, Cisco Prime, Wireshark etc is needed + Bachelor's degree or 4 years additional experience preferred + Ability/desire to work core hours of 7:30-4:30 daily, and off hours/weekends for planned/unplanned outages as needed.EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}