<<<<<<< HEAD
{"title":"Manager / Senior Manager, Global Product Marketing Chemistry & Immunoassay Solutions (Evergreen)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJwmmewjUSqFCmm1E3SsirxHEckNzkqR3grpNTxXktVe3p7NvSCRFJh1-0SHhG6tIks7A57PeQBnDwTX-50M0o07-Rz2ikb1A0szE78Ei3DWQ7_uOa0YitvoHwX6O8bhvjdLQ25XN13sTLQg4AMre6cC37tAnpYacEsVOCFYtYXqUqJeIYPrbyYo_v11hwI","source":"ziprecruiter","full_description":"Meet Your Next Favorite Place to Work! Beckman Coulter Diagnostics, an operating company of Danaher Corporation, is recruiting for a Manager and Senior Manager, Global Product Marketing Chemistry & Immunoassay Solutions.This position can be remoted based.By applying to this \"Evergreen\" posting, you are expressing interest in future positions at Beckman Coulter. This job ad is a proactive way to share your resume with us. All applications will be reviewed on a timely basis.Wondering what's within Beckman Coulter? Take a closer look. Join a team where you can be heard, be supported, and always be yourself. At Beckman Coulter, a Danaher company, we're building a culture that celebrates backgrounds, experiences, and perspectives of all our associates.Our work helps improve millions of lives. We hope you'll see yourself here, too!If you're a marketing leader whose leadership style revolves around empathy and humility, and you have a proven track record of driving engagement and high-quality product launches, we want to hear from you.In this role, you will have the opportunity to: + Develop global marketing strategy and build compelling value propositions for Beckman Coulter's chemistry and immunoassay solutions (CC/IA) with the end goal of upholding positioning, driving product adoption and attachment rates, and growing product revenue.+ Drive the Launch Excellence process and presentation to Senior Leadership for assigned products/product category.+ Use customer, market and business insights to find opportunities for new critical initiatives and campaign optimizations that allow us to grow product revenue, differentiate our products in the marketplace and move healthcare forward.+ Collaborate with the business units (BU's), global and regional marketing colleagues to develop a congruent marketing strategy for CC/IA and its connection with the larger Beckman Coulter solution.+ Drive outstanding marketing; collaborate with marketing communications to develop and launch global campaigns that drive funnel conversion through a compelling value proposition that resonates with our customer base. Essential Requirements: + Bachelor's Degree with 9+years' work experience or Master's degree with 7+years' work experience+ Minimum 5 years' of successful marketing and commercialization experience with growing responsibilities+ Must have healthcare marketing experience (Laboratory, Medical Device, Pharmaceutical or other healthcare)+ Ability to travel globally (once travel resumes post Covid-19 pandemic) It would be a plus if you also possess previous experience in: + Sales, Marketing, or Product Management expertise in immunology or chemistry. #LI-GC1#LI-RemoteBeckman Coulter, a Danaher company, offers a broad array of comprehensive, competitive benefit programs that add value to associates' and their families' lives. Whether it's a health care program or paid time off, our programs contribute to life beyond the job.At Beckman Coulter, we're driven by a sense of wonder for what we can create-and what we can become. Here, you'll accelerate your career while driving innovation that improves lives. You'll work hard and try new things, with guidance from committed leaders, powerful DBS tools Danaher Business System (https://www.danaher.com/how-we-work/danaher-business-system) , and the support of a global organization. As part of the Danaher family of 67,000 associates across the globe, your possibilities for growth and development are unparalleled.We believe that creativity and innovation thrive when the most diverse set of voices are heard, and that's why we're taking concrete steps to ensure that we're fostering an inclusive and engaging workplace for our team. If you'd like to learn more, read stories from our associates on our Careers Blog (https://jobs.danaher.com/global/en/blog) or contact one of our recruiters.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Danaher Corporation and all Danaher Companies are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. The \"EEO is the Law\" poster is available here (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf) ."}
=======
{"title":"Manager / Senior Manager, Global Product Marketing Chemistry & Immunoassay Solutions (Evergreen)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAILgxVgosgHtqN37ZYNW_rSAmtz-HNtxvkOcYcE0uQgBoF1LgcrPAmUZyKGUPdb90JPLNB539shH7CsB-TpNyNAFFq_iblUZqndkcAoZzH1rvx8Cd-BNeXM5FJjL0zVFxAM5f8JJ6RIn99MBagbeksPm-0NN2KLAk4xrV7_wf4SWUPTlxLFqx-KCNhqqPT8","source":"ziprecruiter","full_description":"Meet Your Next Favorite Place to Work! Beckman Coulter Diagnostics, an operating company of Danaher Corporation, is recruiting for a Manager and Senior Manager, Global Product Marketing Chemistry & Immunoassay Solutions.This position can be remoted based.By applying to this \"Evergreen\" posting, you are expressing interest in future positions at Beckman Coulter. This job ad is a proactive way to share your resume with us. All applications will be reviewed on a timely basis.Wondering what's within Beckman Coulter? Take a closer look. Join a team where you can be heard, be supported, and always be yourself. At Beckman Coulter, a Danaher company, we're building a culture that celebrates backgrounds, experiences, and perspectives of all our associates.Our work helps improve millions of lives. We hope you'll see yourself here, too!If you're a marketing leader whose leadership style revolves around empathy and humility, and you have a proven track record of driving engagement and high-quality product launches, we want to hear from you.In this role, you will have the opportunity to:Develop global marketing strategy and build compelling value propositions for Beckman Coulter's chemistry and immunoassay solutions (CC/IA) with the end goal of upholding positioning, driving product adoption and attachment rates, and growing product revenue.Drive the Launch Excellence process and presentation to Senior Leadership for assigned products/product category.Use customer, market and business insights to find opportunities for new critical initiatives and campaign optimizations that allow us to grow product revenue, differentiate our products in the marketplace and move healthcare forward.Collaborate with the business units (BU's), global and regional marketing colleagues to develop a congruent marketing strategy for CC/IA and its connection with the larger Beckman Coulter solution.Drive outstanding marketing; collaborate with marketing communications to develop and launch global campaigns that drive funnel conversion through a compelling value proposition that resonates with our customer base.Essential Requirements:Bachelor's Degree with 9+years' work experience or Master's degree with 7+years' work experienceMinimum 5 years' of successful marketing and commercialization experience with growing responsibilitiesMust have healthcare marketing experience (Laboratory, Medical Device, Pharmaceutical or other healthcare)Ability to travel globally (once travel resumes post Covid-19 pandemic)It would be a plus if you also possess previous experience in:Sales, Marketing, or Product Management expertise in immunology or chemistry.#LI-GC1#LI-RemoteBeckman Coulter, a Danaher company, offers a broad array of comprehensive, competitive benefit programs that add value to associates' and their families' lives. Whether it's a health care program or paid time off, our programs contribute to life beyond the job.At Beckman Coulter, we're driven by a sense of wonder for what we can create-and what we can become. Here, you'll accelerate your career while driving innovation that improves lives. You'll work hard and try new things, with guidance from committed leaders, powerful DBS tools Danaher Business System, and the support of a global organization. As part of the Danaher family of 67,000 associates across the globe, your possibilities for growth and development are unparalleled.We believe that creativity and innovation thrive when the most diverse set of voices are heard, and that's why we're taking concrete steps to ensure that we're fostering an inclusive and engaging workplace for our team. If you'd like to learn more, read stories from our associates on our Careers Blog or contact one of our recruiters.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Danaher Corporation and all Danaher Companies are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. The \"EEO is the Law\" poster is available here."}
>>>>>>> 6e9a075ee97f3a4d702c3307ef1e0ee7373d6616
