{"title":"Software Developer - Point of Sale Solutions","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKVs3ExL7044IjB1SZHH7f2aI0AUV0ZYVvrmLpyoNd7jvof9Qd-uGnIQ0dfC_G6nvYzaD6v9Vc3X18zs0kMTtcg5V2OcIHxyuCytd5dtybm2WcCVzLTIpEKbBqwtdESPETjMS1Hiz6dVVsCc0odUloTfeBIz9E-wrm0XEzOMxsi2p8MCVmAMLU1mp65DBE","source":"ziprecruiter","full_description":"This is an environment unlike anything in the high-tech world and the secret of Costco's success is its culture.  The value Costco puts on its employees is well documented in articles from a variety of publishers including Bloomberg and Forbes.  Our employees and our members come FIRST.  Costco is well known for its generosity and community service and has won many awards for its philanthropy. The company joins with its employees to take an active role in volunteering by sponsoring many opportunities to help others.  In 2018, Costco contributed over $39 million to organizations such as United Way and Children's Miracle Network Hospitals.Costco IT is responsible for the technical future of Costco Wholesale, the second largest retailer in the world with wholesale operations in twelve countries. Despite our size and explosive international expansion, we continue to provide a family, employee centric atmosphere in which our employees thrive and succeed. As proof, Costco consistently ranks in the top five of Forbes \"America's Best Employers\".This position performs the tasks necessary to develop and implement new Point-of-Sale solutions into Costco's warehouse environments. This includes technical knowledge of POS hardware, configuration, and programming in order to develop and apply these solutions. This position is responsible for identifying tasks required to evaluate promising technologies and determine their applicability to Costco's environments. In some cases, this position is responsible for initiating, coordinating and implementing proof-of-concepts of new technologies to demonstrate viability and business value.If you want to be a part of one of the BEST \"to work for\" companies in the world, simply apply and let your career be reimagined.ROLECreates or modifies programs consistent with department procedures, philosophies, and standards.Installs, configures, and supports POS applications.Initiates, develops, updates new and or existing documentation, processes, service tickets and training.Works with Costco's business relations teams to develop a strong understanding of the business area being supported.Designs specific applications as assigned, including traceability back to requirements.Troubleshoots and corrects programming errors as assigned.Creates test scripts and executes adequate unit and system testing while providing necessary test documentation.Provides mentoring and support to both project and area team members.Stays current on industry and technology directions by establishing mechanisms for scanning the technology horizon.Creates strong relationships with vendor's product development groups.Creates strategies for supporting and retiring old systems while deploying new ones.REQUIRED5 + years' experience programming with deep Operating System knowledge working at least two of the following operating systems: Linux, UNIX, Windows, 4690, MQ, System messaging, Relational database solutions. 3 + years proficient programming in Java.2 + years  proficient programming in C and C++. Proficient OS scripting with at least two of the following: Linux/UNIX(shell Scripting), BASH, Python, Windows/4690 cmd/bat, SQL, Powershell, batch and general scripting, Windows imaging.Understanding of dot net framework applications and window operating systems.Proficient with client web services, browser and xml.Working knowledge of networking and protocols.Strong knowledge of system security, certificate management and operations (SSL, SSH, encryption).Must have completed at least one large program from start to finish on their own.Must have completed multiple medium programs start to finish on their own including utility programs.Must have a demonstrated ability to drive, design, test, debug and deploy current and future software solutions.Secure coding understanding and cryptography standards.Strong understanding and demonstrated knowledge of change and version control.Strong understanding of evolving industry standards and new technologies.Strong understanding and working knowledge of PCI, SOX and Data Governance.Thorough understanding of OS security and administration of real time systems.Must possess excellent analytical skills and demonstrated ability to effectively troubleshoot and provide solutions.Must possess demonstrated strong communication skills, both verbal and written.Must be responsible, conscientious and possess a passion for excellence.Must be a self-starter, with the ability to work independently, with different groups and teams, utilizing solid communication skills.Must possess strong work ethic, demonstrated attention to detail and excellent time management skills.Recommended Degree in computer science or related technical field preferred.Experience in legacy languages such as IBM C-BASIC is welcome but not limited to.Background in accounting and/or POS a plus."}