{"title":"          Seeking iOS Developer to Create an App NEW!        ","location":"","salary":"","term":"$5,000 AnnuallyContractor","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAKEGsJ6qKSKSFPFcga1pF68CLOVsL3bmEJ4ksA-nEAy2KrqvwVfva-nRyhLPEYnxzGZRW1GlsZNL_-crvMfx5W_IFP2W_KFd3NfO3PG8SwP16HXJaSJjbjcrFQgHWRGbt_ZaIWlO_x21fK-S9YR1EzravQeuyVpdJi-NSql9v5WtPffsiTmbGqF_2JG-1I","source":"ziprecruiter","full_description":"\n        We are seeking a Seeking IOS Developer To Create An App to become an integral part of our team!Seeking an individual who has time for about two months of work and to be able to commit to the adherence of a schedule creating an iOS app. As a company, we are not able to exactly share what the project is, due to this being under a Non-Disclosure Agreement (NDA). If we do consider you; you will need to sign an NDA ahead of time in order to discuss the details of the invention.Must be able to present 3 references of past jobs to where we can talk to an actual person.Our interview will be via Zoom video.In regards to the scheduled timeline we are issuing for the project, you will have to be in communication with the projects Project Manager at least once a week for follow-up meetings and be in communication using What's App for updates, etc.This individual will be responsible for creating the software for this project using iOS; so, therefore, must be proficient in iOS Programming. Must be responsible and respectful to timelines and be accountable. Must have experience with currently running iOS Apps. Lastly, we are looking for a creative mind who is ready to show us what they can do. This individual needs to have API skills as well.Some description of what we are needing the individual to do is first create a library that inputs a jpg upon receiving user input such as direction. This will create a repeating \"moving\" feature that outputs a moving gif.Secondly, the moving gif is transferred to custom hardware which presents the image to the user. This can be accomplished through Wifi, Bluetooth, etc.Payment Schedule: A retainer amount will be provided at the start of the project. Milestone payments per completion of each milestone will be given payment upon completion.There is a fixed budget for this project.Featured Job$5,000 Fixed-priceProject Type:One-time projectYou will be asked to answer the following questions when submitting a proposal:Please describe the most interesting project you have taken part in and what your role in the project was.Skills and expertiseDevicesPhone TVMobile PlatformsiOS HybridApp FeaturesUser Profile Creation Bluetooth CameraPopular Apple Development APIsiAd SceneKit Metal Core Bluetooth SpriteKit iBeacon CloudKit SiriKit HomeKit HealthKit PassKit AVKit EventKit GameKit GLKit Apple Pay JS Core ML TVMLKit ARKit ClassKit ClockKit Core Data MapKit NewsstandKit PushKit UIKit WatchKit WebKit GameplayKit StoreKit\n      "}