{"title":"Technical Support Specialist - Remote","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJptFGqwyjFaDGEjzRgr7Nvesd5zxt4zecwCb6METN5m-WR-1-outt3I9oMtL8W80xqghlMv1nO9SrO89kMxle0qy3mdNHgcN_Pwc3oM-Z0aZIaxnk9WDQf6bLR2gKV7fDtb-c5FHtcVMShoKGKICPJSv-ZwrrpV5hPQvHZbQonnX8E6EBfQWChdzP6_O5S","source":"ziprecruiter","full_description":"Company DescriptionSquareTrade is the fastest growing company of its kind. We’re revolutionizing a $30b industry with service innovation and attention to customer satisfaction. We partner with some of the largest, most sophisticated retailers and carriers in the world (Walmart, Target, Amazon, Costco, and T-Mobile to name a few), consistently win industry awards, have received tens of thousands of 5-star reviews… and we’re just getting started. A member of the Allstate family, SquareTrade has headquarters in San Francisco and London.Job DescriptionA Technical Support Specialist will provide, via phone and/or remote-desktop, technical problem solving and claim resolution to customers by performing a diagnosis of issue while guiding customers through the claim filing process that gives them a resolution. Support and resolutions include, but are not limited to basic device support, assisting with claim filing, verifying proper hardware and software set up, power cycle devices, troubleshooting account issues, connectivity issues, providing adequate resolution or escalating issues to further tiers or manufacturers. The focus of this specialized, technically-oriented position is on meeting and exceeding high standards of accuracy and quality based on established systems, technologies and guidelines while bringing Squaretrades core values to life of Customer obsession and making an Impact on every call. What You'll Be Doing:Deliver a differentiated customer experience as measured by performance objectives and the core values of SquareTradeAssist customers with the claim filing process, including approving and denying claims, via inbound/outbound Convey interest in each customer through courtesy, active listening, and a friendly and caring voice imageDiagnose for a successful troubleshot or resolution on customers products over the phone Use your expertise to explain complex technical concepts in simple terms to provide troubleshooting help to our customers, which will result in talking them through a series of actions until their issue is either resolved or diagnosed. Use your Knowledge Base to research similar product symptoms to find a resolution, as well as contribute useful content as discovered. Advise customers on how to use their products and the various functions or features on productsFollow standard processes and procedures.Stay current with system information, changes and updatesMust be able to overcome objections and handle customer push backQualificationsQualifications:Minimum 1 year of customer service experience required; previous call center experience strongly preferredBilingual fluency in both English and Spanish preferred but not requiredPrevious computer support or help desk experience highly desirableStrong transcription, critical thinking & web navigation skills while providing quality phone supportQualified candidates will exhibit strong communication skills for remote support using connectivity tools as well as voice, chat, and email support Must have a strong working knowledge of software and operating systems and can provide general usage instructions to customers Excellent critical thinking, problem solving and communication skills Ability to perform the following over a period of up to 10 hours:Speak with and interact with customers over the phoneType on a keyboard and use a computer mouseMaintain a sedentary role at a deskVisual acuity and can utilize a computer monitor with multiple windowsDesire to learn!Plus Qualifications:A nationally recognized certification or degree in the technology field such as CompTia/A+, Microsoft, etc.Sales background preferred1+ years call center experience preferred 1+ years of Troubleshooting/Technical Support with Consumer Electronics preferredHome office requirementsHigh Speed Internet accessQuiet and private workspaceDedicated Landline line – No VOIPIndividuals currently using VOIP (e.g. Bright house, Vonage, Magic Jack) as a service provider cannot be considered due to system incompatibilityAdditional InformationSome of the benefits of working @Squaretrade include: Not feeling stuck! This team has exposure to many different parts of the business, making transitioning easy...we work on developing careers based on what people enjoy!Competitive salaries, Benefits (Medical, Dental, Vision), PTO, 401k matchingRespect for your work-life balanceA paid volunteer day to give back to the community The Team: http://www.squaretrade.com/leadership SquareTrade is an Equal Opportunity Employer The candidate(s) offered this position will be required to submit to a background check, which includes a drug screen."}