{"title":"Developer Mobile (iOS)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJY3RFQI8jPJsf_ayzPyeYwYZ0KblgDN8r6zq157ihwa413aN-tZV6Lz7Y5UyGXfrV9s_xejvwdF2gxNk9s7m6BOpBwwNREDCr2VO6Stgs86tMYAuMXmSiXznd1C8QKSNRUsGhXiPyCSqIa7Ss3jdI48Bvz5kIcyfVy3a7s3Z1zzP_h7A29PTgY_8bihLm9","source":"ziprecruiter","full_description":"Job Description:Essential Job Functions Experience in Angular JS, JavaScript & PHP, Java and Python programming + Experience in security of data on devices and in transit + Worked in Agile/Scrum methodology + Experience in HTML 5 and CSS + Experience with Alexa, smart home, etc. + Experience with integration to REST and SOAP web services + Extensive experience developing mobile applications, service development and integration + Experiences with telematics solutions + Experience with iOT platforms including messaging bus, MQTT, etc... + iOS design patterns and coding conventions as well as Apple's official guidelines or + IOS: Senior level Swift experience + IOS: Objective-C + IOS: Siri integration + IOS: Core Services + IOS: Media and Cocoa Touch frameworks + IOS: Developer tools (XCode 4+) and workflows + IOS: Design patterns and coding conventions + Strong Swift knowledgeE.g. where and why generics are usefulE.g. the different ways of capturing \"self\" in a closureE.g. when to use a struct vs a classStrong knowledge of Swift's Codable protocolKnowledge of 3rd-party library SnapKit is preferred, but not requiredUnderstanding of how certificates, provisioning profiles, schemes, and configurations all fit into an app's build processBasic Qualifications Bachelor's degree or equivalent combination of education and experience + Five or more years of programming or application development experience + Experience working with appropriate programming languages, operating systems, hardware and softwareOther Qualifications Good programming skills + Strong personal computer and business solutions software skills + Familiarity with Kubernetes, Docker, AWS, etc + Knowledge around continuous and automated deployments of mobile solutions + Collaborated with cross-functional teams to define, design and ship new features + ** **Ca** **ndidates to be located or willing to relocate to Auburn Hills Michigan** + **** Must be legally authorized to work in the US without requiring** **s** **ponsorship now or in the future**DXC Technology is EEO F/M/Protected Veteran/ Individual with Disabilities"}