{"title":"Automotive Technicians, Mechanics - B and C Level, $6000 Signing Bonus NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIrZhJLZS6CT8lAGmNl2amc6dVw-Z0q55I0RLN_-HzcGL9KXbzGfGpVoZMRzzU3H36nKXyRwfJIJU5mHU0WNyABo4a8Jqzxz9ulc6zsVkb8yHyQjgBqbyQ0-B5hzaMgCNp99c9GWc_zMdK4bsD4M0YdLeenvfLZjIbi1kvaKAuYhxzJSl37c1zbwCKRe7Fd","source":"ziprecruiter","full_description":"1330 S Conwell Ave., Willard, OH 44890Automotive Service Technicians / MechanicsB and C Level Technicians NeededAt Sharpnack Chevrolet Buick Cadillac Ford, it’s our pleasure and honor to help the community that we’re so proud to be a part of. We have been family owned and operated since 1949 and are involved with many local charities and organizations here in Ohio, and we just love watching the local community thrive. We offer excellent customer service to all our customers in Ohio, from Norwalk, Mansfield or beyond. We believe that culture makes a difference and we focus on building relationships with our employees, our customers, and our community. We value our employees and invest in their success.We need experienced B and C Level Service Technicians/Mechanics now! Our Service Department has a high volume of business, so we are adding to our service team. We have lots of hours of work available! Our Service Tech position offers Top Pay! Experience from other Brands Welcome! ASE and/or Ford Certification a PLUS!We offer:Competitive pay planUp to $6000 sign-on bonus for the right candidateHealthcare, Dental and Vision insurance options401(k)Heated shop!Automobile purchase programFast-paced work environmentResponsibilities - Service Tech:Perform quality repair and maintenance work that meets dealership and manufacturer standardsClearly write and communicate needed repairs/maintenance and the parts and time needed to repairRepair broken or worn mechanical and technology componentsMaintain repair and service recordsInstall equipment, components, and systemsTest vehicles both before and after repairRepair electrical wiring, circuits and fixturesOther duties may be assigned according to expertise and certificationsQualifications/Requirements - Service Tech:Auto repair experience required!Ford certification is a PLUS!ASE certification a Plus! We will certify!Ability to be analytical and multi-taskGood work ethicValid driver's license and clean driving recordResume must be uploaded, and online assessment completed for immediate consideration.Applicants must pass pre-employment testing to include background checks, MVR, and drug screen.We are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."}