{"title":"Senior Android Engineer - Frontend Platform","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJeEXaq0ZEIF-odQwZmuUmmnKmdrhfBmgO_swPqi4DEN2ZO0OLRTBR4ngYN30Hu6TJjUGps_d5n-aoIoRS0apm7zPNjmmPZ8iZ5Gq0wqUOEYGzNBAnvo8q_qOYp7a15vAFv-vqY8vrCRszAnrXt1T-kjp928be-8VWu5lTA1inOSKU5UoNJbY95DVcVyOA","source":"ziprecruiter","full_description":"About The Opportunity We're all about connecting hungry diners with our network of over 300,000 restaurants nationwide. Innovative technology, user-friendly platforms and streamlined delivery capabilities set us apart and make us an industry leader in the world of online food ordering. When you join our team, you become part of a community that works together to innovate, solve problems, grow, work hard and have a ton of fun in the process! Why Work For UsGrubhub is a place where authentically fun culture meets innovation and teamwork. We believe in empowering people and opening doors for new opportunities. If you're looking for a place that values strong relationships, embraces diverse ideas-all while having fun together-Grubhub is the place for you!More About the RoleWe're looking for an Android engineer to join our Frontend Platform team and help take all of Grubhub's Android apps to the next level. The Frontend Platform team creates patterns, practices, tools, and technologies that make it easier to build great apps at Grubhub. We define app architecture, create standard libraries and UI components, and build CI/CD tooling to help frontend engineers get their jobs done more quickly and with higher quality. If you're passionate about making it easier to build better software, we're looking forward to receiving your application. The Impact You Will Make Actively contribute to the adoption of strong software architecture, development best practices, and new technologies. Our team's mission is to improve the process of building software; we'll need your help to do thatDesign, implement, and test shared libraries for Android applications while understanding our products from both technical and business perspectivesBreak down complex problems into elegant technical solutions that are easy to use and understand What You Bring to the Table 4+ years of experience building Android apps in Kotlin/Java using the Android SDKDemonstrated skills in writing clear, correct, and performant codeA strong understanding of the Android app lifecycle and common design patterns (MVVM, MVI) for building and structuring apps from the data layer all the way up to the UIA strong working knowledge of writing concurrent software that consumes web servicesA passion for automated testing, with real-world experience building software with high test coverage using dependency injectionThe ability to clearly communicate technical concepts in written formCollege degree in Computer Science or a related field of study/equivalent experienceGot These? Even Better:Experience building multi-module Android appsExperience building and maintaining reusable libraries in Kotlin/JavaExperience with frontend observability (logs, tracing, and metrics) and SLOsExperience creating CI/CD pipelines for Android appsExperience building software for other frontend platforms (iOS, Web)Fluency with a scripting language (shell, Python, Ruby, etc.) And Of Course, Perks! Flexible PTO/PTO. Grubhub employees enjoy a generous amount of time to recharge.Health and Wellness. Excellent medical benefits, employee network groups and paid parental leave are just a few of our programs to support your overall well-being.Competitive Pay. You'll receive a competitive base salary with eligibility for generous incentives, bonuses, commission or RSUs (role-specific).Learning and Career Growth. Your personal and professional development is a priority at Grubhub. We empower you to be a leader and grow your career through training, coaching and mentorship opportunities.  MealPerks. Get meals on us! Our employees get a weekly Grubhub credit to enjoy and support local restaurants. Fun. Every Grubhub office has an employee-led Culture Crew that connects people through fun, meaningful events and initiatives like Wellness Wednesdays, Slack competitions and virtual happy hours!Social Impact. At Grubhub we believe in giving back through programs like the Grubhub Community Relief Fund and donating 1 million to the Equal Justice Initiative in 2020. Employees are also given paid time off each year to support the causes that are important to them. COVID-19 Response. All of our employees are currently working from home and will be for the foreseeable future. We look forward to seeing everyone in-office when it's safe to return. Grubhub is an equal opportunity employer. We welcome diversity and encourage a workplace that is just as diverse as the customers we serve. We evaluate qualified applicants without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. If you're applying for a job in the U.S. and need a reasonable accommodation for any part of the employment process, please send an email to TalentAcquisition@grubhub.com and let us know the nature of your request and contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this email address.   Not ready to apply? Connect with us for general consideration."}