{"title":"Tier 2 Remote Engineer NEW!","location":"","salary":"","description":"","term":"$60,000 to $70,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAL81B4LtgLlu3c4WZIMmpxuswCjBKPQwkHMBrCnR_jWoY_cpiLrhBOO1XyUzcC9IbNd7HH1Z9r5k8X-tiKQd_SiQYovV2oSDDOGf8v8h9q97hZvw_mJy02ETjWvCp3mLw5tn-Ttc6ryXLJuIyjZdlIqLVPhvyrAfCgA4slkbODRRJRb2InLPsde9L_rwdwT","source":"ziprecruiter","full_description":"Ready to get off the IT treadmill and start making a difference? Do you have the drive and desire to be part of a team that delivers world class service every day? Here at Setton Consulting, we provide exceptional IT support to small and medium businesses in the NYC area and work with a variety of businesses from legal to accounting to manufacturing. From our owner down to our service coordinator, everyone is “in it to win it” every day, on every call, on every client interaction. We are looking for a senior engineer who has the experience, knowledge and desire to help our clients grow and move forward. The Position: Our Tier 2 Engineer is a critical piece in our team and is responsible for the delivery of reactive technical support in a senior escalation role, as well as proactive client requests and project support. This role will also provide continual improvement of processes and standards to provide a consistent client experience. Qualified candidates MUST have the ability to communicate to clients and co-workers at both technical and non-technical levels. Ideal candidates are self-directed, innovative, organized, flexible and can consistently maintain our high-quality standards. The desire and drive to build and maintain customer relationships is a key function of this role. This candidate will also be able to exhibit a sense of urgency in providing exceptional quality service to clients as well as setting and managing expectations.  Qualifications: High school diploma required, higher level degree desired Work Experience: IT Experience: 3 years required; 5 years preferred MSP Experience: 2 years required; 5 years preferred Tier 2 IT experience in an escalation role: 2 years required, 5 years preferred Use of PSA/Ticketing system Additional knowledge, skills, and responsibilities Ownership of assigned tasks Coordination of service via phone, email using our PSA system Being able to adapt and learn quickly Ability to develop relationships with clients and internal staff Follow process and identify possible improvements Time management skills Exceptional written and verbal communication skills Advanced knowledge and experience with Microsoft Server In depth GPO experience O365 experience at an escalation level Azure Veeam Virtualization experience Hyper-V Automation experience Scripting Knowledge and experience with advanced networking principles Advanced hardware and PC operating system troubleshooting skills Preferred knowledge, skills, and competencies: Use of documentation platform Use of ConnectWise Manage Use of ConnectWise Automate HR Information: Medical benefits Two weeks of PTO 401K with 4% match after one year of employment Full time, fully remote Salary $60,000-$70,000, negotiable with experience"}