{"title":"CX Director of Application Engineering (CPXE) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALgBB_r27wuFkKh39EU5Lp62ukYZTGFpbjEw2u9CY3ySjuXjaCXkVapDrqu_DUnn-DAoAywSKujM7CRDvc56xrw2BFU7Objik4oh-5fVZasaancDfa6EK373kYwLUvWMjsnxinFhN-JgLBJLvvQQC7EX--kyIyIEaZ659sXUG_bC7Gz6BmXVWmiouIvlk0","source":"ziprecruiter","full_description":"Director of Application UI Engineering - CPXE Cisco's Customer Experience (CX) organization is one of Cisco's fastest growing teams, and the Customer and Partner Experience Engineering (CPXE) group is redefining how Cisco delivers value to our customers & partners via our product portfolio. The Customer Experience Application Engineering Group is looking for an extraordinarily technical, creative, and talented engineering lead to work with our team of UI engineers and architects. We are looking for an exceptional engineering leader to manage and grow this high-impact team. What You'll Do Be responsible for all technical aspects of the team's projects, working with product management and UX design teams to identify and implement innovative technologies. Evaluate new and emerging technologies and determine applicability to current and future projects. Architect and design new software product features, help drive projects to completion, define system technical use cases and architecture specification in alignment with business/product requirements. Collaborate very closely with the business strategy, product management as well lead the engineering and the execution teams. Define the UI engineering for an integrated collection of components that power cloud native and hybrid cloud solutions. Work collaboratively and drive consensus within a cross-functional team environment. Collaborate to drive best practices and UX consistency across applications Partner with UX leads, product, and business partners to come up with and execute new ideas. Manage multiple project schedules. Provide leadership in working with product management and engineering executives on product strategy and customer engagement. Operate and manage distributed teams. Grow and mentor a multi-disciplinary team of engineers, managers and individual contributors. Experience managing global teams in enterprise settings. The leader should be highly autonomous, with strong problem-solving skills and the ability to analyze quantitatively, scope technical requirements, and effectively prioritize program deliverables. Who You'll Work With You will be part of an application engineering team responsible for overhauling the way customers and partners interact with Cisco. Our team develops forward-looking applications, solutions and services across cloud, desktop, and mobile platforms. This is an outstanding opportunity to drive an innovative roadmap for next generation applications and cloud services in big data analytics, machine learning, and advanced visualization. Who You Are You've got a strong background in front-end system architecture and design, documentation, implementation and deployment, on projects. You have in-depth knowledge of modern development practices and frameworks, with a proven track record of leading, building, and delivering successful software projects across a range of modern technologies. You have experience delivering prototypes and MVPs on an accelerated timeline, as well as a hands-on ability to lead software projects and mentor junior engineers. You love solving problems, enjoy collaborating and communicating with internal and external team members, and are adept at leading all aspects of the technical setup for projects, tools, and infrastructure. You are a strategic thinker (system level) that can look at the big picture, abstract workflows and provide technical assistance in technology to be used at the strategic level. Preferred Qualifications: Artificial Intelligence and Machine Learning Mobile, iOS and Android Wiring front-end prototypes to back-end APIs 15+ years of experience in building large scale, high performance, high availability full-stack systems Experience with frontend technologies such as JavaScript, Vue, Angular, React Fluency and facility with one or more of the following programming languages: Java, Scala, Python, GoLang, C#, Objective-C Hands-on experience with Microservices, Container and Streaming technologies Experience with Big Data technologies (Hadoop and other frameworks in Hadoop ecosystem, Elasticsearch, etc.) Extensive experience with continuous integration processes and tools such as Jenkins, Chef, Puppet Hands-on experience with cloud technologies - AWS, GCP, Azure Excellent written and oral communication skills, able to connect with all levels of internal technology teams and business teams Experience with leading/ground-breaking technologies development or product management Experience in leading the entire life cycle of products Experience in rapid prototyping and other fast iteration methods to ensure product delivers outstanding customer experience Excellent oral and written communication skills Ability to balance multiple contending priorities in a fast-paced environment Knowledge of professional software engineering practices & best practices, including coding standards, code reviews, source control management, build processes, testing, and operations. Why Cisco #WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference. Here's how we do it. We embrace digital, and help our customers implement change in their digital businesses. Some may think we're \"old\" (30 years strong!) and only about hardware, but we're also a software company. And a security company. An AI/Machine Learning company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do - you can't put us in a box! But \"Digital Transformation\" is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) Day to day, we focus on the give and take. We give our best, we give our egos a break, and we give of ourselves (because giving back is built into our DNA.) We take accountability, we take bold steps, and we take difference to heart. Because without diversity of thought and a commitment to equality for all, there is no moving forward. So, you have colorful hair? Don't care. Tattoos? Show off your ink. Like polka dots? That's cool."}