{"title":"Senior Developer","location":"San Diego, CA 92127 (Rancho Bernardo area)","salary":"\n\n$88,505 - $125,000 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">NET 4.5/4.0, 3.5, MVC 4.0, Entity Framework, JQuery, Xamarin (MonoTouch) for app development.</li>\n <li>AJAX, Microsoft SQL Server 2012, Visual Studio 2012 and Active…</li>\n</ul>","term":1,"jk":"f20e7c1d0b6573c8","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=f20e7c1d0b6573c8","source":"indeed","full_description":"Senior DeveloperWe are looking for a hands on, high-energy, results-oriented Senior Software Development professional, who is looking to join a great collaborative team.Applications International Corporation is a fast-paced, dynamic software company that is paving the way for EHS (Environmental, Health & Safety). We work with a diverse spectrum of industries, aiming to make safety and compliance a priority worldwide. AIC offers our employees an unprecedented benefits and wellness package, and an enjoyable corporate culture. Please visit our website to learn more about our company and software : http://www.applicationsinternational.com/ .Job SummaryIn this position you will work as a member of an Agile Software Development Team that develops internet applications, specifically: designing, developing and implementing web-based regulatory and administrative applications used in many corporations. The primary technologies used are C#, ASP.NET 4.5/4.0, 3.5, MVC 4.0, Entity Framework, JQuery, Xamarin (MonoTouch) for app development. AJAX, Microsoft SQL Server 2012, Visual Studio 2012 and Active Reports.Essential Functions and ResponsibilitiesSpecific functions and responsibilities include:Participate in a team environment working with users to develop specifications/requirements documentation for new applications, based on the user needs. Work on the development of applications using Visual Studio, C#,VB.Net, MVC 4.0, Entity Framework 5.0, ASP.net, AJAX and Microsoft SQL Server while following predefined specifications. Participate in the testing and implementation of new applications as well as program modifications to existing applications based on user requests and AIC requirements specifications. Provide ongoing support for applications already in use. This includes; problem diagnosis, resolution, ad hoc reporting support, general application development and quality assurance tasks, as necessary.Benefits Package SummaryBenefits Included in the Role are based on full time employment as applicable by State and Federal Laws:401 K and Roth - employer match @ 6 – 100% vested at time of depositMedical - HMO& PPO programs - 100% paid by employer for you and your familyLife Insurance for employee – 100% paid by employerDental - Voluntary benefitVision - Voluntary benefitPaid Time off , on an accrual basisCorporate Wellness ProgramPaid HolidaysCorporate Wellness ProgramMission Statement:Our mission is to provide one global technology platform to allow our clients to have access to key business information at their fingertips 24/7. We believe the client experience and satisfaction is key in every aspect of our solution. We strive to consistently exceed our client’s expectations by making integrations and implementations seem less to our customers delight. We are dedicated to the execution of providing unsurpassed customer support and service. We believe in only excellence in all areas of the company. That excellence coupled together with our valuable employees, their indomitable spirits and courage, creates an environment where there is no stopping us in this mission.Job Type: Full-timePay: $88,505.00 - $125,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceHealth insuranceLife insurancePaid time offParental leaveProfessional development assistanceVision insuranceSchedule:8 hour shiftDay shiftMonday to FridayExperience:development: 5 years (Required)Work Location:One locationThis Job Is Ideal for Someone Who Is:Detail-oriented -- would rather focus on the details of work than the bigger pictureAchievement-oriented -- enjoys taking on challenges, even if they might failCompany's website:www.applicationsinternational.comWork Remotely:Yes, temporarily due to COVID-19"}