{"title":"Full Stack Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKfrTRj5yqbu5SwMoKujx6W1xi_sis2E0UH0NmmMLB_mDW0cwEVwidcQ3iHNKUrH76wKID-enuoDJx8NINDJnNsg5HxglDkQMeU9_zGMTI80Ngt73gKQ5iWMuzJnt7BgMzRo_xfkL-FsimRlwUkCr3E-xvQs_naZQ4Xc6O9kxgeKd-ksP1I9rheJ1Tu3nPE","source":"ziprecruiter","full_description":"Core One is in search of a Full Stack Web Developer to join our growing Technology Advisory team. The Developer will work with a small, high energy, fast-paced team to develop and deliver numerous web and mobile communications applications. This is an excellent opportunity for the right developer to get in on the ground floor of sophisticated and challenging solution development projects. In this hands-on position, you will work collaboratively to architect, design, build, deliver, and enhance highly available, scalable, web based systems. We are looking for someone who can help build and grow our R&D and product development initiatives. This position will interface with key stakeholders and apply technical proficiency spanning all stages of the Software Development Life Cycle including Requirements Elicitation, Application Architecture definition and Design, and iterating based on Customer/User FeedbackResponsibilities:Support all aspects of software development (designing, coding, testing, debugging, and maintaining products Implementation of user storiesIncorporate internal and customer feedback into how applications should function and performAnalyze the needs and the environment to ensure the solution being developed considers current architecture and operating environmentDevelop and deliver high quality code according to application release scheduleLead validation for all types of testing and support activities related to implementation, transition, and warrantyMust be a self-starter with the ability to work independently with minimal supervision.Effectively communicate technical challenges, options considered, and the recommended solution to senior leadersMinimum Requirements:Bachelor’s degreeMust have an active TS/SCI w/ PolygraphMinimum of three (3) years’ relevant web-application software development and delivery experienceExperience with web UI technologies on NodeJS, Angular, React, Vue.js, Bootstrap, or other web UI development frameworks.Experience with RESTful API design, development and testingExperience with GitLabs, to maintain Release Management Tool and Build Management Tool for CI/CDDesired Skills:Front end web application development with technologies such as React, HTML5/CSS, JavaScript, Vue.js.Back end web application development with technologies such as NodeJS, G-unicorn, Nginx, and PostgreSQL.Strong Python and JavaScript software development skillsExperience working in agile software development teams and environments.Experience with Amazon Web Services or Microsoft Azure is a plusExperience with DevOpsAbout Core OneOur mission is to be at the forefront of devising analytical, operational and technical solutions to our Nation's most complex national security challenges. In order to achieve our mission, Core One values people first and is comprised of outstanding professionals from the national security community. Because Core One is committed to seeking top talent, we offer competitive compensation and benefits packages. In addition, Core One is a team-oriented, dynamic and growing company that values exceptional performance.Core One is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, or protected veteran status and will not be discriminated against on the basis of disability."}