{"title":"Technical Writer - Partner Management","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKOBc7l2Gf72L0VleXSLHx2hVnQHto3XDbDRwveKZw7PoTiKWQEdFQTyfxQMGVv9zEZCwOqjaOju_yv8WyEP0pYL1Z-P_olFaxUgY2RY52Xa2XEpXiT9Qalm1ZAy-HwY6urlwUkqrUe-UzF-nc1LzRHUIvNca2YzS4TxG_E75FGRBGgd7tc7Uxp8jwPxJM1","source":"ziprecruiter","full_description":"Job DescriptionVOLT is seeking candidates for \"Technical Writer - Partner Management\" role for our client in Seattle, WA. This is 100% Remote contract role estimated of 3-6 months.Candidate in this position will be developing solution guides utilizing API, so they really need someone with experience with RESTv2 APIs. They will need to come up with examples and postman requests.Must Haves3+ years developing software user guides in an online environmentExperience using authoring tools to create/publish content on the web; experience with AEM a plusExperience documenting RESTv2 APIsFinance/ Tax knowledge (plus)Job Brief:Our client is looking for a writer who can design, create, and manage content for a set of Integration Solution Guides. In this role, you will develop content from existing documentation and discussions with Subject Matter Experts (SMEs). You will work with a project team to develop a suite of solution guides with a consistent look and feel, and to build an initial set of content that is effective and easy to update.Responsibilities:Create web content for technical development solution guides and in-product assistance for client'spartners on a temporary basis as part of thePartner Management team.Work with product-groups and subject matter experts to understand your feature area and write great documentationCreate and test sample cURL requestsInvestigate and prioritize updates to existing contentTrack and communicate project status, and deliver what you promiseConstantly seek and respond to stakeholder, developer, and partner feedbackRequirements:Be prepared to share samples demonstrating the qualifications below as part of the interview process.3+ years creating assistance content for external customers (samples required; please be prepared to submit them on request)3+ years developing software-product user guides in an online environmentDemonstrated ability to analyze customer needs and develop a writing plan to meet those needsExperience using authoring tools to create and publish content on the web; experience with Adobe Experience Manager a plusExperience collaborating with software development teams and turning solution and integration information into developer-facing contentAbility to use standard software tools and, more importantly, the ability to learn new onesExperience documenting RESTv2 APIsKnowledge of taxes is a benefit and may replace some writing experienceSamples that demonstrate strong writing skills are essentialVOLT is an Equal Opportunity EmployerQualifications: Candidate in this position will be developing solution guides utilizing API, so they really need someone with experience with RESTv2 APIs. They will need to come up with examples and postman requests. Must Haves 3+ years developing software user guides in an online environment Experience using authoring tools to create/publish content on the web; experience with AEM a plus Experience documenting RESTv2 APIs Finance/ Tax knowledge (plus), Be prepared to share samples demonstrating the qualifications below as part of the interview process. * 3+ years creating assistance content for external customers (samples required; please be prepared to submit them on request) * 3+ years developing software-product user guides in an online environment * Demonstrated ability to analyze customer needs and develop a writing plan to meet those needs * Experience using authoring tools to create and publish content on the web; experience with Adobe Experience Manager a plus * Experience collaborating with software development teams and turning solution and integration information into developer-facing content * Ability to use standard software tools and, more importantly, the ability to learn new ones * Experience documenting RESTv2 APIs * Knowledge of taxes is a benefit and may replace some writing experience * Samples that demonstrate strong writing skills are essentialEmployment Type: [\"FULL_TIME\"]"}