{"title":"Network Administrator NEW!","location":"","salary":"","description":"","term":"$70,000 to $80,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ3azu94OhQoSHcQi79dssFLMO6A-a2f8kyaT7cmunMD3Arl12wChG9mVTTzpuxFvSyYMxE7z0U7ldH8J1WqnyHTmk4lJUoepNUVNKUPgK81mUIV4Dgf5zDpyIrtPajPhBkM-UfBiXyZQv_xrDbngVze0ZKAJtg_Coyeaape0mt6ucXqI6RVdmzgYe1oxyl","source":"ziprecruiter","full_description":"3 month contract to hire FTE! Top Things:· Strong interpersonal, written, and oral communication skills· CCNA Certification expected.· 3+ years of experience configuring Cisco routing and switching equipment in LAN, WAN and MAN environment.· 3+ years of experience managing and/or administering firewalls, Palo Alto or Cisco Firewalls preferred.· 3+ years of experience performing hands on firewall and network services infrastructure engineering, diagnosing and correcting network problems, and network equipment installation and configuration.· 3+ years of experience managing and/or administering wireless networks preferred.· Experience supporting TCP/IP based networks and applications in a corporate environment are required.· Experience installing and supporting Cisco IOS based products is required.Our client is seeking a Network Administrator for an exciting contract to hire scenario. The Network Administrator role is to manage company private and public data networks across the organization. Responsibilities include the installation, monitoring, maintenance and optimization of all network hardware, software, and communication links. Will work with meeting planners and conference managers to plan and deliver wired and wireless convention network and Internet services. Individual must be able to plan and implement network and security installs and upgrades from beginning to end. The position requires a person that has strong interpersonal communication skills. The individual is also responsible for user training, network security, documentation, and network diagrams; all of which should meet industry standards and regulations (e.g. HIPPA, PCI, GDPR).Frequently procures and tracks equipment and materials for upgrades and projects. Interfaces with IT department leadership to present task-based solutions and training. Assists with planning, coordination, installation, configuration, and maintenance of all network related devices.DUTIES:Provides Tier 2 support of network hardware, applications, and systems.Manage gateway devices that control and deliver network and Internet connectivity to our property.Read and understand current industry standards and regulations to plan and implement solutions.Work with meeting planners and conference managers to design, plan and schedule convention network and internet solutions.Use wireless, ethernet, and fiber optic technical tools to diagnose and correct network problems.Manage IPS/IDS and firewall configuration, updates, and maintenance.Configure wired and wireless networks to ensure their smooth and reliable operation for fulfilling business objectives and processes.Work schedule is determined by the needs of the business and project requirements. The position requires that individual be able to work any time of the day or night and will be on-call 24/7 for technical support.Responsible for network documentation. Maintains network diagrams and coordinates information with our help desk.Conduct research on network products, services, protocols, and standards to remain abreast of developments in the networking industry. Selection and install hardware and software for the organization.Understands the company’s general business functions and has a conceptual understanding of each business unit’s activities.Perform all other job-related tasks as assigned.REQUIREMENTS:· CCNA Certification expected.· 3+ years of experience configuring Cisco routing and switching equipment in LAN, WAN and MAN environment.· 3+ years of experience managing and/or administering firewalls, Palo Alto or Cisco Firewalls preferred.· 3+ years of experience performing hands on firewall and network services infrastructure engineering, diagnosing and correcting network problems, and network equipment installation and configuration.· 3+ years of experience managing and/or administering wireless networks preferred.· Experience supporting TCP/IP based networks and applications in a corporate environment are required.· Experience installing and supporting Cisco IOS based products is required.· Experience designing, configuring, and implementing enterprise-class VoIP and TDM-based voice networks preferred.· Hands-on experience with Cisco Unified Communications Manager / Call Manager, Cisco Voice Gateways, Cisco Unified Border Elements (CUBEs), and Survivable Remote Site Telephony (SRST) preferred.· Understanding of all common TCP/IP protocols, packet capture and decoding and TCP/IP routing are basic skills that are required in this position.· The ability to read and understand IETF RFCs and IEEE standards is expected.· Experience installing and supporting Microsoft Windows server and workstation operating systems in a corporate environment is preferred.· A bachelor’s degree in computer science or equivalent technical training and experience is preferred.· Strong interpersonal, written, and oral communication skills· Able to conduct research into networking issues and products as required· Ability to present ideas in user-friendly language· Self-motivated and directed, with keen attention to detail· Proven analytical and problem-solving abilities· The ability to prioritize tasks and projects based on business needs· Strong customer service skill set· Experience working in a team-oriented, collaborative environment"}