{"title":"Associate AI Software Engineer","location":"Redondo Beach, CA 90278","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Applies machine learning algorithms to large sets of structured and unstructured data to solve a broad range of problems that include applications in pattern…</li>\n</ul>","term":1,"jk":"5de9b3b17745c4bb","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=5de9b3b17745c4bb","source":"indeed","full_description":"Your opportunities for achievement are limitless with Northrop Grumman Aeronautics Systems.\n\nClimb to new heights on your journey when you start Defining Possible with Northrop Grumman. Enjoy a purposeful career in aeronautics that is crucial to the way we connect and protect our world across land, sea, and air. Bring your experience and take advantage of this opportunity to discover how you can start to push past possible and achieve your goals today. Enjoy a diverse, collaborative environment with professionals across the nation ready to help launch your career.\n\n\nNorthrop Grumman is seeking an Associate AI Software Engineer. This position will be located at our Aeronautics Systems Sector in Redondo Beach, CA.\n\nThe qualified candidate will become part of Northrop Grumman's South Bay Aircraft Design (SBAD) organization.\n\nThe selected candidate will design, develop and deliver novel mathematical and statistical modeling and algorithm development to tackle the challenges of prediction, optimization, and classification. Other duties include:\nApplies machine learning algorithms to large sets of structured and unstructured data to solve a broad range of problems that include applications in pattern recognition, target detection and tracking, machine learning and decision systems, and robotic systems\nPrototypes advanced artificial intelligence techniques to stretch the capability of autonomous systems research and development programs\nDesigns, develops, documents, tests and debugs applications software and systems that contain logical and mathematical solutions\nDesign and develop compilers and assemblers, utility programs, and operating systems\nCollaborates with cross-functional team to deploy machine learning algorithms to prototype testing and production\nEnsures software standards are met\nMay use system-of-systems and multi-agent approaches to architect and design AI software systems\nWorks closely with AI Systems Engineers to understand program intent, system capabilities, and output requirements\nMay design software-systems, applications, and data architectures that directly implement AI techniques to support achieving better reliability, precision, accuracy, and speed to meet performance requirements\n\nQualifications:\n\nBasic Qualifications\nA candidate, regardless of age and hiring source, must meet ALL of the below criteria. The candidate must:\nBe completing or has completed their Bachelor's degree from an accredited institution.\nBe majoring in or having majored in a STEM (Science, Technology, Engineering or Math) degree.\nHave an overall cumulative GPA of 3.0/4.0 or higher (unofficial academic transcripts must be provided at time of application by uploading the documents to your application or profile)\nBe able to obtain and maintain a U.S. Government security clearance (U.S. citizenship is a pre-requisite)\nPreferred Qualifications\nHave an overall cumulative GPA of 3.70/4.0 or higher.\nPrevious internship/co-op or other work experience, leadership & teamwork capabilities, interpersonal communication skills, and activities (professional/community/extracurricular).\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions.\n\nJoin our Talent Community:\n\nLIKE NorthropGrummanCareers on Facebook https://www.facebook.com/NorthropGrummanCareers\n\nFOLLOW Northrop Grumman Corporation on LinkedIn https://www.linkedin.com/company/northrop-grumman-corporation/\n\nFOLLOW @NG_Careers on Twitter https://twitter.com/NG_Careers\n\nSUBSCRIBE to our YouTube Channel: NorthropGrummanMedia https://www.youtube.com/channel"}