{"title":"Chemist - Contractor 210301","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAKr-nydDZyeTdpEZgAOBdVjl_VR6_3SqxvDw9UL4aVK0ALyLXrIiKocnTVYgfjwpu4DXG3XHonhmsFr4YtG0dlxv6DmnmLhn4ho9zgDnbA3vrUobHRIYXlZOHsmLj4t1kHffZSSUUoT0IfoGtS22Tp1ry54wwwp3EOgZF8btJil2BkvLWYgLPsbt4_u_MzB","source":"ziprecruiter","full_description":"Discovery Solutions is seeking job seekers for a contract position with one of our customers, Lilly, a leading pharmaceutical company headquartered in Indianapolis, IN.LOCATION: Indianapolis, IN 46221DESCRIPTION:  The Chemist will perform accurate and timely testing of routine and some non-routine lab samples in accordance with appropriate Good Manufacturing Practices and safety guidelines. Completes second person verification of test results. Participates in laboratory root cause investigations and quality system improvement initiates by executing well defined protocols and procedures. Shares technical information and best practice within the group. Design and evaluation of experiments, methods development and characterization, support of process development / optimization and the analysis and interpretation of data. Conduct studies to validate methods, develop methods, evaluate new technologies. Sample Analysis. Sample preparation, instrument set-up and operation, data entry, primary data review. Coordination of method transfers and co-validations. Qualifying, calibrating, and maintaining analytical instrumentation. All laboratory work will be conducted and documented in accordance with the appropriate Quality System. Act as a resource for insuring adherence to quality systems. Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status. Being on a temporary contractor assignment at Lilly means working in an innovative culture where you have the opportunity to support the work of thousands of others around the globe dedicated to improving the lives of others. Lilly discovers and brings life-changing medicines to those who need them, improves the understanding and management of disease, and gives back to communities through philanthropy and volunteerism. Elanco passionately promotes food security and fosters the human-animal bond to enrich the lives of its customers and the customers they serve as well. Our values: integrity, excellence, respect for people. Greater than 90% of workers rate their Lilly assignment as above average or excellent.Primary Position Responsibilities:Routine sample analysis and data entry. Troubleshoot instrumentation. Communicate with others on shift and in control rooms.Other job specific considerations:Exposure to chemicals or solventsExposure to gasesExposure to potential allergensExposure to vaporsLifting: 0 - 24 lbsPPE is provided as required.SHIFT: 5:45 PM to 6:00 AM / 3 on 2 off, 2 on 3 off, 2 on 2 off (11.75 hrs per shift) May initially train on day shift Monday Friday before moving to rotating.EXPERIENCE: Bachelor's degree with at least 6 months of post academic benchtop lab experience.Other requirements: Tasks may require repetitive motion and standing for long periods of time. Must be able to lift up to 24 lbs.Preferred Skills:Looking for someone with HPLC, UPLC, GC experience.GMP experience. Experience with analytical instrumentation. Experience with different systems such as HPLC, Empower, UPLC electronic notebook, GMP documentation, SmartLab, Darwin. Experience in pipetting, basic dilutions and gas chromatography.EDUCATION: Bachelors Degree in scientific discipline preferably chemistry."}