{"title":"Software Engineer - Backend (Remote)","location":"California","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Experience in full life-cycle agile <b>software</b> development.</li>\n <li>Design and develop <b>software</b> to help operate our internal and external applications.</li>\n</ul>","term":1,"jk":"96661d4b2712c359","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=96661d4b2712c359","source":"indeed","full_description":"The Job:\n\n\nLocation: Remote |California | Hawaii | Illinois | New York | Colorado | Massachusetts | Washington\n\nWe are looking for a Software Engineer - Backend to join a team building the next generation of a growing education technology platform. We are looking for Backend Engineers to join us in building and supporting all features, design and implement API’s and services that power up our product and support our rapidly growing user base.\n\nWhat you will do:\n\nDemocratize data-oriented design\nDesign and develop software to help operate our internal and external applications\nDesign and develop software for shared and common services like load balancers, microservices, logging & metrics pipelines, etc\nProvide and document reliable solutions within application development, deployment, and monitoring\nWrite code in Ruby, Java, or Python\nParticipate and conduct code reviews for team members\n\nWhat you bring to the role:\n\nBachelor's Degree in Computer Science (or Equivalent Experience) with a strong grasp of CS fundamentals\n3* years in engineering using an Object-Oriented Programming like Ruby, Java, Python\nExperience in writing API contracts, documentation, or blueprints\nExperience in Cloud development environment such as Heroku, AWS, GCP\nExperience in full life-cycle agile software development\nExperience with test driven development and test automation\n3+ years working with one or more modern frameworks such as Rails, Spring\nStrong understanding of SQL and other associated databases, and Agile frameworks, is a plus\n\nWhat We Offer\n\nCompetitive compensation plan\nInnovative, high growth and collaborative culture.\nGenerous PTO package with floating holidays\nFun team events (Monthly and virtual for now)\nGreat Benefits including: Medical, dental, vision, life 401k and more!\n\nSketchyGroup LLC is an Equal Opportunity Employer. SketchyGroup LLC encourages women and minorities to apply and does not and will not discriminate on the basis of race, religion, color, sex, age, sexual orientation, marital status, national origin, disability or any other basis prohibited by applicable law."}