{"title":"          Java Developer NEW!        ","location":"","salary":"","term":"Contractor","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAKf25oOheOLnjC2idfq0h7O1yCkkPqIuU-tqIa2eRGbKfD4cdjNG5JGuK0halkMWYxZkxom3zrcHZHF4N5QXAe9XIY7SYIpgzzzQIqBrr2zrlds5MLOGvpgnk25z85VAtmkHQYhy2090-_AaXzY4aux9Lg5tG9RSx5QGIbvJEUo57vKWZGxqHn807mdCE0T","source":"ziprecruiter","full_description":"\n        Ranked as a top Fortune 100 Financial Services company, our client has an opening for a Full Stack Java Developer in Dallas, TX (will be remote until offices are deemed safe to reopen).This will initially be a 12 month contract assignment and has potential to extend up to 24 months. Imagine everything that you could learn to advance your career while working at a Fortune 100 company with around $2.0 trillion in assets. Check out the qualifications below. If you feel that you meet these, please apply online. Let us help you make that next great career decision!Responsibilities:Technical Analysis of Business Requirements and Design interpretation – Ensuring understanding of design in response to business requirements and is able to interpret and successfully implement solutions.Analyzes highly complex business requirements, designs and writes technical specifications to design or redesign complex computer platforms and applications.Subject Matter Expert - Acts as an expert technical resource for modeling, simulation and analysis efforts.Technical Process Management – Ensuring all development and implementation activities follow technical process for compliance purposes.Release Management – Oversees overall systems testing and the migration of platforms and applications to production.Escalation Point - As an escalation point for application support and troubleshooting, provides guidance and direction to less experienced staff in resolution of escalated issues and/or complex production, application or system problems.Leadership & Mentoring - Leads projects, including assignment of tasks, and provides direction and guidance to less experienced staff.The ideal candidate would possess:10+ years’ experience of hands-on IT experience in developing highly integrated, secure web-based applications using Java/J2EEResponsible and accountable for end to end technical design and architecture of low latency web applications and service based applicationsWide Core Java Development experienceExperience developing solutions on a web application platform, Development expertise in the following web technologies: Java, Struts, Spring, Hibernate, Web Services etc.Hands on Experience with Microservices, Sprint boot, Spring Cloud and Netflix cloud ecosystem of technologiesExperience in deploying application in Cloud, preferably Pivotal Cloud FoundryRich experience working in Agile environmentHands on experience adopting and implementing engineering practices such as TDD, BDD, Developer lead functional automation, Automated deploymentExperience in recommending changes to application architecture with knowledge in infrastructure aspects and good ability to articulate to stakeholdersSkilled in configuration management aspects incl. Jenkins, Maven, UDeploy, Apache Ant usageDirect experience with one of Tomcat and WebLogicPerform peer code reviewsExperience of testing frameworks ex; Junit/Selenium/CucumberRelationship experience with business partners (SMES, stakeholders, PMs) and technology partners (data analysts, application developers, QA analysts)Ability to assess and solve problems, grasp concepts quickly, and design solutionsFamiliarity with mortgage data and lending processesThis is a W2 position with Advantage Resourcing. Will not accept resumes from recruiters or agencies.We offer benefits for purchase that include: Medical, Dental, and Vision Insurance as well as an excellent 401k plan.Advantage Reference # 1149094About Advantage Resourcing Advantage Resourcing is committed to providing equal employment opportunity for all persons regardless of race, color, religion (including religious dress and grooming practices), sex, sexual orientation, gender, gender identity, gender expression, age, marital status, national origin, ancestry, citizenship status, pregnancy, medical condition, genetic information, mental and physical disability, political affiliation, union membership, status as a parent, military or veteran status or other non-merit based factors. We will provide reasonable accommodations throughout the application, interviewing and employment process. If you require a reasonable accommodation, contact us. Advantage Resourcing is an E-Verify employer. This policy is applicable to all phases of the employment relationship, including hiring, transfers, promotions, training, terminations, working conditions, compensation, benefits, and other terms and conditions of employment. All employees are directed to familiarize themselves with this policy and to act in accordance with it. All decisions with respect to employment matters and other phases of employer-temporary employee relationships will be in keeping with this policy and in accordance with all applicable laws and regulations. \n      "}