{"title":"Sr Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI1A9zPqyDiyCi0MfNIo5G4ZjBck8eLfuZTbIrsJw03Ix0aX4Ul2xW8HFhtIqqK4PyIMRxwvwGeBf4kpBVGY01ffLe08rckgInMkt9M4OHkekOAwi6PiOsXZ6x_UgdkbrFVa0knXc2pi6POI4Kf0ObffBFJzqqZDQyGlR1JSLghlexKhUxXE6FEYKicjJQ","source":"ziprecruiter","full_description":"Sr Network EngineerAlliant Energy Job Start Date:08/12/2019Type of Position:RegularNumber of Openings:1 Job Location & Contact:4902 N Biltmore Lane Madison,WI53718 6084588458EmailJob Description: Internal Posting Details :Alliant Energy's INT Operations Support team has an opening for a Sr Integrated Network Services Analyst. This position is available in either Cedar Rapids, IA or Madison, WI.As our Network Engineer you will be designing, testing, managing, and deploying core network technology to support large local datacenters, private clouds, and public clouds with a strong focus on routing and switching. Automation will be a strong focus as well in order to support a diverse network across large datacenters, corporate offices, and smaller field offices.This position is a non-bargaining position and requires a resume.Positions come down at 11:00 p.m. on deadline date.For non-bargaining positions, generally employees will have a minimum of 12 consecutive months of employment with the Company to be eligible to apply for posted positions. If an Internal candidate has a current Letter of Expectation or discipline for performance improvement, he/she may possibly not be considered for positions. Making an exception to any of this will be for extenuating circumstances and will be determined by the HR Business Partner.To review the corporate competencies please click here.Talent Gateway Posting Details :Posting Details :Alliant Energy's INT Operations Support team has an opening for a Sr Integrated Network Services Analyst. This position is available in either Cedar Rapids, IA or Madison, WI.As our Network Engineer you will be designing, testing, managing, and deploying core network technology to support large local datacenters, private clouds, and public clouds with a strong focus on routing and switching. Automation will be a strong focus as well in order to support a diverse network across large datacenters, corporate offices, and smaller field offices.Preferred Experience includes:Extensive experience with routing and switching equipment from vendors like Cisco, Juniper, or AristaDetailed understanding of TCP/IP, IPv4/IPv6In-depth experience with BGP, EIGRP, and OSPF routing protocolsExperience with QoS and implementation strategiesExperience with layer 1 technologiesExperience with layer 2 technologiesExperience with cloud architectures and network automationExperience with public clouds and best practices such as Azure and AWSExperience with private cloud orchestration such as OpenStackExperience with SDN technologies such as VXLAN, NVGRE, Open vSwitch, OpenFlowExperience with load balancers like F5 BigIP, HAProxyExperience with device or port authentication and authorization technology like 802.1X, ISEExcellent troubleshooting skillsComfortable working in a Unix server environmentPython scripting and automation Applications will be accepted until a qualified pool of candidates is received.Alliant Energy will not provide sponsorship for an employment visa (e.g., H-1B visa) now or in the future for this position.Job Responsibilities :Resolves low complexity technical issues escalated through the Information Technology Help Desk and other methods for data, telecommunications, voice and/or collaboration technologies during and outside of core business hoursInteracts and cooperates with other internal and external support groups to facilitate resolution of technical issues to maximize system availability and meet Service Level Agreements.Installs, monitors and repairs network, telecommunications, voice and/or collaboration infrastructure to establish stable and reliable network, telecommunications, voice and/or collaboration services that support enterprise LAN/WAN environments (e.g. access, distribution and Core Network Services). Provides troubleshooting, repair and end user support on a daily basis.Provides continual technical expertise in the evaluation, planning, analysis, development and implementation of data, telecommunications, voice and/or collaboration technologies including, but not limited to, providing roadmaps, processes and procedures for both project work and general organizational growth in conjunction with other analysts, engineers and management.All other duties as assigned.Job Qualifications :Education and Experience Requirements:This level requires a four year degree from an accredited college or university, with emphasis in Computer Science or Information Technology with an emphasis in networks, telecommunications, voice and/or collaboration technologies.Four years of relevant experience is required.In the absence of a degree eight years of experience in Computer Science or Information Technology with an emphasis in networks, telecommunications, voice and/or collaboration technologies is required.Preferred Experience:Experience with Cisco ISE/ACI, Perl /Python, pxGrid, Multi-Domain CheckPoint, Technical Collaboration Tools (e.g. WebEx, Telepresence), Basic Linux/UNIX skills and NERC CIP understanding.Certifications in Cisco Certified Entry Networking Technician (CCENT) and/or Cisco Certified Network Associate (CCNA) is preferred.Extensive experience with routing and switching equipment from vendors like Cisco, Juniper, or AristaDetailed understanding of TCP/IP, IPv4/IPv6In-depth experience with BGP, EIGRP, and OSPF routing protocolsExperience with QoS and implementation strategiesExperience with layer 1 technologiesExperience with layer 2 technologiesExperience with cloud architectures and network automationExperience with public clouds and best practices such as Azure and AWSExperience with private cloud orchestration such as OpenStackExperience with SDN technologies such as VXLAN, NVGRE, Open vSwitch, OpenFlowExperience with load balancers like F5 BigIP, HAProxyExperience with device or port authentication and authorization technology like 802.1X, ISEExcellent troubleshooting skillsComfortable working in a Unix server environmentRequired Skills:Hardware installation experience.Proficient in Microsoft Office.Experience communicating professionally with end users in problem / urgent situations.Participate in on-call rotations, including outside business hours; must be prepared to travel as required.Knowledge, Skills, and Abilities:Strong written and verbal skills.Working knowledge and familiarity with network, telecommunications, voice and/or collaboration technologies'(e.g. unified messaging, VoIP, Cisco Networking Equipment, video conferencing, A/V equipment, etc.).Ability to work individually and as a team member.Ability to manage time and work high-paced environment.Strong troubleshooting and problem solving skills.Ability to manage time and work high-paced environment.*NOTE: All candidates selected for employment with Alliant Energy will be required to successfully complete a drug screen and background check.We are committed to providing an inclusive work environment for all and are proud to be an Equal Opportunity Employer M/F/Disability/Protected Veteran.Disclaimer: The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.To apply for this challenging opportunity, please complete our online application at www.alliantenergy.com/careers . Experience Required: 5-10 years How to Apply: To apply for this challenging opportunity, please complete our online application at www.alliantenergy.com/careers . Application Deadline: Jan 01, 1900"}