{"title":"Wet Chemistry Technician","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJbTHfy5ldUjnfS5vpRni_REJbiW82qB65gXX_OnWRGCXz05Do6CwCaWSO515ICK5muXCMgHv-nPoWVOiDbD2rz3Lq72Js569qopd6N_qb-Wk_xNx2iNHeaxsDPMHGrpL7NdnGlxl3gQuUNHbL1-kNXBSSMY3oTLmdCOR-9Z7tNER4Do_wcjdvcrhFAGfga","source":"ziprecruiter","full_description":"ALS provides a broad range of testing and analytical services to a wide variety of end markets and industries around the globe. We continue to remain at the forefront of the testing services industry, building an enviable reputation. ALS provides a diversified line of independent analytical services to a wide range of top-tier customers in the pharmaceutical, nutraceutical, environmental, and food industries. Our diverse laboratories perform routine and specialty analytical testing for compliance, safety, certification and verification purposes. General Accountability: The primary purpose of this position is to follow methodologies, perform analysis, and interpret samples. Seasonal Position Specific Responsibilities: + Follow appropriate methodologies and SOP's as required.+ Document activities and report results in a concise and accurate manner.+ Solve analysis problems as needed.+ Interpret samples and data.+ Performs other duties as assigned from time to time by the Group leader or Department Supervisor.+ Perform other duties as assigned and directed.+ Strong computer skills with knowledge of Excel, Microsoft Word.+ Multi-tasked, organized, and detail oriented.+ Proficient English verbal and written communication skills with the ability to communicate with staff, management and clients in a professional manner.+ Able to work well in a team and has problem solving capabilities.+ Knowledge of working in a laboratory environment very helpful.Required Qualifications: + High School Diploma and at least 8 credit hours of college level science courses+ Bachelors Degree in Chemistry or science related field preferred+ 1 year of college level classes, or 1 year of laboratory experience will be considered. Physical Demands: + Able to speak and hear clearly while communicating with staff, management, and clients.+ Able to sit, and/or stand for 100% of an 8 hour day.+ Able to lift up to 50 lbs+ Dexterity in hands and fingers to operate computer and other equipment.+ Must have average vision and able to see to read reports and operate equipment.+ Must be able to distinguish differences in color and shade.+ Must be able to perform repetitive motion actions.+ Must be able to withstand cold temperatures for at least 1 hour We would like to thank everyone for their interest in ALS but only candidates selected for an interview will be contacted. \"ALS is proud to be an equal opportunity employer committed to achieving and maintaining a workforce which reflects and affirms the diversity of our society\" ALS is a VEVRAA Federal Contractor. EOE AA Minority, Female, Veteran, Individuals with Disabilities Click Here to view the EEO is the Law posterClick Here to view the FMLA Law posterClick Here to view the EPPA Law PosterClick Here to view the Pay Transparency ProvisionClick Here to view company E-Verify Participation Poster ID: 2020-8652 External Company Name: ALS Environmental External Company URL: alsglobal.com Street: Holland OFCCP Compliance: ALSENV"}