{"title":"Mechanic B-MSH - Full time (7am-3pm)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK4cVbrYaHQmjpuGgK1ignPEm9GrFEdDGGIdgDwvAd6gfiHdgQ6SBClKGIrwBW0hi3rbXGkOzHBDytggSq3JdwOyPIHOG1ZGyReB-gjyiZWtrli1aTt4yYy5eqbKn5qQexIE0kibsDAn3LOkLvG0SyBp9g3GyG3i0YTTE0TIi8bESTOuo__pntxv2MjLdg","source":"ziprecruiter","full_description":"Strength Through DiversityGround breaking science. Advancing medicine. Healing made personal. Department Name- Engineering  Job Title: Mechanic BJob Summary:Constructs and repairs metal items, tools and machines; fabricates sheet metal articles and equipment; works in cooperation with other trades and mechanics such as carpenters, Electricians, HVAC, General and Refrigeration Mechanics.Roles & Responsibilities:1. Constructs and repairs all types of metal and other items, tools and machines. Repairs or rebuilds parts to be used on mechanical equipment and appliances; assembles and fits parts together, including hand fitting to close tolerance; fits or matches parts together and fastens with screws, bolts or rivets. 2. Fabricates, assembles, alters, repairs and installs sheet metal articles and equipment. 3. Unpacks, assembles, positions and installs machinery and equipment as required. 4. Sets up and operates various metalwork machines such as lathes, shapers, welding and burning apparatus, shearing machines, drill presses, grinding wheels, and other machine shop equipment; uses various types of hand and machine tools. 5. Repairs doors, locks and other hardware. Repairs, maintains, builds or replaces building and structural components such as windows, stairs, partitions, fences and doors. 6. Cleans work areas, tools, equipment and machines. Insures that work cart is kept supplied with needed items; transports cart to work stations and keeps it within immediate reach at all times. Moves, crates and uncrates equipment. 7. As assigned, performs duties in the Laundry, Kitchen, Compaction area, and as part of Preventative Maintenance Crew. 8. Inspects and tests electrical circuitries and components. Repairs or replaces defective components, dismantles and repairs electrical machinery, repairs specialized electrical equipment, signal systems, controls or electrical and motor parts of units such as pumps, fans, compressors and other plant equipment. 9. Replaces faulty switches, sockets, plugs, fuses, brushes, insulators and other elements of electrical systems. 10. Uses test instruments such as ammeter, ohmmeter, voltmeter and other test instruments to detect and isolate defects in wiring, switches and other electrical equipment and systems, Checks clearances of moving parts. 11. Assembles, installs and adjusts new electrical machinery. Follows blueprints and wiring diagrams to ascertain layout, location and specifications of items to be installed. Assembles, installs, adjusts, connects, repairs and cleans components of switchboard and distribution panels and connects them to units controlled. 12. Mounts motors, transformers and other equipment and completes circuits according to diagrams, specifications or established trade practices. Performs preventative maintenance on electrical equipment in the Medical Center Plants. 13. Performs other duties or tasks as directed. Requirements:High School Diploma or /GEDMinimum of one year of experience as an apprentice or helper in a hospital or commercial settingBasic Computer skills desirable. Able to use an I-Pad for Computerized work orders.Good verbal and written communication skills required  Strength Through Diversity The Mount Sinai Health System believes that diversity is a driver for excellence. We share a common devotion to delivering exceptional patient care. Yet we're as diverse as the city we call home- culturally, ethically, in outlook and lifestyle. When you join us, you become a part of Mount Sinai's unrivaled record of achievement, education and advancement as we revolutionize medicine together. We work hard to acquire and retain the best people, and to create a welcoming, nurturing work environment where you can develop professionally. We share the belief that all employees, regardless of job title or expertise, can make an impact on quality patient care.  Explore more about this opportunity and how you can help us write a new chapter in our story!  Who We Are Over 38,000 employees strong, the mission of the Mount Sinai Health System is to provide compassionate patient care with seamless coordination and to advance medicine through unrivaled education, research, and outreach in the many diverse communities we serve. Formed in September 2013, The Mount Sinai Health System combines the excellence of the Icahn School of Medicine at Mount Sinai with seven premier hospital campuses, including Mount Sinai Beth Israel, Mount Sinai Beth Israel Brooklyn, The Mount Sinai Hospital, Mount Sinai Queens, Mount Sinai West (formerly Mount Sinai Roosevelt), Mount Sinai St. Luke's, and New York Eye and Ear Infirmary of Mount Sinai. The Mount Sinai Health System is an equal opportunity employer. We promote recognition and respect for individual and cultural differences, and we work to make our employees feel valued and appreciated, whatever their race, gender, background, or sexual orientation.  EOE Minorities/Women/Disabled/Veterans"}