{"title":"Junior SQL Developer","location":"Torrance, CA 90505","salary":"\n\n$55,000 - $65,000 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">You will work on new implementations and contribute to important organization-wide projects.</li>\n <li>Experienced in highly scalable web sites using SQL Server.</li>\n</ul>","term":1,"jk":"31cac7c4c41d3fab","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=31cac7c4c41d3fab","source":"indeed","full_description":"LOCAL SOUTHERN CALIFORNIA CANDIDATES ONLY.We are looking for a Junior Software Developer in the Torrance, CA area who is creative and talented to join our development team. You will work on new implementations and contribute to important organization-wide projects.Requirements· Experienced in highly scalable web sites using SQL Server.· Ability to write/analyze queries in SQL Server.· Able to juggle multiple projects on tight deadlines.· Adaptive to changing and fast paced, teamwork environment while maintaining composure and a positive attitude.· Work closely with QA team, analyzing code, data, and calculations.· Develop and/or modify TSQL queries, scripts, functions, and stored procedures to map, transform, and clean data· Understanding of relational database conceptsSkills· Dynamic, can-do attitude who seeks creative methods of problem solving.· Degree in a science related field preferred; Statistics, Mathematics, Computer Science, Engineering or no degree and relevant work experience.· Experience with SQL and relational databases· Experience with JavaScript, Jquery, CSS, HTML· Ability to prioritize and multitask job responsibilities.· Strong analytical skills, attention to detail, as well as good problem solving, time management, and logic skills· Outstanding interpersonal, verbal and written communication skills.· Self-motivated, able to work independently with minimal supervision· Ability to independently and successfully navigate through ambiguity and uncertaintyJob Type: Full-timePay: $55,000.00 - $65,000.00 per yearSchedule:8 hour shiftCOVID-19 considerations:We are working remotely for the foreseeable future. But we will return to the office once it's deemed safe.Education:Bachelor's (Preferred)Experience:SQL: 1 year (Preferred)Visa Sponsorship Potentially Available:No: Not providing sponsorship for this jobCompany's website:www.evolvenxt.comWork Remotely:Yes, temporarily due to COVID-19"}