{"title":"Technical Support Representatives - Atlanta, GA","location":"","salary":"","description":"","term":"$13 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAK4IPCp8wdwhfjxRs7zuzqePOdKfsDF2K0DShz01hePeEmCwxIvlgkxbcdB4Amxd6j48uxaB-J4AuHrLE8YXLxQgWxTLoSlaf8gsPKpOq6oSLCR2sXnX5gafrxwNtlRx809x-cdJjbxYOgaEJPVY3S1QRYdea7O9jNzG2Z4XenqggTHRiUmreg8-d5SDw","source":"ziprecruiter","full_description":"Here is the scope of the responsibility:You’ll rely on advanced call center experience to solve more complex and technical customer problems. That includes IT support on issues like connectivity and troubleshooting.What your days will look like:Know your way around the technical landscape? Ready to help customers get the most out of the technology they love and deliver best-in-class service? Our award-winning Call Center Advanced Technical Support Representatives help our customers by offering solutions, identifying opportunities and serving millions of customers – one at a time.What does it take to help our customers with their advanced technical inquiries? A great attitude and the desire to stay up to date on technology and the latest devices. In this role, you’ll come up with innovative solutions to help our customers. Whether you’re answering direct calls, transferred calls or trouble tickets, you’ll work with the latest systems and tools to assist our customers.Knowledge, Skills and Abilities You’ll Need to Succeed:Professional comportment and demeanorOutstanding verbal communication skillsAbility to build rapport utilizing effective probing questionsAbility to learn product knowledge and troubleshoot to ensure quick resolutionIntermediate knowledge of computers and MS WindowsAbility to navigate multiple screens/programsAbility to multi-taskAbility to type 25 wpmAbility to follow direction and accept coachingSelf-motivated and upbeatDesire to work in a team environment achieving personal and team goalsAbility to work flexible hours, including weekends and evenings as requiredYou’ll Receive:Competitive SalaryEligible for Performance IncentivesPaid TrainingHealth Insurance (Medical, Dental, Vision)Fun Work EnvironmentAbundant Advancement OpportunitiesMust Haves:Minimum of 1 year's tenure at last 3 employersCustomer solutions focusedMotivated by quality/integrityDesire to grow and excel1 Year of related Experience (within a call center environment preferred)Exemplary and verifiable attendance records with previous employersDependable transportation to and from workExcellent communication and articulation skillsWillingness to take receive 50+ calls per dayYou will love our fun work environment and endless opportunity for growth!"}