{"title":"Software Engineer - iOS - Columbus Hub","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL9V6y6L7VXQaEmRSXHbLjLWDhMP-i3-HoisQ8Chy-UP0QIXIxHpy5mMR22HuCj_1aC_fqNY5-IGxX-B1awN2ytBs_wJT59ofBUcjmB_srGRUKPlAhX0W2gmoT0UrbnaXgMEWCLpwTFcmWhHTOJzW1U9UxykZ3081-nWfmFNuOZ4YWKpkxyRL19u-2LUcHN","source":"ziprecruiter","full_description":"Our engineering and product teams are organized around our hubs for community and collaboration. Work anywhere means you can work at home or the office on any given day. Your product hub is based on the primary location of your product.  You should live within one timezone of your product hub. Our current product hubs are Pleasanton, Los Angeles , Columbus, Boston, NYC, Raleigh, and Toronto.  iOS Developers at Veeva strive to build the leading applications for our pharmaceutical customers as they meet with health care providers around the globe. You will play a key part in creating apps that deliver an exceptional user experience for our customers. You're creative, highly-technical, detailed, and able to partner closely with fellow engineers and product managers. If you are up for the challenge of building enterprise iOS applications for one of the fastest-growing public tech companies, you should join our team. What You'll Do Work on technical designs, identify issues and deliver compelling mobile solutionsContribute to plan sprints and write storiesSupport continuous improvement.Investigate alternatives, new technologies and present them for architectural reviewParticipate throughout the development life cycleCollaborate with Product Managers to build featuresUse a pragmatic TDD approach to develop high-quality software that doesn't need to be assured by a QA team before it's deployed to productionOwn features from a technical standpointAccountable for delivery of projects within schedule Requirements 3+ years building applications for the iOS ecosystemStrong Object-oriented backgroundHigh proficiency with Swift/Objective-C and iOS FrameworksUnderstanding of Apple's design principles and interface guidelinesExperience with resource management and performance tuningExperience working with iOS frameworks (Core Data, SQLite, Core Animation)Strong communication skillsFamiliarity with Agile methodologies Learn More Engineer Perspective: 3 Reasons to Consider VeevaEngineering at VeevaVeeva Columbus named the #1 Best Place to Work by Columbus Business First Perks & Benefits Flexible PTOAllocations for continuous learning & developmentAnnual budget to donate to the non-profit of your choice  #LI-Remote Veeva builds enterprise cloud technology that powers the biggest names in the pharmaceutical, biotech, consumer goods, chemical & cosmetics industries. Our customers make vaccines, life-saving medicines, and life-enhancing products that make a difference in everyday lives. Our technology has transformed these industries; enabling them to get critical products and services to market faster. Our core values, Do the Right Thing, Customer Success, Employee Success, and Speed, guide us as we make our customers more efficient and effective in everything they do.   Veeva's headquarters is located in the San Francisco Bay Area with offices in more than 15 countries around the world."}