{"title":"Magento Developer","location":"San Leandro, CA 94577","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Minimum of 3 years of professional experience as a web developer/engineer.</li>\n <li>Looking for high impact, lead <b>developer</b> that has developed around enterprise scale…</li>\n</ul>","term":1,"jk":"1fab210c86d5de5b","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=1fab210c86d5de5b","source":"indeed","full_description":"In business for over 60 years, Continental Western Corporation is a leading supplier of an entire line of packaging and cordage products in the United States. Our product line includes strapping, stretch film, tape, cordage, gloves, safety and janitorial products and much more.We are looking to expand our team with an experienced Magento 2 Developer. Looking for high impact, lead developer that has developed around enterprise scale eCommerce platforms (eg. Shopify, BigCommerce, Magento etc.) with Java and/PhP experience.We'll Need You To: Analyze and solve problems.Collaborate with a team of passionate professionals in various disciplines (System administration, marketing) to deliver exceptional outcomes.Apply your expertise in PHP, MySQL, Javascript and Magento to extend, enhance and build great eCommerce experiences.Create high quality, complex code that can scale with a significant number of usersEnsure compliance with web standards and accessibility requirementsOwn customer-facing features; work with design to build out intuitive customer experiencesWork with management team to understand and analyze new requirementsAssist with software development requests for new Magento 2 features including; scoping, prioritization, use cases, prototyping and QA as required.Implement product features that have a direct impact on user engagement and monetizationMonitor the day to day performance of the e-commerce platform, and associated integrations, to ensure that speed and up-time are maintained at optimal levels at all times.Identify growth opportunities in site infrastructure, on-page optimization and site speed.Minimum RequirementsExcellent problem solving skillsStrong communication skillsMinimum of 3 years of professional experience as a web developer/engineerExperience with agile methodologies and the full software delivery lifecycle; able to propose new ideas, perform feasibility analyses, and scope workUnderstanding of version control toolsFamiliarity with common web application security issuesAbility to analyze and improve performance of web applicationsExcited about working in a fast-paced startup environmentCompensation includes competitive salary. Benefits package includes paid medical, dental, vacation & sick days, 401(k) match, and more.Additional Compensation:BonusesJob Type: Full-timeExperience: Web Development:PHP:Magento Development:Job Type: Full-timePay: $0.00 per hourBenefits:401(k) matchingDental insuranceHealth insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payWork Location:One locationWork Remotely:No"}