{"title":"Sr Hardware Development Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL128Sxv3-VJ6kc3XrpyeYl0mNpx0ZejNMevskBXL9wtvVtDjCkosRDoR7rXeI-Ur9uJPwzZkYcbabXNhMdgev2dtTKtmYm7WNQf1ndWqa8sYzEwWG9hpWBYZDEka_GgEeXaKUPsv3j4-V7E0AubwG4uQ8ucJbBGu3BpnI4kOOf_bu0k5Na_fAbi235LA","source":"ziprecruiter","full_description":"VIAVI (NASDAQ: VIAV) has a 90 year history of technical innovations that have evolved to keep pace and address our customer's most pressing business issues. We make equipment, software, and systems that help to plan, deploy, certify, monitor, and optimize all kinds of networks - like those for mobile phones, service providers, large businesses and data centers. VIAVI is also a leader in high performance thin film optical coatings and engineered diffusers, providing light management solutions to anti-counterfeiting, consumer electronics, automotive, defense and instrumentation markets.We are the people behind the products that help keep the world connected - at home, school, work, at play, and everywhere in between. VIAVI employees are fierce about supporting customer success and we welcome people who bring their best every day to the company -  to question, to collaborate and to push for solutions that will delight our customers.The Indianapolis R&D development team is looking for an experienced Hardware Engineer.  The candidate will design, develop, and maintain test and measurement equipment.  Out products involve analog and RF technologies.  The candidate will be responsible for products from inception through the entire product lifecycle.  The ideal candidate would have experience in analog circuit design covering DC power supplies, analog circuits  and RF technologies up to 3.0GHz.BSEE or equivalent (required)3 years Hardware design experience (required)Experience with analog and RF simulation tools (required)Experience with development test equipment (Oscilloscopes, Stectrum Analyzers, Network Analyzers, Signal generators,...) (required)Experience with Cable TV and/or Fiber optic networks (preferred) If you have what it takes to push boundaries and seize opportunities, apply to join our team today.VIAVI Solutions is an equal opportunity and affirmative action employer - minorities/females/veterans/persons with disabilities."}