{"title":"Front End Engineer","location":"Carlsbad, CA","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">You must be a tech-savvy professional who enjoys learning about new technologies and solving problems.</li>\n <li>This is a fast-moving engineering role where you will be…</li>\n</ul>","term":1,"jk":"250dac5864ee8817","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=250dac5864ee8817","source":"indeed","full_description":"About Us:\nEzoic is an Artificial Intelligence company that works with thousands of online publishers, helping them use machine learning to make smart decisions about the layouts, advertisements and features that users see. These publishers range from individuals to small and medium-sized companies. We have our headquarters in Carlsbad, CA, with a team of very smart free-thinking individuals. Ezoic is a VC-backed startup that is growing quickly. It's a unique opportunity to both be part of a revolutionary product in its earlier stages and work on something that already touches hundreds of millions of people month.\nAbout You:\nYou must be a tech-savvy professional who enjoys learning about new technologies and solving problems. This is a fast-moving engineering role where you will be able to work on core products and develop designs and functionality from scratch. You will help determine how our clients see our tools and our company by building intuitive and functional interfaces, using consistent style, look & feel, and experiences that help improve our products. You must enjoy collaborating with other smart engineers, creating scalable solutions to improve publishers' digital properties.\nQualifications include:\n2+ years of experience as a software engineer\nExcellent client-side HTML/CSS/JavaScript/AJAX skills and experience\nExperience working with a backend language such as Node/PHP/GOLANG to retrieve and process data\nAbility to create wireframes and responsive designs that result a great user experience\nExperience building reusable components and front-end libraries to speed development and maintain consistency\nFamiliarity with cross-browser testing and debugging\nExperience developing Chrome extensions is a plus\nAbout the role:\nYour contributions will have a meaningful and visible impact on the company on a daily basis. You will be building tools for three distinct audiences:\nOur publishers, providing tools to control and customize their sites, and provide feedback on key performance metrics from the artificial intelligence engine\nOur users, creating widgets and features used across thousands of sites to provide advanced functionality, which will be automatically enabled or disabled via the Ezoic engine at a granular level\nThe Ezoic team, providing access to data and features to allow the team to analyze performance, identify issues, and make changes to manage site performance.\nTechnologies used:\nJavascript, Vue.js, Angular\nCSS, HTML5\nMySQL\nLinux\nGOLANG, PHP\nLife as an Ezoic engineer:\nEzoic is a technology-first company. Our CEO is a developer by trade, and our engineers are given all the tools needed to succeed. We empower our engineers to make a lot of their own decisions about both design and implementation, and encourage them to come up with new ideas to improve the application. We also aim to keep a good work-life balance, based on our philosophy that happy engineers are more productive. We want you to be working on something that you are passionate about and allow engineers to move around to keep things fresh.\nWhile we are all working remotely now because of Covid, we have a brand new office in Carlsbad, CA, where we plan to return next year sometimes when the world goes back to normal. This means we are only looking for engineers who are in or willing to relocate to the Carlsbad, CA area, but we will be flexible on timing based on how the pandemic goes. Every engineer works at their own quad-monitor setup on a standing desk. We pride ourselves on getting stuff done, but when you need a break, Ezoic offers great perks, including unlimited vacation time, catered lunches, snacks, flexible hours, ping pong, video games, and pool.\n#ZR"}