{"title":"Scientist II, Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIPL4ezekEzVq7vRZp4atDdCJhix7Bhf_fYjvzyrXV2ptyEJuHqeCqyor-x_xBRpkRDKqfEZIaZdce1wXR54tXg9zLwpwdQhUBkFtG_IEdHmZ_L5CFYbCpIsyeuXQxbc0XEDeCqCsWfOwCNdeFmhskNShNF4xgJN0sDz-RiX9hfgIqr6OMj-mmhTggNBFBS","source":"ziprecruiter","full_description":"Company Summary: Deciphera Pharmaceuticals is a commercial biopharmaceutical company focused on discovering, developing and commercializing important new medicines to improve the lives of people with cancer. We are leveraging our proprietary switch-control kinase inhibitor platform and deep expertise in kinase biology to develop a broad portfolio of innovative medicines. In addition to advancing multiple product candidates in clinical studies, QINLOCK is Deciphera's first FDA-approved drug, a switch-control kinase inhibitor for the treatment of fourth-line gastrointestinal stromal tumor (GIST).  QINLOCK, an oral oncolytic, is also approved in Canada and Australia for the treatment of fourth-line GIST.  Deciphera (NASDAQ: DCPH) is a publicly traded company headquartered in Waltham, Massachusetts. Our state-of-the-art research facility is located in Lawrence, Kansas.     We offer an outstanding culture and opportunity for personal and professional growth based on our \"PATHS\" Core Values: - Patients - places the importance of improving the lives of patients and their caregivers at the forefront of every day's work. - Accountability - for our performance and the way we work with coworkers and other stakeholders. - Transparency - in our intent and actions to both internal and external stakeholders. - Honesty and Integrity - fosters trust and strives to deliver on our and the company's promises. - Stewardship - values and uses wisely the resources and investments provided to the company.Position Summary: The Scientist II, Chemistry, will be part of a new initiative aimed at expanding Deciphera's compound library of proprietary kinase inhibitors developed using the company's switch control platform technology. The Scientist II, Chemistry will apply modern organic synthetic methodologies, parallel synthesis, and high throughput purification techniques to generate screening and focused chemical libraries of switch control kinase inhibitors to support Deciphera's new discovery projects.  The successful candidate will hold an MS or a BS degree in Organic Chemistry with a minimum of 2-4 years industry experience, respectively.     This position will report to the Senior Scientist II, Chemistry lead on the chemical diversity initiative.  The position is based in Lawrence, KS, in Deciphera's state-of-the-art research facility near the University of Kansas campus. Key Responsibilities: Responsible for the design, staging, and reproducible synthesis of high quality small molecule kinase inhibitor librariesOperate, maintain, and supply laboratory equipment related to parallel and automated synthesisWork effectively in a team environment, communicating and planning research with other chemists working on their respective projectPrepare written reports, experimentals for patents, and other reports as requiredValues other people and promotes the welfare of the organization and colleagues Required Qualifications: M.S. or B.S.  in organic chemistry with 2+ or 4+ years of industrial experience in synthetic organic chemistry, respectivelyMust possess a good working knowledge of organic synthesis and/or organometallic catalysis techniquesGood knowledge and experience with a wide range of techniques used in organic synthesis, purification, and spectroscopic characterization of novel compounds (NMR, LC-MS, HPLC, etc.)Experience with reaction optimization in high-throughput experimentation (HTE), parallel synthesis, automated synthesis, design of experiments (DOE), and/or flow chemistry is desirable, but not requiredCapable of setting up and analyzing multiple reactions, and working independently in an organic chemistry lab settingAbility to manage critical laboratory supplies/reagents and coordinate experiment timings with others is a mustSelf-aware; will seek input from others on ideas and problem-solving; uses others as a resourceExcellent oral and written communication skillsDemonstrated proficiency using MS Office and ChemDraw applications is required"}