{"title":"Mechanic / Shop Manager","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJd90HsnmzQs2osl1LVCkJ7RSOKetU6F-YpJHSfecPbt7hnx-EANKvwimchb_qUQd12U6hyj5GC5OsEWVXpDNDP9OanPDLEffuElt2KIsnSByxfUffwXCibegLQiiC0nIWQuCKph9vPPz7_a5uDWxc7GmnEiE6duSgjdxvwxByAqnL5GDecjFOMEOW2mopN","source":"ziprecruiter","full_description":"Mechanic / Shop ManagerColorado Springs, Colorado Apply Now (https://app.jobvite.com/CompanyJobs/Careers.aspx?k=Apply&j=oB2Oefwp&c=qdPaVfwR) BrightView Landscape Services Looking for an opportunity where success comes naturally? Then you may have found your crew. We're looking for a Mechanic to join our team.You'd be responsible for: + Performing maintenance and repairs on a variety of large and small engines+ Providing information and reports on equipment+ Ensuring that all equipment operates efficiently and safely at all times You might be a good fit if you have: + Minimum 2 years of experience with basic truck and vehicle maintenance and repair And while not mandatory, it would be great if you also have: + Small engine, 2 cycle experience+ Diesel Engine, heavy and light equipment experience+ Bilingual (Spanish/English)+ Welding experience Here's what to know about working here:At BrightView, we're a tight-knit crew who are as passionate about caring for our clients as we are about each other. Though we're the nation's leading landscape company, we maintain a small company feel and supportive environment that makes our team members feel at home.If you're looking to join a crew of talented go-getters who tackle big vision projects other companies could only dream of, you might just have found your match. With our range of services, including landscape design, development, maintenance and enhancements, there's no limit to what we can do, and what you can achieve.In addition to industry-leading development opportunities, you'll also have benefits and perks like: + Competitive salary+ Paid time off+ Medical, dental, and vision insurance Think you've found your crew? BrightView is an Equal Employment Opportunity and E-Verify Employer.Job Position Type Regular Full-Time Job ID 28399 Last Updated Mar 01, 2021"}