{"title":"          Applications Engineer NEW!        ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAKCR-FTo88lVvQQTlzFIVv04GEsgPWQOnLUSy_yOm5clsEg-Wq71KAJGyEv9V5E_UNzoLg7TjBwEISHr_8lqWWnr14jrMIOP8KYBm1M8bL-sIn1JvS9eyYluiwb34Ebnto6PC5BmmVp4NkANr9wN2-mplc7i88DbjBM8OaZExPkB6x3v6X3B525MhMgHjY","source":"ziprecruiter","full_description":"\n        Application / Sales Engineer / Technical SupportPolar Power Inc. is growing high tech company designing and manufacturing electronic controls, generators, cooling systems, and solar photovoltaic systems used in applications for: Military, Telecommunications, Off grid power, Electric and Hybrid Vehicles and Yachts. Our products and services are exciting and well respected all around the world. We have been in business since 1979 and we are 100 + employees. Polar is publicly traded on Nasdaq under the symbol “POLA”Polar is located in Gardena, Calif. Please visit our website for more information on the type of products we develop and manufacture. See: www.polarpower.com .Polar product line includes:• Solar Photovoltaic Hybrid Systems• DC Generators for Military and Telecommunications• Hybrid Electric propulsion for Marine and Specialty Vehicles• Micro-Cogeneration for residential, farming, commercial, etc.Job Description:The customers provide Polar with basic information on their application and Polar provides a solution. Our solutions include multiple technologies: power generation with diesel or various clean fuels including natural gas, energy storage using various battery chemistries, solar photovoltaic, heat exchangers for energy recovery, digital controls for system automation and monitoring, and packaging for various environmental conditions. Training on technologies and product orientation by senior engineers is available.The applicant must have some experience standalone solar systems, Combined Heat and Power (CHP) generation, and battery charging.Our Applications Engineers will:· Serve as the point of contact for pre-sales technical support and systems configuration.· Assist the Sales Executives on their technical presentations. · Help the customer identify his needs. And using software (Homer) to configure systems to meet customer needs.· Provide orientation on our products and services.· Post-sales support consists of: tracking the customer’s order through production, keeping the customer posted on his delivery.Assist with the design of new products and services based on customer feedback and your engineering expertise.Build real relationships. Build and develop ongoing relationships with existing clients.Educate our customers on technology alternatives to their need and discuss the features and benefits.The engineer will be trained in the operation of the equipment and will in turn demonstrate the equipment to our customers; either in our factory / headquarters, at the customers location either anywhere in the USA or Internationally. We are hiring 3 Engineers so at least one Engineer has the option not to travel. Travel should not be burdensome as we intended to rotate job tasks between:1. On the shop floor, Testing and inspecting equipment on the shop floor2. In the office, Answering technical support questions on the phone3. In the office and the field, assisting customers with the configuring systems to meet their application needs.4. In the office and field, demonstrating the equipment.5. Assisting Sales Executives anywhere in the world.6. Presenting product and papers at conventions, seminars, and exhibitionsPolar has offices in Poland, Romania, Australia, Dominican Republic, South Africa, and Dubai.Requirements: · Technical knowledge on an engineering level is required to ensure correct Solar, Hybrid System and Generator components are chosen, accurately specified, and applied to the customer's requirements.BS degree in Engineering or equivalent technical experience is preferred.Some sales experience is a plus but not mandatory.Ability to understand and communicate technical applications and develop customer specific solutions, strong communication and presentation skills.Assists with creation of feasibility studies for customer specific application requirements.Provides post-sales applications support to meet customer requirements.Provides telephone and on-site supportExcellent customer service skillsBe team-oriented, courteous, accessible demeanor with leadership, peers, colleagues, and the public.Compensation will be based on experience and talent.\n      "}