<<<<<<< HEAD
{"title":"Network Engineer Operations NEW!","location":"","salary":"","description":"","term":"$20 to $25 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIEadDj4ylhUw8AvYhw6Y0524FVBfaISOYReF50hHF8QdxMZHO3BZynVBWnD8YW2Zhs-GcUB2UHHhADVpLHG_9G6ccgCrOBoutCR5yYdG6ZqNCp2YDUL_IB9SPXchF_SPM7XVI5iWDiXFPqxUku7vD5Wy4ca8C-TZwUx4DXQ_hMoLQaGqYdLqrhy_D-yJI","source":"ziprecruiter","full_description":"Job DescriptionNetworks Unlimited Inc. is a premier supplier of computer hardware, software, and IT services to businesses in Western Colorado. Founded in 2001, we are an award-winning small business in Western Colorado and the recent recipient of “Colorado Companies to Watch” and “Top 250 Private Companies in Colorado.” Networks Unlimited is looking for a Network Engineer to join our growing team.Essential Functions: Network Engineers are involved in the installation, repair, and servicing customer computers, servers, and associated computer networking equipment. Analyzes available data to determine an appropriate solution for the customer problem or need. Advises client on alternate methods of solving need or problem, or recommends a specific solution in terms that the customer can clearly understandTasks/ Responsibilities Analyze and troubleshoot problems and develop and implement solutions Have a full understanding of routing, switching, server operating systems, active directory, firewalls, wireless controllers, DNS, email, virtual machines and software applications Communicate directly with customers as a technical consultant, during problem discovery, to recommend a solution, to provide progress reports on outstanding issues and inform the customer of the resolution upon completion of trouble call. Document and record all engineering time within ConnectWise ticketing system and verify tickets are entered timely and accurately. Provide input on matters associated with site preparation and installation of computer systems and/or networking equipment Provide technical and engineering assistance for sales staff to solution customer needs Ensure that the appropriate hardware/software is ordered to resolve customer issues or customer needs Work with outside IT specialists and designers to implement a customer’s computer hardware, software, and peripherals required to execute specific computer applications Install, support and maintain all company in-house systems, including, but not limited to; company managed service offering systems, internal company servers, and associated networking equipment.Personal Requirements: Excellent customer service and public contact skills is a must Be flexible to work during extended business hours Able to work as part of a team A logical approach to work, self-reliance, and ability to work independently Active interest in maintaining personal technical skills and knowledge Able to investigate, identify and solve problems quickly and efficiently Very organized and able to efficiently manage their timeAccountability:The Network Engineer reports directly to the Service Manager.Position RequirementsMinimum Education and ExperienceBS in Computer Science. two (2) years of progressive experience in researching, ordering, installing, maintaining, and repairing, and troubleshooting hardware and software.Minimum required skills.Ability to read and write. Excellent written and verbal communication skills. Ability to schedule, manage, coordinate, and sequence activities. Ability to analyze and solve practical problems using reasoning. Willingness to help users with all types of problems. Experience in helping users with hardware and software problems. Ability to work well with people.CertificationsAt least one certification from applicable industry partner, i.e., CCNA, CCDA, Citrix, MCSEPhysical RequirementsAbility to move personal computers including monitors, ability to work in cramped spaces, willing to occasionally travel, willing to come in at off-hours to accomplish tasks. Able to lift 50 pounds."}
=======
{"title":"Network Engineer Operations NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAI4VBvQ6xE2VbnIp5tR_r6HWBufcHEa7cWdjUzlTsvIKt2K4pe5L42_z8daeo0fatcSb0tNZ0ky9KGhJOebvaqrgIezM0-aQ-HS7nLjdti6rqJUoqYiUVocd90TZTsarJHENhGyfpB1BsN5w4H4IM0_rrRb_l1b-QFRdveXGrefNPNAAH7By6VkERfGmA","source":"ziprecruiter","full_description":"Responsible for supporting employees and information technology network infrastructure in the following areas:Design and engineer data network, SD-WAN, UCS and voice telephony infrastructure for all locations, including data centers, to provide reliable solutions with necessary data throughput rates for all business needs;Install, configure and utilize network monitoring solutions to analyze and log performance and issues with switches, routers, firewalls, audio visual (cameras) Ubiquiti Productsand other network devices;Design, implement and monitor the LAN & WAN infrastructure to include VLANS and wireless network;Implement and design network infrastructure solutions to support disaster recovery sites that meet business continuity plan goals.Quickly diagnose network hardware/software problems and ensure the proper steps are taken to resolve and document the incidents;Maintain documentation for network assets including DNS and DHCP, map and diagram infrastructure using Visio or other similar software, and backup all network configuration devices;Provide recommendations for network updates, modifications and additions;Interact with the ISP for network related updates, implementations and issues;Work with facilities and construction teams to design network infrastructureLifecycle management of network hardware including asset tracking and secure recycling of old network hardware, routers and switches;Coordinate with approved third party vendors to ensure updates and configuration are maintained on network and infrastructure systems like routers, firewalls, switches and Unified Communications System;Provide first line user support for network, hardware, softwareWork with the Security Engineer to ensure security policies are maintained, administer Active Directory group policies to provide secured network access, ensure firewalls are configured properly and resolve any network related issues;Reply and respond to IT help; phone calls and e-mails related to area of responsibilities;Work with approved vendors to research new network products and make recommendations for purchase of new hardware as needed.Perform various other duties as assigned."}
>>>>>>> 6e9a075ee97f3a4d702c3307ef1e0ee7373d6616
