{"title":"Maintenance Mechanic***$3000 Sign-on Bonus*** NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALDqHKfYk2Mc2qnWoaX60G8lJRilh5Udi0l-tRa39eAnGEmdmQ08X2bys4RyZlsfsGhsd3zo4vgj_6fqmIn23tBsk80hYVnX94uHapZwdMu55KQJYirxWrDKRSCf3KpYyTyFDPAdgUS-AkEO2UcPAEpoDKWINf4J181Fj0AdPuVIGj6QZJ5Y5FUMKolSFk","source":"ziprecruiter","full_description":"Maintenance Mechanic***$3000 Sign-on Bonus***req20210Employment Type: RegularLocation: DENVER,COHave you ever enjoyed Arnold®, Brownberry® or Oroweat® bread? A Thomas'® English muffin or bagel? Or perhaps snacked on a Sara Lee®, Entenmann's® or Marinela® cake or donut? If the answer is yes, then you know Bimbo Bakeries USA! Bimbo Bakeries USA is part of Grupo Bimbo, the world's largest baking company with operations in 33 countries. Bimbo Bakeries USA (BBU) employs 20,000 associates across the U.S. in bakeries, sales centers, corporate offices and on sales routes to ensure our consumers have the freshest products to feed their families at every meal. But our associates come to work for much more - the chance to feed their own lives through exciting work that offers the opportunity to make a real difference in their professional and personal lives every day. Description:Top Reasons to Work at Bimbo Bakeries USA as a Maintenance Mechanic: $3000 Sign-on Bonus for all new hires Great starting pay: $27.25 per hour Excellent benefits with low premiums - medical, dental & vision Stable Union position with pension for retirement Company sponsored wellness and discount programs availableMaintenance Mechanic Position Summary:The Maintenance Mechanic is responsible for ensuring equipment reliability by repairing and maintaining a wide range of processing equipment across the plant/bakery. Maintenance Mechanic Key Job Responsibilities:  Ensure safety and food-safety by following all company, OSHA, and government rules and procedures including; Lock-out / Tag-out procedures, Good Manufacturing Practices (GMP's), personal safety, and food safety/SQF Program standards. Effectively support the Preventative Maintenance (PM) program with a goal of continually reducing unscheduled downtime. Troubleshoot, diagnose, and develop sustainable solutions for issues with equipment to include; PLC controlled equipment, plant electrical, hydraulic/pneumatic, and mechanical systems including motors, instrumentation, distribution, and feed control systems. Complete all assigned work orders within the time allotted. Maintain complete records of work performed using software, work orders and detailed logs. Assist with equipment change overs and line startups, troubleshooting issues as needed. Identify required parts and maintain current inventories, and parts reorder lists. Act with a Continuous Improvement mindset seeking areas of opportunity for improvement and participating in cross-functional CI focused projects. Performs and assists other BBU associates with outlet transactions as required.Additional responsibilities and duties as assigned by supervisorSchedule Hiring for: Days: Sunday - Saturday; Monday and Tuesday or Tuesday and Wednesday OFF Approximate Shift: 1:00 pm  Overtime may be neededPosition Requirements:Ideal Qualifications of the Maintenance Mechanic: High School Diploma or GED is preferred A combination of education, training and experience that results in demonstrated competency to perform the work may be substituted Associates degree and/or Technical School certification or training in basic electricity is preferred Ability to troubleshoot and repair electrical systems up to 480v, 3 phase motors, hydraulic and pneumatic systems, and read and interpret electrical drawings Working knowledge of and ability to troubleshoot PLC's, VFD's and HMI's is preferred Preferred - 3 years' experience maintaining manufacturing systems and equipment in an automated plant as well as training/experience with compressed air systems, boilers, pneumatics, and hydraulics. Ability to work and communicate effectively in a fast-paced environment and adapt to frequent changes. Ability to understand and follow both written and verbal instructions with high level of detail and accuracy.Physical requirements: ability to work 8+ hour shifts, lift 50+ pounds, stand, climb, and/or stoop for prolonged periods of time, perform repetitive motions, and work in an environment with varying temperatures and humidity.The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Be a part of a company that is dedicated to protecting our planet:All of our U.S. operations have been powered with 100% renewable electrical energy since July 2019, with energy created through a Wind Farm backed by a Virtual Power Purchase Agreement with InvenergyBimbo Bakeries USA was named EPA ENERGY STAR Partner of the Year in 2018 and 2019 for superior leadership, innovation and commitment to environmental protection through energy efficiency We have 14 ENERGY STAR® Certified facilitiesOur Manufacturing operations divert greater than 95% of waste from landfill360 of our company-owned vehicles utilize alternative fuel - propane, compressed natural gas, and electricBimbo Bakeries USA has committed to 100% sustainable packaging across its portfolio by 2025. All product bags, pouches and wrappers are currently recyclable through Terracycle.Bimbo Bakeries USA is an equal opportunity employer with a policy that provides equal employment opportunity for applicants and employees regardless of race, color, religion, disability, gender, age, national origin, sexual orientation, gender identity, marital status, pregnancy, veteran status, or any other classification protected by law. This policy applies to all aspects of employment, including recruitment, hiring, promotion, compensation, reassignment, layoff, discharge, education, training and all other working conditions. To further the principle of equal employment opportunity, Bimbo Bakeries USA has developed affirmative action plans for minorities and women, qualified individuals with disabilities, and Vietnam-era and special disabled veterans and other protected veterans."}