{"title":"Hardware Systems Engineer - Storage","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKiKom01p6108VoxHatkONqVpu3nKqI1VeTjUpBuFoL_-r7ifNKBRnob5WZGfjfD703AuTMO41BU_pTPgboWW7s9lncxNGg_c1V8tjYvPd3bPnmRdqhznfsitYBth1CCCpIqS5Iozf5LZ6wmtYGGz6BJgcB7WfxS0tsw6AUk0BKOclK7LeGz-bfVRTtE784","source":"ziprecruiter","full_description":"**Intro:**Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started. **Summary:**Who are we: The Hardware Engineering team designs, builds, brings-up, tests and lands the hardware systems that power the Facebook social network, deployed in our data-centers worldwide. Designs are published for industry adoption through the Open Compute Project Foundation.Who are we looking for: We are looking for an experienced Hardware Systems Engineer for our Infrastructure Storage Hardware Engineering team. The ideal candidate will operate in a highly multi-tasked, fast-paced and highly cross-functional engineering environment. They will have hands-on experience with hardware system design, and with hardware, firmware and software integration for large scale deployments. They will have deep knowledge and experience in storage technology, and a good understanding of server and network technology. They will be data-driven and focus on the highest impact they can create as part of a world-class engineering team.This is an opportunity to join our team and help us build some of the world's most open and efficient hardware platforms. **Required Skills:**1. Work as part of the Hardware Engineering team to design, develop, test and deploy Facebook Storage hardware platforms. 2. Collaborate with Hardware Engineering, Software Engineering and Capacity Management teams to develop the exact specifications for our hardware platforms, including in-depth performance analysis of future Facebook software environments on upcoming hardware designs. 3. Work hands-on with cross-functional partners to bring up Linux, firmware, and other important fundamental software on new hardware designs. This includes integrating systems, achieving stability, performance and power requirements, and driving defects to resolution with our external supply chain and manufacturing partners and internal teams. 4. Work closely with software and hardware sub-system subject matter experts to bring disparate technologies together to produce highly efficient and reliable systems. 5. Work with Data Center Site Operations team to understand installation, operation and maintenance considerations within Facebook data centers and incorporate feedback into future hardware designs. 6. Influence the direction of the landscape of data center storage through development and collaboration with open source hardware communities. **Minimum Qualifications:**7. BS or MS in Computer Science, Computer Engineering, Electrical Engineering or a related technical discipline or equivalent experience. 8. 9+ years of experience in engineering roles developing storage systems. 9. Expert level knowledge in storage technology, including demonstrable depth in at least two areas out of the follow storage domains: Storage Systems [HDD, SSD], Rotating media storage [HDD], Solid State Storage [NAND Flash, SSD], Archival Storage [HDD, Tape, Optical]. 10. Experience learning quickly new hardware technology, protocols, frameworks and understand firmware and software concerns/requirements. 11. Knowledge of hardware system design that crosses multiple subsystems. 12. Familiarity with Linux operating system internals (e.g. kernel dev, tracing, profiling, scheduling, IO subsystems), x86-based server hardware, storage, networking and IO stacks, and large-scale Infrastructure automation. 13. Experienced in complex, multi-subsystem system-level troubleshooting. 14. Experienced with system performance analysis, debug, and optimization practices. 15. Proven solution level troubleshooting skills and the experience diving into proven software, firmware and hardware problems (e.g. debug wherever the problem leads and have the confidence to engage cross functional partners to support issue resolution). 16. English language communications skills and the experience pivoting communication style and depth for the audience. 17. Detail oriented with careful and balanced rapid execution in a fast-paced environment. **Preferred Qualifications:**18. Experience in firmware development and debugging. 19. Knowledge of compute system and memory buses (DDR4, DDR5, HBM, UPI/QPI, etc.). 20. Understanding of storage protocols such as: NVMe, NVMeoF, SATA or SAS. 21. Knowledge of typical system IO and management buses (PCIe, CXL, I2C/SMBus, LPC, etc.). 22. Experience with typical data center networking technology: Ethernet, IPv4/v6, Infiniband, RoCE, etc. **Industry:** Internet **Equal Opportunity:** Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}