{"title":"Chemist 1","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALzD-oP4QsUUPN74lKTT04k7DFV7b6fAp2neZLsaB_rjdBHIA6PZp2PX2_laVmgrZdoxBTKCZObGsZl7awF4k0KHpN0qPAul8ynsxp3knN5SFZcgxqmyOM_JZLe3xWVf5Sc3WRuB68AA5oEdhNiY-uM1k9S_J5goRKldkC67PevuUk2P6HNRchHw989edY","source":"ziprecruiter","full_description":"Job DescriptionChemist IIThis company located in Woodinville, WA is a global leader in developing, manufacturing, and marketing a broad range of innovative products for the life science research and clinical diagnostic markets is seeking a Chemist I and Chemist II. With a focus on quality and customer service for over 65 years, our products advance the discovery process and improve healthcare. Our customers include university and research institutions, hospitals, public health and commercial laboratories, biotechnology, pharmaceutical, as well as applied laboratories that include food safety and environmental quality. Job responsibilities and capacity required in the compounding lab have increased with the production of the new COVID EIA assay.This lab will produce all required reagents, conjugates, and controls for these kits. This is in addition to building up inventory of PLUS O and HBsAg 3.0. Performs plate coating, compounding, slide manufacturing, and western blot production operations in FDA/ISO regulated manufacturing. Follows and interprets standard procedures. Operates production equipment and assures quality of output. Proficient in all processes. Performs production operations in the Compounding lab. Enters labor into ERP system. Records indirect labor tracking. Cleans and maintains work area and equipment. Performs equipment calibrations. Orders and stocks supplies. Maintains and updates proceduresJob Requirements:The ideal candidate should have a 4 year degree plus 2+ years related experience or equivalent. Ability to define problems, collect data, establish facts, and draw valid conclusion. Familiarity with PLC's (programmable logical controller) preferred. Will be working in a clean room and compound lab with the full garb top to bottom (footies, beard cover, hair net, body suit, etc.). Science/Math/Calculation Skills necessary. Document findings.Be able to trouble shoot as you go since some of the machines are \"finicky\". It'll basically be like working in a kitchen. As a chemist you follow a recipe with the right ingredients. Making the beginning of the solution (to support Covid-19 cure, medicine, etc). Chemist I will be working in CMP lab for controls and bulks and Chemist II in CMP lab for conjugations.Volt is an Equal Opportunity EmployerQualifications: This lab will produce all required reagents, conjugates, and controls for these kits. This is in addition to building up inventory of PLUS O and HBsAg 3.0. Performs plate coating, compounding, slide manufacturing, and western blot production operations in FDA/ISO regulated manufacturing. Follows and interprets standard procedures. Operates production equipment and assures quality of output. Proficient in all processes. Performs production operations in the Compounding lab. Enters labor into ERP system. Records indirect labor tracking. Cleans and maintains work area and equipment. Performs equipment calibrations. Orders and stocks supplies. Maintains and updates procedures, The ideal candidate should have a 4 year degree plus 2+ years related experience or equivalent. Ability to define problems, collect data, establish facts, and draw valid conclusion. Familiarity with PLC's (programmable logical controller) preferred. Will be working in a clean room and compound lab with the full garb top to bottom (footies, beard cover, hair net, body suit, etc.). Science/Math/Calculation Skills necessary. Document findings.Education: Bachelor's DegreeEmployment Type: [\"FULL_TIME\"]"}