{"title":"Sr Technical Writer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJRoL1tX_fY75KGSAG0K1ZVHwh6NYkfCuSCYQFVT-PY6mki6K2DuMqwrRrMFj_7zCMW5A1tnx2JeLR2-p2xeoZ_5XmJY628zCUi4c9AVHdiiPYgl-08BWR9ZYB4QF5Q7uWuoIMefTviBNjEshmNF7_4v7Un082Pv7DF_Q3yfw2W61_ZETAckL4AYTZ-6uRu","source":"ziprecruiter","full_description":"Overview Who are you - You are a highly skilled technical writer looking to join a growing world-wide organization.  Looking to use and expand your skills to support our development and deployment of clinical trial management applications. In this position, you will create easy-to-understand user content and product documentation to increase product clarity, performance, and usability.  Your strong knowledge base and ability to work cooperatively with other teams are a must.  Most of all, you want to do it in a place where you're more than an employee number. A place you love working. Responsibilities What will you be doing -  You will work collaboratively with designers and developers to provide comprehensive documentation for our suite of state-of-the-art clinical trial management applications.  From administrator to end users, your content will be used to improve the user experience and guide administrators through the steps required to launch and maintain trials and studies from recruitment trough enrollment all the way to successful completion. Qualifications What you need to have: Bachelor's degree or international equivalent Strong ability to interpret, write, organize, and edit technical material.Strong understanding of technical documentation and instructional content creation standards and best practices.Strong communication skills (written and verbal).Strong organization/project management skills.A well-developed understanding of how to leverage both existing and newly created content in multiple mediums (web, mobile, paper)To qualify, applicants must be legally authorized to work in the United States, and should not require, now or in the future, sponsorship for employment visa status.PRA is an EEO/AA employer and is committed to providing opportunities to minorities, women, veterans and individuals with disabilities. Not ready to apply? We get it! Click here to stay in touch for future opportunities, events and other happenings!"}