{"title":"Associate Engineer Software - Full Stack","location":"El Segundo, CA","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Ensures <b>software</b> standards are met.</li>\n <li>Your job will be to solve tough problems using modern <b>software</b> to create new ways of doing things for our engineers.</li>\n</ul>","term":1,"jk":"7379195bb5c24039","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=7379195bb5c24039","source":"indeed","full_description":"Designs, develops, documents, tests and debugs applications software and systems that contain logical and mathematical solutions. Conducts multidisciplinary research and collaborates with equipment designers and/or hardware engineers in the planning, design, development, and utilization of electronic data processing systems for product and commercial software. Determines computer user needs; analyzes system capabilities to resolve problems on program intent, output requirements, input data acquisition, programming techniques and controls; prepares operating instructions; designs and develops compilers and assemblers, utility programs, and operating systems. Ensures software standards are met.\n\nWarp 9 Accelerator Lab:\n\nThe Warp 9 Accelerator Lab is a new Northrop Grumman initiative to revolutionize the way NG builds and delivers software. Our mission is to rapidly deliver great software our users will LOVE. We apply the best & latest technology to achieve our mission. We focus on user-centric, design thinking, and User Experience (UX) to deliver great experiences for our customers. We use Lean Startup entrepreneurial management methodologies to ensure projects are executed rapidly and delivers maximum value to our customers. Most importantly, we focus on culture: Our people are empowered to move fast, learn fast, fail fast, innovate fast, and iterate fast. At Warp 9, we boldly build software.\n\nYou will be joining an exciting and new initiative to drive digital engineering for a major corporate pursuit. You will apply software engineering to create new tools and new workflows. Your job will be to solve tough problems using modern software to create new ways of doing things for our engineers.\n\nDuties & Responsibilities:\nBackend development using Node.js, databases (SQL and NoSQL), and REST/GraphQL APIs, Containerization\nFront end development using React or Vue\nExecution of modern software engineering best practices including test driven development, unit testing, code reviews, and design documentation\n\nQualifications:\n\nBasic Qualifications:\nBachelor's Degree in a STEM Discipline (Science, Technology, Engineering or Mathematics) from an accredited University/College\nKnowledge of modern software engineering best practices including test driven development, unit testing, code reviews, and design documentation\nPreferred Qualifications:\nExperience in backend development using Node.js, databases (SQL and NoSQL), and REST/GraphQL APIs\nExperience in front end development using React or Vue\nAmazon Web Services (AWS) or Azure cloud experience\nActive open source contributions\nWillingness to quickly learn new technologies and rapidly apply them\nActive DOD Secret clearance or higher\nNorthrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}