{"title":"IT Platform Security Engineer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AALmz5x_NkkPwfpFbvVVnv0EWPANUsoREnumk89ClYoYWo8svUCM-euucOxcvDCJYvGfhML45OSG7norpY_7mE2sOcOhttAFPYjTDN-64HzAyjbTWpjWziUUnSsbRGmfPXnsYiQ_6zpL_5E8LbyGd4FA1zq8HHVMVch47cazPIhuXPJ-CaIunFRGpHY_o0Nm","source":"ziprecruiter","full_description":"Overview:Our client, a global leader in the development, manufacturing and marketing of innovative medical products for the treatment and management of respiratory disorders, with a focus on sleep-disordered breathing, seeks an accomplished IT Platform Security Engineer.*** Candidate must be authorized to work in USA without requiring sponsorship ****** 100% REMOTE role ****************************************************************************************************************************** Location: REMOTE*** Duration: 6 months, w/ possibility of extensionPosition:· IT Platform Security EngineerNote:· Prefer candidate to work across all time zones.Description:· Enable teams to deploy, manage, configure, scale and secure their applications using MS SCCM, Intune and JAMF.· Collaborate with project stakeholders and multidisciplinary cross functional teams to implement deployment strategies for existing and new types of services.· Solve complex problems by applying advanced troubleshooting techniques in SSO, Office 365 products, JAMF, MS Exchange.· Build out a robust and secure system to auto-scale our numerous endpoints and work closely with other engineers and other cross-functional teams to improve the build model, and continuous automated deployment and delivery to production environment.· Implement systems improvements by assessing current situation, evaluating trends and anticipating requirements.· Problem Analysis (identifying abnormalities, etc.) and resolution, monitoring and documenting.· Participate in the design and execution of production acceptance tests and new service evaluations.Qualifications:· BS/MS in Computer Science, Information Systems or equivalent.· Being able to understand security concerns raised by our InfoSec team.· Value proposition in security implementation.· Having some security certifications.· Background into Azure Security (Office 365).· 3-5 years’ experience working as systems engineer or security engineer supporting production services.· Hands-on design / development & implementation experience in application security for web, mobile applications.· Hands on experience of minimum 1-2 years in developing & implementing multi-factor authentication features of IAM strategies & its integration using REST, Java etc.· Minimum of 1-2 years exp. in implementing & configuring Okta for secured identity management & single sign-on to any application using Security Assertion Markup Language (SAML).· Experience in all aspects of system administration and engineering.Preferred:· Knowledge using Okta and SSO architecture and implementation.· Knowledge of Microsoft products with a focus on Exchange, Active Directory, file sharing, mobile device management, SCCM and SharePoint.· Experience working with JAMF, Azure O365 and other cloud platforms.· Familiarity with O365 architecture, deployments and migrations.· Experience deploying or managing cloud based services in large-scale, geographically diverse environments.· Experience in development of systems management and administration automation in a high level scripting language (Python, JavaScript, Bash, PowerShell).************************************************************************************************************************I'd love to talk to you if you think this position is right up your alley, and assure a prompt communication, whichever direction. If you're looking for rewarding employment and a company that puts its employees first, we'd like to work with you.Satwinder “Sat” SinghLead Technical RecruiterCompany Overview:Suna provides consulting, temporary staffing and payrolling services to Fortune 500 companies nationally. We develop and implement solutions that help our clients operate more efficiently, deliver greater customer satisfaction, and see a positive impact on their bottom line. We create value by bringing together the right people to achieve results. Our clients and employees say they choose to work with Suna because of how we work with them - with service that exceeds their expectations and a personal commitment to their success.Suna Solutions provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.Applicants, with criminal histories, are considered in a manner that is consistent with local, state and federal laws."}