{"title":"MAINTENANCE MECHANIC I [M - F; 6:55am - 3:25pm]","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJU4WGDtAjBZ1ujQ5qdROmUjkIR6CemG9cPkSHKBZ3_yfVxt_BcSPStOuCAMWn3eH7MibOKRfAkHRcmxg9jDmJzSUwFyM9tbBOvP66NR0q9sRad5zsRHyrVNMyDWg0jCqOeBh46kZj3o8PFTNe4Y6hZNfiCrLMcxxAwtCA5Zi1s6BvLJKMdFFkfC-kN6yVw","source":"ziprecruiter","full_description":"Req #: 188067 Department: UW FACILITIES: MAINTENANCE & CONSTRUCTION Appointing Department Web Address: https://facilities.uw.edu/ Posting Date: 03/05/2021Closing Info: Closes On 03/21/2021 Salary: $3,285 to $4,303/monthShift: First Shift Notes: The University of Washington is following physical distancing directives from state and local governments as part of the collective effort to combat the spread of COVID-19. Click here for updates\"Onsite work\" in the interim will vary for units and for specific positions and will be discussed with candidates during the interview process. As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.UW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty.UW Facilities manages the University's buildings, infrastructure and land, with more than 1,100 employees in a variety of fields. The Asset Management group includes Capital & Space Management, Real Estate, Sustainability and other teams responsible for planning and workload management. The Operations group includes Project Delivery, Maintenance & Construction, Campus Utilities & Operations, Building Services, Transportation Services and Safety. Supporting these groups, as well as the separate Emergency Management team, are the Business Intelligence & Information Technology group and the Finance & Administration group.Maintenance & Construction (M&C) is responsible for general maintenance, repair and renovations of all University of Washington (UW) main campus facilities including building interiors, exteriors and grounds.We have an outstanding opportunity for a Maintenance Mechanic I.Under the direction of the supervisor and lead, assist in the maintenance, operation and repair of electrical, mechanical and structural systems of buildings and grounds.Primary Duties and Responsibilities May assist journey trades workers by performing duties related to carpentry, painting, plastering, plumbing, steam-fitting, mechanical or electrical work, refrigeration maintenance, machinists' trades, etc. Assist in the fabrication of equipment and materials constructed in trades shops in accordance with project requirements. Operate power tools and equipment. Keep leads and supervisors informed of project status/work progress, needed materials and equipment. Operate vehicles such as University vans and trucks to transport tools and equipment to various worksites. Load and unload materials and supplies. Post project cleaning as assigned. Communicate and coordinate with other with other M&C shops to facilitate work. Know and comply with occupational health and safety regulations specific to the work actions and conduct on the job, including Safety Data Sheet (SDS) instructions, Hazard Review Checklists (HRCs) and the use of personal protective equipment (PPE) as required. Comply with all UW and UW Facilities policies and procedures, M&C protocols, i.e., Individual Accountability Protocols (IAP). Support all management directives and the vision and values of M&C. Participate in and follow through with M&C process improvement initiatives, including Balanced Scorecard (BSC), incorporating metrics and Lean principles into internal work processes, and promoting employee engagement in continuous improvements and innovation. Actively participate in meetings and training as scheduled. Provide excellent customer service through effective, courteous and professional interactions with clients, colleagues and the campus community. Other duties as required.Core Competencies Demonstrate personal integrity and trustworthiness. Manage stressful situations and changing priorities effectively. Anticipate, recognize and resolve problems. Be responsible and accountable. Use organizational skills and provide attention to details. Maintain a positive, optimistic, and success-oriented attitude. Exercise professionalism, which includes being tactful and courteous. Exhibit a professional work ethic. Continuously promote a safe work environment.Requirements include: High school graduation or GED equivalent; OR, six month's full-time related vocational study or training; OR, six months' applicable work experience; AND, one year's full-time experience as a helper in building and equipment maintenance, construction, repair work, or equivalent.Additional Requirements include: Demonstrated successful ability in taking direction, working well with others and as a member of a team. Demonstrated excellent effective verbal and written communication skills. Possession of a valid Washington State driver's license. Equivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration.Desired: Knowledge and practical experience with WISHA (Washington Industrial Safety & Health Act) and OSHA (Occupational Safety & Health Act) regulations. Demonstrated proficiency with standard productivity software including Microsoft Office Suite or equivalent productsConditions of Employment: May be required to accept variable work shift. Work may require access to confined spaces and heights using approved safety precautions. Ability to lift and move heavy material may be required. Approved footwear must be provided at the employee's expense and worn on the job. Must be able to be fitted for and wear a respirator on the job. Must participate in medical screening/monitoring (such as TB screening and proof of measles inoculation) required for work assignments in locations, including but not limited to, nonhuman primate areas, the Animal Research and Care Facility, and the University of Washington Medical Center. Must be able to work in a non-smoking environment. Regular and predictable attendance is required.As a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, click here. (https://hr.uw.edu/benefits/wp-content/uploads/sites/3/2018/02/benefits-classified-staff-20210208.pdf) Application Process:The application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select \"Apply to this position\". Once you begin an assessment, it must be completed at that time; if you do not complete the assessment, you will be prompted to do so the next time you access your \"My Jobs\" page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.University of Washington is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, sexual orientation, gender identity, sex, age, protected veteran or disabled status, or genetic information."}