{"title":"Associate Consultant | Urban Forestry | Seattle, Washington NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKgBYI8q3Ts8Azrj7PdApi0WIQWFbeAR7gXnrItnRNlwinhEVekD-3YwSY-2ieINy47YooxdXVZwy0adLPzJ3_k5hyxCJ-5oKSwYu57kwapu9D9WX3eL9bVu5402l0-Nb7I8myi8GU5fI-TU4sGjySZh0TUARDcmIKEVqjHg5sqh3GAfsnyXuhK95_t2w","source":"ziprecruiter","full_description":"Requisition Number: 107393 Company Name: DRG Inc Service Line: 1ENV - DRG Environmental Consulting Employment Type: Regular Job Type: Full Time Education Level Required: Associates Work Experience Required: 3 - 5 years Travel Expectations: Up to 75%Invest in your future.Join one of the largest Employee-Owned companies in the nation.Davey Resource Group(DRG), a subsidiary of the Davey Tree Expert Company, is a leader inthe Environmental Consulting field.We are seeking an associate urban forestry consultant to join ourgrowing team Pacific Northwest team in Seattle, Washington. Our cross-functional experts partner with municipalities, parks, non-profits, cemeteries, and commercial property managersto deliver sustainable solutions.What You'll Do:By executinginnovative urban forestryplanningprojects, our consultant willposition themselves as a trusted environmental planning partner. The associate consultant has a mastery over the common skills, policies, and processes necessary to execute contracts and achieve client goals. Applies leadership skills to mentor teammates, communicate internally, and provide clients with professional consulting services.Communicates internal and external project status reporting with proactive pain-point identification and solution recommendations.Understands contract specifications and empowers the client to achieve their goals and objectives. Develops technical solutions, prescriptions, and recommendations that comply with rules and regulations specific to Washington State.Represents the company and the client at professional meetings by communicating concepts, technical information, and industry intelligence.WhoWe'reLooking For:We are seeking candidates withan associate OR bachelor's degree in urban forestry, natural resource management, or a closely related field.Additional work experience will include 2years as a TRAQCertified Arborist performing municipal urban forest management.Excellent communication skillsare required.The ideal candidatewill facilitateclient and stakeholder relationshipsbypresentingcomplex data-heavy concepts.The consultant will be capable ofcommunicating viawritten reports,remote meetings, and traveling to engage withinternal and external partners.What We Offer*:Competitive salary; annual performance incentives;paidtime off and paid holidays401(k) retirement savings plan with a company matchEmployee-owned company & discounted stock purchase optionsGroup Health PlanScholarship Program for Children of EmployeesSponsorship for professional development, certification and/or membershipsCharitable matching gift program*For Eligible EmployeesWe are proud to be an Equal Employment Opportunity and Affirmative Action employer. As a service provider, our success depends upon our ability to attract and retain qualified personnel, regardless of their age, race, color, religion, gender, national origin, disability, sexual orientation, gender identity, military or veteran status, or other protected characteristics as established by federal, state or local law.The Davey Tree Expert Company has U.S. and Canadian operations in more than 47 states and five provinces and provides a variety of tree care, grounds maintenance and consulting services for the residential, utility, commercial, and government markets. Founded in 1880, Davey has been employee-owned for 40 years and has more than 10,000 employees who provide Proven Solutions for a Growing World. For more information, visit www.davey.comIf you need any assistance at any time please contact us at 1-877-411-7601 or at Recruiting@davey.com."}