{"title":"EOI - Software Developer - Australian Citizenship Required","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKDqoOfmhU_ozeqJ-g6qLspX8eUm7924rjgABuFKe-JVxTptJ-dGMwns_9AdvWGCf2Wb78t9v-aSWetRoiaTzz4Z3qL2cRKz_vx-j9Yd__kooSGKOhyViW8QLU0Eci-jnBwaYDv3vEsgwNHzo3qzR-CPHZlP5SqbQG_mETahzVo14SM6fap1QQj_vU8TyEL","source":"ziprecruiter","full_description":"Do you want to put companies back in control of their code? So do we.You take the best from open-source applications to create bespoke solutions that are both innovative and agile.Due to increased demand, we are seeking Software Developers to join Avanade in 2021. The role sits within our Software Engineering Talent Community. In this role you will be part of strong development community working on Microsoft development platform, developing solutions for Web, Cloud or Mobile devices for our customers. Good understanding of cloud concepts would be highly considered along with agile delivery experience.You must be an Australian citizen to be eligible for the role.About youYou know how the right software solutions can help businesses do more with less effort. You know code inside out and enjoy putting innovation to work in real applications and getting real results.About the jobAs a Consultant, Software Engineering, you focus on designing, developing and testing mission-critical enterprise solutions and other custom application development projects. You will be part of strong development community working on Microsoft development platform, developing solutions for Web, Cloud or Mobile devices for our customers.You're as comfortable performing basic support and debugging functions as you are with maintaining existing applications, and you're happy to share your program knowledge to support your colleagues.Day to day you will:Be part of a very collaborative team of highly skilled consultants who all share the passion for Microsoft technology and developmentYou will have access to all the newest technologies and services within the Microsoft stackBe part of the development team onshore sometimes working with offshore delivery centresTake part in designing full-stack applications based on DevOps principlesDesign and develop APIs and Microservices integrating with external systems or other data sourcesCollaborate and communicate with customers and colleagues in the projects to ensure the delivery of quality solutions.Build and maintain your relationships within Avanade's Software Engineering community.You will work with some of the absolute best Microsoft consultants in the industry both in Australia and in our global communityYour skills:You are a talented software developer who loves to talk about technology and share your knowledge with like-minded and non-technical audiences. Your passion for technology is matched with good business sensibility and great interpersonal skills. You probably have at least three years of relevant experience and a Bachelor's degree in computer science, computer engineering, management information systems or a related field.Your knowledge and technical skills include:Experience in developing applications using .NET Framework or other Microsoft app development platformsGood understating of cloud-based development (Microsoft Azure PaaS experience preferred)Experience in database development using ORM (Entity Framework or nHibernate)Experience in developing web applications utilising JavaScript / Typescript / JQuery, React, Vue or Angular, Bootstrap.Good understanding of designing and developing well-crafted software using agile and lean approachExperience of Agile/SCRUM and waterfall methodologiesAdditionally, if you have experience with Sitecore, Microsoft Power Platform this is positive but not necessaryIn addition to your salary, Avanade employees also receive:5 annual \"MyDays\" in addition to Annual Leave Annual Wellbeing allowance and Gadget allowanceMicrosoft Certifications and career pathways 80 paid training hours per year 18 weeks paid parental leave Gender transition leave *Benefits subject to change annually"}