{"title":"Manager, Hardware Engineering","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALXas94yezMButeEdzan9jrclrvuSPh0n9S6cxRhyTyYRU2agaPnJk7KurdqgdxPnVluQf9Kv-2njQ15WbmqWBZuq7S4srEkYaXEe5LSb-XwCi6I9S8AtS7JZMkyellfCEQeLuRPWIuqpjFSv-B3DCcSySXUrdcbK7FX6JLt6-TbFXLNC3n0o6Yz8cs6UI3","source":"ziprecruiter","full_description":"Company Overview Lennox International (LII) is a leading global provider of innovative climate control solutions for heating, ventilation, air conditioning, and refrigeration (HVACR) markets.Beginning over a century ago, Lennox International has built a strong heritage of Innovation and Responsibility. Our position as an innovation leader continually inspires us to promote more efficient energy use and a healthier environment through our product operations. Our engaged and diverse workforce is committed to providing climate control solutions that provide the most value and comfort for our customers. We are proud to have instilled a shared sense of responsibility and commitment among our approximately 10,000 employees located throughout North America, South America, Europe, Asia, and Australia. Job Description WHAT YOU WILL BE DOING As a Hardware Engineering Manager, you will research, design, develop and test computer systems and components.   You will be trusted to:Sustain and develop electronic control boards utilizing embedded microprocessor with analog and digital circuitry for residential HVAC equipment.Develop specifications, rules, and best practices for verification and validation of hardware systems.Test the electronic controls to verify they comply with the stringent quality and reliability requirements of Lennox Industries.Perform root cause analysis and implement design changes to assure product integrity.Interact with suppliers to find the best components for the application while containing component costs.Serve as the program manager for your products to deliver the desired product on time while communicating with the other departments within the Lennox Industries organization.Communicate project results to the Controls Team leadership staff. Qualifications WHAT WE ARE LOOKING FOR Bachelor's degree in Electrical Engineer 10-15 years of experience in design of analog, digital, and mixed signal circuitry and embedded microprocessors using through-hole and surface mount technologies.1-3 years of management experienceExperience in utilizing schematic capture and PCB layout software to document your design.Capable of performing general soldering; operation of scopes, meters and general lab equipment.Proficient in speaking and writing in English.Can think creatively with the ability to develop and implement new processes and procedures.Must have demonstrated the capability to multi-task and work on several projects at the same time.Need excellent collaboration and teaming skills.Experience with circuit simulation and PADs PC board layout software is a plus.Experience with designing wireless communication circuits is a plus.Experience in the HVAC or appliance industries is a plus.Experience building electronic devices with contract manufacturers is a plus.Experience with environmental and transient condition testing of the electronic controls is a plus. Join our Talent Network to receive job related information, news, and updates right from the source."}