<<<<<<< HEAD
{"title":"Chemist I","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALueGBvcPVa2JTUnO_pVnswEessHhQA6B_zrDM5SMM9NWd1zvup7QcmWzde0FvqE8zYenAJksFJJ6RGH4Sb3irYRYIeddfgwYVOuaXszbyVyhnwxkjIUNFMHGq2WkrttrX57RxdpHRMmoMMednPnydaXnrpYdJP34k70yRaL3qnhMfbmawmI4v2fky1tsK6","source":"ziprecruiter","full_description":"Company InformationFounded in 1977, Diversified Laboratories, A FoodChain ID Company, has over 40 years of experience protecting our customers by analyzing and detecting pesticides, PCBs, chlorinated dioxins, chlorinated hydrocarbons, and other chemical contaminants in food and animal feed products. Pesticides are highly persistent in the environment and are readily stored and concentrated in poultry and livestock tissues and therefore represent a concern for human health. The dangerous nature of these industrial chemicals requires constant vigilance at all levels, from the corporate arena to federal, state, and local governments. EPA has established tolerances for these chemicals and the FDA and USDA have the responsibility to enforce them, but our customers bear the burden of compliance to ensure a safe product. The potential economic consequences of contamination, if left undetected, can readily exceed $1 million. Diversified Laboratories makes it as easy and convenient for our customers to ensure safe products for themselves and their customers with quick, accurate, and confidential testing. Our approach has helped preserve a perfect record of no FDA/USDA involvement for over 40 years.Summary At Diversified Laboratories, A FoodChain ID Company we are committed to consistently delivering the highest levels of operation and service excellence in our industry. Our Chantilly, Virginia location is currently seeking a Chemist I to assist with research, plans, and verifies methodologies for stakeholders. The Chemist I is also responsible for performing chemical and physical testing on raw materials, work-in-process, and finished product samples to ensure the quality and safety of consumers. This position requires the ability to act quickly, remain flexible, and manage multiple priorities.Role and ResponsibilitiesWorks with team members to maximize productivity and efficiencyOperates and maintains existing lab equipment and evaluates/implements new lab equipment.Perform diverse analytical and instrument testing utilizing official or approved methodologies appropriate for routine and non-routine samplesDevelop schedules and methods to accomplish assignments ensuring work is completed in a timely and efficient mannerQualificationsBachelor's degree in Chemistry or related field and equivalent combination of education and experience.Experience using GC and/or HPLC instrumentation preferred Efficient with chemical preparation of standards, method development, and handling quality control proceduresExcellent problem-solving skills and the ability to take initiativeRelated experience working in a laboratory preferredExemplary teamwork skills are essential, with little direct supervision.Attention to detail and commitment to high-quality standardsAdditional DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice. Work Location: Chantilly, VA Work Schedule: Tuesday - Saturday, 9a-6pBenefits and PerksHealth Insurance - comprehensive medical, dental, vision, and prescription drug coverage options available for staff and their familiesVoluntary Short-Term DisabilityGroup Life Insurance for each EmployeeVoluntary Life Insurance available for staff and their families401K plan, including company matchPaid time off (PTO), including holidays and jury dutyPaid Parental Leave Work EnvironmentMost positions with FCID operate in an office environment. This role routinely uses standard office equipment such as computers, phones, and photocopiers.Physical DemandsThis is a sedentary role; however, some standing, bending, and lifting is required. This position is subject to lifting files and computer-related equipment (up to 25 lbs.), opening filing cabinets, and bending or standing as necessary.Position Type and Expected Working HoursFull-time positions require a minimum of 40 hours per week. Associates are expected to be available during “core” hours of 9:00 a.m. to 5:00 p.m. CDT. Some flexibility in hours is allowed and must be approved by your direct supervisor.Additional DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.EEO StatementFoodChain ID, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws.This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.Employment Type: FULL_TIME"}
=======
{"title":"Chemist I","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIZioJi1mtsuxr8y-EzUSSkrsmLzBPP7Y9NXhup375r9kUvTr_u8T6Z1lVtVaKTEm-v8O1EvuwRykmLRMM0Xv8qaTCUIphhpfZi89QJ6qeInOAUeMxrjoXLkeJE81o9KCK5DNN6sjVk6Q6YRwVzVlvJQlL9LFX5sIekC3YPpTHEKM4R8Q5EupwIllmlen4","source":"ziprecruiter","full_description":"At BASF, we create chemistry through the power of connected minds. By balancing economic success with environmental protection and social responsibility, we are building a more sustainable future through chemistry. As the world's leading chemical company, we help our customers in nearly every industry meet the current and future needs of society through science and innovation.We provide a challenging and rewarding work environment and are always working to form the best team-especially from within, through an emphasis on lifelong learning and development.   And we are constantly striving to become an even better place to work. BASF has been recognized by Forbes Magazine as one of America's Best Employers in 2019. Come join us on our journey to create solutions for a sustainable future!Chemist I - 2100575 - Charlotte, NC Where the Chemistry HappensWe are seeking a Chemist I to work in the Dispersions & Resins (ED) business unit as part of our Charlotte, NC company site.   In conjunction with Technical Specialist and Development Scientists, you will respond to customer requests regarding formulation requests.  Works with manufacturing to investigate and help resolve product non-conformance and ensure and works in compliance with EH&S and ISO standards.  Work with polymer comparisons and evaluation, demonstrations of features and benefits of BASF products.Formula for SuccessUtilizing your bachelor's in science in Chemistry or related Technical Degree (e.g. Chemical Engineering, Biology, etc.), along with 2 years' experience and possible advanced graduate degree.Experience in working on multiple projects, knowledge in coatings technology formulation, knowledge in general construction testing techniques and strong written and verbal skills.  Will be required to communication with both internal and external customers and team members.Apply your formulation skills to design experiments that ultimately provide Starting Point Formulas for our polymers.  Troubleshoot non-conforming product events at our manufacturing sites and provide recommendations on how to resolve the problem.  Using your problem-solving skills to troubleshoot customer complaints and actively participate in all BASF safety practices and programs.  Write/revise ISO documents to maintain and improve work instructions/SOP's and actively support BASF's ISO 9001 Quality and RCMS Policy.The position is for Technical Services that directly support our external customers.  You will be mostly working on multiple projects with competing priorities and using independent decision-making after consulting with project's stakeholders. Create Your Own Chemistry: What We Offer You Adding value to our customers begins with adding value to you. You@BASF is the suite of benefits, perks, programs and unique opportunities we offer to support you-the whole you-in all stages of your life and career. With you@BASF, you create your own chemistry.The total rewards that you receive as a BASF employee go way beyond a paycheck. From competitive health and insurance plans, to robust retirement benefits that include company-matching contributions, to making sure you never stop learning, we believe investing in you is investing in our success. Working for a large, global organization, you'll have a chance to grow professionally and personally, expand your network and build a rewarding and dynamic career.BASF provides interesting and challenging learning and development opportunities to help you make the most of your talents and your job."}
>>>>>>> 6e9a075ee97f3a4d702c3307ef1e0ee7373d6616
