{"title":"Chemist I","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIZioJi1mtsuxr8y-EzUSSkrsmLzBPP7Y9NXhup375r9kUvTr_u8T6Z1lVtVaKTEm-v8O1EvuwRykmLRMM0Xv8qaTCUIphhpfZi89QJ6qeInOAUeMxrjoXLkeJE81o9KCK5DNN6sjVk6Q6YRwVzVlvJQlL9LFX5sIekC3YPpTHEKM4R8Q5EupwIllmlen4","source":"ziprecruiter","full_description":"At BASF, we create chemistry through the power of connected minds. By balancing economic success with environmental protection and social responsibility, we are building a more sustainable future through chemistry. As the world's leading chemical company, we help our customers in nearly every industry meet the current and future needs of society through science and innovation.We provide a challenging and rewarding work environment and are always working to form the best team-especially from within, through an emphasis on lifelong learning and development.   And we are constantly striving to become an even better place to work. BASF has been recognized by Forbes Magazine as one of America's Best Employers in 2019. Come join us on our journey to create solutions for a sustainable future!Chemist I - 2100575 - Charlotte, NC Where the Chemistry HappensWe are seeking a Chemist I to work in the Dispersions & Resins (ED) business unit as part of our Charlotte, NC company site.   In conjunction with Technical Specialist and Development Scientists, you will respond to customer requests regarding formulation requests.  Works with manufacturing to investigate and help resolve product non-conformance and ensure and works in compliance with EH&S and ISO standards.  Work with polymer comparisons and evaluation, demonstrations of features and benefits of BASF products.Formula for SuccessUtilizing your bachelor's in science in Chemistry or related Technical Degree (e.g. Chemical Engineering, Biology, etc.), along with 2 years' experience and possible advanced graduate degree.Experience in working on multiple projects, knowledge in coatings technology formulation, knowledge in general construction testing techniques and strong written and verbal skills.  Will be required to communication with both internal and external customers and team members.Apply your formulation skills to design experiments that ultimately provide Starting Point Formulas for our polymers.  Troubleshoot non-conforming product events at our manufacturing sites and provide recommendations on how to resolve the problem.  Using your problem-solving skills to troubleshoot customer complaints and actively participate in all BASF safety practices and programs.  Write/revise ISO documents to maintain and improve work instructions/SOP's and actively support BASF's ISO 9001 Quality and RCMS Policy.The position is for Technical Services that directly support our external customers.  You will be mostly working on multiple projects with competing priorities and using independent decision-making after consulting with project's stakeholders. Create Your Own Chemistry: What We Offer You Adding value to our customers begins with adding value to you. You@BASF is the suite of benefits, perks, programs and unique opportunities we offer to support you-the whole you-in all stages of your life and career. With you@BASF, you create your own chemistry.The total rewards that you receive as a BASF employee go way beyond a paycheck. From competitive health and insurance plans, to robust retirement benefits that include company-matching contributions, to making sure you never stop learning, we believe investing in you is investing in our success. Working for a large, global organization, you'll have a chance to grow professionally and personally, expand your network and build a rewarding and dynamic career.BASF provides interesting and challenging learning and development opportunities to help you make the most of your talents and your job."}