{"title":"QC Chemist II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJuCblZJL1QXzqBpYBgcHIzZca8I0B55bHvI8QlUsZVf2Fvd0k-v0jMdwvO2b5YeDRmBedGfCquksZPVezGFR5XDvgkOcEr6bkuC_QZVSiTeDFaQUPs9mx6RRJTXC-ziRujkOb0A5GGArEEmQAWMZvSpwwWJISzMte-Jv6BtUBkLl59qox0ndQWQ0-e3mh0","source":"ziprecruiter","full_description":"Title: QC Chemist IIDepartment: Quality ControlReports To: QC ManagerFLSA Status: ExemptI. Essential Duties & Responsibilities· Performs a variety of analytical testing procedures to characterize pharmaceutical materials· Supports GMP operations with performing in-process, release, and stability testing of manufactured material and raw materials· Assists with analytical development and validation process· Generates SOPs for QC operations and equipment· Qualifies analytical equipment for use with QC testing· Transfers and validates analytical methods from R&D or client· Proficiently documents analytical procedures and results· Operates and maintains analytical equipment including coordination with external maintenance and calibration providers· Effectively manages workload according to company and departmental priorities· Maintains a clean and organized working environment· Contacts vendors for equipment/chemical ordering· Perform duties assigned while adhering to operating and safety SOPsII. CompetenciesTo perform the job successfully, an individual should demonstrate the following competencies:· Proficient with chemical analysis methodologies, HPLC/UPLC experience preferred· Proficient with dissolution testing methodologies· Experienced with GMP environments and operations particularly as they pertain to QC testing· Problem solving/decision making skills· Computer skills: Microsoft Office package and basic computer skills facilitating assimilation of various software packages associated with analytical equipment· Strong data and statistical analysis skills· Good written and verbal communication skills· Strong organizational and documentation skills required· Strong multi-tasking skills· Works well in a team environmentIII. QualificationsEducation and Experience· Bachelor’s degree in chemistry or related discipline.· QC experience preferred· 3-6 years of pharmaceutical analytical experience.· Dissolution testing experience required.· Experience with Empower Software preferred.Powered by JazzHRYjng89xwSA"}