{"title":"QC Chemist 1","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKGDTH1kEPxBaE5bbDFajhYAbP964jJ7ZsFhXPcqBndEESj2qN58iFow6CbKV7n82GO_C3i-2IDICr9nzh8jH-hiaFVWfS0iyKY0Jx-LpJ4x-ONfBegluxhqKfJ5L0jsoMBeNAd_Ur5wnN_U8z2Z1k9l1Om9ngV5z3-t0ILNtpR_xeEgkjhK2aXhNxrfPM","source":"ziprecruiter","full_description":"QC CHEMIST I** H1B Visa transfer and RELO assistance is available for this job **Pharmaceutical Research and Manufacturing facility is seeking a qualified Quality Control Chemist I to join our Quality Control team. The Quality Control Chemist I is responsible for providing analytical chemistry support for the facility.To perform this position successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required:Shall adhere to all applicable regulatory requirements, including FDA, EPA, OSHA, and related safety, health and environmental procedures, policies and practices.Consistent support and practice of mission, vision, and values.Identify and protect the original technical information as part of the company property.KEY RESPONSIBILITIES:Support manufacturing operations through the testing of raw materials and starting materials as required to meet production timelines.Perform cleaning verifications on multi-use equipment using approved methods.Test reference standards and stability samples.Document sample preparation, equipment set-up, and test results in laboratory notebooks or other appropriate test record forms. Verify data with second quality team member as required. Maintain all records as required to maintain compliance.As required, test intermediates and final products to meet production timelines/client requirements.Assist in the revision of documentation as required.Participate in quality unit projects, including but not limited to supplier certification, methods development, methods validation and training of both quality unit members as appropriate.Provide support in the maintenance and calibration of laboratory analytical instrumentation.Assist in the maintenance of the QC laboratory through routine housekeeping, as well as keeping personal bench area and desk organized.As required, perform routine testing on the water system (DI, ice, potable, and QC water), and prepare reports as needed.QUALIFICATIONS:EDUCATION/EXPERIENCE:Bachelor’s degree in Chemistry or Biochemistry or equivalent.Minimum two (2) years of experience in pharmaceutical quality control or equivalentFamiliarity with analytical testing and instrumentation.JOB COMPETENCIES:Excellent organizational and planning skills.Strong written, verbal, and interpersonal communication skills.High attention to detail.Demonstrated strong analytical skills, and the ability to work independently against multiple deadlines."}