{"title":"Sr. Sales Engineer-Automotive-ADAS NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIXvZ9D9R9VGWtegtVM0lR-PKUJPBhEWr6yK7lIrNcY5cCtgBln-P_t78GW6013dmJI-TDINZaRtlJmWeDB3RC6rdb08JxnL-uhtHWsNkCFyVWpt88jHJKK3gUBn4ieY8rA2KSn5uH77Y7gUkYpk6Ptltdz_gfnMlC4GFJa_0SAtp4YMP6GSoX0fCeYR0CQ","source":"ziprecruiter","full_description":"Sr. Sales Engineer-Automotive-ADAS-Austin, TXRESPONSIBILITIES:Own technical engagement with multiple OEMs and Tier 1s and promote ADAS and AD solutions to key customers. Understand ADAS/AD systems, software, ecosystem and requirements.Support concept and SW development as required for components such as DNNs, ISP, sensor interfaces etc. Manage deep dives on various technical topics ranging from ADAS systems to individual components such as AI, Machine learning, communication, virtualization etc. Provide expertise to customers on technical queries and support resolution of customer and ecosystem partner technical issues.Support management and expansion of ecosystem of solution and service providers.Manage customer RFI/RFQ technical responses.Collect customer and market requirements to provide key feedback for next generation product definition.Support solution development team in defining system solution requirements per ADAS customer needs. Work closely with cross-functional teams - Sales, design, solution etc. - to achieve successful Design-in of ADAS/AD opportunities.REQUIREMENTS:Bachelors degree in electrical or Software engineering.5-10 years in embedded SW or HW development.ADAS/AD experience and semiconductor experience is highly preferred.Strong knowledge of ADAS systems with background in sensors, image processing, computing architectures (Neural networks, ARM cores, GPU), communication & networking.Background in AI and DNNs is desirable.Comfortable in a customer facing position with the ability to talk about a wide range of technical topics with ease.Comfortable with developing a broad understanding of product portfolio and developing strong knowledge of a wide variety of technical areas (system, sensors, neural networks, communication etc)."}