{"title":"Software Engineer II, Android - Fares Experience","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKsA4SjXyJABdyI8jX-RV0IHt5YdTQeY8VagIOxsM9f6LoF8eoMpSQM8DnCyI5SUFp1IxwYSERX5HcKgYnjix7lrtvO06L1NkbgP4U02xcyLE5dEpaDxI-W91-5OfNYmSTTUJyrSSPwF-L-g1OCqZxhrOP8P4EYZp-sTs2T9D4BQ2dVgXJhCQuqS4vCqXVH","source":"ziprecruiter","full_description":"About the Role:As an Android engineer on the team, you will be responsible for creating delightful and sticky fares consumer experience. Whether this is ensuring our Fares are razor-fast, defect-free or well understood by riders/drivers, there is tremendous scope in building engaging user experiences around fare comprehension, clarity & acceptance. A compelling fares experience will be an important lever in ensuring marketplace health and stimulating both short and long term gross billings via long-term rider engagement.What You'll Do: * You will deliver high quality mobile softwares. You will write, release and maintain mobile code  You will develop framework with you strong expertise in Java and Kotlin  You use experimentation to measure the success of products or platform  You work with Android and backend engineers to improve the scalability and reliability of the end to end workflow.  You provide guidance to mobile engineers on resolving reliability issues. * You will help define the next generation of Fare Mobile SDKBasic Qualifications:  Bachelor's degree in Computer Science or related technical field or equivalent practical experience  Strong experience in either Kotlin and/or Java * 2+ years of professional experience building in either mobile platform/sdk/dev tools, or mobile consumer facing featuresPreferred Qualifications: * At least two (2) years of software engineering experienceAbout the TeamThe Marketplace Fares Team powers global fares for all of Uber - that's all riders, drivers, eaters, new initiatives and technical consumers. Tens of billions of dollars in gross bookings flow through the systems and experiences within our responsibility. Our scope and critical work span the entire stack - from platform fare calculation for riders and drivers, to data science prediction of trustworthy upfront prices, to compelling mobile fare experiences for our customers. At Uber, we ignite opportunity by setting the world in motion. We take on big problems to help drivers, riders, delivery partners, and eaters get moving in more than 10,000 cities around the world. We welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let's move the world forward, together.  Uber is proud to be an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know by completing [this form](https://forms.gle/aDWTk9k6xtMU25Y5A)."}