{"title":"Senior Android Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKwGWrzBAhkElJF6MXvx0DNJ1kb0TJ5kHNwFl-kCQrxv--GfRX3vVtQ17dS_e_ukZu9rUoe73R-_9zQszZNml1tY9acQTbQsHGUw8MOrLz4PnSEIFACLXmo-w_kclYDFBSUcpr1bo0EmWOOOy_F5p8ECGFnEItAqA9tbwyINZGIS6YfBwwf3tsgjelgFCw","source":"ziprecruiter","full_description":"Senior Android Developer - Rural SourcingRural Sourcing is a consulting firm passionate about creating jobs across the United States and changing the IT outsourcing experience for our Fortune 500 and 1000 clients. Come experience our collaborative, fun, and creative culture where we take our work seriously, but not ourselves!**Why you will enjoy Mondays again:*** Exposure to modern technologies across various industries in an agile environment Continuous development through training and mentorship programs Progressive career journey and opportunity for advancement Every day is casual Friday Work from home days Opportunity to give back in your community Tuition reimbursement Competitive salary + bonus opportunities Benefits package, 401(k) plan, and substantial PTOA Day in the Life:As a Senior Android Developer, you will be responsible for defining, designing, and implementing on various mobile smartphones running Android. A key part of your responsibilities will include communicating with engineers on the mobile team, as well as other parties like UI designers and product managers. Develop mobile applications in Android Develop new functionality on our existing software products Participate in a small, experienced, energetic team on a rapid, agile development schedule Provide general technical support and training to Rural Sourcing and for our clients**What it takes:*** Passionately mentor and motivate those around them Ability to interact with clients and have a consultative approach Oversee the execution of deliverables Ability to adapt and have flexibility within a high-growth organization Hunger for continuous learning and professional development Problem solving skills to tackle business challenges Intellectual curiosity to provide creative solutions Ability to work in a team environment Good interpersonal, written and verbal communication skills*Equal Employment Opportunity Policy: Rural Sourcing is committed to offering equal employment opportunity without regard to age, color, disability, gender, gender identity, genetic information, marital status, military status, national origin, race, religion, sexual orientation, veteran status, or any other legally protected characteristic.**Location: Fort Wayne, INJob Code: 1086# of Openings:* 1"}