{"title":"Software Engineer","location":"Roseville, CA","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Experience with <b>software</b> development tools and processes.</li>\n <li>Majoring in computer engineering, computer science or <b>software</b> engineering.</li>\n</ul>","term":1,"jk":"8913da13452c28c8","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=8913da13452c28c8","source":"indeed","full_description":"Hewlett Packard Enterprise (HPE) advances the way people live and work. We bring together curious minds to create breakthrough technology solutions, helping our customers make their mark on the world.\nJoining HPE in an early career role is an excellent opportunity for a self-motivated, proactive individual to grow with us and help us drive our continued success globally. We are one of the largest technology companies in the world, operating in over 150 countries and market leading in several industries. We believe in partnership, innovation and taking action – our culture is what defines us as a company: how we act, how we treat others, and how we conduct business. In addition to working alongside great colleagues, you will have many opportunities to learn through coaching and stretch assignment opportunities. You’ll be guided by feedback and support to accelerate your learning and maximize your knowledge. We even have a “reverse mentoring” program which allows us to share our knowledge and strengths across our multi-generation workforce.\n\nJob Description:\nWe are hiring top-tier university students to work on leading-edge networking products. We are looking for students majoring in computer engineering, computer science, or software engineering. You will learn about our wired product portfolio while working as part of a team to design, implement, test and validate SW for our state of the art networking products. Internships are generally full time for the summer, but longer term co-ops may be available for students that wish to take a semester off. Interns will work closely with a mentor for duration of their internship and will meet regularly with their manager in a one on one type of format.\nRequirements:\nMajoring in computer engineering, computer science or software engineering\nUnderstands fundamentals of data structures, algorithms, operating systems, and networking.\nExperience with software development tools and processes\nProgramming experience in C/C++\nPassion for learning something new and taking on a challenge.\nGood communicator (verbal and written)\nEducation/Experience:\nIn 3rd or 4th year of university studies\nUnderstanding and experience with networking products and challenges.\nWhat we can offer you:\nExtensive benefits, a competitive salary and participation in the shared values and purpose that make Hewlett Packard Enterprise one of the world´s most attractive employers! At HPE, our goal is to provide equal opportunities, flexible work-life balance, and constantly evolving career growth.\nIf you are looking for challenges in an exciting, supportive and international work environment, then we definitely want to hear from you. Continue the conversation by clicking apply now below, or directly via our Careers Portal at www.hpe.com/careers.\nJoin us and make your mark!\nFind out more about us and follow us on:\nhttps://www.facebook.com/HPECareers\nhttps://twitter.com/HPE_Careers\nHPE is an Equal Employment Opportunity/ Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. We do not discriminate and all decisions we make are made on the basis of qualifications, merit, and business need. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together.\n1071718"}