{"title":"Senior Digital Hardware Design Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKxtGf8smz6qPVAN0MWCOXGQTITRWAK88K56pSYnJQdb1koYfYp1BjHi5Zx2qPFGEL3Pu7EcilQ-7AXDCftE8vfOccQg8Xit9wQ-1d3r-Z90X849lef2DIOnTM7T3lhFAjUClDpkzOYtv1DcC-prf40kxrmVriwW4CfUrJY9gQUD9YBX-PTU0_XBthXp4dD","source":"ziprecruiter","full_description":"Please Note: US citizenship or permanent residency is required for this position.CesiumAstro is a rapidly growing space technology startup in Austin, Texas, developing out-of-the-box communication systems for satellites, UAVs, launch vehicles, and other space and airborne platforms. We are opening our Broomfield, CO office and looking for talented engineers to join our team. Our approach is unique, and our team is changing the world of space communications. Learn more about our company at https://www.cesiumastro.com (https://www.cesiumastro.com/).We are looking to add a Senior Hardware Design Engineer to our team. If you are great at what you do, enjoy working in a startup environment, and are passionate about developing leading-edge hardware for satellites, spacecraft, and aerospace systems, we would like to hear from you.In this position, you will be responsible for board-level high-speed digital electronics, including products based on processors, FPGAs, and GPUs, through all phases of the development process. Projects will include software-defined radios, single-board computers, digital architectures for communication systems, and hardware products for artificial intelligence and machine learning.As a senior hardware team member, you will be responsible for hardware product design from initial concept through requirements definition, architecture definition, part selection, detailed design, analysis, manufacturing, testing, qualification, and in-orbit support of Cesium's products. Hardware design tasks will include roadmap planning, block diagrams, schematics, PCB layout and routing, analyses (e.g. signal integrity, failure method), testing, and qualification. Senior engineers also serve as technical and professional mentors in their field.The successful candidate will also present engineering design review materials to our customers and executive team, as well as participate in proposal-writing efforts. As such, excellent written and verbal communication skills are required.CesiumAstro is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.We provide a generous benefits and stock option package to all our employees.Successful candidates will require, as a minimum: + Bachelor of Science (BS) or Master of Science (MS) degree in Electrical Engineering or Computer Engineering from an accredited university.+ Minimum of 4 years of industry or university research experience in high-speed digital electronics design, analysis, and test. More experienced candidates are also encouraged to apply.+ Expert-level proficiency in electronics design (EDA) tools such as Altium.+ Expert-level proficiency in high-speed digital PCB layout.+ Experience with board-level signal integrity simulation tools such as Ansys or ADS.+ Extensive hands-on experience with lab instruments such as oscilloscopes, spectrum analyzers, electronic loads, and signal generators.+ Excellent written and verbal communication skills. Preferred experience includes: + Aerospace electronics design, development, and qualification.+ Worst-case circuit analysis, failure method and criticality analyses, and reliability analysis.+ Programming (C/C++, Python, MATLAB, etc.).+ EMI/EMC design and mitigation techniques."}