{"title":"Tier 2 Student Technical Support Agent NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAITWP6IqWahh9I_PMJtbVLyFJaIBpP0ClVYTiPwXCgc2-9PGIQ4sQHesaOgolILxhZtQnETb9SrN8V3NtNX-FWSzcUgQihHbX3e5YP6RNsxXyuEPjaqDhxhTncx6y-ffYY6NQklX0mO7ReQt1nOMz0q7_KHTaOQXlEXHUK8_FDaL07Kw0SkUSlhiM9ysSb6","source":"ziprecruiter","full_description":"Tier 2 Student Technical Support Agent - ( 2103248 ) Description Company Summary: Pearson Online & Blended Learning is a leading, fully-accredited provider of high-quality, highly accountable virtual education solutions for students in grades K-12. Pearson Online & Blended Learning is committed to expanding quality education through technology and helping students achieve both academic and personal success. Since 2001, the company's Connections Academy division has delivered individualized learning to students through virtual public schools and a private online academy. In the 2012-13 school year, 32 Connections Academy virtual public schools will operate in 27 states and expect to serve more than 65,000 students in grades K-12 (some schools do not serve all grades) from across the U.S. **The Connections Learning division meets the needs of schools, school districts, and other institutions looking to develop and enhance their online learning programs. Connections Learning delivers a full range of targeted digital learning solutions to the K-12 education community including online courses, a program for homebound students, a digital learning platform, and more. More than 300 schools, school districts, state departments of education and other educational institutions, serving tens of thousands of students throughout the U.S. and beyond, are already utilizing Connections Learning products and services.** **Position Summary:** **The Student Tech Support Blended Agent Tier 2 will work in our Columbia contact center primarily providing student technical support services to students and caretakers as they set up and use our technology to learn at a distance, from initial startup, troubleshooting, and virus/spyware removal, to resolution of software, hardware, printer, and broadband network issues.** **Student Tech Support Responsibilities: + Troubleshoot and resolve software, hardware, printer, and broadband network issues by actively listening to the caller and asking appropriate questions to build a solution + Troubleshoot LMS (online school) issues (Internet/application issues) + Log all calls in call tracking system, creating detailed, accurate entries + Escalate calls when necessary according to guidelines + Remote in to callers' computers when necessary using the appropriate student tech support processes + Define and feedback/recap user problems while providing a detailed solution to resolve each issue + Proactively follow-up (outbound) with callers (in between inbound calls) to verify that problems were resolved + Respond to voicemails and Webmails, and create trouble tickets as necessary + Maintain a current level of understanding of the details of home networking, high-speed Internet, and application functionality + Act as liaison for web-based application problems between users and developers + Assist in the collection of data for identifying user requirements that may result in future system development or training + Keep current with development of new system features + Work with manager to implement products and processes to increase Student Tech Support team efficiencies and quality + Perform other duties as assigned, including manual labor, such as staging materials, packing, inventory, and delivery** The position is open to applicants in any state, and hourly rates, while generally between $20.20-$21.64 /hr may vary depending on a location's minimum wage. The anticipated starting hourly wage for Colorado-based individuals expressing interest in this position is $20.20. This position is not eligible to participate in an incentive program. Benefits available to eligible employees can be seen at: https://pearsonbenefitsus.com/Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply. Qualifications + Exceptional phone manners and customer service skills + Outstanding written and verbal communications skills + Exceptional interpersonal skills and proven positive attitude + Highly detailed oriented + Proven problem-solving methodology + Outstanding resourcefulness and creativity in providing timely service to callers + Demonstrated ability to learn and apply large amounts of detailed information rapidly + Proven ability to multitask in a fast-paced environment + Excellent organizational and time management skills + Demonstrated ability to manage stressful situations in a calm, courteous and efficient manner + Prior technical contact center / Help Desk experience required + Strong working knowledge of the Application Service Provider (ASP) model, Windows 7 and Windows 10, Office 2010 and later, including Word, Excel, PowerPoint, Chrome, Firefox, Edge, Internet Explorer and Safari, and the Google Office Suite + Mac experience a plus + Strong remote troubleshooting and working knowledge of ISP's, high speed connections (DSL/Cable-Modem) and TCP/IP + Strong remote troubleshooting and working knowledge of home networking/devices and wireless devices + Ability to make quick and clear decisions in accordance with company policy + Demonstrated ability to organize, prioritize and multitask while managing users' expectations + College degree preferred + CompTIA A , and CompTIA N a plus Primary Location : US-RE-Remote Work Locations : US-Remote Remote Job : Customer Service Organization : Technology & Operations Employee Status : Regular Employee Job Type : Standard Job Level : Entry Level Travel : No Job Posting : Mar 8, 2021 Job Unposting : Ongoing Schedule: : Full-time Regular Req ID: 2103248"}