{"title":"AI Video Analytics Engineer NEW!","location":"","salary":"","description":"","term":"$130,000 to $200,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALNWhy2-djG0WUovJGM2TPFbmuo-zP8-weEXdwcsgNuLA4T6fAIi0_8KiXaU789jKM28HeEzrIpGf9DdYZpnA8mYQ2S2qz735DbeGDvU0a47PaMt68j4Elcv9jHGB3SADKjThqwJ2_9X4JR4a7_xsNejnJQ8-1W4lYUQM_WBAybMZ6uFHNHKUs2wr2ByHh0","source":"ziprecruiter","full_description":"AI Video Analytics Engineer We are leading the way in 5G!If you are a AI Video Analytics Engineer with experience, please read on!What You Will Be Doing- Maintain a video streaming analytics pipeline based on the NVIDIA DeepStreamer library- Design and deploy a flexible library and execution framework of analytics tools related to video and image processing- Create, train, and deploy new AI / ML plugins to the pipeline for object recognition and other tasksWhat You Need for this Position- Familiarity and working experience with AI / ML training and inference frameworks such as Tensorflow, Keras, or PyTorch and programming languages such as Python/C++.- Understanding of AI / ML algorithms commonly used in computer vision, image and video processing, such as CNNs, YOLO, RNN LSTMs, etc.- Understanding with Kubernetes is a plusWhat's In It for You- Excellent compensation package!- Industry leading benefits!- World class team!So, if you are a AI Video Analytics Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}