{"title":"Intern / Trainee Software Engineer","location":"Folsom, CA 95630","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Documenting and presenting processes and procedures.</li>\n <li>Collaborates with clients and project team to design appropriate process solutions.</li>\n</ul>","term":1,"jk":"79c64f139e8ac31e","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=79c64f139e8ac31e","source":"indeed","full_description":"Intern / Trainee Software Engineer\nFull Time\nFolsom, CA\nJob Description\nThe person who has good academic background, having exposure to software skills and ability to work on software cloud applications.\nResponsibilities:\nDocumenting and presenting processes and procedures\nWork with individuals or in group setting to provide “how to” knowledge/demo sessions.\nTroubleshoot/problem solve effectively and execute timely decisions in resolving issues.\nLearn, and stay up to date with, the latest capabilities that ServiceNow has to offer.\nConfigure platform which includes activating of plug-ins.\nWork with team to support in creating support tickets including collaborative troubleshooting with ServiceNow Support.\nMonitor, optimize health, usage, and overall compliance of the ServiceNow platform.\nConfiguration, maintaining, monitoring and enhancing discovery for ServiceNow,\nAnalyzes business processes and documents functional requirements to increase operational maturity.\nDevelops use cases, process diagrams, and requirements documentation using stories and scrum tasks in ServiceNow.\nCollaborates with clients and project team to design appropriate process solutions.\nEvaluates requirement changes and provides feedback to ensure alignment to original design objectives.\nAdvises on options, risk and impacts on business processes and cultural adoption.\nFollows up on outstanding needs and provides timely status reports to team lead / project manager.\nCommunicates technical problems and solutions to both technical and non-technical audiences.\nBuilds positive relationships with team and clients by providing excellent service / support and consistent communication as appropriate.\nPerforms accurate internal operational tasks such as time tracking, expense reporting and knowledge sharing.\n\nRequired Skills:\nBachelors / Masters Degree in Computer Science, Information Technology (OR) Equivalent.\nStrong analytical, problem solving, interpersonal and communication skills required with exemplary communication ability, both written and verbal.\nExcellent presentation skills.\nThorough attention to details, ability to multitask, and effective time management skills.\nKnowledge of ServiceNow is highly desirable."}