{"title":"          Sr iOS Developer NEW!        ","location":"","salary":"","term":"Contractor","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAJYhF97xgMtT2AvNwvd1SsyFCM3J9hQ2-SbSVyyZN-3t0ST3AEXwbV1FvLJxpDZAbn9aYnSQowyAw6FeiLV3TjFpXolcEtqdVLjGPW7OKrb4W0mAK-CGCaxfqFkNJ5P4czcCNVfOXekEiS6RHm7JYmOTGf11zEaQj_55YRj4d_A8ZR6jBrUTvQI39jNSu0","source":"ziprecruiter","full_description":"\n        Duration: 6 months to startWork location: San Francisco (remote until the virus restriction has been lifted/then you would onsite in downtown SF)*Must be local to Northern California Seeking a Sr iOS developer for full stack native mobile and/or responsive mobile solution. Will lead a team of native developers through product development and maintenance, working as a member of mobile scrum team to review the product backlog/epics/user stories, develop the system design/prototype and software solution delivery by leveraging various in-house and vendor solutions. In-depth knowledge and expertise with mobile development (iOS, Android and Hybrid) best practices, rich expertise of multi-device solution implementation will be necessary to succeed in this role. Experienced in architecting high quality scalable maintainable mobile native and hybrid application.Duties:-Establish and maintain strong partnership with the business owners/product owners.-Work with Business Owners/Product Owners and system leads (including vendor solutions) to logically design and negotiate solutions and participate in the long-term planning for products.-Ensures commitments are met while providing high quality and cost-effective systems that meet customer’s expectations.-Full stack hand-on mobile development for native mobile app design and implementation (iOS and Android), including system analysis, test driven application development, test automation, code review and application maintenance support.-Adapt Digital Agile approach and work with mobile vendor to implement the mobile solution.-Drive the architecture and technology choices that enable a world-class user experience.-Code and ship complex new mobile features and apps at high velocity and high quality with well-structured code.-Keeping up to date on new technology, standards, protocols and tools in areas relevant to rapid changing digital environment.-Work with the application support team and external vendors to ensure all applications are supported according to their SLAs.-Troubleshoot debug, and fix issues in production and non-production environments.-Hands on development experience and full understanding of mobile app development pipeline and process including development of applications that interface with hardware accessories.-Lead and mentor junior mobile developer.Skills/Exp:-Master’s or bachelor’s degree in engineering, computer science or a related technical field.-10yrs+ direct exp. in mobile solution design and implementation.-Experience in Native Mobile app development (Android, iOS); hands-on Java RX and/or Swift/Object-C and/or React Native code.-Exp. using React/JavaScript to build front-end web or native application exp.-Act as subject matter expert for iOS/Android development.-Hands on development exp. with cross platform display and performance optimization.-Exp. in test-driven development and test automation.-Attention to detail, carefully crafting both tests and code.-Code and ship complex new mobile features and apps at high velocity and high quality with well-structured code.-Troubleshoot debug, and fix issues in production and non-production environments.-Proficient in Agile and SCRUM practices.-Backend web service and API knowledge.-Organization skill and ability to multi-task.-Willingness to learn new technology.\n      "}