{"title":"Manufacturing Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALbOfNcmQzFLpxQAJsG0jKcBsgxaSi6dUvMIjBwVh_g9fLkbdyyLC-O2Bg7rNrE_mU2itecUd9ZBraXhUob89iBpYmJaXkHe6efhkQqAUyMa3DjdkwATIcl8OsU_JvCdSL9oMVJnWJMkb2tncwApgaSxIoz-hE8kjf4ynNIsipv5M4pQJAQH40Wd6chjlw","source":"ziprecruiter","full_description":"Danaher Company DescriptionAt Cepheid, we are passionate about improving healthcare through faster, more accurate diagnostic tests. With our GeneXpert System, we've taken the most sophisticated molecular technology and packaged it into an automated, easy-to-use format that has quickly become the platform of choice worldwide. From the largest laboratories to small physician offices, our game-changing solution delivers critical answers when clinicians and patients need them most. Through strong molecular biology capabilities and ongoing product innovation, we are focused on developing tests for healthcare-associated infections, sexual health, critical infectious disease, virology, and oncology applications. Come join our vision for abetter wayand help make life better for us all! For more details, visit us atwww.cepheid.comor follow us on Twitter (@CepheidNews).**Description***JOB SUMMARY:The Manufacturing Chemist is responsible for the manufacturing of proprietary chemical reagents used in oligonucleotide production in large scale under GMP compliance. The successful candidate will have demonstrated knowledge of chemistry and organic synthetic procedures. Process optimization work will be included in the job responsibilities, working closely with the Research & Development team as needed.ESSENTIAL JOB RESPONSIBILITIES:**_ _* Work on multi-step synthetic chemistry methods to manufacture proprietary dyes, quenchers, nucleosides and intermediates under GMP compliance. Work on process optimization, auto purification (ISCO or Biotage System) and scale up of reagents. Sustain the regular production of proprietary reagents in large scale following established SOPs, and manufacturing batch records. Conduct analytical testing of manufactured reagents using HPLC, LCMS, UV and NMR techniques. Additional responsibilities also include sustaining the production of solid supports (CPGs and polystyrenes for use Oligo synthesis) to comply with established SOPs. Ensure and adhere to GMP compliance and maintain a clean/ traceable work environment. Participate in maintenance of laboratory equipment. Participate in Process Transfer activities, revision of manufacturing documents as required. Work with QA to address NCR, PDR and production level changes.**Qualification***MINIMUM REQUIREMENTS:Education or Experience (in years):  * BS degree in Chemistry or Chemistry Engineering. A minimum of two years of direct related experience in chemistry manufacturing or R&D.*Knowledge and skills: ** * Ability to follow established SOPs, worksheets and general knowledge of GMP guidelines. Practicing good safety alert and maintaining safe working environment. Strict adherence to the Personal Protective Devices and equipment policy. Practical knowledge of analytical equipment such as UV, NMR, HPLC and LCMS. Proficiency in handling of various chemicals and performing chemical reactions in large scale (5-22L flasks). Ability to work under GMP guidelines and maintain a clean working environment. Excellent oral and written communication skills. General training and awareness of chemical safety practices.*Physical requirements/abilities: ** * Ability to work in an office and chemical laboratory environmentPREFERRED REQUIREMENTS: Synthetic experience in heterocyclic compounds, dyes and nucleosides is a plus.This description represents typical elements, criteria and general work performed. They are not intended to be an exhaustive list of all responsibilities, duties, and skills for this job.Danaher Corporation OverviewDanaher is a global science & technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&P 500 by more than 1,200% over 20 years.At Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We're innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you'll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.Organization: CepheidJob Function: SciencePrimary Location: North America-North America-United States-WA-BothellSchedule: Full-timeReq ID: CEP002556Cepheid is an equal opportunity employer and strictly prohibits unlawful discrimination based upon an individual's race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, mental/physical disability, medical condition, marital status, veteran status, or any other characteristic protected by law."}