{"title":"Legal Assistant 2 (Seattle) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK7NOC_oFYQ_lgvi7sEvk5IACZAI0yzKfsMY8lDfX55oIDBCIG5L6Ki3L-440aHEFw2mMJ9gqxS0kydZ-F4Lvc2xVCrdrJQJTzy350BIayNz9H2TSNkp2yaf-8ceQAFZAIs5N2m5ZHMLRvhO5IzzdPPWQBtd9HgUeNUVPaeBqqiQ3yvGyH4Ek1xOHylCiA","source":"ziprecruiter","full_description":"Description    Legal Assistant 2Office of Administrative HearingsSeattle Field OfficeNOTE:  The essential functions of this position require in-office work; therefore, this is not a full-time telework position.Note: The salary listed on this job announcement does not include the additional 5% King County Premium Pay that WA State employees who work in King County receive in addition to their base salary.  About the Agency:The Office of Administrative Hearings (OAH), established in 1981, offers the people of Washington a fair, independent hearing when they appeal a government agency action. Administrative Law Judges at OAH preside over administrative hearings, and decide cases about unemployment, food assistance, medical benefits, child support and more.  OAH conducts hearings for more than 20 state agencies, including the Employment Security Department, the Department of Social and Health Services, and the Health Care Authority. For more information about OAH, please visit our website at oah.wa.gov.Our mission: We independently resolve administrative disputes through accessible, fair, prompt processes and issue sound decisions.Our vision: OAH offers the people of Washington a convenient, easy to navigate system to request and receive fair and impartial hearings on their appeals of government actions. OAH is the preferred neutral forum for Washingtonians to resolve their disputes with state and local government agencies.Our values: Public service, respect, integrity, communications, employees. OAH Offers:Professional legal office setting.Work that is important and makes a difference in the community.In-house training and professional development opportunities.Comprehensive benefits package, including: retirement, medical, dental, long-term disability, life insurance, and more!The Opportunity:OAH is currently looking to hire a permanent Legal Assistant 2 (LA2) in our Seattle field office. Due to the essential functions of this position, the successful candidate will need to work in the office regularly; this is not a full-time telework position. Part-time telework may be approved based on business needs. This LA2 position contributes to the OAH mission by providing support services to the agency. This includes scheduling, case management, arranging for interpreters or court reporters as needed, order formatting and development, creating and processing case-related documents, transmittal of records, ensuring timely and proper service of legal documents, managing case documents, providing support to parties and ALJs, and data entry. This position prioritizes workload and works with other OAH employees and internal/external customers to ensure the agency meets its mission and goals.   Duties  The caseload that this LA2 position supports is the Public Assistance (PA) caseload, as well as providing back-up coverage for all other Seattle field office caseloads. Duties include, but are not limited to: Schedules cases: Schedule hearings and other case events, taking into consideration multiple scheduling conflicts, distributing cases evenly among ALJs, and ensuring that hearing can be conducted and have decisions issued timely according to caseload requirements.Work with agency representatives, attorneys, and ALJs to determine availability and possible scheduling conflicts.  Handle and process complex appeals, including analyzing information to determine the proper processes.Ensure each case party receives the necessary notices and documents both prior and after their hearing, according to caseload timelines dictated by the appropriate WAC or RCW.Plan, organize, and schedule workload, including assigning dockets to ALJs to ensure all deadlines are met.Make changes to scheduling and workflow processes in order to meet goals set by management.Coordinate coverage for ALJs when the assigned ALJ is unavailable.Case management: Processes requests from participants, parties, and ALJs.Track and organize incoming documents, and exercise independent judgment in reading documents received to assess the next appropriate action to be taken.Ensure all case information is accurate in PRISM and in all case files, and make appropriate and accurate case notes in PRISM to reflect current status of the case and case documents.Interpret office rules, WACs and RCWs for the caseload ensuring that all processes are followed and deadlines are met.Maintain constant, clear, and open communication with agency representatives, parties, attorneys, the Call Center and ALJs regarding case-related issues and scheduling changes.Provide continuance and postponement coordination for ALJs; process requests for continuance and requests for change of hearing type (in-person/telephone/ALJ by phone) by confirming that all parties agree to the change in date and/or type.Keep parties notified of the case status if ALJ is late or unavailable.Ensure that case files are prepared and complete prior to the hearing, with enough time for the ALJ to prepare for the hearing.Proof orders for punctuation, dates, headers/footers, names, etc., tracking errors and proofing data for ALJs.Assist LA3 in maintaining desk manual for assigned caseloads so that manuals are easy for back-up staff to use when needed.Notify Office Manager of potential high-profile cases where media attention is a possibility.Provide electronic copy of hearing recording upon request.Route all documents requiring ALJ's attention to the appropriate ALJ.Refer other miscellaneous documents requiring supervisory review to appropriate supervising ALJ or Division Chief.Accessibility to hearings: Coordinate in-person hearings when needed.Arrange and manage interpreters, court reporters, or note-takers as needed for hearing following guidelines put forth by OAH Headquarters. Ensure that all information is entered and updated accurately in PRISMCoordinate ADA accommodation requests with the agency ADA Coordinator.When needed, work with the Legal Assistant 3 (LA3) or Office Manager to set up safety and/or accessibility to OAH facilities.Process incoming / outgoing documents, faxes, portal documents, and file transmittals: Monitor mail, inboxes, faxes, and portals for incoming documents, ensuring that all incoming documents are accurately date-stamped.Print and transmit PA Board of Appeals case files according to agreed-upon schedule and timeline.Process portal documents.Process incoming mail and documents.Process and mail out outgoing notices, documents, and orders. Qualifications Option 1: A high school diploma or equivalent AND two years of experience in a legal environment supporting an attorney, Administrative Law Judge, Industrial Insurance Appeals Judge, review judge, or equivalent.Option 2: One year of experience as a Legal Assistant 1.Option 3: A two-year degree in Legal Secretary Studies, Paralegal Studies or related field AND one year of legal office experience.Option 4: A combination of four years of college education and/or relevant experience. Supplemental Information How to Apply: To begin the online application process, click the green \"Apply\" button at the top of this announcement on careers.wa.gov or governmentjobs.com. If you have not done so previously, you will need to set up an account. To be considered for this position you  must complete the supplemental questionnaire and include the following information in your online application: A letter of interest describing what interests you in this position and what makes you a viable and competitive candidate.A resume AND a completed online application profile that includes education and employment history.Please include a minimum of three professional referenceswith your application. A professional reference is defined as an individual who has either been paid to supervise your work or worked directly with you and can attest to your work performance, technical skills, and job competencies. If your references do not meet these criteria, please include non-related professionals, such as educators or other professional associates. OAH is an equal opportunity employer and does not discriminate on the basis of race, creed, color, national origin, sex, marital status, sexual orientation, gender identity diversity, age, honorably discharged veteran, veteran status, genetic information, or the presence of any sensory, mental or physical disability or the use of a trained guide dog ..."}