{"title":"          Systems Software Engineer         ","location":"","salary":"","term":"$140,000 to $170,000 AnnuallyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AALf5OJyq-8-PjP0SMI1SWsTVVi7cw2p1yvBnY-CXyhqLFjtaqDgJEWntNmD93zhHl0Gsvw_0rCTmi7_gYO4iLOZDPhLNnIry7xaa64Hrpjl3bqif3s5tvNsgaq4K7UeqHn7OYWbJLG0RVO39EpJDotFdSD1NsOKQPUU8H5vlCboB9G1TogHd7sHnvyFdoM","source":"ziprecruiter","full_description":"\n        Systems Software Engineer If you are an Expert Systems Software Engineer with strong embedded firmware and network-related product experience, please read on!Please note that this is a remote position.With locations around the world, we're a technology powerhouse on a mission to develop the next generation of cutting-edge, networking products and services for our customers! Due to explosive growth and increased demand for our products/services, we're looking to expand our team with talented, expert level systems software engineers with highly advanced C/C++ programming skills for embedded firmware.Top Reasons to Work with Us1. Recognized industry leader!2. Competitive base salary and benefits!3. Opportunity for professional growth!What You Need for this Position- 7+ years of embedded firmware engineering experience with C/C++- Strong background developing software including operating systems, routers, compilers, networks, databases, etc.- Heavy background with low-level devices and drivers- Expertise with Linux OS- Heavy networking product background- Experience assisting with multiple patents or prior software design solution deployment background- Bachelor's Degree in Computer Science, Information Systems, or equivalentBonus Points For:- Master's Degree in Computer Science, Information Systems, or equivalent- Previous experience working for Cisco, Juniper, Arista, Netgear, Qualcomm, Broadcom, or Intel- Systems/software architecture experienceWhat's In It for YouFor your hard work and dedication, you will be rewarded with a competitive base salary, RSUs and benefits including but not limited to:- Medical (HDHP + HSA, PPO, HMO, EPO, ACO options)- Dental- Vision- Life AD&D- 401(k) + Match- Flexible Spending Account (FSA)- Short Term and Long Term DisabilitySo, if you are an Expert Level Systems Software Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n      "}