{"title":"          Linux Software Developer NEW!        ","location":"","salary":"","term":"$90,000 to $100,000 AnnuallyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAJ3ITiQTHJWSzEfmP9PnEAm8RCBl8hShDHAGfUfLTQaha9mnM_CwgDH4behnlv9dSPlOy9jqkeBSYMb1nnj7NNBBJ3EI53xO7SiUxzoXZoMGJsRWXwjf3a_n54sxs1ukmSV4z_-EBKc603ER7OJcTmocvR_uA3N3YBnFKSDoR570jOxNvd4kB8SEBuZBSM","source":"ziprecruiter","full_description":"\n        Interactive On-net Operator Clearance Level: TS/SCI US Citizenship: Required Job Classification: Full Time Years of Experience: 5-7 years Education Level: Bachelor of Science Degree Position Description: We are looking for an experienced Interactive On-net Operator capable of supporting sophisticated cyber threat pursuit operations. The successful candidate shall be a skilled cyberspace problem solver, planner, and operator. Required Skills: - Graduate of the Remote Interactive Operator Training (RIOT) Course - Completion of a formal Cyberspace Warfare operations course or Undergraduate Cyberspace Training (17D/17S, 1B4X1, 14N, 1N4X1A courses or direct commercial or other Armed Services equivalents). - Three years of pen-testing experience within the last five years, and at least six years of technical analysis, military intelligence, DNI, SIGINT analysis and production, or similar experience - Experience in Cyberspace operations planning and Cyberspace Warfare operations focused on offensive and defensive Cyber operations - Strong understanding of system administration (Windows and *nix), analysis, and manipulation, including startup programs, system configuration files, common executable files, logging capabilities, etc - Proficiency in writing, editing, executing scripts on Windows and *nix systems. - Solid familiarity with networking analysis and manipulation, including network stack, ports, protocols, tunneling, routing concepts, firewalls, VPNs, proxy servers, and network mapping - Established knowledge of hacker and pen-testing methodologies such as host enumeration, exploitation, privilege escalation, persistence, and effects - Robust understanding of detection evasion (antivirus, IDS/IPS, and other personal security products) and other post-operation steps - Ability to assist in the development and adaptation of exploits for operating systems, applications, and services to fit operational needs Desired Skills: - Bachelor's or master's degree in Computer Science, Software Engineering, Cybersecurity, or related discipline from an accredited institution in addition to the required experience - Certifications such as SANS GXPN, GAWN, GPYC, GPEN; Offensive Security OSCP, OSWE, OSCE, OSEE; EC-Council CEH, APT, LPT; CompTIA PenTest+ or other similar technical certifications - Experience with Python, PowerShell, or other scripting language to automate operational requirements - Ability to develop and adapt exploits for operating systems, applications, and services\n      "}