{"title":"Mechanic B NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALyl9OIdL_KO_BCgJTOD-qboQ_5XoyMsEt_96qxx0Kn7cUN5pe0mMRYTCRFxGyj-i2pmC_NipnDmO8xd4y2128UT1B8ychXdIyeFjECXHl1w7568OuZ411xa5Hwvol93uXp9oL-ziWeYzWyG3sJcgFq37lX9v4HfOSonhDlDJ1hz-mpUtCM7EdRFBfMBZco","source":"ziprecruiter","full_description":"Mechanic B  Apply now Date: Feb 8, 2021 Location: Seattle, Washington, United States  #job-location.job-location-inline {display: inline;} Company:  Herc Rentals Req #:  21303Herc Rentals Inc. is a premier, full-service equipment rental firm - providing our customers the equipment, services and solutions they need to achieve optimal performance safely, efficiently and effectively. A pioneer of the equipment rental industry, Herc Rentals continues to evolve and grow through technological innovations, expanded product offerings and value-added services and consultative solutions to support its customers' projects.  With more than 55 years of equipment rental expertise, approximately 4,900 employees and approximately 270 company-operated locations across North America, Herc Rentals serves a broad range of end markets, including construction; industrial operations, refineries and petrochemical operations; governmental entities and contractors; disaster recovery and remediation; infrastructure; railroad operations; utilities; film, television, live entertainment and special event production; agricultural operations; and facilities management..   Short Description The purpose of the Heavy Equipment Mechanic B position within Herc Rentals is to utilize his/her mechanical expertise to support the needs of the branch in a professional, safe and timely manner. An individual in this position will work to keep all equipment in top running condition through an effective preventative maintenance program. This incumbent is a master technician and assumes a leadership role of product knowledge and standard of quality within the branch. He has mastered the operating standards of his facility, the region and corporation. Responsibilities Basic Understanding:Internal Combustion Engines (both gas and diesel)DC Electrical Systems 12, 24, 48 voltsPropane SystemsHydraulicsTrack EquipmentAerial EquipmentHeavy Trucks/Automotive Ability to diagnose and troubleshoot:Fuel SystemsElectrical SystemsHydraulic SystemsPropane SystemsYou will be responsible for repairs and general maintenance to all rental equipment, shop equipment and trucks in accordance with HERC quality and efficiency standards.    Requirements  Professional Experience  Educational Background  High School Diploma/GED  Conditions of Employment  Skills Ability to lift 50+ pounds Ability to operate large, heavy machinery Basic Understanding Internal Combustion Engines (both gas and diesel) Ability to handle assorted tools properly and safely  Our long-term strategy underscores the understanding that our success depends on the dedication and capability of our team members. We are focused on attracting, retaining and empowering talented and dedicated people to build the best team in the equipment rental industry. We also seek to build a team that reflects the variety of people, cultures and communities we interact with every day and to create an inclusive, productive environment in which all team members feel valued and respected.  Herc Rentals provides an excellent compensation and benefits package, which includes a competitive salary, retirement savings plan, tuition reimbursement, comprehensive medical, dental, vision care, life insurance coverage, paid vacation and holidays.   Herc does not discriminate in employment based on the basis of race, creed, color, religion, sex, age, disability, nationals origin, marital status, sexual orientation, citizenship status, political affiliation, parental status, military service, or other non-merit factors.Job Segment:  Mechanic, Maintenance Mechanic, Hydraulics, Agricultural, Manufacturing, Operations, Engineering, Agriculture  Apply now"}