{"title":"Technical Writer-Global Security Operation Center","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKCGtrGM-FfwYskmzohYHMcI4uZUba5Ylpyp16pDzheZ-KF0sMFe7XhhXdpnh0i4WuXluMA4vR8f1hxceEF9sXEDRc52GewWYL3fJJ27p8kOuW6HXIssOxvMySP9cCmnxR7NFmQL3HsN5ICbEz5PWcGuGINtH-o3Ed2UF2U9F7hnnSVCqjMlPNNRwXXQbNr","source":"ziprecruiter","full_description":"Overview At Allied Universal, we continue to build an inclusive, Be Phenomenal, culture that encourages, supports, and celebrates a diverse workplace. It fuels our innovation and connects us closer to our customers and the communities in which we serve. We are North America's leading security services provider with over 265,000 phenomenal employees protecting over 50,000 client sites.  There are countless examples of individuals who began their career as Security Professionals and today hold positions on our senior leadership team.  We offer medical, dental and vision coverage, life insurance, 401K, employee assistance programs, company discounts, perks and more for all full-time positions! Start your phenomenal career with Allied Universal today! Job Description Allied Universal is looking to hire a Technical Writer 85K/Year!  The Technical Writer role will support written programs, procedures, and information management for a global security team. This will be done through collaboration with subject matter experts to translate processes into clear, concise and structured documentation. The Technical Writer will both create documentation and edit contributed content from various teams. Job Title: Technical WriterDepartment: Amazon Corporate SecurityLocation: Seattle, WashingtonEmployment Type: Full Time The Technical Writer will support Amazon Corporate Security's GSOC. This is a full-time contracted position that is located in the South Lake Union district of Seattle. The writer will:Create and maintain documentation for internal and external teamsWork closely with operations leadership to ensure quality and accuracy of contentManage and maintain organizational knowledge and help pagesCommunicate with stakeholders, clients, product managers and other writers to create, develop and understand procedural contentNavigate through multiple platforms such as PowerDMS, SharePoint and various web based systemsAssist in managing document approvals and release through document management system A candidate should have: At least two (2) years' experience in writing and technical documentationBachelor's Degree in writing, English, communications, or another relevant fieldExperience writing, proofreading and editingExperience producing and organizing operational proceduresExperience meeting multiple deadlinesAbility to work under deadlines and to deliver in the midst of changes in project directionAbility to creatively overhaul and re-design projects or workflows to optimize comprehensionHigh level of competency with Microsoft Office SuitePreferable additional qualifications:Familiarity with security organizations and processesFamiliarity with incident management systems and incident manual documents Closing Allied Universal provides unparalleled service, systems and solutions to the people and business of our communities, and is North America's leading security services provider. With over 265,000 employees, Allied Universal delivers high-quality, tailored solutions, which allows clients to focus on their core business. For more information:  www.AUS.com. We proudly support the Veteran Jobs Mission, a group of over 200 companies that have committed to collectively hiring a total of one million military veterans. EOE/Minorities/Females/Vet/Disability Allied Universal Services is an Equal Opportunity Employer committed to hiring a diverse workforce. *CB-NW Requisition ID 2021-513365"}