{"title":"          Quality Engineer NEW!        ","location":"","salary":"","term":"$22 to $36 HourlyContractor","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAIVW8Wtgqa-4Utx30tF8C32SGoZuI1549VDOkKDdItjNnLTW34_D3eFeU6oq-3EeYTPbP4mQhd4as2d72ciIIw77QWm7kK4WRLkad6Gzevv_SeX1jI83cPG5fEkt_Eg9sYkg3qav8bL0fXttwkQNqEhthY8OfxHRPwsmWgCVhWqRAR22wQj6ihQk-0RY0k","source":"ziprecruiter","full_description":"\n        Contract to HIRE----------ESSENTIAL DUTIES AND RESPONSIBILITIESDevelops and implements methods for inspection, testing and evaluation. D vises sampling procedures and writes training material. Develops, documents, and disseminates written procedures, policies and programs for the implementation and administration of ISO 9000 and the Quality System. Compiles quality related data and analyzes and reacts to data as to what has troubleshooting potential to determine opportunities for improvement. Assists in implementation of QPS tools and/or trains employees in QA measurement techniques. Coordinates and performs ISO internal audits. Interprets and communicates procedures to manufacturing personnel. Reviews, tests and approves different processes and equipment, including high volume assembly and precision machining. Performs a variety of moderately complex tasks related to the inspection of testing of finished goods. Participates in continuous improvement processes, such as Kaizen and statistical engineering programs. Utilizes existing quality systems and participates in the development of new systems to identify product failure trends and to verify consistency of various design standards. Analyzes reports and returned products and recommends corrective action for procedural, product or process deficiencies. Through the use of statistical methods and data analysis, studies variation in product quality and assists the manufacturing area in understanding the nature and causes of production problems. Designs and installs QA process sampling systems, procedures, and statistical techniques. Designs or specifies inspection and testing mechanisms and equipment. Analyzes production limitation and standards. Recommends revision of specifications when indicated. Formulates or assists in formulating QA policies and procedures. Analyzes shop related processes and recommends improvements as necessary. Perform other duties as assigned.Requirements:BS: Engineering or related field Five or more years of work experience, including Quality Assurance program in a manufacturing environment. The site will consider candidates with a technical trade school degree with 2-3 years of Engineering/Quality experience.Comprehensive knowledge of the QA field to include knowledge of ISO Standards, quality control procedures and techniques, manufacturing techniques and practices.Looking for candidates to have some programming and data mining experience. No specific software experience is required.Understanding of continuous improvement and lean manufacturing concepts. Ability to conduct process capabilities studies, SPC and other quality assurance engineering studies.Proficient in the use of computers and office equipment-MS OfficeExcellent verbal and written communication/language skills required to include the ability to provide written and verbal instructions, compile and present business reports/correspondence, and present information clearly.Excellent analytical and reasoning ability for solving problems and good judgment for decision-making.Capable of planning and organizing work and processes; ability to self-direct multiple projects and meet deadlines.Ability to cooperate and interpersonal skills to work effectively as a team member.Quality orientation.Motivation to provide excellent internal and external customer service\n      "}