{"title":"          Accounting Assistant         ","location":"","salary":"","term":"$22 HourlyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AALq8dlNlZArFlsHHj6p9AZ_gXyNZuywCCN2Gfpy6wl1W4x3mC8CnJY7TRMe1mpJPCaaeJ5T8GLFd4zmynxeliwsvtPSKCa3FS1-neWYjFV5lz5ntNme_rpx3fmrdEvnTAaswAwHFhH2xSrNWsCRTSJEaRn3-690e4kAsNqpvkolGtNPfqK2oBMvihPGkQ","source":"ziprecruiter","full_description":"\n        Our client, an established and mid-sized business management firm located in Woodland Hills seeks to hire an Accounting Assistant to join their professional and friendly team. This person will be responsible for supporting the account managers handling accounting activities to include accounts payable and receivable, payroll, general ledger, and account reconciliations.This is a full-time direct hire position offering full benefits and opportunity for growth. The position is onsite for the first 90 days with the potential to WFH thereafter during the pandemic. Their office follows strict Covid protocols with no more than 25% of employees onsite at any time with masks required onsite.Primary responsibilities:Assist in verifying and entering details of transactions as they occur in accounting software.Assist in maintaining the bills and receipts as a ready reference for any transaction recorded.Assist in preparing appropriate schedules and reports as requested.Assist in preparing and recording payroll.Assist in preparing annual information returns such as 1099’s, business license, etc.Prepare bank reconciliations monthly.Research account payable and accounts receivable issues as needed.Prepare quarterly earnings reports for various guilds – WGA, DGA, etc.Prepare medical/dental insurance submissions and reconcile with explanation of benefits.Communicate with Account Managers and Department Manager daily workload and schedule.Other duties as assigned.Education and experience:Minimum of a high school education with emphasis on business math, bookkeeping and accounting.Ability to operate calculator, computer and other general office equipment.Ability to professionally communicate verbally and in writing.Proficiency w/ Microsoft Office365.Comfortable with accounting software or comfortable learning accounting softwareExcellent attention to detail.Works with confidential firm and personnel matters, requires ability to keep matters confidential.Equal Opportunity Employer considering qualified candidates in accordance with state and federal laws, including those with criminal histories, in a manner consistent with the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.\n      "}