{"title":"Software Engineer - Audio NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALjIdpW6QW0x6K382fozD_GaTuB_uncgWJR4hOyCDz_bDn1ULilb2SOyQ7bg3KNkBtdKFR7w3xIktXi_psYsS8UR-BDSPMKpE1DKu-Vf1exAk82bTBF_tOf14YA08_1QODVxrwvUWV2JhqAISSuOzZ4_NxbKLY7JK4VSZp1CvZNJ6MYdIhi1MbURhl4peQp","source":"ziprecruiter","full_description":"Software Engineer Responsibilities: + Utilize strong coding skills in C/C+++ Generate automated unit, regression and integration tests+ Write clean, high performance, maintainable code+ Develop and maintain 8x8's shared VoIP client software stack (C/C++ code) for Windows, Mac OSX, iOS and Android+ Develop and maintain 8x8's Media-Relay Server and RTP Media-Server products+ Become intimately familiar with 8x8's VoIP client and media-server codebases Required Skills: + Strong proficiency in C/C+++ 5+ years experience in C+ Thorough knowledge of the standard libraries (ISO/ANSI)+ Strong experience/knowledge of low-level threading primitives and developing real-time multi-threaded environments+ Strong knowledge of working with TCP/IP sockets (BSD/WinSock)+ Windows core audio development experience (WASAPI) Good to have: + Working knowledge of audio processing algorithmsABOUT 8x88x8, Inc. (NYSE: EGHT) is the trusted provider of secure and reliable enterprise cloud communications solutions to more than 45,000 businesses operating in over 100 countries across six continents. 8x8's out-of-the-box cloud solutions replace traditional on-premises PBX hardware and software-based systems with a flexible and scalable Software as a Service (SaaS) alternative, encompassing cloud business phone service, contact center solutions, and conferencing. In today's competitive market 8x8 continues to deliver service excellence, with a consistent, innovative, cohesive, progressive and dynamic culture.For additional information, visit www.8x8.com, www.8x8.com/UK or connect with 8x8 on LinkedIn,Twitter, Google+ and Facebook 8x8 is proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. For 8x8 jobs located in the US: 8x8 participates in the E-Verify program. View the Participant Poster in English | Espanol. View the Right to Work Poster in English | Espanol. Requisition Number: 2018-4375 Street: 2125 O'Nel Drive"}