{"title":"Analytical Chemist I NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKdNDTR6odiTL71T6AiOsjoWPOOEUGgwXTNz84onPwx43ZHDk7WzFlzHx8ui2AqfUnBv79IfRvLWsSydgDhYX8gCvZGifu0Pw76EcxqRtjp690ZOd4TTQmHmMYKQd3nnU9UdkqFCg6YKrgClD6-KbluZzqUeH7bBFUyx2nbyoZe3h6ZBr3vGGSWuOh1RKpa","source":"ziprecruiter","full_description":"Analytical Chemist I in Parsippany-Troy Hills, NJ at APEX Systems Date Posted: 1/11/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: Parsippany-Troy Hills, NJ + Job Type:Other + Experience:Up to 6 year(s) + Date Posted:1/11/2019Job DescriptionJob #: 928257 Apex Systems is looking for a Chemist in the Parsippany, NJ area! DUTIES + Working with some supervision, applies established knowledge of laboratory techniques such as HPLC, dissolution, moisture by KF, GC, TLC, and others to perform pharmaceutical product stability testing. + Candidate will be responsible for understanding and performing routine analytical testing for stability samples, evaluating and documenting results in a timely manner. + Understands and follows all SOPs and written test procedures. + Performs testing within established standard test times and maintains quality and productivity at acceptable levels as communicated by the supervisor. + Candidate will execute troubleshooting of instrumentation and will be expected to maintain laboratory equipment in good working condition. + Candidate will perform laboratory investigation steps with appropriate approvals and with guidance from supervisor. + Candidate will understand the investigation process and begin to assist in preparation of laboratory investigation documents. + Keeps supervisor fully informed of all results and project status on a daily basis and reports critical information in a timely manner. + Should have some ability to multi-task. + Will be expected to perform other tasks as assigned by the supervisor (e.g. assist other colleagues with laboratory investigations, training of other analysts as assigned.QUALIFICATIONS: + 3 - 6 yrs relevant experience with Bachelor's Degree, 5+ yrs with Associate's Degree; + Good working knowledge of dissolution and chromatographic techniques, especially HPLC, is necessary and a requirement. + Working knowledge of both computer and/or data handling acquisition systems is necessary and required. + Candidate must have good oral and written communication skills. + cGMP experience is required. + Previous pharmaceutical, quality control / stability experience preferred.***For immediate consideration, please email your updated resume to ljohnson@apexsytems.com with 'Chemist - Parsippany' in the subject line*** EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}