{"title":"Technical Writing Manager NEW!","location":"","salary":"","description":"","term":"$80,000 to $100,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIhk30eXU_Q-dN-JUMAgXeCGcaWQxjKKkTu8Xo32kSBEinpVe50iOzHLZQb4aGTGASioO0BMtRvFozXIS_jHMDwp1IJQ3ePXpyRkOon2GKKrTzkARZmYAv3A6uv0poLU2DOt9CWXU-qfaV0uKE_Q7QM-OK7Jy4IhGDoew5gG0GGm556ynP_LkcOlNOr-Dc","source":"ziprecruiter","full_description":"Technical Writing Manager Job Title: Technical Writing ManagerBased In: Bulverde, TXQualifications: MadCap Flare, Adobe FrameMakerSalary: $80-100k, Full Benefits, 401k, etc.We are a global provider of enterprise data encryption solutions. More than 15,000 customers depend on our innovative technology for secure encryption and transmission of sensitive data. We're looking for a Technical Writing Manager who is passionate about learning new skills and concepts and wants to learn about cutting-edge technology.Top Reasons to Work with Us- One of San Antonio's \"Best Places to work\" for nine straight years- Competitive compensation plus benefits, perks, amenities- Great company culture and room for growthWhat You Will Be Doing- Maintaining technical documentation, including user guides and product training materials.- Enhancing our existing documentation to provide greater value to our customers.- Expanding the usage of our products and reduce their reliance on our technical support team.- Resource planning to ensure we meet customer expectations for documentation relating to new hardware, firmware, and application releases.- Enhancing our existing technical documentation infrastructure to make it more efficient.- Identifying new ways to improve the customer experience as it relates to their integration and operation of our products and services.What You Need for this Position5+ years of experience with:- Technical Writing- Enterprise B2B Technology3+ years of experience with:- MadCap Flare- Adobe FrameMakerWhat's In It for You- Vacation/PTO- Medical- Dental- Vision- 401kSo, if you are a Technical Writing Manager with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}