{"title":"Systems Engineer (VMWare/ESXi/Backup)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI5_stPHCBI-HZldVDc4vo5UNwGQPtwiRFqa-BIedB62gAkghDrD-CimuD6PFOuXVspiMPlaIGKNPbv5n890VF_cBm6gk552qTArr2HxYIOvOEM4Cf8NqaZTm6QhlXzDGss9ugFGJgyIlTDZJhD9_3ngvb7VZNQgN8dn--1cefl2Z9D-JgvkzhD1Oz5D55q","source":"ziprecruiter","full_description":"Company Description Large client Job Description Overall administrative responsibility for the corporate facility operations including servers, storage, backup methodology, messaging, business continuity, etc.Engineers technical solutions to meet corporate systems infrastructure needs and audit/compliance requirements, maintains vendor relationships, coordinates hardware proposals and acquisitions and oversees and performs equipment installation, testing and ongoing maintenance.Evaluate the companyas infrastructure and needs holistically and recommend, design and implement solutions that provide the best value to the business.Provide technical mentorship and leadership to other members of the team.Investigates and resolves software and hardware problems of computer users by performing the following duties. Qualifications Essential Duties and ResponsibilitiesOther duties may be assigned.Works within and adheres to CACTUS Software network design and security, testing and documentation standards, including Change Control documentation.Works closely with Director of Infrastructure, Network Engineer, Manager of Application Development, Manager of Business Intelligence, and IT Project Management to collect and analyze systems infrastructure project requirements, and develop detailed project specifications.Also works to provide systems and services to support corporate software solutions. Assists Network Engineer to complete network infrastructure project initiatives.Designs, implements, upgrades, monitors, and maintains key systems including but not limited to;servers, SAN, VMware infrastructure, UPS, backup system, MS Active Directory, anti-virus,web/email security appliance, Cloud Services, etc.Experience and/or knowledge in the implementation and support of Cloud Services, such as Azure, AWS, Private Cloud or Hybrid Cloud.Is responsible for designing and administering all corporate data backup and business continuity processes.Continually researches technologies and trends related to corporate facility operations and makesstrategic recommendations related to corporate data center technology (servers, SAN, VMware,backup, etc.). Consults with external resources to obtain engineering proposals, pricing, etc.Provides software and hardware evaluation and recommendations for management review.Writes and maintains documentation related to corporate facility operations, policies and procedures.Provides technical assistance by responding to inquiries regarding errors, problems, or questions with systems and services. Handles problem recognition, research, isolation, resolution and follow-up for complex problems escalated from Technical Support.Analyzes, installs, and tests upgrades of externally developed application programs including firmware updates, security releases, etc.Requirements Extensive experience with VMware ESXi required Extensive experience with Microsoft Windows Server required Experience with Nimble storage systems desirable Experience with Veeam Backup and Recovery highly desirable Experience with VMware Orchestrator desirable Experience with Microsoft Active Directory is desirable Supervisory Responsibilities This position does not currently have direct supervisory responsibilities.Qualifications To perform this job successfully an individual must be able to perform each essential dutysatisfactorily. The requirements listed are representative of the knowledge, skill, and/or abilityrequired. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Education, Experience, CertificationsBachelor's degree from a four-year college or university preferred; or a minimum of eight years related experience and/or training, Microsoft MCSE, Microsoft MCSA, and VMware certification highly desirable or equivalent combination of education and experience. Any related security certifications or network infrastructure experience is a plus. Additional Information All your information will be kept confidential according to EEO guidelines.Qualifications: Essential Duties and Responsibilities Other duties may be assigned. Works within and adheres to CACTUS Software network design and security, testing and documentation standards, including Change Control documentation. Works closely with Director of Infrastructure, Network Engineer, Manager of Application Development, Manager of Business Intelligence, and IT Project Management to collect and analyze systems infrastructure project requirements, and develop detailed project specifications. Also works to provide systems and services to support corporate software solutions. Assists Network Engineer to complete network infrastructure project initiatives. Designs, implements, upgrades, monitors, and maintains key systems including but not limited to;servers, SAN, VMware infrastructure, UPS, backup system, MS Active Directory, anti-virus,web/email security appliance, Cloud Services, etc. Experience and/or knowledge in the implementation and support of Cloud Services, such as Azure, AWS, Private Cloud or Hybrid Cloud. Is responsible for designing and administering all corporate data backup and business continuity processes. Continually researches technologies and trends related to corporate facility operations and makesstrategic recommendations related to corporate data center technology (servers, SAN, VMware,backup, etc.). Consults with external resources to obtain engineering proposals, pricing, etc.Provides software and hardware evaluation and recommendations for management review. Writes and maintains documentation related to corporate facility operations, policies and procedures. Provides technical assistance by responding to inquiries regarding errors, problems, or questions with systems and services. Handles problem recognition, research, isolation, resolution and follow-up for complex problems escalated from Technical Support. Analyzes, installs, and tests upgrades of externally developed application programs including firmware updates, security releases, etc. Requirements Extensive experience with VMware ESXi required Extensive experience with Microsoft Windows Server required Experience with Nimble storage systems desirable Experience with Veeam Backup and Recovery highly desirable Experience with VMware Orchestrator desirable Experience with Microsoft Active Directory is desirable Supervisory Responsibilities This position does not currently have direct supervisory responsibilities. Qualifications To perform this job successfully an individual must be able to perform each essential dutysatisfactorily. The requirements listed are representative of the knowledge, skill, and/or abilityrequired. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Education, Experience, Certifications Bachelor's degree from a four-year college or university preferred; or a minimum of eight years related experience and/or training, Microsoft MCSE, Microsoft MCSA, and VMware certification highly desirable or equivalent combination of education and experience. Any related security certifications or network infrastructure experience is a plus.Responsibilities: Overall administrative responsibility for the corporate facility operations including servers, storage, backup methodology, messaging, business continuity, etc. Engineers technical solutions to meet corporate systems infrastructure needs and audit/compliance requirements, maintains vendor relationships, coordinates hardware proposals and acquisitions and oversees and performs equipment installation, testing and ongoing maintenance. Evaluate the companyas infrastructure and needs holistically and recommend, design and implement solutions that provide the best value to the business. Provide technical mentorship and leadership to other members of the team. Investigates and resolves software and hardware problems of computer users by performing the following duties."}