{"title":"Data Science Software Developer II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJgx7eU9llKRmYKfbBxYFXZ4mICkOmj23a9W7H4ho6nooE9xMQvrcOJapLho-DzCLaAYCJRzv7xIbtG_n73gRcP0YfazdCYBEpT1jcQd4waLLUFW_Vwu2d1iAhvBeoqVMrjRVhIMQ827k4KD8O8f0bGKka3XDT2OXBjO9JBYQxTEuKsleXkKxBh84xqQg","source":"ziprecruiter","full_description":"Data Science Software Developer II - 80786Data Science - USA New York, New York  Nielsen Media is the global leader in measuring what people watch and listen to on TV, Digital and Audio in a changing media landscape. Data Science is essential to Nielsen's mission. We offer a fast-paced environment for methodology and software development in a team of world-class computer scientists, statisticians, data scientists, and behavioral methodologists.What would make me a great candidate?You enjoy bridging the fields of data science and software development. You're equally excited about building models at scale and writing production-ready software that can run in the cloud. You understand machine learning and know how to implement best software development practices across a team. You're intellectually curious and prepared to learn from your peers, just as you are comfortable educating your colleagues in software development and testing standards.What will I do?Plan, design, develop, test, and maintain data-science applications in Python and SparkOperate in Agile framework with cross-functional accountabilitiesManage large databasesConfigure software to run in the cloudProductionalize machine-learning algorithmsOptimize structural design and appraise the performance and consistency of developed applications' designsEvaluate, test, troubleshoot, promote and develop maintenance procedures and enhancements for live applicationsProvide technical support to end usersAddress critical bug/issues in a timely mannerIs this for me?3-5 years experienceProficiency in Python, Spark, SQLStrong understanding of object-oriented programmingSkill for writing reusable Python librariesAbility to design scalable modules for machine learning and statistical applicationsFamiliarity with various design and architectural patternsProficiency in Airflow and DockerUnderstanding fundamental design principles behind a scalable applicationExperience in implementing automated testing platforms and unit testsProficiency in Git and code versioning tools (Gitlab)Experience with Agile Scrum methodologiesFamiliarity with continuous integration/continuous developmentFamiliarity with cloud computing (AWS preferred)Degree in computer science, engineering, or data scienceExperience with APIsStrength in code documentation Business Skills:Excellent oral and written communicationSelf-motivation and an ability to handle multiple competing priorities in a fast-paced environmentStrong interpersonal skills and the ability to develop effective relationships with other team members#LI-MJ1ABOUT NIELSENAs the arbiter of truth, Nielsen Global Media fuels the media industry with unbiased, reliable data about what people watch and listen to. To discover what’s true, we measure across all channels and platforms⁠—from podcasts to streaming TV to social media. And when companies and advertisers are armed with the truth, they have a deeper understanding of their audiences and can accelerate growth. Do you want to move the industry forward with Nielsen? Our people are the driving force. Your thoughts, ideas and expertise can propel us forward. Whether you have fresh thinking around maximizing a new technology or you see a gap in the market, we are here to listen and take action. Our team is made strong by a diversity of thoughts, experiences, skills, and backgrounds. You’ll enjoy working with smart, fun, curious colleagues, who are passionate about their work. Come be part of a team that motivates you to do your best work!  Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.Job Type: Regular Primary Location:  New York,New York Secondary Locations: , , , Travel:  No"}