{"title":"Senior Environmental Chemist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKF6AYWxCsJbGgZgbtzZJZsgxQ48qtq855qsM3ob4agUOUFpdG3KkDg4Mgo7DZTFN6GliO08gkIe1TSNVuwengI54-gcCEeEwOtws5AbiavNnXAdIEgQ48UYYaZICvmIoFVG_1IDuyx3sqwZAwQ0jwBe3OH187nwzaKUhTIVNYYrjqjhQgKoYpUFswQpfY","source":"ziprecruiter","full_description":"Senior Environmental Chemist Edmonds, WA (http://maps.google.com/maps?q=115+2ND+AVENUE,+N.+Edmonds+WA+98020) ApplyDescription NewFields is seeking aSenior Environmental Chemistto join our hardworking and innovative team of scientists and engineers who can contribute to growing the Sediment Management & Marine Sciences Practice in the Edmonds, WA office. The appropriate candidate has a strong chemistry background and can support a team of specialists across several disciplines (e.g., chemistry, biology, sediments, oceanography) working for public and private sector clients. You will play a lead role in building new client relationships, enhancing existing client relationships, planning and scoping new projects, and ensuring our work is executed with the highest standards. Reporting to the NewFields Sediment Management & Marine Sciences Partners, the Senior Environmental Chemist will collaborate closely with the rest of our science and engineering team, as well as our 17 other NewFields office locations. You will be ready to tackle any complex issues thrown your way, while maintaining a positive attitude and an eye towards the future of the business. Status: Full-timeClassification: ExemptLocation: Edmonds, WACompensation:$80k + annually; BOE About Us: + NewFields is an environmental, engineering, and construction management consulting ?rm, with approximately 350 employees and 17 offices around the world. We provide access to a global network of recognized experts and professionals who work together to resolve our clients' complex business needs. Our corporate office is located in Atlanta, GA. Our Edmonds, WA office is in the heart of downtown Edmonds within easy walking distance to several restaurants, coffee shops, and retail stores. We are a short walk to the ferry terminal and Brackett's Landing Beach Park.Requirements Education Requirement: Master's or Doctorate's degree in chemistry or a relevant physical science (e.g., environmental or marine sciences, oceanography, biology).Experience:A minimum of eight years' experience, including five years of consulting experience.Physical Demands:Position requires sitting/standing for long periods of time, extended hours working on a computer and lifting up to 30 pounds. Field assignments for this position requires the employee be able to work on small boats and large research vessels, supporting field investigations that can occur over extended periods. Field assignments can be in a variety of environments and cultures, including difficult and diverse climates. During field assignments, standing, squatting, bending, and lifting up to 30 pounds may be required over prolonged periods of time.Potential Travel:Travel to project sites located in the United States, and abroad. It is expected approximately 80-90% of work time will be spent within the home office of the individual.Work Location:NewFields supports our employee's ability to work from home (remotely) in response to state and local COVID-19 guidelines. As COVID-19 conditions improve and as state and local guidelines allow, it is anticipated that the candidate would report to the Edmonds, WA office, with an eventual transition to full-time attendance. Position Responsibilities: Project Management, Field Work, Client Deliverable Development - 70% + Provide support and/or supervision for environmental investigations/studies, including planning, implementation, analysis, interpretation, and reporting aspects.+ Manage large amounts of environmental data (primarily chemistry) using database management systems.+ Perform statistical and geospatial analysis on environmental data.+ Prepare accurate and professional technical reports including data assessment and evaluation in original text.+ Coordinate with laboratories for the analysis of environmental samples.+ Conduct field investigations related to marine and aquatic sediment quality, including working on boats and research vessels.+ Work independently, but also thrive in a team environment.+ Provide close communication with management and clients providing details of projects and schedules.+ Prioritize schedule to accomplish tasks for time sensitive deliverables.+ Support other Project Managers through application of various technical and writing skills to achieve established project-specific objectives.+ Participate in NewFields' projects acquired and managed by others, as needed.+ Preparing quality technical products under your supervision (or as assigned) on-time, measured by internal or external client satisfaction. Networking, Marketing, and Business Development - 30% + Participate in business development and marketing activities.+ Create, budget, design client proposals.+ Mentor staff.+ Interact with other NewFields' offices; promote cross-discipline collaboration. Core Competencies: Attention to Detail: accurate, patient, and methodical, without getting caught 'in the weeds.'Professional Competency: track record of career progression in the field, with a passion to help and support people.Resilience & Adaptability: ability to solve problems in the face of ambiguity and constant change. Bias for action.Trust & Respect: respect and inclusiveness. High openness to feedback, respect for the opinions and differences of others, and a tendency to always assume the positive intent of others.Interpersonal Strength: able to relate comfortably with people across levels, departments and geographies, actively engaging input, listening with empathy and concern, and driving collaborative outcomes.Business Insight: in-depth understanding of underlying business dynamics and organizational behaviors. Maintains an eye toward future policies, capabilities, and trends within the business. Communicates Effectively: effective in a variety of communication settings - one-on-one or group, written or verbal, formal or informal, among diverse styles and positions/levels. Delivers messages in clear, compelling, and thoughtful manner. Ethics & Integrity: Unquestionable integrity, credibility and character who has demonstrated high moral and ethical behavior. Benefits:NewFields believes that in order to attract and retain the best and brightest employees, we need to offer an outstanding benefits package. NewFields provides paid vacation, sick and parental leave, along with ten (10) paid holidays.+ Medical and Prescription Drug Coverage+ Health Savings Account (HSA)+ Telemedicine+ 401k & Roth + 401k Match+ Basic Life / Accidental Death & Dismemberment+ Long Term Care+ Short Term Disability (STD) Insurance+ Long Term Disability (LTD) Insurance+ Dental Insurance+ Vision InsuranceEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}