{"title":"Network Engineer IV NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI0o9DqgRr6_f1o6y1cUV0BK9dasBo3a4X2O-LLPfxM7O1ysucCUmKVG2u-10CVABhsikqGczaDHeztWK_eOyn90JtEYdy8q6SlQaaJrw4ol4rJGF-xrcYIT2rtwLSj9sDNsq_sh-HFO9_QRvMyCLWWfUbaDxnry9GQ5YYy_S6aOrOEKzLHryPT5U2VAQ","source":"ziprecruiter","full_description":"Business Title: Network Engineer IV Posting Location: United States - Colorado - Greenwood Village Posting Job Description: JOB SCOPECharter is proud to have a network that provides service to millions of users across the country. The NE IV leads in the planning, forecasting, implementation and identification of resource requirements for network systems of varying (moderate to high) complexity. Follows corporate standards, develops and implements network enhancements and makes recommendations for improvement. Responsible for implementation of approved network architecture and designs. Leads in staff development efforts.DUTIES AND RESPONSIBILITIESLeads in network planning, network architecture design and engineering.Integrates communication architectures, topologies, hardware, software, transmission and signaling links and protocols into complete network configurations.Evaluates new products, performs network problem resolution.Assists in the development and documentation of technical standards.Working with firewalls; ASA, SRX and on load balancing projects using F5 and A10.Implements approved methods of procedures and assists in designing corporate standards.Develop and implement network enhancements and makes recommendations for improvement.Works on projects/systems/issues of varying complexity surrounding network planning, configuration and optimization.Proactively and consistently support all efforts to simplify and enhance the customer experience.Provides tier support across organizations and acts as a mentor for junior staff.Work on one or more projects as a project team member, regularly as a project team lead.BASIC / MINIMUM QUALIFICATIONSBachelor's Degree in Computer Science, Electrical Engineering, or related field and / or equivalent work experienceMinimum four (4) years of Data network experience - Cisco and/or Juniper.ADDITIONAL JOB QUALIFICATIONSRouting/SwitchingAbility to produce MOPS and BOMSAdvanced knowledge of related industry specifications and standards IEEE, ANSI, Physical Media (Multimode Fiber, Singlemode Fiber, UTP, etc.), bridging, switching, routing, ethernet and transport technologies and protocolsExperience with network design, network architecture, protocols and network topologyTCP/IP and the OSI ModelAdvanced knowledge in using ticketing and software tools to support the current operationsExperience with network devices and basic network appliancesStrong experience with network designing software, such as VisioPREFERRED QUALIFICATIONS Cisco Certified Network Professional (CCNP or CCIP or CCIE)Industry and vendor specific certifications and training (Cisco, Juniper, Alcatel-Lucent, etc.)Requisition #: 275842BR Job Code: ENE312 Network Engineer IV Position Type: Full Time Area of Interest: Engineering, Information Technology, Network Engineering, Network Operations, Technical Operations Business Unit: Network Operations Location: 6175 S Willow Drive Suite 100, 110, 200, 300, 400, 500, 600, 700, 800, 900 FCC Unit: 13541 Account Code: V01-304-5000-532 Controlling Establishment ID: 01905 - Greenwood Village S Willow Dr. More on Spectrum: The health and safety of our employees and candidates is very important to us. Spectrum has adopted virtual mobile recruiting tools that allow us to continue meeting new candidates. We look forward to \"virtually\" meeting you.The Spectrum brands (including Spectrum Networks, Spectrum Enterprise and Spectrum Reach) are powered and innovated by Charter Communications. Charter Communications reaffirms its commitment to providing equal opportunities for employment and advancement to qualified employees and applicants. Individuals will be considered for positions for which they meet the minimum qualifications and are able to perform without regard to race, color, gender, age, religion, disability, national origin, veteran status, sexual orientation, gender identity, or any other basis protected by federal, state or local laws. Work State: Colorado Work City: Colorado - Greenwood Village Posting Job Title (Do Not Exceed 250 Characters): Network Engineer IV - Datacenter Operations Firewall Team Zip Code: 80111"}