{"title":"Android Engineer - Consumer Revenue","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJLjC324nkYGuBwnUWAQ88fWRq6Vuec2GL8aZyDPI8iHKFihrfzzBLDYYw8SqDgy3qEusSYISewc7QL9TKdHKcRUAikqNrHSpvQ8AmRWRZQiWIEF-X70wE5XkxOb1NDS98K22YGxcnWPPOvQmEB1AZqJBajuJzn6r_adee-HQ3XOOyOlN0LRQ9vFHeriHwv","source":"ziprecruiter","full_description":"Company DescriptionTwitter is one of the largest and most popular platforms in the world. Our code operates at massive scale and speed, serving billions of requests per day, connecting hundreds of millions of active Twitter users to real-time information about their lives and the world we live in.Our team loves using the latest mobile technologies and tools for making the highest quality and best performing mobile app on the planet. Our work is an integral part of Twitter's product vision and directly impacts the lives of our users and the success of our business. We are a collaborative and cross-disciplinary product development team.Job DescriptionAs part of the Mobile team you'll be responsible for bringing some of our core revenue products to Android and be part of guiding Twitter’s future revenue and platform growth, contributing to monetization of areas such as Home Timeline, Search, etc. You will use your in-depth knowledge of all things Android to craft new Twitter features that are uniquely Android-based.Additionally, millions of businesses, content creators, and media publishers use social media every day as a way to reach customers and grow their businesses. Be a core member of a team that builds custom features and solutions that enable consumers to connect with businesses and content creators on Twitter. Help them thrive on Twitter and drive commerce through public conversation.QualificationsQualifications3+ years experience developing mobile applications on AndroidExperience implementing new features and optimizing existing onesExperience in Kotlin, Java, or C++BS or MS in Computer Science or equivalent work experienceAdditional InformationWe are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.All your information will be kept confidential according to EEO guidelines."}