{"title":"Senior iOS Engineer - Ballpark App","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI8xGreFvJVACYPomJ6FV-EUOUpUnU--tSFIzScE__3TAT1vKbpvHdaW4nqWImZuCmO3xxq7hwGTmsvTPD0YiBGUhCPsbDhmWOi4aSwXq_H6JB2NpPiabHpKqYFEEsHXX2b1WII22NaUjkLcG7T-8EX3QqbmX5Yhw1dei9AdaVeskE4L--2bit8oY_2Q6I","source":"ziprecruiter","full_description":"MLB is looking for iOS Engineers for our MLB Ballpark team in Boulder. We are looking for developers that are passionate about working on some of the most popular sports applications available on a mobile device. Since its inception in 2001, the tech arm of Major League Baseball has been renowned for creating mobile experiences that baseball fans love - and we're just getting started! The MLB Ballpark app is your mobile companion when visiting your favorite Major League Baseball ballparks. The official MLB Ballpark app perfectly complements and personalizes your trip with access to your digital tickets, interactive maps, exclusive content, and mobile check-in for offers, rewards and personalized history.As an iOS Engineer on the Ballpark team your primary responsibilities will be to write clean, concise, modular code in an agile environment.You'll also:Use the latest Apple app development technologies including SwiftUI and ARKit.Incorporate cutting edge cloud technologies to support the app.Collaborate with a team of extraordinary engineers and technologists.Influence the innovation of products used by millions of users worldwide.Participate in the full lifecycle of software development (requirements gathering, designing, building, testing and maintenance).Help shape the way fans interact with baseball with machine learning, augmented reality, virtual reality, voice control, and more!Receive amazing benefits - you get 100% employer-paid Medical, Dental and Vision.You are:An expert developing Apple platform applicationsPassionate about testing all aspects of the applicationAn avid learner, independent with excellent problem-solving skillsPassionate about mentoring peer developers, providing code reviews, etcPassionate about iOS development! Whether you're a baseball fan or not, we hope you enjoy the challenge of solving complex problems and building products used by millions!  Why MLB?Major League Baseball (MLB) is the most historic of the major professional sports leagues in the United States and Canada. Employees love working at MLB because of the culture of growth, teamwork, and professionalism. Employees who are most successful at MLB take initiative, know how to identify problems and provide solutions, and always put the Team first. For those ready to step up to the plate and join the Major Leagues, MLB takes the same approach as teams do with their players: empowering our \"workforce athletes\" to be at their best by engineering experiences that put employees in the best position to succeed. Major League Baseball is looking for candidates who are passionate about growing America's pastime to best serve its fans for decades to come.MLB's vision is to be the global sport of choice for youth to play, fans of all backgrounds to enjoy and a desired destination for employment. With a belief that the journey to growth and greatness is ongoing, MLB gives employees the opportunity to continue learning and honing their skills with programs such as: tuition reimbursement; mentorship programs; lunch and learns; online course subscriptions; paid industry certifications; business resource groups; and more.MLB provides its employees with exceptional medical, dental, and vision coverage. Premiums are 100% employer covered to help employees focus on being their best!Are you ready to Step Up to the Plate? Apply below!"}