{"title":"Mechanic NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIaoP-8dfWXNj_EEKWYxcl-4ufnrOauelr09kUkzpp96-pA9m1QpEnYSmg60CXg5NNYd12Uk-fgiPDi5vPRj_nMX7tRs8FIgdGnWK_sWkUhF-vN_sP1CnQAPwQyL13ChmCBMPXXAUwnFWokFDhcV6XJW-OjlGPtn9yUDUfkkcrBnQqmPcRGe4nx_4cwyp1o","source":"ziprecruiter","full_description":"COMMERCIAL VEHICLE MECHANIC - Everett, WA Locally owned and operated in Whatcom County, Cowden Gravel & Ready Mix specializes in aggregate, concrete and trucking needs.  We have two fast paced, busy, on site shops in Bellingham, WA, where our mechanics work on all aspects of commercial diesel truck repairs and maintenance.  We recently opened our newest shop in Everett, WA in January 2020 and have a mechanic position available.  We are looking for a full-time Commercial Vehicle Mechanic to work day shift hours M-F, 6am - 4pm with overtime available.  This mechanic will perform lube, maintenance and repair work on 53' container chassis in our Everett, WA shop located at the rail yard in Everett.  This position will also go on road side calls either solo or along side another mechanic and perform repairs as a Mobil Repair Mechanic, as well as conduct work as a diesel truck mechanic, depending on experience.Serving Northwest Washington since 1945, Cowden is committed to providing quality products and genuine customer care. Top candidates for employment will be safe and courteous, skilled, dependable, enthusiastic, and willing to follow directions.To join our team, please submit a resume and/or application showing past employment history and relevant job skills. COMMERCIAL DIESEL TRUCK MECHANIC JOB DUTIES OVERVIEW (entry level mechanic will train in these areas)Perform routine services and maintenance (lube, oil change, 6/12/36 month services)Maintain, repair and lube chassisPerform vehicle inspections compliant with DOT regulations and complete corresponding paperworkDiagnose and troubleshoot mechanical issues with accuracy and in a timely mannerDevelop repair plan to ensure a complete, safe and timely repairPerform mechanical repairsNavigate electronic Parts System Database to locate and bill parts according to unit in repairComplete parts order request forms to include judgement calls on tagging out unitsMaintain an organized and clean work areaMust always be safety conscious, especially when using powered equipment, maneuvering equipment/vehicles, must warn others before performing repairs that will include loud noise, sparks or fumes. Wear eye and ear protection as required.Complete tasks as assigned by management QUALIFICATIONSAbility to read and create work orders in EnglishBasic to mid-level mechanical experience Knowledge of machines/tools used for repair and maintenance of diesel trucks and chassisTrade school training (preferred)CDL (a plus)Welding skills (a plus)Eligibility to work in the US BENEFITSCompetitive wages, DOEFull time (40-50 hrs/wk), Mon-FriHealthcare includes medical, dental, visionPTOPaid Holidays401K with employer matchBonusesDrug & Alcohol Free company Visit our website, www.cowdeninc.com, to learn more about our company and download our employment application. Resumes can be submitted to this post."}