{"title":"JS/VUE/HASURA Developer","location":"United States","salary":"\n\n$40 - $60 an hour\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>In the past this has involved everything from development of web applications to designing inventory tracking for smart refrigerators.</li>\n</ul>","term":1,"jk":"d3adcbffa70836ac","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=d3adcbffa70836ac","source":"indeed","full_description":"The JobOur most immediate need is for front-end engineers with ES6 Javascript/Typescript, Vue.js (2 & 3) and moderate CSS experience. We are servicing a contract with a Fortune 100 energy company among others.As an agency/consultancy we are standardizing our software stack around JAM and are looking for candidates who want to build digital products in this modern stack. Several green-field projects on the horizon, along with ample opportunities for both technical and people leadership.The CompanyIncyte Studios, LLC is a software development agency/consultancy. We help our customers realize their technical goals from planning to completion. In the past this has involved everything from development of web applications to designing inventory tracking for smart refrigerators.Incyte Studios was founded by a software developer, which means leadership focuses on generating new business instead of micromanaging developers. We'll keep you loaded to the brim with interesting work, give you the freedom and room to excel how you see fit, and offer mentorship to those seeking to learn from a team of veterans.The Soft SkillsThe right candidates for this job are more interested in shipping good product than debating dogma about languages. If you're more into talking about the right amount of test coverage than shipping something, this probably isn't the right fit.Job Types: Full-time, ContractPay: $40.00 - $60.00 per hourBenefits:401(k)401(k) matchingDental insuranceHealth insuranceSchedule:8 hour shiftDay shiftMonday to FridaySupplemental Pay:Bonus payExperience:JavaScript: 3 years (Required)TypeScript: 1 year (Preferred)Vue.js: 1 year (Preferred)Language:English (Required)Contract Length:More than 1 yearContract Renewal:LikelyFull Time Opportunity:YesWork Location:Fully RemoteThis Job Is:A job for which military experienced candidates are encouraged to applyOpen to applicants under 18 years old, provided it is legally allowed for the job and locationOpen to applicants who do not have a high school diploma/GEDOpen to applicants who do not have a college diplomaCompany's website:http://incyte-studios.comBenefit Conditions:Waiting period may applyWork Remotely:Yes, always"}