{"title":"3D Software Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK-wAn88AM6_jy9kWot2DygoE_aWWTbVBeCOiNPl2hOdzodLMGgBuxvNLhl-6mrQo3qingex6QAe62Leo0Odub4n9LqOOEym7MC1tTiKbWDwlA52QaYbpYFe_vWhIo4tBpj2xARBeDN2BqeZyDctL0CVlOWrHLb3kAtP1UdPjme06XcaKYGFWwFpU3NMdYX","source":"ziprecruiter","full_description":"At Anark our 3D Software Developer is responsible for the development of critical integrations with 3D CAD systems. This position works with a team of motivated engineers to plan software releases that adhere to customer requirements within business-acceptable timeframes.The ideal candidate will have experience developing 3D software on the Windows platform. Additional CAD specific knowledge/experience is very helpful.Required Knowledge and SkillsExperience with 3D data.Programming experience in one or more of C, C++, C#, C++/CLI, or similar languages such as Java.3D basic understanding of BREP and polygonal mesh data, scene graphs, DAGs, and transformation matrices.Desired Skills (Which combo do you bring?)Experience integrating with CAD software libraries.Experience with 3D and 2D graphics-oriented development.Experience using best-practices design/architectural patterns and loosely coupled component-based programming.Experience with agile development methodologies including Test Driven Development, and a propensity for refactoring code.Experience developing graphical authoring software tools.Experience using Microsoft Visual Studio and TFS.Basic knowledge of automated testing, such as writing unit tests.Experience with cloud technologies such as Azure or AWS.Experience in RabbitMQ or other messaging platforms.Soft SkillsGreat \"can-do\" attitude with a desire to learn and solve problems.Capable of managing deliverables on aggressive delivery schedules with a conscientious work ethic.Strong technical and communication skills—capable of garnering the respect of team members and associates within the company.Required EducationBS in Computer Science, Aerospace Engineering, Mechanical Engineering, Electrical Engineering, or equivalent.New graduates accepted with demonstrable relevant professional experience.CompanyAnark is a leading provider of intelligent information management (IIM) software and solutions for technical industry, enabling engineering, procurement, manufacturing, and field service organizations to publish and manage technical content, for access and collaboration workflows across the extended enterprise—yielding faster iterations, reduced material waste, and higher-quality products and services with substantial cost savings.Anark helps market leaders such as GE, Boeing, Lockheed Martin, Allison Transmission, Johnson & Johnson, Cisco, Ericsson, and TE Connectivity with their Digital Transformation, leveraging smart technical content to streamline procurement, manufacturing, and field service operations.Culture, Compensation, Citizenship and moreCome work in a cutting-edge, exciting, fun, energetic, friendly, and supportive work environment. Anark Corporation strives to be a \"change the world\" innovator. Anark offers a competitive salary, performance bonus plan, stock options, 401(k) retirement program with employer match, and a comprehensive and generous benefits program. This position requires either US citizenship or US permanent resident legal status. A background check will be performed on all qualified applicants prior to an offer for employment.Anark is a small but mighty locally owned Boulder, Colorado business. 15+ years in business with 15 years of F100 great clients! Within our inclusive environment, engineers \"have a say\" and the ability to work on a variety of challenging projects. We are building out our NextGen products in the enterprise, cloud-enabled and SaaS space. A great place to learn and grow as we offer a very open and collaborative atmosphere. Anark offers very competitive pay, our engineers starting base salary is 90,000 - 140,000 depending on skills, experience and the specific role. We also offer equity, bonus, 100% employer paid full medical benefits, learning and fitness perks and much more. Consider joining Anark if you are looking for a long-term career home where you can become a significant contributor."}