{"title":"Research Associate II/III Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ5V2fm898u-avcIE12Y6g-1Jc94obHWFTkJ-V_G9YxyWOvUQz0Nc_lx-0G1Ojcm0mueFJxK7b_-9MkICndsZ5auFd1j-soR3getQm8uBh_y50c7IHtgMeRg3z8OgfAwgQjYFTIF_VG_bpE8i_7-jasupMZugjPOGQu2wK5JqsFla0BR6rJmPBqcpjXi5A","source":"ziprecruiter","full_description":"Description Summary: We are seeking an experienced synthetic organic chemist to participate in research projects involving the synthesis of high potency cytotoxic agents and the development of new linker technologies for antibody-drug conjugates (ADCs) and related drug targeting modalities. This research will involve multi-step organic synthesis and will employ various purification and analytical techniques to enable structure determination and purity assessment. Activities may also include antibody conjugation, enzymatic assays, and stability assessments on compounds of interest.Requirements:Synthesis of novel payloads and drug-linkers to enable ADC technologiesStructural characterization of new drug-linkers and ADC payloadsCollaborate within the chemistry group and multi-disciplinary project teams to present data and develop new ideasSolve problems uncovered in the synthesis of new payloads and drug-linkers Required Qualifications:A bachelor's or master's degree in chemistry or related field1-5 years of research experience in organic chemistry, including multi-step organic synthesis, in either an academic or industry settingExperience with compound isolation and identification (flash chromatography, NMR, HPLC, MS, etc.)Effective written and oral communication skillsAbility to think critically, learn quickly and independently advance research projectsStrong work ethic, interpersonal skills, enthusiastic, and team player As the leading employer in our industry in the Pacific Northwest, Seagen is proud to offer a competitive total compensation package as well as a comprehensive benefits program designed to support the whole lives of our employees and their families. Benefits include medical, vision and dental coverage, group and supplemental life insurance, 401(k) with company match, tuition reimbursement, relocation assistance and much more. To learn more about Seagen, please visit www.seagen.com. Seagen is an equal opportunity employer. All qualified applications will receive consideration for employment without regard to race, age, gender identity, sexual orientation, color, religion, sex, marital status, national origin, protected veteran status, disability status, or any other status protected by federal, state, or local law. #LI-CM1"}