{"title":"Software Engineering, University Graduate","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALxmECYSB79UqveJ3x4Lb_YdzCIF847PODhPGiZ-R_ZQGoa88fvvpRnS3B2i6elKQGlKbSxvGqKksZt8TXIH3MyTdzcG2x9NI7oo9wH-uCRb8guOp5vYw9TmIPDPTQBrfg00h-MMUcNhTpNM-wHuzyLel5qd8MN69N7qY-s-XsXyZiS4S8JB6fDngdjH8_N","source":"ziprecruiter","full_description":"Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google's needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.Product and Systems DevelopmentWhether it's finding new and innovative ways to advance search quality, building computing platform and networking technologies, automating the indexing of videos, or continuing to refine and scale complex auction systems (just to name a few), you will be developing solutions to some of the most challenging technical problems out there. You will research, conceive and develop software applications to extend and improve on Google's product offerings and collaborate on scalability issues involving access to massive amounts of data and information. Examples of specialist domains: UI development with AJAX and similar technologies, security, embedded systems and mobile apps (Android and iOS), developer tools (IDEs, large-scale build systems, compilers).Engineering ProductivityAs a Software Engineer in the Engineering Productivity organization, you'll use your software design, analysis and programming skills to create innovative automated test systems. This isn't a job in which you'll simply debug and run test cases; in fact that only scratches the surface. The test team undertakes a broad range of challenges on a daily basis, designing and building intelligent systems that can explore various use cases and scenarios for distributed computing infrastructure. Just imagine trying to design and build an automated testing system for something that's never been done before.Site ReliabilitySoftware Engineers working in are involved in every facet of Google's production and work on the cutting edge of cloud-based computing. As a member of this team you are in the thick of everything involved with keeping Google running, from code-level troubleshooting of traffic anomalies to maintenance of our most cutting edge services; from monitoring and alerts to building new automation infrastructure. Software engineers on this team love to create robust and scalable software that scale to tens of millions of users. You will take on challenging, novel situations every day, and work with just about every other engineering and operations team to provide services and applications that are quintessentially Google - fast, reliable and accessible to all.Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another."}