{"title":"          ReactJS Software Developer         ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAIPzKO5BAJf2LSQ29Umu5CnwrfYspqcyoqW_pB6941LE89gdlRSsMyR67jYFLEEbHtR4q8pofCkwFtwWnV25jUuS5dVBePAvHxr7LEfmhuvvv0wsmoJ8I3uZaojFN2iWW_jqlGJ_EiFUQQ1udNJATIYkEeGtMR4WWUYaOXWDvjlQ4sEexa_mrXcQBMpV50","source":"ziprecruiter","full_description":"\n        ARGO is a leading provider of software and analytics solutions for both the financial services and healthcare industries. ARGO transforms business processes for financial service providers and healthcare organizations using proven business models and software innovation informed by real customer challenges, breakthrough technology, and rich analytics.ARGO is looking to add a ReactJS Developer to our Cloud based, banking software application development team.EDUCATIONAL REQUIREMENTS:A Bachelor’s degree in Management Information Systems (MIS), Computer Science (CS), Software Engineering (SE) or related technical field is required for the position.MINIMUM KNOWLEDGE, SKILLS, ABILITIES & PREFERENCES:Front end experience with ReactJS and/or AngularJS framework, including Redux stores experienceExperience with JavaScript, HTML, and CSSExperience working with remote data via REST, JSON, XML, AJAX and SOAP API’s3+ years of cumulative full life-cycle development of nTier web solutions including design, development, build, delivery to internal QA testers, and deployment to customersC# and .Net development experienceExperience working within Azure or AWS (cloud technologies)Experience with website application development for both greenfield and existing web applicationsExperience troubleshooting problems with web applications used by customers, and diagnosing and fixing problems quicklyExperience debugging exceptionsFamiliar with performance considerations for consumer facing web applicationsExperience working with remote data via REST, JSON, XML, AJAX and SOAP API’sImplementing unit tests as part of a testing strategyWebsite security concerns and authenticationExperience with Git source control a plusFamiliarity with Banking web applications a plusCan create deliverables for all phases of the software development life cycle.Ability to organize, plan and carry out complex assignments. Effective problem solving and negotiating skills.Ability to demonstrate a high level of understanding of tools and technologies and be able to innovatively apply this understanding to work assignments.Proficient in both written and verbal skills.Ability to present to all levels of an organizationWORK PERFORMED:Front end and middle tier web application development:Manage system complexityCloud based application integration with other ARGO software applicationsProduct to Market contributionSoftware features enhancementsNew technology innovationProcess innovationSecurityInformation managementQuality – standards, patterns & practicesManage 3rd party controls and interfacesProvide tools/knowledge to increase developer productivityADDITIONAL REQUIREMENTS:Applicants for U.S. or Canadian based positions with ARGO must be legally authorized to work in the United States or Canada. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for any ARGO position.\n      "}