{"title":"Software Engineering Intern (Spring 2021)","location":"San Francisco, CA 94117 (Haight-Ashbury area)","salary":"\n\n$16 - $20 an hour\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Ensure we meet our commitments to ship high-quality <b>software</b>, clearly communicating across the product team and company regarding key milestones or any time…</li>\n</ul>","term":1,"jk":"93ce5d544b8641f9","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=93ce5d544b8641f9","source":"indeed","full_description":"Software Engineering Intern (Spring 2021) - Paid 12 Week ProgramApplications will close on January 7th, 2020SummaryOur mission is to build the World's Most Optimised Network for Tech Workers to connect, build community, and get hired, in our increasingly digital economy. The Showwcase team is looking for a highly motivated engineering student with a strong background in Web Development, Testing, and API Engineering to join our fast-paced team of software engineers.Showwcase is headquartered in San Francisco, California, but work with a distributed team all over the world - San Francisco, Singapore, India, and Estonia. We work in a collaborative and dynamic environment where we are constantly pushing ourselves to redefine how tech workers are represented online.We are actively seeking enthusiastic interns who can work full-time for a minimum of 12-weeks either for our Spring 2021 session.Software Engineer InternYour role as an intern is to work alongside our core engineering team to support development and innovation enhancement at all stages of the product lifecycle. Our product culture is: Gorgeous, Smart, and Powerful. And you will be involved in the implementation of every aspect of our product. We are about solving complex, global challenges, where millions of users will interact with the platform every day and aim to deliver a completely new networked experience for tech workers.Building a platform optimized for the tech community is hard. Our customers understand how systems are built, they understand the look and feel of great software products, and do not waste time with subpar services. Your role is to collaborate deeply with our design and product teams to help bring to market a novel product.There has never been a time in history where tech workers are so core to business, execution, and our everyday lives. You will be working on a product that will completely change how the world connects, accesses, and transacts with tech workers. This is a high-impact role that will challenge you to think from first principles and draw the future.About the roleDescriptionWork alongside design, and product teams to build user-facing capabilities that empower our users to fully showcase their full potential to the world.You will work to build Showwcase web components to delight our users, helping them make their showcasing process seamless. You are extremely passionate about the impact tech workers can have in the next decade, and ready to leapfrog the existing social platforms.The ideal candidate will be able to:Work collaboratively, and in a dynamic fast-paced startup environment.Represent the engineering team in meetings, contributing to ideas relevant to the product roadmap with a strong understanding of future users and their desires.Ensure we meet our commitments to ship high-quality software, clearly communicating across the product team and company regarding key milestones or any time there are delays to our commitments.Work well individually and in teams.Design, develop and test software frameworks.To debug functional, performance and stability issues across the stack.Participate in design and code reviews.QualificationsFamiliarity writing in JavaScript or Typescript in the React framework.Experience building responsive layouts with CSS and HTMLExperience with modern browser technologiesStrong communication and problem-solving skillsSelf-awareness, a positive attitude, a sense of humor, and empathyYou are NOT required to be completing or have recently completed a Bachelor's or Master’s degree in Computer Science, Engineering or related field, or equivalent training, Bootcamp program, fellowship, or work experience. In the world we live in today, that is backward.Preferred familiarity with React, Javascript, Typescript, NodeJs, Serverless architecture.You love to code.Very willing to learn and passionate about building products.Job Types: Part-time, InternshipPay: $16.00 - $20.00 per hourSchedule:Monday to FridayCOVID-19 considerations:We're currently operating as a distributed remote team. However, we have set up a very efficient workflow process that allows us to work seamlessly across our functions. We look forward to onboarding you into this process.Work Location:Fully RemoteThis Job Is:A good job for someone just entering the workforce or returning to the workforce with limited experience and educationCompany's website:https://www.showwcase.comWork Remotely:Yes, temporarily due to COVID-19"}