{"title":"          Senior Software Engineer (Backend)         ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAJm1wkKKy4AngxLg3trMx7u8JX12bB2Y3HYS5bmx6iV6keLClvWJSC0rziTr6BBlvece08goFpkF_h7VOG1PjeRZj1dbZ7RJtxkzUcRZ_wR_e5Pn-vVIcucBWLWXqDL6RVj-8LvYF5EMExwgag21RcRkJdoTMK3QmIAN1HJO9dRkWX8ILCwak63Cgx0ghkTsJzQgw","source":"ziprecruiter","full_description":"\n        About RouteRoute is a one-click premium shopping experience for online ordering, and the only way to view all of your online orders, from any merchant, in one place. Online shoppers can insure and visually track everything they order online in one centralized app. E-commerce merchants from boutique brands to household names can add Route to their website enabling one-click solutions for their customers for shipping insurance, visual package tracking, and one-click claim handling. With offices in both Silicon Slopes, Utah (HQ) and Santa Monica, California, Route embodies a creative lifestyle partnered with innovative tech to build a one of a kind global brand.About the RoleRoute is looking for backend software engineers for its package tracking team. These team members are developing next-generation technologies that will fundamentally alter the way people visualize their packages while they are enroute.As part of a team whose role is fundamental to the development of Route’s product, we’re looking for engineers who can learn and contribute with a great deal of independence. We aspire to hire only the best engineers who feel comfortable taking ownership over tasks and collaboratively solving problems. We need our engineers to bring fresh ideas, be excited to take on new problems, and embrace the startup culture where we must be comfortable being uncomfortable at times.Your participation:Design, develop, test, deploy, and improve backend softwareManage project priorities, deadlines, and deliverablesEmbody a culture of innovation, transparency, and radical candorMinimum qualifications:BS/BA degree in Computer ScienceSolid understanding of Computer Science fundamentals5+ years of relevant work experienceExperience with one or more general purpose languages, e.g. Go, C/C++, Java, C#, or other compiled/semi-compiled languageInterest and ability to learn other languages as neededPreferred qualifications:Experience with one or more of the following: Big Data Processing Systems, AWS, Machine LearningGo experience a plusExperience contributing to architecture decisions on systems with extreme upward scalability concernsExperience working with carrier API’s such as UPS, USPS, FedEx, etc.Must be willing to relocate to Santa Monica, CA or Lehi, UT now or in the near future.Benefits:Route offers an array of benefits including generous salaries, stock options, 100% healthcare coverage, and an unlimited PTO policy.Route is an Equal Opportunity Employer. We embrace diversity and equal opportunity in a serious way. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be.\n      "}