<<<<<<< HEAD
{"title":"Senior Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKqUQvuKrDuyOW5JIbkJCvJ-zf-RrMFQ6E2sK_DYNsKHSCUcW8BhvKxOnVPsMOYTkpTDlstwRO0l3giXU8f7rt-g3_r7JAN9V9hh4oag61mY5BAV5t4i05Zmb7MVG5RwP8ottf4-ycxh6J9aDy48wD1CYsWlqXzg-P7zNeoJX0gSEXCmVm5iaDGXP3fmQ","source":"ziprecruiter","full_description":"LER TechForce, an LHP affiliate, previously LHP Engineering Resources, is looking for an Electrical Design Engineer to join our team specializing in PCB layout and component engineering for our Electrical Design need in Minneapolis, MN. This role is a hands-on designer role.Role ResponsibilitiesDesigning Electronic hardware for Power Electronics applications and leading the detailed design for Power Electronics for Power Converters and Genset ControllersCreating PCB layout to develop hardware. Using circuit simulation, analysis and DFMEA/PFMEA to ensure robust design.Understanding and implementing appropriate rules and strategies for high-frequency signalsCoordinating the development of design verification and system validation plans from a variety of inputs to identify failure modes while managing risk and relative priorityEvaluating analytical and experimental test results following engineering principles to verify that products meet technical requirements and validating that the design solutions meet customer needsProducing recommendations with technical documentation to support product decisionsSkill Set and ExperienceBachelor's degree and 7 to10 years of relevant experience, including assessing system requirements and contributing in developing the Electronic System ArchitectureDeep experience with digital and analog circuit design, including filter selection/design/and analysis, and working in electrical design software (Zuken, Mentor, etc. )The ability to perform electrical circuit analysis, for both analog and digital circuits, use critical thinking and troubleshooting capabilities. Experience with Pspice and MatlabExperience working with different microcontroller architectures and understands the various communication links like MODBUS, CAN, Ethernet and their impact on Hardware design"}
=======
{"title":"Senior Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJRdXCM6SUOBBubyh45iCiIcIMGlH1o7vFdo7PkeRCwFF9gIalCyjehvDqrl0D0WNGSwH-3X-Q208Kw57PsXNW_V9LM0veUTPOTMN9Jc2fFz4rPlYbAKj_MEZPGY3fTGkCFUgMa-_Oj39dMrLBktgvHzsRkSwscovE5oZMtR2MmePdT75qy6saxM60jyXvT","source":"ziprecruiter","full_description":"Senior Hardware Engineer Senior Hardware Engineer - Skills Required - RF, FMEA, Hardware Engineer, FTA, Bluetooth, Electronics, Product Development, wi-fiJob Title: Senior Hardware Engineer Job Location: Louisville, CO Salary: $120k- $140k DOE, Benefits, 401k Match Requirements: 5-10+ Years Hardware engineering experienceWe are the industry leader in wireless sensor networks. We patented the use of 900 MHz wireless technology to deliver the most reliable and cost-effective solutions for wireless applications.Known for our outstanding performance and dependability, over 10 million of our wireless devices have been integrated into the most complex environments where limitations and multiple networks can prove impossible to lesser systems. We are currently in a major growth phase and looking for a senior Hardware Engineer to help us grow.Top Reasons to Work with Us Competitive salary ($120K - $140K DOE) - Dynamic and exciting work environment - Full Benefits (health, dental, vision, etc.) - 401k match - Casual work environment - StabilityWhat You Will Be DoingThe Hardware Engineer will be joining an experienced team of hardware, firmware, and software developers working on a variety of development efforts, including new transceiver platforms, antenna design, firmware for wireless devices, and software applications to support them. The Hardware Engineer is expected to deliver quality RF/analog/mixed-signal designs, well documented, tested, and peer reviewed. The successful candidate will be able to design and hold effective design review meetings on the work assigned. This individual will report accurate and timely status of the tasks assigned.What You Need for this Position 5-10+ Years Hardware engineering experience - Experience with/knowledge of wireless protocols desired - Review internal and external wireless and system level specifications and determines compliance to specifications - RF design, Link budget, implementation, and release of wireless products - Participate in DFMEA and risk assessment and risk mitigation for product development - Microcontrollers and microprocessors desired, such as: ARM, TI MSP-430, K60/Cortex M4, 8051, etc. (experience with ARM architecture a plus) - Drive test environment definition as well as testing and troubleshooting of product to characterize the unit and system level RF performance - Experience with RF technologies (Bluetooth, WiFi, Cellular, etc) is a plus - BS (Masters is a plus) in EE, CS, etc.So, if you are a Senior Hardware Engineer with experience, please apply today!Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.*Senior Hardware EngineerCO-LouisvilleDH1-1582042*"}
>>>>>>> 6e9a075ee97f3a4d702c3307ef1e0ee7373d6616
