{"title":"Sales Professionals Wanted NEW!","location":"","salary":"","description":"","term":"$75,000 to $300,000 AnnuallyContractor","detail":"https://www.ziprecruiter.com/k/l/AAJ2JFEUpOU74NERUVtp054g86uZOUva41_-VXNm0OkX8CL8bvlkYbYjyM7aJ9C2x1LniE8Ug1yz94Wdx9yTND36kIo1kcazSakiu19XKoMTQqlHsNWW9d8j9URG2uNyve5X9mf8whPh3YRceo0A3XfWRzYUK49TJerUkX4csZOYnfVi-N8gJ_p-eFFDCDrQ","source":"ziprecruiter","full_description":"*SALES PRO*International M & A CompanyIMAGINE . . . . . . .You are a Sales Consultant who has been asked to meet with business owners in regards to selling their business. iagmerger.comYour job would be to meet with that business owner(s) and engage them in the process to sell successfully and profitably. After a 1-2 hour on-site visit, you will get an agreement and collect a deposit from the owner(s).You will spend time with the business owner(s) discussing the best approaches to maximize the likelihood of selling and determining if this business and its owner(s) qualify to meet our buyers and investors. Since your job is to analyze the sale-ability of the business, the only decision for the business owner is whether to start the process with our company. We furnish you with generated leads of business owners expressing a desire to sell.You will be paid for starting the selling process by engaging the business owner(s). Our M & A Company will handle all responsibilities after that. You will move on to new businesses and repeat the engagement process. Your territory will be based on your general location and the surrounding areas. You could earn from $2,000 to $5,000 per engagement and a 6-figure annual income. Training will be held April 27th - 29th in Addison Texas a suburb of Dallas. As an Independent Contractor, you will be provided with complete training from the parent company to include all presentation materials. You will have access to the home office management team with 100+ years of combined experience.We are seeking individuals now since there will be pre-training and product knowledge to learn. We are looking for professional, seasoned sales pros that have some knowledge of the Mergers and Acquisitions field or are willing to learn this amazing, profitable field.We are a growing Mergers and Acquisitions firm searching for experienced business-to-business sales consultants who would work with business owners who wish to sell their business. We are \"client\" focused, meaning that enhancing the value of a business, means having a transferable entity for that business owner. When a client goes through this process, all aspects of the business are in balance. Our company initiative focuses on all of the clients being enhanced as they enter the market.We have an excess of buyers and investors but we need businesses that want to sell of which you would be calling on to represent those buyers and investors. Through national and international advertising and electronic media, we reach 150 to 200 million readers quarterly to attract these prospective buyers. You may be the perfect match for our company and we would be interested in speaking with you further to see if we can mutually benefit each other.WE OFFER TO YOU:6-figure commission potential (based on 1 sale weekly)An Independent Contractor positionFor you to work from your own home office on your own scheduleComplete corporate office staff working directly with field personnelNo CompetitionComplete training and collateral sales materialYOU OFFER TO US:5+ years in successful B to B sales experienceHave sold intangibles on a one-call close basisConsultative selling to business ownersA signed Independent Contractor Agreement from usMade and kept appointments with Business OwnersWillingness to be trained by Corporate personnelA background dealing with a broad range of business types (non-technical only sales)Minimum commission expected of $75K annually."}