{"title":"Network Engineer - NISSC II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJHaDXtqslA69ElVgFK-OsWKLNMxqFVduy2wiFTVmsapvyuyx2dO8Wx3p1KhRfTc5D0jqKAIt_6pQL9a64RbQdEeO8RPTyIOXgfgydodBCWkMYUh2tnOJsaKTSE2q9B13yZVZx1CpqM40t_dn1REM3FqcT2XcZDwjpXF_OUmAwKbET-G__TG_p4UfjIzZA","source":"ziprecruiter","full_description":"Jacobs is seeking a Network Engineer  to support the newly awarded NISSC II contract. Your career at Jacobs enables NISSC to fulfill its mission to \"provide classified communications and processing for Command and Control (C2) capability in organizational work centers at NISSC sites.\" As a member of our team, you will support corporate and customer mission to provide world-class IT services and support that connects systems and users across NORAD in the areas of software development/maintenance, network services, cyber security, systems administration, and other mission-critical areas.The Network Engineer plans and conducts work requiring judgment in the independent evaluation, selection, and substantial adaptation and modification of standard techniques, procedures, and criteria. Independently prepares (or directs others) criteria, computation/analyses, specifications, cost estimates, and technical reports in the specific area of technical expertise.  Selects and applies engineering techniques and procedures to analyze and evaluate specific problem, data, or other features of the work which are broad in scope and complexity. Reviews and evaluates the quantity, quality, and overall adequacy of results and conclusions drawn from accomplishment of engineering tasks.Supports Agile team(s) in system design, integration and verification of NISSC II Products.Attend and Participate in Periodic Large Scale Agile Planning events.Attend and Participate in standard Agile ritual meetings (Sprint Planning, Daily Stand-ups, Backlog Grooming, Sprint Reviews and Retrospectives).This position is expected to pay $90,000 - $100,000 annually; depending on experience, education, and any certifications that are directly related to the position.Jacobs health and welfare benefits are designed to invest in you, and in the things you care about. Your health. Your well-being. Your security. Your future. Typical benefits offered include education reimbursement, retirement benefits (401K match), employee stock purchase plan, health benefits, tax saving options, disability benefits, life and accident insurance, voluntary benefits, paid time off and paid holidays, and parental leave.BS degree in appropriate discipline and 5 to 8 years of related engineering experience, or a MS degree and 4 to 6 years of related engineering experience, or PhD school and 0 to 3 years of related experience. At least 5 years of practical experience in Managing and monitoring installed systems and infrastructure, Ensuring the highest levels of systems and infrastructure availability, Monitoring and testing application performance for potential bottlenecks, identify possible solutions, and work with developers to implement those fixes, Maintaining security, backup, and redundancy strategies, Developing and maintaining custom scripts to increase system efficiency and lower the human intervention time on any tasks, Participating in the design of information and operational support systems, Providing 2nd and 3rd level support, and liaising with vendors and other personnel for problem resolution."}