{"title":"Sr. Analytical Chemist","location":"","salary":"","description":"","term":"$77,910 to $113,300 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALJgE24r6RrX7LmonPzGDl0WlLBiS7kT-iZik7HoyYOMqs8sYloBeSwQqFaBS9KnBi2SMbJSaLm7fLcFi0_Fs7F2KlMMEmAE_1S3ZsBatqfdKgOUyjcQYtNWh0VgtBr5okT2sxULbvesJouvZqSM4AXMJ7sAuq7EHOz1IWKcukkEtztKWnCGTVuKpjwuMW-","source":"ziprecruiter","full_description":"SALARYActual pay will be based on your skills and experience.SUMMARY Performs analytical research and development activities for the purpose of designing/improving a manufacturing process or technology, as well as producing clinical trial batches by performing the following duties. ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned. Participates in development of new processes by applying analytical skills and training. The required skills may, depending upon the focus of the position, need to include advanced technologies, such as mass spectroscopy (MS, LC/MS, LC/MS/MS, GC/MS). Applies analytical techniques at a process scale (e.g., process chromatography). Initiates and executes development of new and innovative analytical chemistry and methodology.  Develops a comprehensive understanding of internal, corporate, and ICH stability guidelines to provide support to the Corden Pharma Colorado (CPC) stability program. Provides written analytical procedures and reports supporting clinical manufacturing, commercial manufacturing and regulatory needs. Facilitates and supports analytical technology transfers. Develops key technologies and transfer strategies that function well in a manufacturing environment. Responsible for the analytical sections of process procedures. Serves as analytical resource on R&D teams.  Plans and formulates aspects of analytical research and development proposals such as objectives or purpose of project, applications that can be utilized from findings, cost of project, equipment and human resource requirements. Develops, implements and validates analytical methods and procedures. Practices good communication skills and maintains documentation such as records of expenditures and research findings, progress reports, staff conferences, in order to inform management of current status of each project. Participates in manufacturing site activities, such as troubleshooting and analytical problem resolving. Develops an understanding of QEH&S principles and regulatory affairs. Analyzes and releases batches of drug substance and/or intermediates to be used in clinical or registration programs. Responsible for properly managing the generation and accumulation of hazardous and non-hazardous waste. LEADERSHIP & BUDGET RESPONSIBILITIES Expected to work interactively and collaboratively in a project team environment. Demonstrates positive attitude. Supports a positive, healthy and flexible work environment that encourages employees and coworkers to develop their full potential. SAFETY & ENVIRONMENTAL RESPONSIBILITIESEvery individual is personally responsible for the safety and environmental aspects of his or her activities in the workplace. Each employee is expected to perform their job duties in a safe manner utilizing all of their knowledge, training, ability and experience. QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. EDUCATION and/or EXPERIENCE Doctoral or master's degree in chemistry with 2 years of related experience; or BS degree with 6 years related experience; or equivalent combination of education and experience. LANGUAGE SKILLS Ability to read, analyze, and interpret common scientific and analytical journals, financial reports, and legal documents. Ability to respond to common inquiries or complaints from customers, regulatory agencies, or members of the business community. Ability to write speeches and articles for publication that conform to prescribed style and format. Ability to effectively present information to top management, public groups, and/or boards of directors. MATHEMATICAL SKILLS Ability to apply advanced mathematical concepts such as exponents, logarithms, quadratic equations, and permutations. Ability to apply statistical concepts such as significant figures, frequency distribution, determination of test reliability and validity, analysis of variance, correlation techniques, sampling theory and factor analysis. REASONING ABILITY Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables. CERTIFICATES, LICENSES, REGISTRATIONS Domestic and international travel may be required. PHYSICAL DEMANDSThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to work with hands; and talk or hear. The employee frequently is required to stand, walk, and sit. The employee is occasionally required to reach above shoulder height; climb or balance; stoop, kneel, crouch, or crawl; and taste or smell. The employee must occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus. WORK ENVIRONMENT The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee frequently uses toxic and/or caustic chemicals and there is a risk of exposure. The employee is occasionally exposed to moving mechanical parts, outside weather conditions, and risk of electrical shock. The noise level in the work environment is usually moderate.  CORE COMPETENCIES These are the specific areas of knowledge, skill and ability that are important for successful job performance. They must be job related and consistent with business necessity. Presentation and persuasion skills.Training and facilitation skills.Developed written and verbal communication skills.Developed written and verbal communication skills. Complete understanding of cGMP and GLP. BENEFITS401(k) matching - Corden Pharma will contribute 100% of the first 6% - 100% vested after 2 years of service Accident planCritical illnessDental insuranceDisability insuranceEmployee assistance programFlexible spending accountHealth insurance PPO/HSAHospital indemnity planID TheftLife insurancePaid maternity/paternity leaveTuition reimbursementWellness ProgramVacation – Three weeks 1st yearVision insurance"}