{"title":"Senior C++ Software Engineer Python Ticker Plant Experience NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ6cmbvzN5EkWpgG49VR1ddzoGSMVWixurOxrzLxh1rSHVL3JNzmW-Yd8YfSajyRyp3AI8ZeJ293ohtoK90HSB0c069tx6Ilb3zQNxBBRcjTbA-qx3KuKs0pqIchn6DbS5nzctqUy1CjXpurlAB8oyf2R5TT063SrRIuPbcm45DDfUnOSFCJar-10RApJ0","source":"ziprecruiter","full_description":"Senior C++ Software Engineer Python Ticker Plant ExperienceMy name is Bill Stevens and I have a new full time Senior C++ Software Engineer opportunity available that could be of interest to you, please review my specification below and I am available at any time to speak with you so please feel free to call me.This position will start off as a remote position however once the shelter in place laws are lifted the ideal candidate should be capable of working five days a week in Midtown, Manhattan.Due to client confidentiality please call me for the salary and benefits information.The firms Ticker Team is responsible for the integrity of the software that delivers the world's most reliable, timely and accurate financial data. More than 4,500 developers rely on them to provide the core foundation and data required for their applications. Their work environment is fast-paced, spirited, friendly and collaborative. On their team, you will learn about state-of-the-art large-scale development infrastructure, work with field experts, and get insight into the heart of the firms financial engine. They are currently in the process of upgrading a large number of software assets. The project will involve communication with multiple engineering teams, the migration of code to a modern infrastructure, creation of project summary documentation, and the development of scripts to support all the above.As a software engineering consultant enabling this migration:You will be involved in coordinating, planning, rolling out and testing updates to the production system.You will also have the opportunity to learn the challenges in design and maintenance of large scale enterprise systems.You will develop an expertise in CMake, Git, C++ build troubleshooting, and Python.You will have the opportunity to extend the firms existing infrastructure. This will include modifying or developing code using CMake, Python, and frameworks of the Jenkins ecosystems.Responsibilities:Complete projects that required significant communication skills and the ability to work with a teamCollaboratively document tasks consistent with industry standards, project specific design principles and frameworksWork with engineering and product teams across the firm and understand their application requirements and data access patternsBe willing to tackle new challenges, learn new technologies quicklyEssentials:Ability to communicate and interact with internal engineers to learn systems is essential.Ability to write technical documentation on systems and processes is essential.Basic familiarity with C++, its compilation process, and solving linker errors on UNIX/Linux platforms.Aptitude for writing scripts to automate repetitive tasks.Full-Time work experience with C or C++Familiarity with CMakeSystem admin experienceExperience with Git and Jenkins pipelinesExperience with Python scriptingUS citizens and those authorized to work in the US are encouraged to apply, sponsorship for this role is not available at this time.The interview process will include an initial telephone screening.Please let me know your interest for this position, availability to interview and start for this position along with a copy of your recent resume or please feel free to call me at any time with any questions.RegardsBill StevensDirector of Technical RecruitingPRI TechnologyDenville, New Jersey 07834Direct Line: 1-973-732-5454 x21Bill.Stevens@PRITechnology.comhttp://www.pritechnology.com/LinkedIn: http://www.linkedin.com/pub/bill-stevens/3/26/687/"}