{"title":"Modeling Engineer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJyexW49C-Y4ZKdDny4Z0WyN0xDcCDCiDQP5iSpADM7FTsDsbv5g5BsJ4gCPibShYH3JaqP3yAxS8G9Mky_CvTh6gso1dc6AvoqcyhusI7mllGGG-EhiYzi86bbA1rSDAs4T-GJ1ImZOshJcJVBWM3pjwEQIDpQrd1BgGv6Wo56tWA2qgIoRXYXNhiCEaCL","source":"ziprecruiter","full_description":"The Modeling Software Engineer will work in a collaborative work environment with local and global team members to engage in Model in the Loop (MIL) activities as it relates to Model Based System Engineering (MBSE) and Model Based Requirement Analysis (MBRA). Responsibilities include but not limited to:- Model Based System Engineering (MBSE) and Model Based Requirement Analysis (MBRA)- Developing software models- Writing & executing automated tests for individual software features based on functional requirement specifications provided- Establishing and maintaining traceability to requirements in feature simulation designs as well as to developed tests- Identifying, analyzing and providing feedback on requirements, software and tool issues- Updating and managing software changes in existing simulations- Presenting periodic team progress reports to management- Delivering on time per established schedules - The Engineer will work in a collaborative work environment with local and global team members that include other Software Engineers, System Engineers, Validation Engineers and Release EngineersQualifications:- Bachelor of Science degree in Electrical, Computer Engineering or Computer Science (or equivalent) from an ABET accredited university. - Minimum two years of experience in software model development, including software design, programming and testing- Software simulation tools training/experience- Automated test development experience- Requirements management/analysis tools experience- Project management skills- Issue reporting and issue tracking- Presentation skills, excellent communication and teamwork skills- Desire, drive and ability to learn quicklyPreferred Requirements:- Master of Science degree in Electrical or Computer Engineering from an ABET accredited university- C/C++/CAPL programming, embedded programming training/skills; Design for Six Sigma (DFSS) certification- Matlab/Simulink, Rhapsody (SysML, UML), DOORs, vehicle diagnostics, CANoe/CANalyzer network analysis tools training/experience- Leadership training/skills, MS Excel/VBA skills- CMMi/ASPICE training/experience- Orthogonal array test experience- Root cause analysis with Model-in-the-Loop (MIL), Software-in-the-loop (SIL) and/or vehicle level experience- Quality tools experience (Kepner-Tregoe/Shanin). - Self-starter and motivated to produce results.Additional Informaiton (Must Have's)SysML UML Systems Modeling Language IBM Rational Rhaspody"}