{"title":"Sr. Consultant iOS Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAISf-mXCUqsh24TAOzvVOCrHKtOOfjBZkZW1Bo_ohDorJFXswLVf54Nk4FyxndPRrQEkeWCcnkqhz349mcZ2C5KuiZgu73E7UmxvhQ60s0-Mb7QBuSsqlUBaBIcV8e_aimpspw8VfFkz5NG-ebZevEv3VOM-XKBoHph0kZsv3kwQje_CVdhISM9CBDD6fbf","source":"ziprecruiter","full_description":"About the roleAs a client-facing iOS developer consultant, you will acquire domain knowledge in the client's area of business focus. You'll contribute suggestions and creativity to the team and work with other team members to validate design and implement decisions.Day-to-day, you will:        Design and develop application components and features with limited oversight  Adhere to project governance-developing according to industry best practice  Take and follow directions, ask questions, and raise risks  Focus on building strong and lasting client relationships by doing right by the clientAbout youYou're excited about the latest in mobile development, specifically in iOS development. You have strong teamwork and interpersonal skills to facilitate interaction with team members and clients. You have the ability to learn and apply new technologies in a fast paced environment.Your technical and business skillset likely includes:  At least 5 years of experience with Swift and iOS development in a production setting  Experience in all parts of the iOS development lifecycle including: application development (application structure; device and operating system Application Program Interface (API's); debugging; performance; security), deployment, updating, and roll-out, 3rd party integration points  Strong understanding of object-oriented programming and software design patterns  Experience with dependency injection and reactive programming (RxSwift) frameworks  Experience with and a desire to learn other mobile technologies, including Android, Flutter, React Native etc.  Experience with Mobile First Platform, Angular is a plus.  Experience with back-end architecture and implementation (web services, databases, security), on platforms and technologies such as Windows Server, Open Data Protocol (OData), Azure, Structured Query Language (SQL) ServeYou likely have a Bachelors degree in Computer Science, Computer Engineering or related education, as well as 4-8 years of strong iOS development and experience with Swift."}