{"title":"Lead R&D Chemist (CED Analytical Laboratory Inc.)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALFHm5_4bH7ZSr2XXT11F6polN5UcbuSeoKsWQEKf1qEjg5333twgS0K_z8EJV0HftPrfH3kXn-RknFDLhWVm2ap8EVnRgm_L_AllIXlUYXnhecixzTzikXeldVFg-SpssQcCkD_qDCZfjwFRZaXOIprwbruzlNHe0voiompEmUw4q9Y_h0UhCUac8i54Vd","source":"ziprecruiter","full_description":"Lead R&D Chemist Affiliated with MEDISCA, CED Analytical Laboratory Inc. is looking to fill the role of Lead R&D Chemist. The primary purpose of the Lead R&D Chemist is to coordinate and work with external customers in developing methods, validation, and testing of finished products. This person will have to lead project execution independently, while assuring the accuracy and timeliness of the completed work. The ideal candidate will have a working knowledge of regulatory and compendial guidelines as well as extensive experience with compounding. Responsibilities: Communicate with Clients about testing requests and projects. Supervise other chemists and manage projects within laboratory Method Validation Maintain an optimized schedule of method development activities Perform method/sample validation including: Ability to develop and validate methods for multiple products and forms. This includes, but is not limited to, extractions, creams, tablets, troches, etc. Generate protocol specified data Analyze data according to validation parameters Author technical reports Perform laboratory troubleshooting and participate in the investigation process. Perform laboratory review of results obtained by analysts Conduct non-routine analysis of samples and compile data for documentation of test procedures. Stability Testing Ability to manage and organize R&D stability program Report the status of projects to management, while maintaining a visible project list Calculate results as required in compendial methods and procedures. Balance, reprioritize and allocate tasks and/or negotiate resources when needed to optimize schedules and outcomes on multiple projects managed simultaneously Perform instrumentation and wet bench testing for finished product samples HPLC assay, dissolution, pH, viscosity, water determination, etc. Inventory Login & Upkeep Compliance to FDA regulations and CED SOPs Perform other duties as assigned."}