{"title":"Android Developer- Mid NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAIZ29x4gPU2WrzHMZW7l48gRPQ_bEGmCeNgspjX7K9NFBkS7_t5blYbOmXXiNtphP_rVcgwsAZ_tDX2Namwx4SL93twmRXc9Xk4skVUzjquz6uWaXnV061setjgZcbcpBzbhr---N3JsUlad450msSKuyyb0Jb0HsKLdJGvuSJb12rdDA8G63kZq_BwuNzU","source":"ziprecruiter","full_description":"Android Developer- Mid in Bernards, NJ at APEX Systems Date Posted: 1/15/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: Bernards, NJ + Job Type:Mobile Development + Experience:Not Specified + Date Posted:1/15/2019Job DescriptionJob #: 925698 Apex Systems combines with parent company On Assignment to make it the 2nd largest IT staffing agency in the country. Apex has an opportunity for a Mid Level Android Developer for a client in Basking Ridge, NJ. If interested in discussing the position further, please send an MS Word version of your resume to Jaclyn Imbriano, jimbriano@apexsystems.com Here are the details: Position: Mid Level Android Developer Location: Basking Ridge, NJ Rate: NegotiableDuration: 6 Contract to Hire Day-to-Day Responsibilities: YouMust Haves: + 2+ years experience with android experience + Knowledge of Java or Kotlin + Published Apps in the Google Play Store + REST API + RetroFIt- HUGE PLUSSelling Points for Candidates: + Will hire off SkypeFor this opportunity, you will also be eligible for benefits through Apex for the contract period, a W2 hourly rate, weekly pay, and direct deposit! Apex Systems Inc. is an equal opportunity employer and encourages female and minority applicants to apply.What type of interview process is preferred? (Face to face, phone, Skype, or a combination of the three) Face to face EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}