{"title":"Software Engineer Intern","location":"Sacramento, CA 95815 (Arden Fair area)","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>In accordance with your area of study, we will assign you a project related to system development, optimizations or new technology development.</li>\n</ul>","term":1,"jk":"2baa020859b4a212","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=2baa020859b4a212","source":"indeed","full_description":"Summary\nPosted: Nov 18, 2020\nWeekly Hours: 40\nRole Number:200207676\nImagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\nAt Apple, it’s the diversity of people and their ideas that encourage the innovation and runs through everything we do, from amazing technology to industry-leading environmental efforts.\nKey Qualifications\nA self-starter who loves to innovate\nPassionate about learning to solve business problems with data\nWillingness to learn new languages and technologies\nAttention to details and concern of accuracy\nFamiliar with any major programming languages like Java, Python, JavaScript, Go\nStrong computer science fundamentals, including data structures, algorithms, and software design\nWorking with high volume, business critical, transactional and complex data profiles\nDescription\nApple's Strategic Data Solutions (SDS) team is seeking a Software Engineer intern who is passionate about learning and enjoys coding. During your internship on the Strategic Data Solutions team, you will be participating in design, modeling, development and testing of SDS systems. You will also get the opportunity to contribute in high level design discussions regarding system architecture and features. In accordance with your area of study, we will assign you a project related to system development, optimizations or new technology development.\nOur commitment to you: We will guide you through a challenge with opportunity for growth, recognition and accomplishment. As we learn more about you, we’ll connect you with mentors and teammates to assist in your personal and professional development. You’ll work cross-functionally with teams across Apple and gain valuable experience driving security improvements in a high tech environment.\nWhat we expect: High energy, positive attitude. Bring the best version of yourself. Be prepared to be curious, creative and to make an impact.\nEducation & Experience\nCurrently enrolled in a degree-granting program pursuing a B.S. or M.S. in computer science, computer engineering, or closely related fields with equivalent experience.\nAdditional RequirementsInvolvement in all the phases of software development within the teamDeliver high quality software using industry’s best practicesDeveloping efficient solutions for modeling, processing, and persisting dataHighly desirable to have knowledge of distributed data processing platforms (Hadoop, Hive, Spark, Kafka, etc.)"}