{"title":"Diesel Mechanic Technician - Weekends Shift 4 x 10 Schedule! NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKJncJzyQa0s6cc7Za03n2vfBqCqWwHJuHLDwQBoQtwZBu9NedZi6QlaSHXcwxNjzzqiY42ZyiRVgsizhUis6U2w-iUMJsfTXCClY1wfpd9ClomReQmmQjmVKj-fwIOufBho5M7wOMLCvpMDhFTszcHWj79lfdZLLoq4Gs3PuZdMbEzGIZu2btgu8pq5eI6","source":"ziprecruiter","full_description":"Position DescriptionGreat Opportunities to Advance Your Career!4 x 10 Schedule Friday-MondayPaid weekly, 401k, Medical, Dental and VisionWe are currently hiring a Diesel Mechanic Technician in Tacoma, WA!Please call or text Patrick @ 708-305-7177 for more information.Are you looking for an excellent place to work that offers great pay, benefits and incentives?Do you want to work on new trucks using state of the art tools?Do you want a rewarding career with one of the largest transportation companies in the country?If you answered \"Yes\" to these questions, you've got to check out Ryder!At Ryder, we offer outstanding incentives: Generous Paid Time Off! + Excellent Benefits! + PPE & Uniforms provided at no cost! + Free Job training and development! + Career advancement strategies that will help you secure your future!For 85 years, Ryder has provided customers around the world with integrated transportation, logistics, and supply chain management solutions that enhance the way they do business. Building and maintaining a fleet takes time, resources, and expertise few companies can spare.We are a fortune 500 company with 800+ locations and 36,000 employees across the US! Employee satisfaction is part of our culture.Apply today and see why a job with Ryder is what you've been looking for. Call us or go online to apply for one of our awesome opportunities.Under close supervision, the Tech II Diesel Mech (Regulated) position performs minor to average routine maintenance and repair services on different types of vehicles.Works with the assistance of a T3, T4, TIC, SS or SM, when performing highly technical and superior diagnostic type repairs. Task assignments are directed by shop management to encourage development in a productive manner.The T2 Technician performs minor to average repairs and routine maintenance under limited supervision. The T2 may be assigned to work/train directly with a T3 or T4.\\#INDtech\\#FBRequirements High school diploma or equivalent + Post-secondary vocational education strongly preferred + Must have minimum tool requirement + Must have a valid driver's license + Valid CDL (license A) is highly desired; mandatory in some locations + Must possess state license as required + This position requires for you to drive Ryder vehicles. In order to become a Ryder employee you must: + Must be able to obtain CDL within 6 months after hire + Pass a Ryder Drug Test + Pass a DOT physical + Pass a Ryder road test + Pass a Ryder Background and Motor vehicle check including drug and alcohol verification from previous employers for the last 3 yearsImportant Note: Additional requirements may be required in different locations and/or accounts.Responsibilities Performs vehicle maintenance and repair duties + Performs standard vehicle maintenance + Performs standard component inspections and repairs + Performs preventive maintenance + Diagnoses standard mechanical and electronic problems, utilizing diagnostic computer when applicable + Identifies root cause of basic failures/conditions and perform repairs as required + Replaces defective components as instructed + Performs facility maintenance duties + Interacts with customers/drivers to properly determine nature of complaint once assigned a task + Utilizes key functions of Shop Management System and electronic documentation available + Works in accordance with all federal/ provincial and corporate compliance guidelines (i.e., safety, DOT, MOT) + Performs other support duties as required to support operations. These could include but are not limited to Service Island supportRyder is proud to be an Equal Opportunity Employer and Drug Free workplace. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, among other things, or status as a qualified individual with disability.Job Locations US-WA-TACOMA Posted Date 22 hours ago (3/8/2021 5:53 PM)Requisition ID 2021-95745Category Technicians/Service EmployeesEmployment Type Regular-Full timeTravel Requirements 0-10%Position Code 7006"}