{"title":"          Senior Software Engineer NEW!        ","location":"","salary":"","term":"$100,000 to $150,000 AnnuallyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAJiohSFVi5B_e_-TiUf5c_awPl5njpZRt-lwdSKwU3WBcrP4mvMW6Oy-Jl_6RL4W6SNh02WpFR7JDMvBClrDdEz6AkA5k0_44K_emhIqljgWfqAmD792HVnNdi9kOIFL_Xp-cv7ENyHkNEvLhRHO59_e6idr3p4SiWZRm02EZlHfJpwa2jKWVWgtSYlhv_X","source":"ziprecruiter","full_description":"\n        Senior Software Engineer If you are a Senior Software Engineer with experience, please read on!We are a SaaS company looking for a Senior Python Developer to join our team. This position will be fully remote and we are looking for talent to join our team.Top Reasons to Work with UsFully RemoteCompetitive Compensation Huge Room For GrowthWhat You Will Be DoingAs a senior member of the team, you'll use both technical and relational skills to lead large scale projects to completionDevelop in-house services/API's using Python/Django/RestFrameworks Operate and maintain internal services that support our internal platforms (RabbitMQ, Redis, Django/Gunicorn/Nginx webapps, etc)Lead the team in designing and developing frameworks and API's that enable functionality for the entire Engineering organizationWhat You Need for this PositionMust Have: - Python- DjangoNice to have: - React - Node - Postgres - Rest - RedisSo, if you are a Senior Software Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n      "}