{"title":"Sr Software Engineer (Back-End) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIMWjBdTqxm0_tRuR40wtDldA2_0KlbMC5RMPFnOTvgS0mXQl9FDHMvagd57hMA9QJ1QRv-2hAERqpPZuy0RFnk7EkBdIEEY21HRG6lI2IipEGVi6PD4UoLG1HsmtkCzpC-AHJhZt5NGxVOVfaMquA5nSNU6Q7zXz8U8C3FbemfGmW9fxqxiLiZUvH2A4Y","source":"ziprecruiter","full_description":"1323719 - SR Software Engineer (Back-End) Who We Are Cisco Cloud Security Group is at the forefront of developing cloud-delivered security needs and challenges of our customers. With annual revenue exceeding $200M, it is one of the fastest-growing businesses at Cisco. As Cisco is transforming its business model aggressively to a software and recurring revenue model, our cloud security business is leading this journey with 100%+ YoY growth in software recurring revenue. What We Do The Cloud Security group focuses on developing solutions that provide Security as a Service to our customers. Our vision is to build the most comprehensive security solutions that are both easy to deploy and simple to manage. We have a highly scalable cloud infrastructure spread across 30 data centers where we run our cloud security applications that operate at massive scale - 100B+ requests per day from > 90M daily active users. Who You'll Work With You will join a dynamic, multi-talented Engineering team where new features are deployed to customers multiple times a week. We are Umbrella's Secure Web Gateway team and our mission is to improve the underlying technologies and the UI that drives Umbrella Security. We work on features big and small in order to build the best security solution in the world. This team does it all, so you'll never be bored, and you'll constantly be learning new technologies. What You'll Do Work on best of breed Cloud Security Solutions that provide comprehensive security to enterprises Build highly scalable Cloud Microservice solutions that secure a high volume of web traffic Bring a mindset of developing simple solutions to complex problems. Define, architect, design, and deliver new software features for Web gateway. Write functional and design specs. Conduct and participate in peer code and design reviews. Collaborate with the adjacent software teams in defining the programming interfaces into the various other software modules. Relish a build it, operate it, secure it culture. Who You Are You're a Software Engineer who enjoys wearing many hats, a self-starter who's willing to jump headfirst into the codebase and start improving it immediately. Our minimum requirements for this role: Experience in tunneling protocols like GRE/IPSEC/TLS, Overlay Technologies and Virtualization Experience in Web Gateway products, web proxy, Web Security domain Solid understanding of network protocols like TCP/IP, UDP, HTTP, HTTPS, DNS Experience in designing, implementing, and supporting large-scale transaction systems Proven Python, GoLang, Java, C or C++ skills In-depth knowledge of object-oriented concepts, programming, and systems design Understanding of various design patterns and Microservice Architecture Strong foundation in data structures, algorithms and software design Strong analytical and troubleshooting skills. Desired Skills Experience in an Agile environment Well versed with Web proxy - NGINX is a plus Understanding of HTTP service behaviours Cloud Development Environments: AWS, Google Cloud, Microsoft Azure Continuous Integration/Delivery tools (Jenkins, Docker, Chef, Ansible) Educational Background BSCS with 7+ years of development experience in Computer Engineering, Electrical Engineering, Computer Science (or related major) or MSCS with 5+ years of development experience Why Cisco Cloud Security Cisco Cloud Security enables you to securely adopt the cloud and better manage security for the way the world works today. It protects users against threats anywhere they access the internet and secures your data and applications in the cloud. You can also leverage the cloud to enhance security through simplified policy management and dynamic threat intelligence. With Cisco Cloud Security, you gain complete visibility into internet activity across cloud applications, all office locations, and roaming devices, plus faster threat detection and response. Cisco Cloud Security provides an effective security platform that is open, automated, and simple to use. And it's backed by industry-leading threat information delivered by the Cisco Talos security intelligence and research group. #WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all. We embrace digital, and help our customers implement change in their digital businesses. Some may think we're \"old\" (36 years strong) and only about hardware, but we're also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do - you can't put us in a box! But \"Digital Transformation\" is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) Day to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. So, you have colorful hair? Don't care. Tattoos? Show off your ink. Like polka dots? That's cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! #WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all. We embrace digital, and help our customers implement change in their digital businesses. Some may think we're \"old\" (36 years strong) and only about hardware, but we're also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do - you can't put us in a box! But \"Digital Transformation\" is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) Day to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. So, you have colorful hair? Don't care. Tattoos? Show off your ink. Like polka dots? That's cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!"}