{"title":"Sales Development Representative - SDR","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALgpEFQSE90gnJ-KKXuwpztDoIQbEWWXVElOg39sSnl2JOfYn6y1zCE1cANZ0NqUbHNg80-A-W8VRMvK4DgIHAaIYXFb2NpeBtAFYyQPcZzN1iRtTRVUPGbNfk54MBq0j6W5-BocehfryU5jAwPnaUtBDwIra-GBJk6RyW8OUSzA_mXjS3djFcrG0Y8YuA","source":"ziprecruiter","full_description":"With SV Academy’s Sales Development Representative (SDR) program, you will get hired in a Tech Sales position and become part of a strong network and community of 700+ high-potential sales leaders. The program ensures you gain all the advanced sales skills necessary to succeed. Choose between full-time or part-time training starting in April for 46 coveted entry-level jobs in Tech Sales, with an average compensation package of $79K (base and bonuses).About the RoleTech Sales is a field that is always in-demand, exciting, and lucrative. If you are an innovative, ambitious mind who wants to upskill in the non-coding side of tech, being an SDR will give you the start that you need to break into the industry. SDRs are on the front lines of the tech business, connecting with customers and clients, and coming up with the smartest solutions for their problems.You’ll have a fundamental role in a fast-moving, fast-growing field:Driving ambitious customer acquisition and revenue growth objectives.Identifying and generating sales opportunities through inbound and outbound calling and emailing, running presentations, and face-to-face (virtual) meetings.Developing proposals and solution consulting as part of your day-to-day responsibilities.About the TrainingSV Academy offers a straight path to a Sales Development Representative position to the applicants who can commit to 4 or 12 weeks of intensive training. You’ll learn all the skills and real-world experiences necessary to succeed in a non-coding career in tech. Our training directly prepares you to be job-ready with 300 hours of small-group, instructor-led live online classes, self-paced work, and virtual employer projects. Upon completion, you will land a job at one of our 400 employer partners. In your first year on the job, you’ll be part of a dedicated group coaching circle and have lifetime access to SV Academys community of top performers and sales leaders for mentorship to ensure you succeed and to position yourself for promotion and ongoing career growth. You pay your tuition after you get the job.Basic QualificationsCurrently have a high school degree (GED) or higher.Live in or be willing to relocate within a one hour commute of one of the following Metropolitan Areas: Atlanta, GA; Austin, TX; Boston, MA; Chicago, IL; Dallas, TX; Denver, CO; Los Angeles, CA; New York City, NY; Phoenix, AZ; San Francisco Bay Area, CA; and Washington DCCan legally work in the US"}