{"title":"          Senior Software Developer - AI Agent Application NEW!        ","location":"","salary":"","term":"$120,000 to $190,000 AnnuallyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AALhlMmHA44X9diQ2eQkU6lbw56lfuDZtkptdKhxI1axKso_q2Yq0wceDGEPI6BCTh23nEo-78wujG_iIeo_g-8J5ejfsHxwHRcWQHAI1wj10Zq1lu3H9on93E4yz9AdcAcfuHjPh5_sXAs28_CLvVSCBN6jyu-83e8bLhXTmF8XHRnJoD7nLNhG-YJh6xG3","source":"ziprecruiter","full_description":"\n        Why you should join:Join us in building the best ecommerce conversational AI SaaS platform to revolutionize how retailers and brands engage with shoppers for post-purchase activities and more. Linc is looking for senior software developers who are passionate about their craft, who thrive on challenge and who believe in success through collaboration – people who would complement our existing team of world class developers! We offer a fun, dynamic and result-driven environment. If scale and complexity in a high growth startup excite you, Linc is the right place to be.About Linc:Linc’s Conversational AI platform delivers automated experiences at scale across webchat, email, SMS, Facebook, Google Business Messaging and voice connected platforms such as Alexa. From brand awareness, to consultative buying assistance to buying assistance, post-purchase and retention, Linc’s platform provides over 85% out of the box automation for all customers’ most commonly asked questions and services. The end result is higher shopper retention rates and a higher lifetime value with those clients.As a fast growing startup, Linc has delighted tens of millions of shoppers, and its customer list includes world-class brands like Levi’s, Carter's, PacSun, Venus, Kimberly-Clark, LampsPlus. Learn more at letslinc.comResponsibility:Build and maintain Linc’s SaaS application platform at the highest level of quality, service and availability Design, implement and maintain functionality and enhancements of AI Agent Applications on Linc platform. Measure everything, optimize for best user experience and business valuePlay a leading role in all phases of software development from planning, designing, implementation, testing, deployment, to day-to-day operation Collaborate across entire product team to contribute to the analysis of functional requirements and overall system architectureDocument and communicate designs and interfaces for use by customer success team and customersKey Qualifications:5+ years of working experience in designing and developing large scale web applications Experience in building high performance, highly scalable, and fault-tolerant multi-tenant SaaS based applications with Amazon AWS, GCP or AzureDemonstrated ability to master at least two of the programming languages: Python, Go, Java or C++Strong knowledge in software architecture, data structures, modern design patterns, microservice and internet protocols Experience in designing and implementing public APIProficient in relational databases and SQL (MySQL, PostgreSQL, AWS RDS) Self-starter - ability to drive projects forward with limited oversightExcellent communication and problem solving skillsBachelor or graduate degree in Computer Science or related technical fieldsDesired:Familiarity with Kubernetes, ElasticSearch, Docker, Kafka, MongoDB and Neo4jExperience in machine learning, NLU/NLP and chatbot Experience in ecommerce industry\n      "}