{"title":"Virtual Machines Technical Support Engineer Stage 3","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ_yNsnQb5dHRidkf_vSUSXuh4FRITsNRnzi9YeiubukywG74FgE08iTzULIgJEUI1HBoC6Thdx92_jcvDyo64JTUVBDi2EeeW5azCJiqv1GWh7eO2cRHlKDtg6cEOCO0cbMfG7dFOgB9VZTAVHjB4Gg-BFNF-RbvBQmB0MbdePF8l4fo8Jsgah0l0u_EmT","source":"ziprecruiter","full_description":"Are you a natural problem solver looking for an organization where your career can develop rapidly within a short time frame? Do you want to gain global experience and get extensive training on high-end software products and solutions?  Do you take pride in delivering great customer service?    Tek-Experts provides business and IT outsourcing services, and we take intense pride in helping companies handle their business operations.    We are looking to add to our team of software support engineers. As a customer facing support engineer your role will be to provide phone and email based technical support to corporate customers while ensuring ticket resolution and customer satisfaction. Working on the Azure Virtual Machines Infrastructure Team. You will be supporting VM management, VM configuration, VM connectivity, VM migration processes, VM high availability and VM performance. Supported by our quality assurance team, domain experts and training and development department, you will have a comprehensive induction and training program to ensure you deliver extraordinary customer service. Act as the technical contact, deliver advanced technical troubleshooting and problem-solving solutions for corporate customers including, issues escalated to the highest level of management Collaborate with subject matter experts and escalation managers when additional support is needed Manage critical issues by setting customer expectations, devise and implement action plans and professionally communicate to all parties involved Seeks supplemental training to improve performance and develop specialization. 2+ years' experience in technical or customer supportStrong researching, problem-solving and troubleshooting skillsAdaptability to work independently and part of a team bringing in experts when neededExcellent customer service skillsPassion for technology and learningExperience in Microsoft technologies, virtual machines or windows server administrationA Career, not a jobBe part of something greatOpportunity to realise your full potentialContinuous personal and professional learningFast-track careerGlobal resourcesUnleash your potentialWork-wide family Tek Experts is an equal opportunity employer. We do not and will not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin, or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items."}