{"title":"Technical Writer II or Above","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKLuCD1Jq5nZYy_-BhWDrya7qlmp8Ot25XjV3wzyWy6Ge8AanH8LAaEP3GHWGREu3mGIW151EPJpmoWgkLLjbaftztn1uQhXmjEuNjKed72BnIgOqA84EflEuvCeXWDwel02XWDg6mYrAlsaUZsb2615P8qMz4L69D4x87e2iM-zybgcBp7qzVxMJniWjyO","source":"ziprecruiter","full_description":"Sekisui XenoTech, LLC is currently looking for a Technical Writer II or above in our Service Logistics department. The Technical Writing Unit is part of the Services Logistics Department in the Services Division. This department is responsible for preparing contract services reports and other client deliverables -including non-routine reports requiring atypical designs and formats-for disciplines such as enzyme inhibition, enzyme induction, drug metabolism, drug transport, etc. The Technical Writing department contributes expertise and support to the preparation of contract study reports that meet our sponsors' documentation requirements and the ICH eCTD specifications.Essential duties and responsibilities include, but are not limited, to the following:Prepare final report deliverables for distribution to the client.Assess and review study data (assay results, data processing, NTFs, SOPs, etc.) for applicability and inclusion in contract service study final reports and data summaries.Assemble procedures, tables and figures into draft final reports and data summaries.Assemble results and conclusions into draft final reports and data summaries.Revise draft final reports and data summaries based on study director and/or sponsor requests.Assist with preparation, format, layout or assembly of other written or online materials.Organize, layout and assemble material from various sources for written publication. Revise final report document templates and sponsor-specific report templates.Advise study directors with interdepartmental standardization and Sekisui XenoTech documentation standards.Communicate with service departments' study directors and managers regarding applicable timelines.Coordinate preparation, revision and finalization of all contract service reports including Technical Writing unit scheduling.Ability to present information to and respond to questions from groups of managers, clients and customers.Assist with maintenance of Sponsor Requirements for all components of draft and final report deliverables (e.g., finalization preferences, signatures and formatting).Advise or conduct training for Sekisui XenoTech scientists and technical writers on procedures, standards and best practices of the unit and Sekisui XenoTech documentation standards.Adhere to Good Laboratory Practice regulations and Sekisui XenoTech safety policies and procedures.Assess study deliverables for compliance with applicable regulations and recommend corrective actions as needed.QUALIFICATIONS: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Master's degree (M.S./M.A.) or Bachelor's degree (B.S./B.A.) with minimum 2 years' experience in technical writing. Experience with scientific communication, scientific terminology, data and records generated in a laboratory environment desirable.Excellent organization skills and high attention to detail.Literate and proficient in the use of personal computers and peripheral equipment (e.g., printers, scanners, data retention devices, etc.).Ability to read, analyze and interpret documents such as safety rules, operating and maintenance instructions, procedure manuals and GLP regulations.Ability to write general correspondence and instruction documents.Proficient in software programs such as word processing, spreadsheet, graphics and statistical analysis applications. Ability to learn new software programs, as needed.Ability to apply concepts such as fractions, percentages, ratios and proportions to practical situations. Ability to apply advanced mathematical concepts such as exponents and logarithms. Ability to perform mathematical operations and statistical analysis using computer software.Ability to define problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram or schedule form.PHYSICAL DEMANDS: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is regularly required to sit; display finger dexterity, handle or feel; and talk or hear. The employee is occasionally required to stand; walk; reach with hands and arms; and stoop, kneel, crouch or crawl. The employee must occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, color vision and ability to adjust focus.WORK ENVIRONMENT: The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is incidentally exposed to fumes or airborne particles, toxic or caustic chemicals, risk of electrical shock, biohazard and risk of radiation. The noise level in the work environment is usually moderate.Those interested may apply via the online link. No phone calls please.Sekisui XenoTech is an EEO employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin."}