{"title":"Network Engineer - 1 (JobID: WISCJP00014030) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJcyOQq2ZtolJwv_xlIqjjezuFeuQ1lU-ZJAoqxCNTLV3ML_SQix-oRI2nsukrYgWwOeRg46H4eb0ZiwnrNcIZBfih5xaTzu2ntGO4hz-xPqR9Pz5HfB7XNzuxmkJd-c7nftiSqt4tZ6S0vHuPV7myiyI5ATkayWOvN2jv7-qGOia_mDLtGuL9HVYeOXg","source":"ziprecruiter","full_description":"Network Engineer - 1 (JobID: WISCJP00014030)+ 5830 Femrite Dr, Madison, WI 53718, USA+ Full-timeCompany DescriptionComputer Consultants International, Inc. (CCI) is an IT Consulting Firm with more than 18 years experience providing effective, expert-level services in industries such as Construction, Technology, Finance, Healthcare, and Government. CCI focuses on building long-term relationships while completing projects from design to delivery. People are CCI's key component for success. Recruiting utmost-quality individuals for our clients, CCI fields a workforce of individuals who are selected not only because of their technical qualifications but also for their achievements as substantial, contributing human beings. In government work and in the commercial market, high standards of ethics and accountability are critical. Therefore our people are chosen for their integrity and ability to maintain relationships, as well as expertise in their field. To learn more about CCI, visit us online at www.cci-worldwide.com.Job DescriptionPrincipally responsible for installing networking technologies and supporting networks. Assesses existing network configurations and makes recommendations based on product specifications. Configures equipment and software to meet business needs, trains others on the solution, and documents the solution for ongoing support. Functions as part of a team on larger projects, or individually provides the services on support visits or smaller projects. Provides technical support and assists with the design of network solutions. Requires experience in the technical services and support field as well as experience in network administration (DHCP, DNS, routers, firewall, etc.). Network Engineer capabilities with 8 or more years of experience, relies on experience and judgment to plan and accomplish goals, independently performs a variety of complicated tasks, a wide degree of creativity and latitude is expected.Qualifications + Change management *Required 3 years+ Methodologies - Understanding of project management methodologies and experience with 'agile' *Required 3 years+ Project management *Required 3 years+ Experience in Technical Writing and Documentation *Required 5 years+ Analytical/problem solving skills *Required 8 years+ Excellent oral and written communication skills *Required 8 years+ State of Wisconsin server or network environments experience *Required 5 years+ MS Office products *Required 5 years+ Active Directory Tools *Required 1 year+ Active Directory *Required 3 years+ Develop detailed technical designs to meet agency's network needs *Required 5 years+ Local Area Networks (LAN) *Required 8 years+ Network Administration *Required 8 years+ Network backup & recovery/fault tolerance *Required 5 years+ Implement new system configuration *Required 5 years+ Operating system administration (e.g., monitoring, process control, threads, upgrades and patching) *Required 5 years+ Metro Area Networks (MAN) *Required 5 years+ VoIP Networks *Required 3 years+ Wide Area Networks (WAN) *Required 5 years Additional Information For immediate consideration, please send your resume to career(at)cci-worldwide.com with \"Network Engineer - 1 (JobID: WISCJP00014030)-WI\" as the subject line.Job Location"}