{"title":"Full Stack Developer - All Levels","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJLBQkgbYDshONlrw0YQIF4eLHXtIWqS1E3j5h-CtymR5D9oPKUfcCZ6Z3AWktuqSGkJU0B4MY8fNpuNM-DQ91sx2Ju-wgBP77fxrjwDEVxkcf0k5bULZi3VTm6mY3IpScWY8HmASmyG6EtMQgkpZ0bJPGtnAVWKBCDyMPCgYnfmPwF1BTZr3NsWDoRFxb0","source":"ziprecruiter","full_description":"350 Spectrum Loop 80921 Colorado Springs,Colorado United States of AmericaRC317867 Full Stack Developer - All Levels (Evergreen) (Open)Information TechnologyWant a career where you are empowered to make a difference? Want to work for a company that is environmentally responsible? Want to grow and develop on the job? If so, FedEx is the place for you! Every day FedEx delivers for its customers with transportation and business solutions. FedEx serves more than 220 countries and territories around the globe. We can serve this global network due to our outstanding team of FedEx employees. FedEx has over 400,000 talented employees who are tasked with making every FedEx experience outstanding. FedEx has been recognized on many different lists both for business success and for being a great employer.Here are some of the recognitions FedEx has received from the past couple of years:Fortune \"World's Most Admired Companies\" - 2020Forbes \"Best Employers for Diversity\" - 2020Reputation Institute \"World's Most Reputable Companies\" - 2019National Business Inclusion Consortium \"Best-of-the-Best Corporations for Inclusion\" - 2019Women's Business Enterprise National Council \"America's Top Corporations for Women's Business Enterprises\" - 2019When 400,000 employees around the globe are all working together it is amazing what we can achieve! FedEx connects people and ideas. If you would like to make a difference on a global scale while receiving top notch benefits, competitive pay, and plenty of opportunities to develop, click 'Apply' and tell us more about yourself.Job Description: FedEx Services is seeking qualified applicants for Full Stack Developer positions at all levels.Your application to this posting may potentially be considered for multiple positions within this group.Full Stack Developer Positions: Full Stack Developer I Full Stack Developer II Full Stack Developer III Full Stack Developer AdvisorJob Summary:Duties for this role include but not limited to: code and unit test changes to computer programs from program specifications. Documents and maintains those programs.Job Specific Information: Design, develop and implement enterprise scale solutions to support the organization's business strategy and goals. Work closely with our business product owners on an Agile team to fully understand requirements, provide feedback, and request clarification as needed. Work with other engineers on a collaborative Agile team to deliver code on an ongoing basis. Review requirements and data models and translate into responsible applications and architecture Conduct design and code reviews with extended team to ensure that code meets FedEx Enterprise Foundational Services standards Track and resolve software defects Support test execution including system level and integration testsAbilities/Skills/Knowledge Considered a Plus: Skills in languages: Java and SQL Experience in leading 12-Factor application and Cloud platform implementation Object Oriented Design and Development experience Understand of software design patterns Applicant must work well under pressure Understand the SAFE Agile framework Knowledge of software craftsmanship and Agile best practices Barcoding technologies Knowledge of application development on Android or iOS platforms Mobile UI/UX design Source control tools: Git, Subversion, TFS Maven and Gradle build frameworks Spring Boot, Spring Cloud Integration technologies; such as SOAP, JMS, and REST Understanding of network design and architecture Familiar with microservice architecture principle JAVA 8 or higher Google Cloud Platform (GCP) Google Cloud Network  DockerDomicile: This position will be domiciled in Colorado Springs, Colorado.Remote Work: The ability to work remotely within the United States may be available based on business need.Relocation: Relocation assistance may be available based on business need.Minimum Qualifications:Full Stack Developer I - Bachelor's Degree/equivalent in computer science, engineering, or information systems and/or equivalent formal training or work experience.Full Stack Developer II - Bachelor's Degree in computer science, engineering, or information systems and/or equivalent formal training or work experience. Two (2) years work experience in information technology or engineering environment.Full Stack Developer III - Bachelor's Degree in computer science, engineering, information systems or related field and/or equivalent formal training or work experience. Requires three (3) years qualifying work experience in information technology or engineering environment. A related advanced degree may offset the related experience requirements.Full Stack Developer Advisor - Bachelor's Degree, in computer science, engineering, information systems or related field and/or equivalent formal training or work experience. Four (4) years qualifying work experience in information technology or engineering environment. A related advanced degree may offset the related experience requirements.Application Criteria: To be considered, please upload a copy of your current resume to include beginning and ending dates for each employer/position and answer job screening questionnaire.EEO Statement - FedEx Services is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetics disability, or protected Veteran status.FedEx Services will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee, unless undue hardship or a direct threat would result from the accommodation. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact recruitmentsupport@fedex.com.Job Posting End Date:"}