{"title":"Sr Software Engineer Technical Privacy NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ7WuKchIqmEpWQIO8RO7GzgWsAW5ZhEjJ6wxB_NRw6e-uezrPd1pi09BBiYt9LmT_zbpjIeGwsT1z21oHkiQsQbuf-0ktsw1WpIGsjXhthmvpqZLh-UYKndM7AU5CIgV8haJIZb258mYHrC7iwNMWXt1nJ1pcE33hISkRYLnqctaJk9CcnJTMllzqoHE24","source":"ziprecruiter","full_description":"About the Role Privacy Engineering's mission is to make Uber the industry model for consumer privacy through differentiated products and services, standards in engineering, and transparent communications. We are focusing on building both privacy technology platforms and user-facing products that give our users choice when it comes to their data, build trust, improve their data privacy, and enable our business. We are seeking a software engineer with technical depth, product intuition, and entrepreneurial spirit to join our Privacy Engineering team. You should feel comfortable in uncharted territory as we build innovative privacy technologies and grow user trust. We need your skills and enthusiasm to help make it happen. ### What You'll Do  Design, develop, test, and deploy software solutions to address real world privacy concerns through close collaboration with various engineering and product teams, as well as many business and legal teams across Uber  Deliver products and platforms to provide transparency and choices to our users around their data and work towards growing user trust  Build microservices, backend platforms and user interfaces for Uber customers & partners, internal stakeholders to enable automation of various privacy functions  Work closely in a big data environment and with large scale systems to manage user data lifecycle  Drive excellence by evangelizing and adopting best practices on engineering standards, and consumer privacy  Process massive amount of data, build software solutions to enable data inventory, data deletion and data preservation### Basic Qualifications  Expertise in Javascript and experience with frameworks like React, Angular, Backbone  Experience with Node.js, Java, Go, or other backend technologies  Familiarity with principles of good user experience  An engineering-focused undergraduate degree or equivalent industry experience  5+ years of software engineering experience  Experience building highly scalable, robust, and fault-tolerant products and platforms  Demonstrated experience collaborating with other engineers and non-tech stakeholders, both to meet short term goals and to create long-term partnerships### Preferred Qualifications  Versatility. In addition to having an intimate knowledge of the full stack, you see how it all fits together and can navigate both typical and complex pitfalls.  * Mobile app development experience in iOS and/or Android are highly encouraged given the scale of customer-facing mobile development that team undertakes  Experience building tools in a big data environment  Ability to learn on the go. You flourish with new technologies and don't believe in one-size-fits-all solutions. You can adapt to meet the needs of our massive scale, growth, and evolving business environment. * **Ownership. **You feel ownership for everything you deliver. You'd never call code \"released\" until you're satisfied that it's well implemented and tested. You pride yourself on efficient monitoring, thorough documentation, and proper test coverage.  * Attention to details. Whether you're working on an API used by other developers, an internal tool consumed by our operation teams, or a feature used by millions of customers, your attention to details results in a delightful user experience. * A great teammate. You believe that you can achieve more on a team; that the whole is greater than the sum of its parts. You rely on others' candid feedback for continuous improvement. You can take the lead and have a great sense of what doing 'the right thing' is. You seek ways to mentor others and share your knowledge with the team.  * Security or privacy expertise. This is a nice-to-have requirement but you may have knowledge and experience in approaches to securing user data and keeping it private. You have knowledge of integrating privacy in the systems and product design process. You might have experience with privacy enhancing technologies, e.g., data anonymization or differential privacy.At Uber, we ignite opportunity by setting the world in motion. We take on big problems to help drivers, riders, delivery partners, and eaters get moving in more than 10,000 cities around the world. We welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let's move the world forward, together.  Uber is proud to be an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know by completing [this form](https://forms.gle/aDWTk9k6xtMU25Y5A)."}