{"title":"Hardware Engineering Manager NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAICZ2oFSlaM11a8TPGLepggzErQdAeGzvHWlBE_HKJ2F_V7DMJfyzAvE0CbPtpZTF0HY3wvRwzuQCC7xnKxG-bX4P1HBEG0wKrEZCZax7zKEqn7O3R3Ua_Ll1koDHAFdozACVoPFaygfw-akdQXzyRg-LGrW7NGRMTn2aebY6_t4U6fWSKrJgJB4Sd36OU","source":"ziprecruiter","full_description":"Compensation: $135K-$155K Base Salary + Healthcare Benefits + PTO + 401k + EquityWho We Are:Liqid provides a dynamic bare-metal architecture for the most demanding datacenter workloads. We deliver unprecedented infrastructure agility, marking the next evolution in data center technology. As a global leader in Composable Infrastructure (CI), our open platform allows users to effortlessly manage and configure “physical” bare metal server systems in seconds. Liqid software and hardware work in harmony, allowing users to configure their physical server infrastructure on-the-fly while enabling true datacenter disaggregation.Does getting in on the ground floor of a data center technology that is disrupting the computing industry make your heart beat a little faster? Does the excitement of joining a team of exceptionally talented and motivated technologists at a well-funded, startup sound attractive? Are you looking for an exciting opportunity to interact with large enterprise, hyperscale companies? If so, please read on.What You Will Do:As a player/coach, you will lead our Hardware Engineering efforts, consisting of electrical and mechanical engineers. As well, you will contribute technically to the advancement of both the technology as well as the team. This hands-on position will work with peers across the Liqid business and cross functional engineering leadership to ensure that our products are designed, built, and delivered with high quality and minimum defects.We see your primary responsibilities including, but not limited to, the below items. Everyone at Liqid is expected to have a \"can-do\" attitude and be proactive in taking on challenges and presenting solutions.Lead a highly technical team from product concept to mass productionWork closely alongside a team of electrical and mechanical engineers to coordinate the release of hardware subsystem designsWork cross-functionally to provide hardware requirements for software feature development and drive factory test requirements for engineering buildsBe responsible for planning and execution of build events, including material planning and factory readinessBe the primary point of contact with vendors and CM partners to establish a daily build plan, provide clear direction and guidance to meet the program and build objectivesDefine budget, resources and schedule for each project implementation and provide concise status to the management teamBuild and promote a work environment that is highly collaborate and team-centricSet performance expectations for individual employees and monitor their success in meeting these goalsParticipate and facilitate the transformation of the hardware engineering team to an Agile workflowWho You Are:Proven track record of managing complex hardware product schedules and engineering builds down to the small detailsStrong technical background in Electrical, Mechanical Engineering, or Mechatronics5+ years of enterprise grade hardware engineering experienceSolid understanding of embedded software development, device drivers, and factory test requirementsExperience with hardware design flow which includes schematic entry tools, PCB Layout design process, vendor management, tool managementUnderstanding of high-volume manufacturing processes"}