{"title":"Technical Writer (Pharmaceutical Industry)","location":"","salary":"","description":"","term":"$32 to $33 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAKjC1QBzcxU8SUa7hDiImgC5_Jfz7XkcBNdy6XmZHQnefKbeHDYlrNmvCR-2-XDaTrJ71gaqSOotkdeRCzM5J4sJ2us75DdV5vnM2m3Up4W718mtG3L5KQOpC6HQ3c1hNG-QWLkMdws9ygd3FPajynhDTgV-Ag-zPILcZUPVXy1D9MQPsS3fz7Jl1hHtdg","source":"ziprecruiter","full_description":"Sunrise System Inc. is currently looking for Technical Writer in Portsmouth, NH with one of our top client.Job Title: Technical Writer IJob Id: 21-02455Location: Portsmouth, NH 03801Duration: 9 monthsPosition Type: Hourly contract Position (W2 only)Day Shifts: 6am-3pm and 8am-5pmJob Description Summary· This position is responsible for consistently delivering accurate and high-quality process Batch Records to Manufacturing in a timely manner for a number of different customer projects.· Level 1 Technical Writers review and edit cGMP documents, allowing these records to not only be timely and accurate but also easily understood by scientists, regulatory agencies, manufacturing workers, etc. Providing an important role in producing quality while proofreading, editing, and reviewing documents.· Level 1 Writers begin to provide support and communication among a multitude of different departments, organize and prioritize document schedules, and accurately and precisely review batch records used on the manufacturing floor. Level 1 Technical Writers, therefore, help create the foundation for successful product campaigns by producing error-free documentation, knowing that the documents they produce not only affect the ease of operations within the building but also patient safety, drug quality, and business reputation.Job Description· 65% - Authoring of Batch Records, coordination of the delivery of timelines for SOPs and other support documents for approval of batch records, participate in Project Team Meetings to coordinate Project schedules and alignment of groups in regards to the writing, review, and approval of process of batch records, ensure Batch Records are consistently generated and delivered to Manufacturing in a timely manner, to a high level of quality, and with a high level of inter-departmental collaboration that ensures the promotion of Right-First-Time operations on the manufacturing floor. Co-ordinate delivery timelines for SOPS and other support documents for approval of batch records· 20% - Manage document comments: Answer and translate questions into the reviewed document to meet regulatory, internal, and external requirements with the aid of document owners and other technical writers, Perform daily work to support TWG functions, including interacting with internal and external stakeholders/customers, hosting/attending ad hoc meetings and interceding on behalf of TWG to resolve obstacles.Support other tasks as required, including Regulatory and Customer Audits, and participation in required reoccurring meetings· 10% - Maintain schedules: Notify associated departments of deadlines and keep documents within their scheduled timeframe. Oversee day-to-day activities in TWG, including assignment of work, to ensure compliant, timely completion of tasks including support the issuing of batch records, editing and peer reviews as required· 5% - Perform other duties as assigned.Education· Bachelor’s Degree or equivalent -Scientific related fieldQuality Responsibility· Adherence to cGMPs is required at all times during the manufacture of APIs. All personnel own the quality of what they deliver and are responsible for notifying responsible management in a timely manner of regulatory inspections, serious GMP deficiencies, process deviations, product defects and related actions.Safety· Must know and follow job safety procedures, attend required health and safety training, proactively promote safety at work, and promptly report actual and potential accidents and injuries. Must comply with safety policies of the company and site.Work Experience· Entry Level experience in a production environment. Working knowledge of GMP / Biotechnology manufacturing background preferred. Entry level experience in QA and/or Documentation creation preferred. Practical knowledge and application of Operational Excellence / Lean tools beneficial. Practical experience with Microsoft suite a plus.ContactRahulDirect: (732) 837 0410|Email:rahul.r@sunrisesys.comOrMichael Peng Direct: (732) 272 0265 | Michael@sunrisesys.com"}