{"title":"Associate Software Engineer","location":"Seal Beach, CA 90740","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Address all phases of the <b>software</b> development lifecycle including requirements and interface definition, design, development, and integration of embedded…</li>\n</ul>","term":1,"jk":"6fe1348386b5fb8e","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=6fe1348386b5fb8e","source":"indeed","full_description":"Boeing is seeking an Associate Software Engineer to work in their Seal Beach, CA location.\n\nPosition Responsibilities:\nAddress all phases of the software development lifecycle including requirements and interface definition, design, development, and integration of embedded software for space-based applications, and product maintenance.\nSupport formal qualification testing, including software test description generation and test script generation using TCL\nAbility to effectively communicate with internal customers during development and after product release.\nResponsible for several parallel tasks as part of a fast-paced and dynamic team of systems and software engineers.\n\nRequired Qualifications, Experience and Education:\nTypical Education/Experience:\nEducation/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 2 or more years' related work experience or an equivalent combination of technical education and experience (e.g. Master). In the USA, ABET accreditation is the preferred, although not required, accreditation standard.\n\nBasic Qualifications (Required Skills/Experience):\n2+ years' previous experience developing software using C.\nBachelor’s degree or higher in engineering, computer science, or related field.\nThis position requires the ability to obtain a final U.S. Top Secret Security Clearance based on a Single Scope Background Investigation (SSBI) post-start, for which the federal government requires US citizenship.\n\nPreferred Qualifications (Desired Skills/Experience):\nPrevious technical experience in an aerospace environment.\nSelf-motivated problem solver, capable of taking initiative with minimal instruction.\nWorks under general supervision.\nAble to problem solve in a clear and concise manner.\nPossesses strong communication skills.\nPrevious experience with Unix/Linux.\n\nRelocation:\nThis position offers relocation based on candidate eligibility. Basic relocation is available for internal candidates.\n\nDrug Free Workplace:\nBoeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies."}