{"title":"IOS Developer in Baskin ridge, NJ for Long Term Contract Job","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK7nFMCFqOVfIKg93kg_C5by8b8zHqxfy1-kX5jbPVpfvaPxlGt0enVBRAsGgRssdpymAeXj3dkoFORvl1hJ9GZLWOc9BDiEyHqFyVrJqMF3lnGAlxtGb2TN-wu0EKLp2UR30XldgicZAQglJnjsHlgt1DyZQoAR-eHtJRXyNJ0HGukGZTildwh19wtakw","source":"ziprecruiter","full_description":"Overview Greetings We are looking for IOS Developer in Baskin ridge, NJ  Location, Are you available for this position in Baskin ridge, NJ  Location? Will you relocate to this location for Long Term Contract Job? Are you available for short/quick discussion over Call ? Role      : IOS DeveloperLocation: Baskin ridge, NJLong Term Contract JobJob DescriptionNeed 10+ years of candidateProficient with Objective-C and Swift.Experience with iOS frameworks such as Core Data, Core Animation, Core Motion, Core Location, etc.Experience with offline storage, threading, and performance tuningFamiliarity with RESTful APIs to connect iOS applications to back-end servicesKnowledge of other web technologies and UI/UX standardsUnderstanding of Apple's design principles and interface guidelinesKnowledge of low-level C-based libraries is preferredExperience with performance and memory tuning with tools Familiarity with cloud message APIs and push notificationsKnack for benchmarking and optimizationProficient understanding of code versioning tools Familiarity with continuous integrationDesign and build applications for the iOS platformEnsure the performance, quality, and responsiveness of applicationsCollaborate with a team to define, design, and ship new featuresIdentify and correct bottlenecks and fix bugsHelp maintain code quality and automatizationJob ResponsibilitiesDesign and build applications for the iOS platformEnsure the performance, quality, and responsiveness of applicationsCollaborate with a team to define, design, and ship new featuresIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatizationFlexon Technologies is a leading end-to-end technology solutions provider to IT and Non-IT industry. We specialize in providing \"Total Solutions\" encompassing technology and services combined with unparalleled domain knowledge that gives our clients a distinct advantage. We offer integrated business solutions, enabling clients to optimize their business with greater efficiency, and increased responsiveness. Our offerings are designed to cater to the entire range of clients' technology needs. We deliver end-to-end solutions that can build, manage and support our customers' IT systems across the entire value chain infrastructure, applications and business processes. The range of our offerings extends to software (including systems and application software development, implementation, maintenance and frameworks), IT architecture, network consulting, Staffing etc. These technology offerings backed by the domain solutions and knowledge to ensure maximum business alignment, allowing you to derive maximum benefits out of the IT investments. Benefits that Make a Difference:Medical, Dental and Vision plan options 401(k) Life Insurance Flexible Spending Account (FSA) Commuter Benefit Program."}