{"title":"Senior iOS Developer, Engineering productivity","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI1WFBHBNDPG6NJoBXjNc_Xplpnat9XtSoPV8XEg8sR3PN3OoVgycRcWAPweoqJBhZOhqbk4D6GVfAdbcQ3TAinivToeD1FRZgpWevbd6yvNyHrTM-RMOkFVprwUVFjtCli5TMACgdtfL6rpzVbAk_a_bZCqoyyP9byaE_dhz0gTu0QmmfXzsiHmFucL-5T","source":"ziprecruiter","full_description":"Title: Senior iOS Developer, Engineering productivity No. of Positions: 1 Position Summary: Enterprise Digital seeks to change the way individuals manage their healthcare by focusing on the features that matter to our customers, building software in a modern, lean way, and deploying continuously into the cloud. As part of an engineering organization building the Aetna Health experience, we help our members effectively find the care they need.What You'll DoThe Productivity team is responsible for supporting the engineering teams that build our Aetna Health client applications. They are the data-driven problem solvers who focus on helping improve the productivity of our engineers.In any given day you will:* Help improve engineering efficiency by building and supporting a diverse range of services and tools* Identify bottleneck areas and help optimize workflows in order to accelerate software releases* Seek opportunities to enhance the stability, performance, maintainability, and extensibility of our application.The typical salary range for this role is $112,200 to $167,200.This position is eligible for a CVS Health bonus plan or program.Benefit Overview:https://jobs.cvshealth.com/employee-benefits?prefilters=none&CloudSearchLocation=none&CloudSearchValue=none Req ID: 1476121BR Sourcing Requisition: No State: CO Business Area: CVS Health Location - State/City: CO - Denver Job Category: Digital City: Denver Preferred Qualifications: * Experience working with CircleCI* Experience with AWS* Proficient with CI/CD pipeline integration* Experience designing and building test/release infrastructure* Experience in tools development* Experience leading technical projects Country: United States Job Type (Expected Hours Category): Full Time Street Address: 1500 Wynkoop Street Location code: AO022 Requisition Template: Professional Education: Bachelor's degree or foreign equivalent in Computer Science, Information Systems, Engineering or related field required. FLSA: Exempt Clinical Licensure Required: N/A Zip Code: 80202 Required Qualifications: * 5+ years of web development experience Business Overview: At CVS Health, we are joined in a common purpose: helping people on their path to better health. We are working to transform health care through innovations that make quality care more accessible, easier to use, less expensive and patient-focused. Working together and organizing around the individual, we are pioneering a new approach to total health that puts people at the heart. We strive to promote and sustain a culture of diversity, inclusion and belonging every day. CVS Health is an equal opportunity and affirmative action employer. We do not discriminate in recruiting, hiring or promotion based on race, ethnicity, sex/gender, sexual orientation, gender identity or expression, age, disability or protected veteran status or on any other basis or characteristic prohibited by applicable federal, state, or local law. We proudly support and encourage people with military experience (active, veterans, reservists and National Guard) as well as military spouses to apply for CVS Health job opportunities."}