{"title":"Machine Learning Software Engineer NEW!","location":"","salary":"","description":"","term":"$130,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJr_TNtAEUdBFC8989CY7_009aWSAsT9Pt-X3nzyT-H_Lb9A1o6EG3D6XTrbBL_lFeNKdev0iCjU-gqqwbPHKyf1To2bQn_iOZafzCZilt0z69kJS2OZah34ZBYAji1fDIOcnVr-cC5HoWag3xn328eH63yneGjlsn3olFOqryj-DtqROwpiP8U_fNPtA","source":"ziprecruiter","full_description":"Job DescriptionProtek is currently seeking a Software Developer/Engineer with expertise in artificial intelligence/machine learning (AI/ML) efforts; specifically focused on Reinforcement Learning. This position requires a Secret level, DoD clearance. The selected candidate will go through the process to acquire a Top Secret Clearance.The project this role will support is a rapid development and deployment effort to develop counter UAS (CUAS) technology for a critical US Department of Defense customer. We are looking for a multi-skilled software developer to join the team to assist in delivering critical AI/ML/RL enabled solutions. A developer joining the project team will learn about the complex multi-disciplinary mission as well as engage with a highly skilled engineering team delivering a cutting-edge solution to the end customer.Essential Job ResponsibilitiesAs part of a small internal team, you will play a key role in the software design, development, testing and support for a counter-UAS tool designed to both automatically react to UAS within range and advise a user which action to take.Collaborate with a diverse team of engineers from the company, government customer, and various vendors, working in a dynamic and fast-paced environment to meet evolving requirements.Develop reinforcement learning to model behaviors in a Unity engine-based simulator. Create and train models capable of evaluating and issuing appropriate course of action recommendations. Assist in the development of evaluation metrics to assess the effectiveness of AI/ML algorithms in the presentation of CoA options to the warfighter.Designs and develops system architectures and AI/ML models.Designs, develops, documents, tests and debugs applications software and systems that contain logical and mathematical solutions.Conducts multidisciplinary research and collaborates with equipment designers and/or hardware engineers in the planning, design, development, and utilization of electronic data processing systems for product and commercial software.Determines computer user needs; analyzes system capabilities to resolve problems on program intent, output requirements, input data acquisition, programming techniques and controls; prepares operating instructions; designs and develops compilers and assemblers, utility programs, and operating systems. Ensures software standards are met.REQUIRED SKILLS/EXPERIENCE:5 years relevant experience with Bachelors in related field; 3 years relevant experience with Masters in related field; 0 years relevant experience with PhD or Juris Doctorate in related field; or High School Diploma or equivalent and 9 years relevant experience.Experience working as part of a technical engineering team.AI/ML experience (specifically Reinforcement Learning)Experience with standard machine learning techniques, tools and frameworks (Python and its associated libraries) including but not limited to: pandas, numpy, Tensorflow, keras, Pytorch, Torch, etc.Applies extensive technical expertise and has full knowledge of other related disciplines.Able to communicate effectively and clearly present technical approaches and findings.Develop technical solutions to complex problems which require the regular use of ingenuity and creativity.DESIRED SKILLS/EXPERIENCE:Master’s degree in engineering, computer science, or other related technical fieldProcedural Environment Creation experienceExperience using Reinforcement Learning with drones/vehicles.Experience applying Reinforcement Learning in Unity (preferred) or Unreal environmentsExperience developing a Machine Learning (ML) pipeline from data collection to model training to model deployment.Experience analyzing large scale data from a variety of sources.Design, validation, and characterization of algorithms and/or systemsRedis/NoSQL experienceGeospatial experienceVersion control experience, git preferred.Experience with UAVs/CUAS"}