{"title":"Junior Networking Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK5B-P_eEtEsp8rsce4wkE1Nh2JUGOmHpdOuv0GO4E186x_OaaOgsHkmyBwBi6ND9PXE3x_O7xD6u6F070n-PqDvbZJusRUA189z3pKbQyNpk7iAfE8yviAwso1L3JrAiVjkpqvN0jis5aXolm8mHC1WU1KaFVZlIipNtZMD6q8oUGRqV2a3raY2yV7K0rp","source":"ziprecruiter","full_description":"Network EngineerLove a challenging, fast paced environment?  Want to make a jump into Networking - you think you can learn anything and everything associated with running a network - from unboxing a switch to configuring RADIUS authentication for an AP to troubleshooting BGP peering issues over a VPN connection?  Do you make Visio floorplans of the furniture layout in your house?  Do you speak in acronyms like TCP/IP, DNS, EIGRP, AAA, DNS, BGP, OSFP, SSH, and others? If the answer is yes - you might be a fit - and you'll deserve a free cold beer in the company break room at the end of the day.What you'll doImplement and manage LendingTree's network, from our headquarters in Charlotte to remote offices across the country or on the other side of the world.Manage our firewalls, switching, and routing infrastructure - primarily Palo Alto, Aruba, and Cisco.Manage Palo Alto Firewalls with zero-trust architecture.Manage Aruba wireless technologies.Work with our DevOps team and network in the cloud(s).Create and update network documentation.Work with a creative, collaborative team to not only fix problems, but identify ways to prevent them from reoccurring. You're not the type to want to do things twice.Participate in a 24x7 on call rotation to ensure network systems stay up and running at all times (well, maybe 99.999% of the time ...)What we'd like to see you bring to the tableAt least 2 years' experience in an enterprise IT environment - or related networking education - or some Associate level certifications - like CCNA, AWS SA, Network+, PCNSA, ACSA, ...Expertise in some IT technology - it could be Linux, Microsoft AD, SQL databases, or maybe you're a scripting guru with Powershell, Python, C#, or you built your own Plex server at home, or you built a Raspberry Pi Server to live stream your pet lizard - whatever.Experience with one or more monitoring tools such as Solarwinds, Tembria, SumoLogic, Nagios, etc.Some knowledge of network infrastructure technologiesNot afraid to learn new things, make mistakes and ultimately get s___ doneYou dig tech and are Intellectually curious about technology (you know if you are!)Bonus PointsExperience managing a Microsoft Active Directory infrastructure or Linux Systems, especially network related services such as DHCP, DNS and NTP.You have some IT certifications.Exposure to AWS or similar cloud technologiesExperience with Aruba, Palo Alto, Cisco, Juniper, or any big networking company's gear."}