{"title":"          Software Dev Engineer I NEW!        ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAIDU6Cvi41w74Hk1biZSwcIAkEXg8gdpKTAw3r63ZHvf4kNX4yxLaVImNl4_rCsk_SS08sS4CbMlFcdzKTvhQEKNtm6lUnjOpbUVFzTuYScpxmbBe67VHTYFK4Gp1G6PDPg9Glpwhprw6FJMriHxwZDDm0PRuKUyO-Zvs752YHcSvFZTCux2Gn2-po3dU4","source":"ziprecruiter","full_description":"\n        Job Description:The Human-in-the-loop services team enables the use of human intelligence in Machine Learning. Common use cases include video labeling, 3d point cloud object detection, and natural language processing. Successful machine learning models are built on high-quality training data. But the process to create the training data is often expensive, complicated, and time-consuming. Products such as SageMaker Ground Truth and Augmented AI solve the problem using smart crowd-sourcing and Machine Learning technologies, and thus improving the quality of the training data while reducing the cost.Autonomous vehicle segment needs data pre processing data pipeline which includes cleaning up the data collected from various sensors (LIDAR, Camera, Radar), ensuring data is calibrated and time synch in order to be rendered correctly for labeling. It needs to be optimized for performance and usability.We are looking to expand our team with software engineers with such experience. You will be expected to contribute to the overall architecture, implementation and ongoing maintenance of these data prep processing pipelines to meet customer unique needs.REQUIRED SKILLSBA/BS degree in Computer Science, Robotics or relevant technical fieldExperience in data structures and advanced algorithmsExperience in AV domainPREFERRED SKILLSExperience developing in a highly-concurrent, multi-processor, and multi-threaded environment.Strong math fundamentals and a good grasp of 3D geometry and Vector mathPrevious experience building perception system data pipeline for AVExperience investigating and resolving performance bottlenecksExperience with modern machine learning techniques\n      "}