{"title":"Network Engineer - Entry Level","location":"","salary":"","description":"","term":"$20 to $40 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJkGOYMxCoFwKHEQa3Z9TTqy-mgAqbq93HYdtrYkbwZCDm6ONHPMgGfO-2qlWD1QWgHYWb0OTvWru6dD90sQv2bhzhGTrVFb12h2DaE-7_a1R1AU-qxaJHjklVZh2kmL5WUUM0O9AtJANe5ta1YZKLf95aiklSCINRGxKjPQuUFmSp0hpspEOQWeMxgA-ke","source":"ziprecruiter","full_description":"About Aston:“Our culture of Innovation, Collaboration, Inspiration and Mentorship is at the core of our success.”With offices in Minneapolis, MN and San Francisco, CA, Aston has been connecting people with opportunities to learn and innovate since 2001. Our two decades of stability and rapid growth have transformed the IT company into a national powerhouse with IT projects in 40 of the 50 states. Empowering our people with the newest technologies in a family-oriented environment is our priority.Job Description:This Cisco Network Engineering position will be working on client’s IT projects to help assess, implement, design, configure, and troubleshoot to ensure a successful project completion. We are seeking talented individuals that are motivated and eager to kick start their career in the IT industry.Training includes:· Full time (40hrs/week) paid training· Corporate housing provided upon request in lieu of an hourly rate· Collaborative team environment· Hands on access to state-of-the-art technology· 1 on 1 mentorship with highly skilled Sr Level EngineersOn Project Perks and Benefits:· Pay starts at $20/hr after completing our 3-month paid training program· Company paid travel· Weekly travel Food stipend· Monthly travel/transit stipend· Aggressive raise structure· Excellent Health, Dental Vision, and 401(k)· Certification Reimbursement (example: CCENT, CCNA, CCNP)Requirements:· Professionalism· General understanding of basic computer terminology· Basic fundamentals of Windows OS & proficiency in MS Office Suite· Great communication skills (oral & written)· Must be open to 100% travel/relocation ( Currently travel is limited due to COVID )· Successful completion of a background check and drug screen· Must own a reliable vehicle to drive to MN· Ability to train out of our MN Headquarters"}