{"title":"RMS Java Android Developer / Ridgefield Park, NJ / SW Development / SN768772 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ4FQk7qsdNPtUML4auEri196llA5jZRPuCBBw4fAgbgFH_iAJTNct5f4mRzin3wr2KJBOBFtOzeoD3KHKaZuz97ucDbu8-WocU33AVtC0Gue9nm1lNdKwJrh3VfA_q26KY-tj3jje7E7RJ6NCjA8TCUEeeycjO-xWM5UrWs-wC2TGHWgL3G3dHMF3xQg1b","source":"ziprecruiter","full_description":"Summary:We are a visionary leader in the IT Business Intelligence industry that is looking for an android developer to assist us with the maintenance, development, and implementation of our internal mobile applications across business groups. The candidate must have a solid background in android development and is expected to be conversant with multiple technical disciplines including J2EE web application development, client/server architecture, and database operations.The role will primarily involve android application maintenance and development but will also include some traditional web application module development and maintenance as well. Responsibilities cover the entire development lifecycle, from requirements gathering and brainstorming, analysis, coding, testing and documentation. It also requires strong problem-finding skills with quick adaptation to existing application for business functions and technical structural layout.Requirements:2-5 years of experience (low to mid-level) in android application development and maintenance including knowledge in Core JavaExperience in Java based technologies with preferred knowledge in one or more of the following areas: J2EE, Spring MVC, iBatis/Hibernate/JPA, JDBC, JSP/Servlet, Web ServicesExperience in consuming RESTful APIFamiliarity with one or more of the following applications servers: WebLogic, JBoss, Tomcat, or Sun One J2EEWASExperience of working with front end technologies~HTML, CSS, jQuery, JavaScriptExperience of working with RDMS (Oracle preferred), SQL, PL/SQL proceduresFluency in communicative English (verbal and writing)BS/BA or higher in Computer Science or related field Special Skills:Experience in iOS App development (Preferred)Experience with multiple O/S's: UNIX or Windows server platforms.Goal oriented and self-motivatedAbility to work independently or within a team environment.Strong oral and written communications skills with ability to create software design and engineering documentsAbility to multi-task and deliver high quality work under tight deadlines is essentialAbility to work in a fast-paced environment under deadlineAbility to learn, excel and deliver at a quick pace is required"}