{"title":"Project Engineer - Nuclear NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIyxpueeggoLIdhUgiTKK6mbzDR5AZmWY7Fy02w1DBRTeWpjbRiZySXKMiEjxK8X34IOMmJ3Z9VV2gvPCe_O7uwtmh9SJ9nlFwl2XKvD_4jGAskUAbtrjHBGAgXIgi8g6SqNojavroJRrzFUmY6K-3_wBZoYIAjRQYEP4YlQdzih9bwNOe_tarjvXyHYqU","source":"ziprecruiter","full_description":"JOB RESPONSIBILITIES:Detail valve design and perform other support functions in order to meet deadlines, commitments and manufacturing. Whenever possible, modify existing parts to speed process.Support draftsman/w, stress engineer, test engineer, technical writer on valve design so that they can become familiar with the design expectations and documentation of the unit.Must have excellent analytical skills and prepare ASME code Design Report using Mathcad software.Produce operability calculations in order to insure compliance to customer specifications/request.Assist and advise the Engineering Manager with regard to technical information pertaining to customer specifications and manufacturability on new order proposals.Review, approve and comment on customer requested design changes.Work within the team to ensure accurate and timely response to custom requirements.Monitor, control and promote the standardization and refinement of engineering software used on the engineering computer network.Keep well informed on new developments in the engineering field through contact with educational institutions, professional societies, manufacturers and trade shows, perusal of texts, technical papers, journals and periodicals.Assist and provide recommendations to Engineering Manager concerning procedures, personnel, equipment or other improvements that may better the overall effectiveness of the Company.EDUCATION REQUIRED:BSME with PE License.Masters in Mechanical or Electrical helpful.Electrical component training a definite plus.EXPERIENCE REQUIRED:Working knowledge of PC based CAD system (by choice – SOLIDWORKS). Minimum five years design of intricate mechanisms and electro-mechanical components. Ability, to work in a team environment usually as a leader. Knowledge of ASME CODE, ANSI B16.34, B31-1, B31.3 and MathCad software would be a benefit."}