{"title":"Chemist A","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJAFFD3PYkVbXw6wRuOj8VQ0VVGMn2esuQILmL5vUfdQMhzdsYtXSpziWrhlxBbbt_FlH72ZoIOlaNlGlUQaNlT8xSn-kGXQUWgS6miXIt-ys0qiIXnp3haRV8HbQkp4NO_Gle3iaToywP4_E_njdAEmTi_AgiNDal17_ghBimE3ckDSx91jorI1xVtkKM","source":"ziprecruiter","full_description":"Chemist ADayton, NJJob Id: 10626Are you looking to make a career change to a stable and growing company? This exciting opportunity offers a competitive salary plus an excellent benefits package including Medical, Dental and Vision. Does this position match your future career goals? Then this opportunity could be the right fit for you. RESPONSIBILITIES:Responsible for method development of testing protocols based on validated compendial monographs.Responsible for maintaining Independent verification testing programs with 3rd party contractor.Perform routine laboratory analysis, such as finished product testing, dissolution testing, stability testing, raw material testing, cleaning verification testing and manufacturing in-process testing.Responsible to perform assigned sampling, physical, chemical tests and assay on raw materials, active pharmaceutical ingredients, in-process, finished and stability products, using various wet chemistry, physical and instrumental techniques (HPLC, GC, UV-Vis, IR, Particle Size Analyzer, KF Autotitrator, Bulk Density, and other routine QC instruments) as per as per USP monograph / In-house / any other Compendial monographs.Must be able to independently plan and execute testing to meet established time lines. Perform complicated testing with supervisory direction.Must prepare and/or Review Test Procedures, SOPs, and Protocols as assignedMust provide the necessary document to Support for the ANDA filingMust perform troubleshooting and investigations under the direction of a supervisor/senior QC chemist.QUALIFICATIONS:Bachelor’s degree in Science or related field5+ years of experience in the same field.3+ years in Analytical Testing in raw materials, finished products and stability testing.BENEFITS: Medical InsuranceDental InsuranceVision Insurance Contract to HireAsk for: Harshita Berryharshita@ajuliaexecutivesearch.comAjulia Executive Search is a New Jersey based Executive Search Firm specializing in retained searches in multiple sectors, including Manufacturing, Finance, IT, Legal, and Pharmaceutical. We have a nationwide client base and offer services in temporary and direct hire placements.#ZR"}