{"title":"Full-Stack Software Engineer Intern","location":"Palo Alto, CA","salary":"\n\n$40 an hour\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Experience using cloud services such as AWS.</li>\n <li>As a full-stack <b>engineer</b> at VALUENEX, you will work closely with data scientists, designers, product managers, and…</li>\n</ul>","term":1,"jk":"ad3ffd74769fc107","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=ad3ffd74769fc107","source":"indeed","full_description":"About this JobAs a full-stack engineer at VALUENEX, you will work closely with data scientists, designers, product managers, and other developers to translate UI/UX wireframes into actual code. You will combine the art of visual presentation with the science of engineering to help evolve the VALUENEX platform and infrastructure. You are expected to work 30+ hours per week, with the possibility of converting to a full-time role after the internship.Responsibilities:Collaborate with product design and engineering teams to deliver new features for the VALUENEX productWork with data scientists to implement algorithms and prototypes on the front-endEnhance existing features for speed and scalabilityRequirements:Experience with modern web technologies and techniques such as such as HTML and CSSExperience with Ruby, Ruby on Rails, JavaScript build tools, and modern JavaScript frameworks such as React, Redux, or Reactive along with the knowledge of when to use themStrong unit testing and debugging skillsPassion for creating beautiful, intuitive, efficient, and empathetic user interfacesAn ability to critically assess design and engineering practices to maintain the highest ethical standardsPreferred Qualifications:Experience with C/C++Experience with RESTful API developmentExperience with relational databases such as MySQL, PostgreSQL, etc.Experience using cloud services such as AWSEEO Statement:We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, disability status, sexual orientation, gender identity, age, protected veteran status or any other characteristic protected by law.INTERNSHIP EXPERIENCE:Read about the experiences of some of our interns here: https://en.valuenex.com/en/intern-interviewsAbout VALUENEX Inc.VALUENEX is a big data predictive analytics platform and consulting services company, powered by proprietary algorithms, artificial intelligence, and teams of data scientists and expert analysts. Founded as a startup in Tokyo in 2006, the company provides solutions for Corporate/R&D strategy development, Intellectual Property(IP) monetization and evaluation, investment analyses and leveraging, and technology convergence mapping. Working with clients across a wide range of industries and business functions, VALUENEX’s panoramic-view analytics software and expert consulting has led to breakthroughs in big data analytics and predictive modeling and has grown on the global stage to include 45% of Japanese Fortune 500 as clients, as well as major corporate partners such as Honda Motors, Panasonic and Mitsubishi UFJ Morgan Stanley. Through advanced capabilities in strategy development, white space extraction, pan-industry or technology-specific trend mapping, and comprehensive M&A analyses, VALUENEX continues to hold the top position in the field.Job Type: InternshipPay: $40.00 per hourBenefits:Flexible scheduleSchedule:8 hour shiftMonday to FridayEducation:Bachelor's (Preferred)Experience:Ruby: 1 year (Required)ReactJS: 1 year (Preferred)Work Location:Fully RemoteThis Job Is:A job for which military experienced candidates are encouraged to applyOpen to applicants under 18 years old, provided it is legally allowed for the job and locationOpen to applicants who do not have a high school diploma/GEDA “Fair Chance” job (you or the employer follow Fair Chance hiring practices when performing background checks)A good fit for applicants with gaps in their resume, or who have been out of the workforce for the past 6 months or moreA good job for someone just entering the workforce or returning to the workforce with limited experience and educationA job for which all ages, including older job seekers, are encouraged to applyOpen to applicants who do not have a college diplomaA job for which people with disabilities are encouraged to applyCompany's website:https://en.valuenex.com/COVID-19 Precaution(s):Remote interview processVirtual meetings"}