{"title":"Technical Writer / CMS Administrator NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALH2jmMCmlx1AohyCc0FXCnY2rXEf1lp1-j4F6WunwhsQX12q8BOKFr2k5tRknusmZDmOsYpzZLDLwGR0JJKXSVO8Pvrown4LYruOY6JRtOPag44WQjLoVuM2MNoFmtUMYs0ANxwHG7N75hs1qCCTIpOXQwUp8m23Cy3eTAd4lXNpBxG5nvw10KhunCNua6","source":"ziprecruiter","full_description":"Danaher Company DescriptionAt Cepheid, we are passionate about improving healthcare through faster, more accurate diagnostic tests. With our GeneXpert System, we've taken the most sophisticated molecular technology and packaged it into an automated, easy-to-use format that has quickly become the platform of choice worldwide. From the largest laboratories to small physician offices, our game-changing solution delivers critical answers when clinicians and patients need them most. Through strong molecular biology capabilities and ongoing product innovation, we are focused on developing tests for healthcare-associated infections, sexual health, critical infectious disease, virology, and oncology applications. Come join our vision for abetter wayand help make life better for us all! For more details, visit us atwww.cepheid.comor follow us on Twitter (@CepheidNews).DescriptionThis unique, hybrid position delivers Cepheid's Product Labeling and end-user instructions in the form of Package Inserts, Operator's Manuals, Service Manuals, Training Materials for Field Applications, Installation Procedures and handbooks for distributors. These publications follow style guides and meet FDA regulations and/or CE mark specifications. The Technical Writer also works with an outside vendor for multi-language translations and manages deadlines according to project timelines. This job involves working in cross-functional project teams involving hardware, software and reagent product lines. The Technical Writer provides content, format and editing for customer-facing product labeling.As a CMS administrator, you will be responsible for overseeing Cepheid's CMS system which includes but is not limited to developing style guides and modifying DITA cascading style sheets.Technical Writing Creates or edits Package Inserts for Cepheid's assay products. Creates or edits user and service manuals for Cepheid's system products. Interprets and analyzes content for grammatical consistency to Cepheid's style guides and ensures that all documents meet the style guide requirements. Responds to project scope and/or timeline changes. Initiates and follows up on document reviews with subject matter experts. Oversees translations and formats final translations from our third party translation supplier. Completes final inspection and release procedures for all documents. Creates and updates training materials that Field Application Specialists use to train customers and training documents that are provided to the customers.CMS Administrator Monitors and enforces content reuse policies. Develops DITA style guides use in online user documents. Modifies DITA Cascading Style Sheets to improve outputs readability. Implement a taxonomy and classification structure for DITA content.* May assign topics to other technical writers.**Qualification***MINIMUM REQUIREMENTS:Education or Experience (in years):  Bachelor's degree in Life Sciences or Engineering with 8 years of related work experience*Knowledge and skills: ** Working knowledge of Adobe FrameMaker, Adobe Acrobat, Adobe Illustrator, Adobe Photoshop, Microsoft Word and Microsoft PowerPoint. General knowledge of English grammar, punctuation and overall writing skills. Must have good verbal communication skills for working on teams. Working knowledge of Adobe InDesign a plus. Working knowledge of creating and editing XML files using DITA is required as well as experience using JustSystems XMetaL software a plus. In-depth experience as a CMS Administrator; experience using Vasont CMS is a plus.*Physicalrequirements/abilities: ** Must be able to sit for several hours. Work may involve repetitive arm/wrist motions.PREFERRED REQUIREMENTS (optional):*** Preference given to candidates with medical equipment writing experience, complex hardware operation and service procedure experience or scientific writing experience.* Preference given to candidates with Vasont CMS.Danaher Corporation OverviewDanaher is a global science & technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&P 500 by more than 1,200% over 20 years.At Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We're innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you'll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.Organization: CepheidJob Function: CommunicationsPrimary Location: North America-North America-United States-CA-SunnyvaleSchedule: Full-timeReq ID: CEP002351Cepheid is an equal opportunity employer and strictly prohibits unlawful discrimination based upon an individual's race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, mental/physical disability, medical condition, marital status, veteran status, or any other characteristic protected by law."}