{"title":"Software Engineer","location":"Valencia, CA 91355","salary":"\n\n$63,000 - $93,000 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>This role will be based from our Valencia, CA headquarters but for the right candidate we would support part or full time remote work.</li>\n</ul>","term":1,"jk":"98e28910438cf92f","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=98e28910438cf92f","source":"indeed","full_description":"COMPANYAdmediary is an online performance marketing company that specializes in lead generation via the internet and phone for all major industry verticals. We create relationships between hundreds of service providers and millions of consumers each year. We are seeking a Software Engineer to join our growing engineering team. We are based in Valencia but working remotely at the present time.This role will be based from our Valencia, CA headquarters but for the right candidate we would support part or full time remote work.RESPONSIBILITIESWork in a fast paced, collaborative environmentContribute to overall company and engineering team goalsWork both as part of a larger team and autonomously depending on the projectQUALIFICATIONS1-2 years of professional software development experienceStrong experience with HTML, CSS, and JavascriptExperience with PHP and SQLExperience with JQueryNICE TO HAVEExperience with ReactExperience with Mongo or other noSQL databaseCOMPENSATION/BENEFITS: Salary commensurate with experience401(k)Health insuranceDental insuranceFlexible spending accountLife insurancePaid time offVision insuranceJob Type: Full-timePay: $63,000.00 - $93,000.00 per yearBenefits:401(k)Dental insuranceFlexible spending accountHealth insuranceLife insurancePaid time offVision insuranceSchedule:Monday to FridayCOVID-19 considerations:All employees working remotely at the present timeEducation:Bachelor's (Preferred)This Job Is Ideal for Someone Who Is:Dependable -- more reliable than spontaneousDetail-oriented -- would rather focus on the details of work than the bigger pictureAutonomous/Independent -- enjoys working with little directionInnovative -- prefers working in unconventional ways or on tasks that require creativityCompany's website:admediary.comBenefit Conditions:Waiting period may applyOnly full-time employees eligibleWork Remotely:Yes, occasionallyCOVID-19 Precaution(s):Remote interview processSocial distancing guidelines in placeVirtual meetings"}