{"title":"RFP Technical Writer - K12 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALJJFo57Wv1TncRfMOZqqMUyDrd7jioKWO3sbDbBMpUcvSLl3tr_teDQ22aVEwTIY7kK68ONnz0TBrjuKOvy-Tlw_kflZ34KyT9gdulGsi-l3_WesXcIAQuQ_dR80C4qkLhKa5UNNX7CEehd1OfwhzJDfIm9aHgxlhLlxl7-rx_7XSyAT1bQbnbuuk5qXnz","source":"ziprecruiter","full_description":"Impact the Moment  Could your creative thinking build the future? Our Request for Proposal (RFP) Team at McGraw Hill makes a difference for learners and educators across the world. Our team needs individuals with new ideas who connect with people in innovative ways.   McGraw Hill, the leading provider of digital and print educational materials is looking for an RFP Technical Writer (K-12) to manage narrative for latest product releases and version enhancements for proposal requests from the sales organization of educational products in both Open Territory and State Adoption states. This individual will become the liaison with internal platform teams to develop and maintain software and hardware technical proposal language. This position will sit out of our Columbus, OH location. (Please note we are currently all working remotely due to COVID-19.) What can you expect from the position?         Lead the writing and completion of assigned projects, while collaborating cross functionally across the organization.        Serve as primary point of contact to facilitate conversations with the necessary platform specialists to ensure appropriate technical information and responses are obtained for proposals.         Use and apply project management principles to ensure projects are meeting milestones and deadlines.         Moderate in-take communications and facilitate RFP launch or other stakeholder meetings for assigned areas.         Create and monitor a project schedule to ensure all projects stay on track.    We're looking for someone with...        Bachelor's degree required.        2-4 years of technical writing experience within an RFP process strongly preferred.        Experience working with request for proposals (RFPs), or grants required.        1+ years Project Management experience required.        Demonstrated success achieving service level expectations in a fast-paced environment while meeting critical deadlines.         Understanding of the education technology landscape. The ability to understand technical terminology and translate technical information into non-technical language. As an education innovation company, we're proud to play our part by inspiring learners around the world. If you bring your curiosity, we'll help you grow in a collaborative environment where everyone shares a passion for success.  Are you ready for a new challenge? Apply for a career at McGraw Hill and together, we'll impact the world."}