{"title":"Software Engineer Apprentice","location":"San Jose, CA","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Software Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run…</li>\n</ul>","term":1,"jk":"6ed23a8de39ebd80","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=6ed23a8de39ebd80","source":"indeed","full_description":"Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\nYour Role and Responsibilities\nAre you interested in pursuing a software development career? Have you heard about agile development, but want to learn more about how it ‘works’? Are you someone that has a foundational understanding of development or programming concepts, but want to take a less traditional path to achieve it?\n\n\nWhat is an Apprenticeship?\nIBM Apprenticeship Program, which lasts approximately 12 months, is an official registered apprenticeship recognized by the Department of Labor (DOL). Every graduate of a Registered Apprenticeship program receives a nationally-recognized credential from the DOL.\n\nDuring the apprenticeship duration, you will be required to complete specific learning hours and on the job training that has been outlined to ensure you are developing the skills and competencies essential to the role. You will be able to learn and grow at your own pace, but we expect most apprentices will complete their learning within 12 months. Once you graduate and receive your certificate from our apprentice program, you will be eligible to apply to available full-time roles at IBM.\n\n\nWho you Are\nAn apprenticeship is about learning. We’re seeking candidates who have the following requirements, but we know you’re just getting your career started, and we’re committed to helping you learn and grow. If you’ve had some experience with coding or development in the past, you’re exactly the type of candidate we’re looking for….\nDrive and eagerness to learn\nStrong problem solving and communication skills\nAble to work independently and take initiative, as well as work collaboratively and contribute to an agile team environment\nSome knowledge or experience in ONE or more of the following:\nJava, JavaScript, PHP, C#, Objective-C, C/C++, Python, Ruby and/or functional languages (Haskell, Scala, F#, Clojure)\nDesign Thinking\nHypothesis driven development\nSocial coding\nAgile principles\nContainer development using tools such as Docker or Vagrant\nApplication Development, DevOps automation, and the development toolchain (e.g. Travis, Jenkins, Junit, automated test tools)\n\nWhat’s the Experience?\n\nAs an apprentice, you'll join with other apprentices in a local cohort. You'll go through your first few weeks together, learning about IBM and the skills you'll be attaining throughout your apprenticeship. Then, you'll work with your managers and mentors to progress through your personal skills roadmap, learning and demonstrating new knowledge and competencies through hands-on application with your project teams. You'll complete milestones along the way, earning digital credentials to validate your skills, and will come back together with other apprentices to participate in on-going training and development focused on your professional and technical skills.\n\nAs a Software Engineer Apprentice at IBM, you’ll work as part of a larger team of experienced developers and mentors in an interactive, collaborative environment. You’ll learn the fundamentals of development, software design, testing, and cloud computing, agile principles, IBM Design Thinking, DevOps and continuous delivery. You will also learn how to resolve IBM customer issues, debug customer problems and environments, and increase Cloud Service skills, and will build the skills to grow your career as a Software Developer. Best of all, you are a contributing member of your team, putting forward ideas, taking on responsibilities and making choices about how you get the job done just like any other IBMer.\n\nNo relocation is available for this position.\n\nncappx\n\nRequired Technical and Professional Expertise\n\nMust have basic knowledge in one of the following programming languages: Java, JavaScript, PHP, C#, Objective-C, C/C++, Python, Ruby and/or functional languages (Haskell, Scala, F#, Clojure)\nWillingness to complete the requirements of the apprenticeship program.\n\nPreferred Technical and Professional Expertise\n\nNone\n\nAbout Business Unit\nIBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the world’s most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio designed for cognitive business and optimized for cloud computing.\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\nLocation Statement\nIBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}