{"title":"Clinical Laboratory Technologist - Chemistry - Evenings","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALmHjrrb7XaDmiZ3-Y9sl8O5aVc2Bvrhlcbdp5QQ-oMDtmRkCiiQBGDz-4KFSE1JwuIh3oCRRkYAXSBtH-_-3tXl8D0rKnz4P00QHBOELxabQknIitaBQI365odez93iCeRKr32uuS9N45UyqyNuzC6pq7_xuM8cCa8TDGaHYdJlCo4UPUYR8jgv0-aywaD","source":"ziprecruiter","full_description":"LocationNew York, New YorkShift:Evening (United States of America)Description:Where Amazing Works:NYP/Columbia University Irving Medical CenterClinical Laboratory Technologist -Automated Lab (Chemistry) -Full Time - EveningsAt NewYork-Presbyterian/Columbia University Irving Medical Center, Laboratory Technologists are redefining the limits of science and medicine. We study some of the most complex and rarely seen medical conditions - with unmatched energy and expertise. Join a highly-skilled technical team of 48 Laboratory Technologists in ourChemistry area. Here you'll have an opportunity to work with nationally accredited colleagues in an Ivy League affiliated medical center while contributing to lifesaving results. You will perform a variety of automated and manual tests and related duties to obtain data for use in diagnosis and treatment of disease, following established procedures. In state-of-the-art 24-hour facilities, you'll find real opportunities to maximize your time and training.This position is from 4:00pm - 12:00amplus alternate weekends and rotating holidays at our Columbia campus in Upper Manhattan/Washington Heights.Preferred CriteriaASCP certificationTwo years experience in a clinical laboratory settingNew Grads welcome to applyRequired CriteriaA Bachelor's degreein Medical Technology (or equivalent)New York State Clinical Laboratory Technologist licensure from the New York Education departmentJoin a healthcare system where employee engagement is at an all-time high. Here we foster a culture of respect, diversity, and inclusion. Enjoy comprehensive and competitive benefits that support you and your family in every aspect of life. Start your life-changing journey today.__________________#1 in New York, \"America's Best Hospitals 2020-2021.\" - U.S.News & World Report2019 \"Best Places to Work: Employee's Choice.\" - Glassdoor2019 \"Employees' Choice: Top CEOs\" - Glassdoor2019 \"America's Best Employers in New York State\" - Forbes2019 \"150 Top Places to Work in Healthcare.\" - Becker's Healthcare2019 \"Top-Rated Work Places: Best Hospitals\" - IndeedDiscover why we're #1 in New York and a best employer at: nyp.org/careersNewYork-Presbyterian Hospital is an equal opportunity employer."}