{"title":"Field Service/Customer Engineer IV - (C4) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIyZ3uwDzd42itSC4JhM6eDh9HgEgduYM9muNtJG_nt5J3K8os3Sffy5Dr0ZUTEwnJOjzGRHXzYdDXauw8Dzwv-4lfN3vgB-hTans_I7IvIqexB_ZQqzMmdgqWK4DtARcFEXlCyLDklFiCU9Qz1DnoEF9W3gleFlBDq32FIevUnW94ONWgOEJ_H5rhVzyM","source":"ziprecruiter","full_description":"Location: Utica, NYKey ResponsibilitiesPerforms startups through Tier III including process qualifications with assistance. Understands all qualifications performed on tool and verifies operational quality (process qualification) of systems equipment including ability to use customer's metrology equipment. Plans for and completes all levels of preventative and corrective maintenance within timelines. Troubleshoots key technical issues at the component level. Diagnose and recommends solutions for complex system downs. Uses process data to diagnose hardware problems. Resolves some sustaining process issues on well characterized tools.Troubleshoots key technical issues at the component level. Uses routine process data and on site data logging functions to diagnose system downs. Diagnoses and resolves hardware and software issues. May resolve sustaining process issues with assistance or on very well characterized tools.Performs complex retrofits. May occasionally organize and lead retrofit activities.Ensures the correct revs of procedures and schematics. Identifies and corrects procedural issues. Applies global best practices to solve problems for their customer. Occasionally contributes to global best practices. Creates methodologies and procedures as necessary. Participates in patent processes/discussions and documents IP as appropriate.Anticipates and responds to fab issues including communicating with CE's in other locations. Drives corrective processes through key stakeholders (PBG, Customer Spec owners, ECO owners, GPS, etc.) or escalates as appropriate. Communicates findings to others and provides suggestions to improve checklists and procedures. Participates in customer meetings and escalations.Within assigned scope, assist management in operation of site service business. Assists Applied Materials field management in establishing and achieving objectives for assigned accounts. Keeps field management informed on customer perception of system performance. Takes initiative to avoid and resolve customer problems. May occasionally initiate projects to drive down costs or increase uptime.Provides technical guidance to less experienced CE's on complex system problems including sustaining process issues. Instructs customers in the operation and maintenance of system.Follows all checklists and procedures, including safety.Functional Knowledge Has developed depth of skills in a range of processes, procedures and systems, or acts as the technical expert in an areaBusiness Expertise Uses knowledge of how related teams impact achievement of objectives + Understands the impact of various actions/decisions on the account(s). Takes initiative to avoid and resolve customer problems.Leadership May act as a team lead, may allocate work to more junior team member; provides subject matter guidance to more junior team membersProblem Solving Gathers and analyzes data to identify and solve problems that arise with little or no precedentImpact Impacts own team and other teams whose work activities are closely related; suggests improvements to existing processes and solutions to improve the efficiency of the teamInterpersonal Skills Evaluates and communicates technical content in a clear mannerQualificationsEducation: Bachelor's DegreeSkillsCertifications:Languages:Years of Experience: 7 - 10 YearsWork Experience:Additional InformationTravel: Yes, 20% of the TimeRelocation Eligible: YesApplied Materials is committed to diversity in its workforce including Equal Employment Opportunity for Minorities, Females, Protected Veterans and Individuals with Disabilities.Applied Materials is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future."}