{"title":"LeadiOS MobileSoftware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJlsC7ew-xSRBF_SxwaOV0fYBCcm5gSYl5wW7aT__hbu-CiV5oJZTPqBFILPsnni8JQG5NAiV_nv6STTMICg-jEwGaJhSqqAHUsR_ENRHXKB21efROvFBtEu7-seFN6i_5UBmnUh20PEBPVARooxiGxo3PVBkt6_CzNJ7qWJY_SivcLWj6lAF1aINNv5s5e","source":"ziprecruiter","full_description":"CivicPlus is an informal, social workplace where enthusiasm and talent are rewarded. We are looking for an experienced software development professional interested in building services that improve communities.  CivicPlus is THE integrated technology platform for local government, working with over 4,000 local governments including municipalities, counties, and municipal departments. Inc. Magazine has selected CivicPlus as \"One of the Fastest-Growing Privately Held Companies in the U.S.\" since 2011.  Due to all our recent product suite additions and more anticipated growth in the future, we are looking for talented individuals to join our team. We offer you.... The opportunity to work on software and services that improves our communities. The chance to work with a development team committed to producing high quality software using best practices such as continuous testing, integration, and deployment. Competitive pay and benefits including flexible location, hours, and time off. The potential to work in an environment that is dedicated to teamwork, collaboration, and innovation. Job Overview... The Lead iOS Mobile Software Engineer is responsible for reviewing and evaluating all team output and ensuring that all work adheres to standards and best practices while maintaining a high degree of quality. This position works closely with the Software Development Manager and the Architectural Review Board (ARB) to assist in defining and understanding standards and best practices as well as designing and planning applications to meet project objectives. Performs as a first line supervisor responsible for the performance of employees on their team and provides status reports on the activities of the team. Additional duties include analysis, design, develop and test software solutions for company products. It is also responsible to provide maintenance and support to existing code following company's standards and best code practices. What we will expect you to do... Is a high-performing member of an agile development team who works closely with team members to effectively deliver high quality products.  Responsible for the performance of employees on their team and provides status reports on the activities of the assigned unit   Reviews and evaluates team member's outputs to ensure that all work adheres to standards and best practices while maintaining a high degree of quality.  Contributes to the development and refinement of the product roadmap.  Provides leadership and coordinates the engineering design and implementation of our products.  Develop code using best practices and current software patterns.  Follow company's code standards to fix product issues (bugs)  Read, understand, debug products code to find and solve current software problems.  Responsible for completing employee performance reviews and development plans. What you will likely need to succeed... Prior experience in a similar position with demonstrated success. 3+ years of iOS mobile development, 1+ years of Swift experience 6+ years of professional software development experience Comfortable working independently and guiding a small development team including Android developers Experience working in a continuous testing environment. Familiarity with view model architectures and design patterns Comfortable with git revision control patterns The following skills and areas of experience are not required but are of interest to us:  Android mobile app development, mapping and visualization, fastlane development tool  Employment Practices:CivicPlus is proud to be an Equal Employment Opportunity employer. At CivicPlus, we celebrate and support diversity for the benefit of our employees, products, clients and communities we serve.Upon receiving an offer of employment, candidates must complete required pre-employment screenings, which include a drug test and background screen. Offer of employment is contingent upon this post offer screening process. All testing will be conducted by a licensed independent administrator, which will follow testing standards and background screens in accordance with state law."}