{"title":"Network Engineer Level 2 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIdGWM7JW_sjx3FkBMFSZ6Qgod70kn9iqZbmsCr0KsddOGDWgCsvBuyENx1GAd8f_rffrG2kwDeuuyiu-k06B9OO0X_U1wKXNAWd7rgB0GdCrJlE8tFInp9HrMWFRq3zwSUAsU8hpPhq8W6bDq9jIHiWkQ4Q5VcczY-5t9g9UsyRlEg1vjH5Vgtyr-lokc","source":"ziprecruiter","full_description":"Network Engineer Level 2 in Huntsville, AL at APEX Systems Date Posted: 1/3/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: Huntsville, AL + Job Type:Network Admin & Design + Experience:Up to 10 year(s) + Date Posted:1/3/2019Job DescriptionJob #: 844270 Network Engineer + Client is hiring for a Network Engineer with Layer 2 and 3 switching experience to lead configuration efforts on a long term contract + Candidate would maintain and administer computer networks and related computing environments including systems software, applications software, hardware, and configurations. + Candidate would perform disaster recovery operations and data backups when required. + Candidate would protect data, software, and hardware by coordinating, planning and implementing network security measures. + Candidate would troubleshoot, diagnose, and resolve hardware, software, and other network and system problems. + Candidate would replace faulty network hardware components when required. + Candidate would maintain, configure, and monitor virus protection software and email applications. + Candidate would monitor network performance to determine if adjustments need to be made + Candidate would confer with network users about solving existing system problems. + Candidate would operator master consoles to monitor the performance of networks and computer systems. + Candidate would design, configure, and test networking software, computer hardware, and operating system softwareQualifications: + Candidate must be able to obtain/maintain a Secret clearance as a condition of employment + 2-10 years of Engineer level Cisco experience + Bachelor's Degree + Knowledge of Network Troubleshooting + Fast learner and be able to multiplex between various tasks and assignments. + Must be an adaptable, self-starter, self-motivated individual capable of working in supervised, and/or, unsupervised environments. Preferred Qualifications + CCNA or CCNP certs + Air Defense C4I Tactical Operations Center Enhanced Operations. + Air Defense Systems Integrator (ADSI) operations. + Air and Missile Defense Work Station (AMDWS) operations + Tactical Airspace Integration System (TAIS) operations + Air Defense Airspace Management (ADAM) Cell operations and tactical hardware. + Air and Missile Defense (AMD) Battalion operations. EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}