{"title":"Engineering Manager NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKdnCNF5qIev6x-KqQX8Vv_oIokMgZf49QlV9T2rj1FPXXI4JeMb44FjWlp15f3nEFPXXICAXaoA5tsPCN1zuHdZqMqhGt2dX7UCmqpX4QVoYSFP7MlCF_s2p5B1y6DOOBCI3_ceIrAdbQhVGuhKVf1foNzndy0PXy1-OjnQmW122O2eCrtGR88X1dqwgo","source":"ziprecruiter","full_description":"Waterstone Faucets, is a full line manufacturer and distributor of high quality kitchen faucets and accessories. Waterstone Faucets is looking to expand its talented team of engineering design team in the capacity of Engineering Manager.At Waterstone Faucets, we believe every person has a right to happy and successful in their job. To that end, we employ the globally recognized leader in workplace assessments, Predictive Index, to assess candidate fit for every role in the company. Bottom line, we want every person who works at Waterstone Faucets to be a match with their role and stay with us for long periods of time because their work fits their personal motivating needs, drives, and behaviors. We want you to be happy, and we want to be happy.After submitting your resume to careers.jobs@waterstoneco.com if qualified and interested, please take five-minutes to do the Predictive Index Behavioral Assessment (BA) so we can determine if your individual pattern is a match to the pattern we’ve created for this role. You will automatically receive a copy of your assessment results within a minute of completing the assessment. Again, our goal is to ensure fit and success for all of us. Here’s the link: https://assessment.predictiveindex.com/S53/e96eb25c-51ce-44fe-807f-5db9b64b6676?type=candidatebaEngineering ManagerThe individual in this position will perform a variety of engineering design and support work on faucet components for both new development and sustaining activities. Responsibilities include developing creative solutions to design problems, generation of 3D CAD models, 2D CAD drawings, BOMs, test procedures, etc., all executed per a project plan and maintaining CAD database integrity. This individual will work closely with the VP of Engineering and other team members to assure specifications are met with technically strong, high quality, and cost effective designs. Accomplishes tasks in a manner that reflects the high quality standards on which Waterstone Faucets was founded.Supervision:Manages personnel in the Engineering Department. Carries out management responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems.Job characteristics:Fast-paced environment with a focus on timely, correct resultsTechnical, intellectual focus. Great deal of attention devoted to getting results that are timely and accurate. Demanding, critical and exacting with close follow-up and limited delegation. Reserved and confident when supported by detailed information.Decisions are made based on careful understanding of all available information; detailed technical knowledge; expertise and serious considerations for all sides of the issue/problemNeeds time to make the right decision and cannot be pressured to make quick decisionsReserved communication; ‘strictly business’ communicates accurate information and provides all sides of the issueDemanding, critical and exactingNeeds opportunities to use/demonstrate ‘know how’ and expertise in finding creative solutions to problems, with relative freedom from organizational involvementsDelegation is usually given to those who have proven to be highly dependable and preciseLeadership style likely involves high expectations for subordinates and a high degree of review following each taskEquipment/Software Use: · Proficient in all Microsoft Office Software, (Word, Outlook, Excel)· CAD Software· Kubotek KeyCreator· Corel Graphics· Adobe Reader"}