{"title":"Software Test Engineer","location":"Lake Forest, CA","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Performs functional analysis, timeline analysis, detail trade studies, requirements allocation and interface definition studies to translate customer…</li>\n</ul>","term":1,"jk":"abc866ae774e8e64","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=abc866ae774e8e64","source":"indeed","full_description":"Performs technical planning, system integration, verification and validation, evaluates alternatives including cost and risk, supportability and analyses for total systems. Analyses are performed at all levels of total system product to include: concept, design, fabrication, test, installation, operation, maintenance and disposal. Ensures the logical and systematic conversion of product requirements into total systems solutions that acknowledge technical, schedule, and cost constraints. Performs functional analysis, timeline analysis, detail trade studies, requirements allocation and interface definition studies to translate customer requirements into hardware and software specifications.\nMinimum Requirements\nBachelor’s Degree or equivalent years of directly related experience (or high school +8 yrs; Assoc.+4 yrs)\nThe ability to fluently read, write, understand and communicate in English\nAlcon is an Equal Opportunity Employer and participates in E-Verify. Alcon takes pride in maintaining a diverse environment and our policies are not to discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity, marital or veteran status, disability, or any other legally protected status. Alcon is also committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please send an email to alcon.recruitment@alcon.com and let us know the nature of your request and your contact information."}