{"title":"HVAC Service Mechanic","location":"","salary":"","description":"","term":"$27.32 to $31 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJKuVYjypfXlrBXR-mMICi_bTnY557DXlQnmzt3DXiHCEMu38kh5v_bCeUxyUxixLUJobZQyPFLmELkLkK5OmjaCwTcGvRoBd6l80zB8Dh7zqTYCkmRii47OeLGR8Lk2sM9EwM_F-LF-tXD0Rf3QiJJKyFcappJdLaSPSJPeFrte1UqWJUv7dYiWovi7w","source":"ziprecruiter","full_description":"We have an exciting opportunity for you! We will provide you the tools and resources you need to succeed in our organization. We are currently looking self motivated and skilled heating, ventilation, air conditioning & refrigeration services mechanics who have a desire to advance into systems engineering and help us meet our goals. Unlock your potential here!Job Duties (include, but not limited to):SHIFT: Rotating (Days, Swings, Mids) 24x7x365 including holidaysSCHEDULE: Full-timeQualificationsPerform preventative maintenance and repairs on mission critical commercial HVAC/R equipment. Provide support to engineering team that supplies high pressure steam and chilled water to science/healthcare community.Licensing/Certification/Registration:HS Diploma or GEDLevel II or III AC/Refrigeration cert from an accredited educational institute preferred5 year minimum experience diagnostics commercial HVAC/R systems including RTUsEPA 608Ability to work independentlyComplex understanding of commercial laboratory equipmentRoutinely ascends/descends ladders to service equipmentAbility to walk and stand for extended periodsRoutinely lift, bend, push, materials and equipment weighing up to 50-75 poundsThis position requires inspection of sites to detect safety hazardsStrict adherence to industry codes, OSHA, and environmental regulationsPosition offers premium fringe benefits and paid time off.Applicants must be 18 or older. Successful applicants will be asked to show proof that they can legally work in the US. Pass a pre-employment, random alcohol & drug screen, and federal background check. Relocation assistance not available.Facility HealthCare Services Inc. is an Equal Opportunity Employer. Facility HealthCare Services Inc. does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other basis covered by appropriate law. All employment is decided on the basis of qualifications, merit, and business need."}