{"title":"Mobile App Programmer","location":"","salary":"","description":"","term":"$60,000 to $90,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKXwWoPn1Dx3RGlni0TYTqvworRmgo0LSm0lDyN3KbU6_d2yCpmgYD1fNz0_6WqsTJZsgDwW8wUY6LjkJOqywA2Vpbo4kOS5y22n1u4zf6BWvA8CIeAfOTCX5icGncgSMjLl9pGi6D6rP6TaH89krGZfJH3ywhfN4Z0FdT_T2POTstSIhbhiITnW89jNjDF","source":"ziprecruiter","full_description":"Contract or Permanent Hire. Company HQ in Elkhart, Indiana. Must be able to commute to office at least 1-2x per week.OVERVIEWGrowing financial company seeking motivated App Developer to revamp or replace existing iOS/ Android App. Candidate will be on a team to either design, develop, code, or a mixture.QUALIFICATIONSMUST have minimum 2 years in App Development experienceBachelor's degree in IT/ relevant field highly preferred, or equivalent experienceLocated in or near Elkhart, Indiana (on-site/ hybrid)Bilingual Spanish highly preferred!REQUIRED TECHNICAL SKILLSProven work experience as a back-end developerIn-depth understanding of entire web development process (design, development, and deployment)Hands-on experience with programming languages (e.g. Java, Ruby, PHP, and Python)Working knowledge of CMS frameworkFamiliarity with front-end languages (e.g. HTML, JavaScript, CSS)REQUIRED PERSONAL SKILLSExperience working in team-oriented, collaborative environmentAbility to rapidly adapt and respond to changes in environment and prioritiesSolid analytical and strategic capabilities and business acumenDemonstrated work ethic, integrity, professional conduct and appearanceDUTIESResponsible for developing and coding mobile applications from layout to function and according to the client's specifications.Create visually appealing Apps that feature user-friendly design and clear navigation.Complete work breakdown structure/ project work plan to estimate effort required.Resolve any issues and solve problems throughout project life-cycle.We must inform you that during the hiring process, we may ask for you to disclose and provide us with various categories of your personal information, including identifiers such as your name and address, professional information, commercial information, education information, and other related information. Please note that we will only use this information to facilitate and complete the recruiting process. This posting is not an offer of employment. All applicants must be authorized to work in the United States and willing to cooperate with a background check and drug screen, to the extent permitted by federal and local laws up to and including both criminal and financial reviews. The submission of intentionally false or fraudulent information in response to this job posting shall render the applicant ineligible for the position. BCforward is an equal opportunity employer. Any subsequent offer of employment shall be considered employment at will regardless of the anticipated assignment duration."}