{"title":"Software Developer II (Framework) - Developer Experience","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKd1kiXImbsNRrVrmDIL-k5eKYzw4ezu_fvHiBqwBH-QrHtbLtYHolYHaLDOHFZUAgi8rZSbshSwLj5ZgFtZEr89Baah461VJ4Ojv503R7Ox3CFhGaWOZCwjcBsI5ktn3pBjhCsTLwcGxrlawKuhW5HoLH6Q_y1PTz333514DHZT_6wrpzGYFtmJqBSD34","source":"ziprecruiter","full_description":"Redfin is revolutionizing the $75 billion real estate industry. We use data, beautiful software, and innovative design to put customers first at every step in the home-buying and selling process. Get ready to dive headfirst into our award-winning website and mobile apps, solving complex business problems in a highly visible, customer-centric way. If you value doing great work in a collaborative environment, join us!At Redfin, we are working to separate our applications and support a full CI/CD pipeline. To help enable our engineers here at Redfin to build the best applications for our customers, we are building out a core framework and tooling. A core tenant of our framework and team is a belief that this framework should empower teams to focus on their business area and not get bogged down in building the basic foundation for each area.As a software engineer on the A-Frame team, you will be responsible for helping us define and build the framework for Redfin's isolated applications and the tooling necessary to empower your fellow engineers.Come join our fun group of kind folks who are passionate about building a platform that's robust and simple to use for our customers - the engineers here at Redfin!Technologies we useWe are building our platform on top of Spring Boot and leveraging open source tooling where applicable, built with GradleOur applications integrate with other internal components at Redfin such as Helm charts, Kubernetes, AWS resources, Jenkins, and TerraformWhat You bring to the teamBachelor's degree in computer science or a related engineering field (or equivalent experience).Experience working with JavaSelf starterCustomer empathy: you are a \"voice of the customer\" and understand how your projects affect user experience.When you disagree, you disagree constructively, with respect for everyone else's opinions and ideas.Effective communication and team-building skills.Redfin is an equal opportunity employer committed to hiring a diverse workforce."}