{"title":"          Java Developer         ","location":"","salary":"","term":"$55 to $65 HourlyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAKl16crW1RcAi477OdvMA4nIUXizGkmMvEbNvyAHpwjbiNgwj2_UrCDs6e0Ga34Ik1OtI-mDuHnQmU_gXK1723_RMPqaRMjHEqiLo1E1vnAzNzsBr8ere98Ry8JhERmF-DQKM_2PQ4CBkGoHMYjn6IvDSsGITLLiRt_cxRr9beHUw3UxAi1xp8ZuG4n3g","source":"ziprecruiter","full_description":"\n        BCforward is currently seeking highly motivated Java Developer in Irving, TX 75063We place consultants for end clients all over USA.Job Title: Java Developer Location: Irving, TX 75063Expected Duration: 12 Months• Act as key point of contact and SMEs for Java open-source components, framework and libraries like Spring, Struts etc.• You will follow the open-source Java community and especially security vulnerabilities (OWASP) in widely user Java open-source components• Strong development background in Java/J2EEResponsibilities• You will architect/develop/support enterprise scale systems/tools/frameworks/libraries, implement new tools and processes in CI/CD space for global use across Citis Technology groups• You will provide Unix/Linux development tool subject matter expertise to the application development communities at Citi• You will proactively identify and implement opportunities that enable the development groups to provide the best solutions to their businesses.• You will understand technology industry trends, how they impact our future solutions and provide strategic direction for the development community• You will evaluate and provide technical solutions to solve a variety of complex and interdependent processes and application integrations• You will evaluate and perform POC on new strategic technical products and applications• You will manage problems/defects with existing solutions and drive issues to resolutionJob Skills• Strong demonstrable experience in system solutions design (coming from a development background)• Experience with Binary repository tools (Artifactory, Nexus)• Experience with CI tools (Jenkins, TeamCity) and Build tools (maven, gradle, ant, make)• Experience with RESTful Webservices, Setup Load balancer, nginx configuration• Experience with Bitbucket/GIT/SVN• Strong understanding of the Software Development Life Cycle - including unit testing, code scanning• Strong understanding of architectural concepts and design• Hands-on Linux/Unix platforms development experience• Familiarity with data persistence technologies both SQL (Oracle) and NoSQL (MongoDB)• Windows Security (LDAP, Active Directory) a plus• Knowledge on AWS products (EC2, S3) a plus• Knowledge of cloud computing concepts and devops tools (OpenShift, Kubernetes, Docker, Chef etc.) a plus• Strong verbal and written communication skills including social networking and blogging• Ability to work independently as part of a remote team• Ability to understand business drivers and balance business requirements, timelines, costs and best practices• Good analytical skills, ability to contribute in design discussions and problem solving sessions About BCforward:BCforward began as an IT business solution and staffing firm. Founded in 1998, BCforward has grown with our customers' needs into a full-service personnel solution's organization. Headquartered in Indianapolis, Indiana, BCforward also operates numerous delivery centers across North America and India. We are currently the largest consulting firm and largest MBE certified firm in Indiana. Our uninterrupted growth has allowed BCforward to deliver uniquely configured IT staffing and project solutions for over the years of catering to our customers' specific needs. BCforward currently maintains a team of over 5000 global resources. With our additional brand, Stafforward, together we have the capabilities to deliver services for a variety of industries in both public and private sectors which allows us to address your most challenging needs.www.BCforward.comwww.facebook.com/bcforward“We must inform you that during the hiring process, we may ask for you to disclose and provide us with various categories of your personal information, including identifiers such as your name and address, professional information, commercial information, education information, and other related information. Please note that we will only use this information to facilitate and complete the recruiting process. This posting is not an offer of employment. The submission of intentionally false or fraudulent information in response to this job posting shall render the applicant ineligible for the position. BCforward is an equal opportunity employer. Any subsequent offer of employment shall be considered employment at will regardless of the anticipated assignment duration.”\n      "}