{"title":"Mobile Developer Sales Engineer (Remote) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKtJuvbBUz8KTFka32hkoBDZkSXzYaT9auIepifzBSHGlmJ5BmS4lAH_oSJ2QFMUu0gM3Cc464a46gocN75vbWk4ivcGyNxemy8TRurcEv-IpuZ5dfCXL8ysh1PpqlSidkvhBPNHqsxOm-pOBFMaYtgKhr75-EzR3na0BRw8KPtbRlA1t4UPYxwb2DWcKqc","source":"ziprecruiter","full_description":"We are seeking an experienced Professional Services Engineer who is responsible for presenting product offerings and architecture in the best light to prospects and customers, to evoke confidence in company's technology infrastructure, and to remove all technical objections in the sales cycle. To accomplish this, the Professional Services Architect must have a strong desire to leverage their Technical and Sales Skills, including the ability to solicit business requirements, develop technical sales strategies, configure and effectively demonstrate the solutions that address these requirements and provide business value.Professional Services Engineer will be responsible for the following:The well-being of the CustomerMonitoring & overseeing customers' technical needs (including: Request for Enhancements, Request for Services, and Support Tickets)Manage all technical product-related queries and liaise between Resident Engineers, Professional Services, Client Services, and Development TeamUnderstand Customer Projects, future strategies and tech roadmapsProvide technical, product and business knowledge to strengthen customer relationshipPriorities and manage Professional Services personnel tasksPoint of contact for customer escalationThe Professional Services Engineer role is a combination of an Architect and a Project Manager. The goal is to be accountable for the Customer's success within the account (meaning that they will need to help the customer to maximize the value of the solution). The Professional Services Engineer will be responsible for managing the local Resident Engineer and will have access to the Professional Services Architect (including Professional Services Developers) & Client Services resources and should prioritize the customer needs.QualificationsBachelor Degree in Engineering, Computer Science or related program5+ years of mobile and development experience is a plus5+ years of IAM, network and security experience is a plusExcellent interpersonal, verbal and written communication skillsCommunicate effectively with both internal staff and external clientsAbility to work independently as well as part of a teamStrong overall background in Enterprise architecture and designStrong overall mobile development skills. This includes native objective-c, Swift (iOS) and Java (Android) programming languagesStrong background in development platforms such as Cordova, Ionic3, Phonegap, MobileFirst/WorklightExpertise with integrating third party mobile SDKs into both iOS and Android mobile applicationsStrong understanding of best practices and security applied to mobile application developmentExpertise with all aspects of transport as applied to mobile applications (connection handling, push notifications, client-side certificates/SSL, PKI on mobile)Expertise with Unix and native mobile operating systemsSolid understanding of Web applications, Web APIs (REST/JSON), web protocols, (i.e. http/s, JavaScript, SSL, DNS, proxies/caches, firewalls, etc..)Support sales team on prospect conference calls, virtual meetings and onsite visits by providing product demonstrations expertly responding to technical questions and explaining features in the context of solving customer's business problems.Excellent time management, multi-tasking, prioritization skills and ability to manage multiple concurrent projects."}