{"title":"Senior Software (iOS) Engineer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJv8z9XMI9qhW__5iL1a6Cv5sdpbMhFltPgxEtLSbhl2Jn64Jgb-l6D4R8S2uESaoi37gE0AhTt09TIcysUyDf4ZiSIq2rGc6jHQfcFl_jnHmhKhqQV4V5ZIHDw3rX900m8kXAUH-sWA7HiddjY77eichgSUNjvUESc5W8XO7v8uAtSILT0kzzDSx1n11cE","source":"ziprecruiter","full_description":"Senior Software (iOS) Engineer Atlanta, GA6 Months Contract To HireJob Description Seeking a product-aware and design-oriented Senior Software Engineer (iOS) to re-imagine and flesh out our mobile experiences across various iOS devices. You'll be an early member of small close-knit team that is leading a mission to help merchants run their business better. responsible for the development and application of the next generation of software. The primary responsibility of this role will be hands on coding.Primary Responsibilities: Designs and develops mobile applications across all iOS devices Collaborates closely with our product, design, and server engineers Utilize your experience and judgement to make the system scalable and performant Defines and documents the designs for applications and enhancements. Creates, reviews, and may coordinate execution of unit test plans for multiple projects. Identifies opportunities to improve testing process. Assists with design, coding, testing, implementation, and documentation of solution. Develops high level program specifications. Ensures that expected application performance levels are achieved. Assists technical staff and clients to investigate, analyze, and resolve highly complex technical problems. Identifies and manages interfaces, service levels, standards, and configurations. Analyzes, defines, and documents design for data, workflow, logical processes, and operating system environment, interfaces with other systems, internal and external. Supervises monitoring of existing application systems operating efficiency. Identifies opportunities for improvement and recommends technical solutions. Demonstrates deep understanding of the business needs driving projects. May be key point of contact for business line.Preferred Skills / Experience -6+ years of experience designing and developing iOS native for mobile phones, and tablets -Strong Experience in native iOS frameworks (API, unit testing, deployment, etc.) -Excellent programming skills in Object 'c'/Swift -Experience with iOS SDK performance tools, and optimization. -Strong object oriented programming, design skills, and computer science fundamentals -Demonstrated success in delivering complex full stack mobile applications across native and server-side components -Familiarity with version control systems (Git, Svn,) -Familiarity with build systems (gradle, maven), CI tools (Jenkins, Artifactory, Nexus) -DevOps capabilities containers, cloud, automation, security, configuration management, CI/CD -Focuses on the bigger picture, identifying and prioritizing with the aim to consider more than one domain in this analysis. -Creates project proposals and designs that have considerable impact or touch multiple systems. -Technical designs are clear, well thought out, and considers dependencies, failure states, maintainability, testability and ease of support. -Studies scalability, reliability and performance of systems/contexts affected when defining technical designs. -Has a thorough understanding of the team's domain, how work in this domain relates to the team's objectives and deliverables and how it contributes to overall business strategy and how technical strategy maps to this. -Understands the organization's company strategy and how the engineering strategy aligns to this. -Thoroughly understands the business model in relation to their current product focus area. -Looks for opportunities to simplify product & technical design. -Able to communicate processes and results with all parties involved in the product team, including engineers, product owner, scrum master, third party vendors and customers. -Strong problem-solving and analytical skills. -Excellent communication and interpersonal skills.SriramSriram@technosoftcorp.com248 603 2625"}