{"title":"Med Technologist Coordinator","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIHSFojTe_F4NQwKV1DPxFNxjEZzqz53BsWwp--kp63fk1vQgWP3qM8L9iU9ehXzvqwJ5-jvhRV-lcOJnjKRW2Wtz_n679NlNxvE7G_4XniF3zrrGBPKNp1HHIAyA5MqmbEIl858BDmXw7ugdLaCVI3ST7VCvoHbri9FSerGgO2oGDJLNH2keB1bRaO7fFG","source":"ziprecruiter","full_description":"Overview CommonSpirit Health was formed by the alignment of Catholic Health Initiatives (CHI) and Dignity Health. With more than 700 care sites across the U.S. & from clinics and hospitals to home-based care and virtual care services CommonSpirit is accessible to nearly one out of every four U.S. residents. Our world needs compassion like never before. Our communities need caring and our families need protection. With our combined resources CommonSpirit is committed to building healthy communities advocating for those who are poor and vulnerable and innovating how and where healing can happen both inside our hospitals and out in the community. Responsibilities Job Summary:Oversees and provides ongoing technical guidance to Lab staff in performing the technical and clinical activities of the department and assists in the administration of daily Lab operations for the Franciscan Health System (FHS). An incumbent may also perform the work of a certified Medical Technologist, although this is not the primary function of the job. Work requires professional knowledge of the major disciplines of laboratory practice (e.g. clinical chemistry, hematology, coagulation, urinalysis, toxicology, microbiology and transfusion service) and of FHS standards/procedures sufficient to provide technical guidance to technical and professional staff, determine quality control measures needed and troubleshoot escalated problems/issues. Essential Duties:Provides technical guidance to other laboratory staff and coordinates/participates in a variety of complex technical tasks to troubleshoot escalated problems/issues and determine quality control measures needed. Assists in the review and/or directly reviews technical employee/students; conducts competency assessments by task or procedure and documents through a training checklist.Assists management in ensuring departmental compliance with applicable department, regulatory and safety standards. Assesses, on a continuous basis, services, patient outcomes, quality control, family/patient satisfaction, staffing needs and operational effectiveness to ensure optimal care delivery; ensures that internal controls are sufficient to provide for accurate, complete and compliant programs and processes; identifies need for changes in standards, programs and services, and develops recommendations for consideration by the Director. Participates in the implementation, validation and training processes associated with new lab equipment/ instrumentation.Develops, documents, and implements new test methodologies or procedural revisions.Works with management team to ensure the application of consistent practices relating to internal operations; assesses instruments, equipment and reagents to ensure they meet quality control standards. Monitors the strengths/weaknesses of the laboratory department to identify opportunities and provide recommendations to management for new quality/performance improvement initiatives. Coordinates and oversees staffing levels and shift coverage. Qualifications Education/Work Experience Requirements:Baccalaureate degree from a regionally-accredited college/university, including courses in biological science, chemistry and mathematics, AND successful completion of a NAACLS-accredited Medical Technologist program, AND four years of related work experience in a clinical laboratory that demonstrates attainment of the requisite job knowledge skills/abilities, ORMLT (ASCP) or equivalent certification, AND a baccalaureate degree from a regionally-accredited college/university to include ASCP- or NCA-required college credits, AND four years of full-time acceptable clinical laboratory experience in Immunohematology, Chemistry, Hematology, Microbiology, Immunology and Clinical Microscopy within the past ten years, ORBaccalaureate degree from a regionally-accredited college/university, including courses in biological science, chemistry and mathematics, AND five years of full-time acceptable clinical laboratory experience in the discipline for which the candidate is applying, to include Microbiology, Chemistry, Immunohematology, Hematology, AND meets the acceptable route of Categorical certification through ASCP or NCA in the area for which the candidate is applying.OR MT (ASCP) or equivalent certification, AND Associate's degree from a regionally-accredited college/university to include coursework in biological science, chemistry and mathematics, AND ten years of full-time acceptable clinical laboratory experience in the discipline for which the candidate is applying, to include Microbiology, Chemistry, Immunohematology, Hematology, Immunology and/or Clinical Microscopy within the past fifteen years.Licensure/Certification:National Registration as an MT (ASCP); MLS (ASCP); CLS (NCA, or Certification with the U.S. Dept. of Health and Human Services as a Clinical Laboratory Technologist or Categorical Certification by either ASCP or NCA in the discipline for which the candidate is applying (e.g. Immunohematology, Microbiology), OR current application accepted by ASCP pending examination. If not already held, one-time national certification is expected to be obtained within the first six months of employment.  Not ready to apply, or can't find a relevant opportunity? Join one of our Talent Communities to learn more about a career at CommonSpirit Health and experience #humankindness."}