{"title":"          iOS Engineer NEW!        ","location":"","salary":"","term":"$170,000 to $190,000 AnnuallyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAKngD4pjnCt8t5rjuWsEYNMYrQDdVpsnWnIiqRlHcE1ZV3tJRBsIWiod8JRSmR9SMfx__33AKmvBSf8934n_8Eq-i0JukKZy-GZzZ0EcyaYoC4X5LNtdAWReCc6ddckIHuzEjUwOmMj-kfLqI3IpBiUDCYvf_DBpT4K5ZZxtA-sDsB1KjGPtCkRNd2EeLI","source":"ziprecruiter","full_description":"\n        iOS Engineer Job Title: Mobile iOS EngineerJob Location: Bay AreaRequirements: Minimum 6+ years of Engineering experience working/building iOS applications.Based out of the Bay area, we are an exciting start-up that has experienced a tremendous amount of growth since we've opened our doors 5 years ago! We are creating a whole different meaning to your day to day calendar! We've created a platform that has allowed consumers to merge everything into your everyday calendar: chat with friends, subscribe to apps, shows, movies, podcasts, and much more!Our Engineering team is substantially growing and are looking to add an engineer who lives and breathes all things iOS! We need an iOS Engineer who has a strong background developing mobile applications on the iOS platform. If you have this experience, please apply immediately. We are actively interviewing this week and next for this high profile position.Top Reasons to Work with Us1. New tech-start up in the Bay Area!2. Have experience a tremendous amount of growth!3. 3. Very competitive salary/comp plan with a strong Equity plan as well!What You Need for this Position- 6+ years of iOS Mobile development experience- Experience building out Native iOS applications- Technically fluent with Objective-C and Swift- Previous start-up experience preferredWhat's In It for YouFor your hard work and dedication, you will be rewarded with a competitive base salary, and benefits including but not limited to:- Strong equity package- Dental- Vision- Vacation- Medical- Life- PTOSo, if you are a iOS Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n      "}