{"title":"Software Engineer, Junior","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIjH47FYUcb_t_ZX9wk0ZuOMgY0Z73RjGT7xtEXBCbV8Yu0dYNtUKKbyR2Iad-qRdXzzgB28aDnY-vwCHfdw8Sxico4hPxViuMggAdlrqxHexk9gzSNpmwtSlR0Id5GDOVdJ-wA0LAdm-BZpmpQBR-m8ALRZTWDC5SHezXuu08s0PzlSO8vI-a91nueFxqb","source":"ziprecruiter","full_description":"Software Engineer, JuniorThe Challenge:Are you looking for an opportunity to not just develop software, but to build a system that will have a positive impact on national security?As a software engineer, you can solve a problem with a complete end-to-end solution in a fast-paced, agile environment. We're looking for a software engineer with the skills needed to aid in the selection, development, and evaluation of software systems, subsystems, and future system enhancements.This role is more than just coding. We need a professional who will use their passion to learn new tools and techniques and identify and implement system improvements. Using established software engineering processes, you'll work with the development team to build software systems, subsystems, and future system enhancements. You'll analyze the needs and the environment to make sure the solution you're developing considers the current architecture and operating environment, as well as future functionality and enhancements. Join us as we build systems to change military technology for the better.Empower change with us.You Have:Experience in working with a modern programming language, including C++, C#, or Java applicationsExperience with Linux or Windows developmentAbility to analyze, refactor, compile, and test source codeActive Secret clearanceBS or BA degreeNice If You Have:Experience with working on DoD projectsAbility to communicate with technical and non-technical stakeholders at all levels both verbally and in writingClearance:Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.Build Your Career:A challenging and dynamic work environment isn't all we have to offer. When you join Booz Allen, you'll have access to:experts in virtually every fielda culture that focuses on supporting our employeesopportunities that provide stability while offering varietyYou'll also be exposed to a wealth of training resources through our Digital University, an online learning portal featuring more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and tech from our in-house experts. Pursuing certifications that directly impact your role? You may be able to take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We'll help you develop the career you want as you chart your own course for success.We're an EOE that empowers our people-no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, veteran status, or other protected characteristic-to fearlessly drive change."}