{"title":"Medical Technologist I - CMC Main Chemistry/Hematology - FT 2nd Shift","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKC-i4xJrsKQ6l1WxuoRx2u9XaupvGpAkigGCsWZjW0SygI9qpgQqCDUsEy417SbSFnRh8Uogoh8NfEYFjrVPIHqaBpn6r4O-zAoAFcNSwpcGtlznRxVSoYsAdwzXNK40Cd30GCg6mJbyCexjym9lt8Mt_8u8VqqiUej91bIzN5kgY12ofQ6u1RYcDVg4bd","source":"ziprecruiter","full_description":"Medical Technologist I - CMC Main Chemistry/Hematology - FT 2nd ShiftDate: Dec 17, 2020Location: Charlotte, NC, US, 28203Company: Atrium HealthJob Req ID: 844321Position Number: 00175488Employment Type: Full TimeShift: Variable/On CallShift Details : 2nd shift FT, 2-10:30pm, every 3rd weekendStandard Hours: 40.00Department Name: Lab-Chemistry/HematologyLocation: Carolinas Medical CenterLocation Details: 1000 Blythe Blvd. Charlotte NC 28203Our mission is to improve health, elevate hope and advance healing - for all. The name Atrium Health allows us to grow beyond our current walls and geographical borders to impact as many lives as possible and deliver solutions that help communities thrive. For more information, please visit atriumhealth.org/about-us .Job Summary Performs laboratory analysis on received specimens, providing clinical information for diagnosis, treatment and prevention of diseases. Responsible for overall quality, efficiency, and safety in the performance of assigned technical duties.Essential Functions Demonstrates proficiency and follows testing procedures and policies by adherence to quality assurance guidelines for equipment and work area, documenting corrective action to any non-conforming event. + Prepares reagents, maintains an adequate supply of materials for test procedures and manages inventory to effectively reduce departmental waste/expense. + Exercises clinical judgment in assessing priorities while identifying, problem solving and offering solutions to test systems through the appropriate department channels, i.e. contacts hotline to troubleshoot with a specialist when necessary to resolve the issue or set-up service when appropriate. + Assists with review and revision of procedures and documentation related to accreditation, adhering to all regulatory requirements for various authorities, including but not limited to CAP, TJC, OSHA. + Maintains clear, real time communications shift-to-shift and with leadership regarding issues, concerns and problems which may affect patient care or the operation of the department. + Participates in planning and implementing change through participation in staff meetings, task forces or projects. + Participates in competency assessment program, where qualified.Physical Requirements Works in a fast-paced clinical environment. Works in an area which contains bio hazardous (infectious) materials along with chemical, fire, and mechanical hazards. Duties may involve standing, walking, stretching, stooping, bending and lifting light (20 pound) to moderately heavy (50 pound) loads.Education, Experience and Certifications Bacheloris degree required, MT, MLS or equivalent registry eligible. MT (ASCP) or MLS(ASCP) or equivalent required within one year of hire.At Atrium Health, our patients, communities and teammates are at the center of everything we do. Our commitment to diversity and inclusion allows us to deliver care that is superior in quality and compassion across our network of more than 900 care locations.As a leading, innovative health system, we promote an environment where differences are valued and integrated into our workforce. Our culture of inclusion and cultural competence allows us to achieve our goals and deliver the best possible experience to patients and the communities we serve.Posting Notes: Not ApplicableAtrium Health is an EOE/AA EmployerNearest Major Market: Charlotte Job Segment: Hematology, Medical, Medical Technologist, Law, Chemical Research, Healthcare, Legal, Engineering"}