{"title":"Sr. IOS Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI3YOjtQv1DyIEmph8GBPIezPPfv0tePnYovuIsgG_2RZuL-icW78Vhz9A-cDokf8pxU6kLYPl-ElMf2YErVKTG2gH0YJJS03VaLQB2vQ6q2YdcSzz5i5DncoyUbuocCJJMY2kvYc_9aNeqxOQzeDO2F-Il0yNqt59Y_N2e5XTGVMu8VJZbgwnd6sha7tOe","source":"ziprecruiter","full_description":"Our client, a provider of customized point of sale devices to businesses, is seeking a Sr. IOS Developer Location: Colorado Springs, CO Position Type: Full Time What does a great iOS Engineer do? Every day, Client devices handle the core credit card and point-of-sale processing for hundreds of thousands of merchants. Behind the scenes, we operate a cloud platform providing processing, storage and collaboration for merchants, application developers, service providers and our merchants' customers. To support all of this, we have a team of engineers dedicated to ensuring our systems remain operational, safe and secure. The iOS Engineer on a daily basis will spend 10% of the time reviewing designs of new features, 50% of the time developing features, 30% of the time investigating/reproducing/resolving bugs, and about 10% of the time creating tests and helpful documentation.  As an iOS Engineer, you can look forward to:  -Owning one, or more, of the applications; adding new features, resolving bugs, and refactoring/ improving code base -Identifying technical requirements in product meetings and assisting the business team with realistic project planning and feature development; translating product requirements into functional, maintainable, extensible software that is in-line with company objectives -Implementing new applications as needed, taking ownership of the new product from development through deployment and production monitoring -Collaborating with Server Application Engineers to determine the best way to maintain low response times as new features are designed -Working with QA to develop test plans/strategies Basic Qualifications for Consideration:  -High School diploma -Strong Swift or Objective C skills -Previous development experience on iOS platform -Experience in SQL RDBMS  Preferred qualifications for consideration:  -Bachelor's degree -Experience with a cloud platform: AWS, Google Cloud, etc. -Experience writing unit, integration, and instrumentation tests -Experience with distributed computing -Experience in in RESTful APIs and web development (React) -Data analysis experience Education: -Bachelor's degree -Experience with a cloud platform: Employment Type: [\"FULL_TIME\"]"}