{"title":"Escalation Staff Engineer (ESC700) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK9-FSUCPf2tDJxHCr9lUWrfCt-WuGCqkUIYXiWHrH-eRpmhXtw8Z3eK-NXRVFktjz7z1oOVCvg6XBo-qcjoVyhDYS8JtrPXum_kChVtEt2AfNpA6lE5i5WhQtyYYJJr92am_i3N9UwhikF1aOV1jhWoiMkTVnVmhQdGnuW9OW9pUbWTL0seilERPzJTA","source":"ziprecruiter","full_description":"One Identity delivers identity governance, access management, and privileged account management solutions that facilitate and secure the digital transformation of our customers. Our solutions eliminate the complexities and time-consuming processes often required to govern identities, manage privileged accounts and control access.We are looking for a skilled, self-motivated Escalations & Quality Assurance Engineer to join our existing team, providing 2nd and 3rd line technical support for products in our Identity and Access Management (IAM) portfolio for customers all over the world. Additionally, this role will include some manual product testing.As a Senior Escalations Engineer you will provide technical expertise for problems that the 1st line support team are unable to solve. You will investigate the requests and software issues escalated by 1st line support and liaise with development teams to resolve them. Support Identity and Access Management products working with support engineers based worldwideWork closely with the engineering team to resolve product defects, plan enhancements and help resolve customer problems with the minimum amount of disruption to the customer.Reproduce errors, and build test systems to help implement solutionsMonitor the case tracking system for newly-escalated customer issues and follow process to meet service level agreements.Continue to update the global support organization with updates throughout the lifecycle of the customers service request in accordance with the service level agreement guidelinesBe available to participate in online meetings and calls where necessary during the working day, and convey accurate information to customers and to development teams as required.Be available to handle priority escalations at fixed times outside normal office hours, according to the on-call scheduleAuthor knowledge-based articles to help customers mitigate or circumvent known problemsUndergo any training as required by your managerResponsible for writing and executing manual test scriptsResponsible for reporting bugs and errors to the development teamWork with cross functional teams to ensure quality throughout the product development life cycle.The ideal candidate will:Have strong analytical and problem-solving skills Have strong interpersonal and communication skillsHave an enthusiastic, flexible, positive attitudeHave the ability to be focused and think clearly under pressure.Have a willingness to help othersBe self-motivated, well-organized and proactiveBe eager to learn new concepts and keep up to date with evolving technologies.  3+ years of experience in software customer support or software development roleFamiliarity with .NET, and some coding experience using C# would be desirable skillsetGood knowledge of TCP/IP networking, application level protocols, and firewall technologiesIn-depth knowledge of Microsoft Server operating systems including Terminal Services, Remote Desktop, Active Directory permissions architecture and Kerberos. Excellent general knowledge of UNIX/Linux platforms.Familiarity of quality control concepts and testing procedures Experience of the following would be advantageous for a candidate to be successful:Experience of Federation, SNMP, SMTP, WWW/RDP Certificates installation, Radius, SSH and Ticketing"}