{"title":"Field Sales Representative (Seattle/Northwest Washington)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKSMl61ATgf4B1zQi6zkSIePf4AGXKCRZCUurdVfOQZKMRbKQ8LOugCUGWyzLAbwHtFUe3A2kksHag_av3Alp_rIYGGWiE1e0-n721YvBVHAju5Ar7Ry1AiBY1aLc74Ykn3eY2ih7RLZJb6Vl8pPPJgAHZNa1ZYuIWiHbqSDNJniipXcRnjJQkS3Iyg9Vo","source":"ziprecruiter","full_description":"Customer Business Manager (Field Sales Representative) - Seattle/Northwest Washington TerritoryImagine working for a Company that customers love doing business with! Advance your career with Heilind, whom customers voted The Best Electronic Distributor for the 6th straight year! Customers prefer Heilind more than 3 to 1 over the nearest competitor! (Source: Bishop & Associates, the industry’s leading market research firm, annual customer survey)Position overviewThe major objective for this position is to increase sales by creating new business relationships at new customers in the Seattle/Northwestern Washington area. You will be in the field visiting engineers with established OEM’s, New OEM target accounts and contract manufacturing accounts. Your goal is to take Heilind, its franchised lines and services deeper into the accounts we have. You will be the trusted go-to source for engineering and purchasing. You will introduce Heilind to New accounts that need us! OrganizationA strong predictor of success for a Field Sales Representative is the ability to build relationships. You are the quarterback as you collaborate with the inside support team and other key departments to build solid relationships with our customers and suppliers built on Heilind’s performance, trust and innovation. Utilize all the resources, services and personnel that are at your disposal to make you and Heilind indispensable to the customer. Performance Objectives Before you start the journey, it’s important that you have the roadmap. Within the first 2 weeks, take the initiative to meet with your branch leadership to understand the Company vision, key Company objectives and most important your individual objectives & expectations. Set up systems to measure your progress toward meeting or exceeding your objectives each month. Within the first 30 days… With the support of your Branch Manager, learn the Heilind system and the sales tools you will be using on a daily basis to help organize, track, and follow up your sales activities. During this time, also with the assistance of your Branch Manager, you will proactively introduce yourself to your top 10 – 20 accounts and also your top 5 supplier reps in person. Within the first 60 days… With the support of your Branch Manager, you will meet with the remainder of your supplier reps and account base in person. Meet with your inside sales team to review your top 20 accounts and discuss engagement & opportunities. By this time you should also be comfortable with the CRM and sales tools. You should start loading New Opportunities that you are creating via New Designs and New Quotes into Opportunity/Design Tool on a daily basis.Within 90 days… You will meet with your Branch Manager where the two of you will strategically plan your coverage of the territory by ranking your accounts (A,B or C). All assigned training modules should be completed by this time. Also, you should be scheduling regular meetings with your supplier reps to discuss business opportunities, sharing account information, and developing strategies to pursue opportunities.  You should have identified a minimum of $150,000 in new Opportunities. Within the first 6 months… You should have accomplished a minimum of three supplier training events. By this time you should be comfortable explaining weekly what you are creating, the outcome of assigned sales leads and updates on specific activities discussed as critical to your success with Heilind. Also, you should have ten active new design opportunities. Through your regular rep meetings, you should have identified $300,000 in new business that Heilind doesn’t currently enjoy (existing or new customers)ExperienceA Customer Business Manager for Heilind needs to have at least two years of sales/marketing experience; preferably in electronic component distribution or a closely related field. Ideally a business or technical bachelor’s degree from a four year college or university or an equivalent combination in education and experience would be an asset as would experience with sales tracking software. Microsoft Outlook, Word, Excel and PowerPoint are also frequently utilized sales tools.Employee Value Proposition Heilind is growing rapidly! We are the preeminent brand in electronic distribution, synonymous with world class service, quality people, global reach and an unsurpassed inventory of quality products. You now have an opportunity to establish a long term field sales career with a dynamic company with an excellent reputation that provides exceptional support, employee development and advancement opportunities. Be part of our exciting team, our global expansion, enhanced product portfolio and corporate growth goals. Make a measurable career move where you own your territory, create your sales opportunities and realize your earnings potential.This position requires use of information or access to hardware which is subject to the International Traffic in Arms Regulations (ITAR). To perform the position, you must be a U.S. Person as defined by ITAR. ITAR defines a U.S. person as a U.S. Citizen, U.S. Permanent Resident (i.e. ‘Green Card Holder’), Political Asylee, or Refugee"}