{"title":"Optical Transport Network Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKB4LXJS6sCtXOhW5s3q4ZlvrseiFB3wqj1Adqj9gKa9FfnaOwXJmKYZKSsLcsZ-V42Qs3hebLboHv9ZGkBZU6IOPXRtTUEtKuy4Mw4BuxpEycwr-iqU_O-x12caUf947hTUlz_AfoyIPEhfRfCt8kc3G6Q9zciTsrpFu2qobG8puocowIiroO7afVWVz8","source":"ziprecruiter","full_description":"Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google's complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services.As an Optical Transport Network Engineer, you'll be responsible for defining and qualifying platforms and solutions for scaling Google's optical transport network. Optical transport networking covers a wide range of optical technologies and reaches - from client transceivers to metro and long haul Dense Wavelength Division Multiplexing (DWDM) coherent systems. Your work will involve specifying the hardware, embedded software, and control/management software requirements for optical platforms, as well as evaluating and qualifying new technologies and developing tools, workflows, and processes for introducing and managing these in the network.You'll understand optical physical layer technologies and transport-layer networking systems. You'll apply your knowledge to creative, scalable, and cost-effective solutions, and work closely with the design, build, and operations teams. You'll also engage with external optical equipment vendors, and be expected to think critically/strategically to solve Google's networking challenges in a continuously evolving environment.Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible."}