{"title":"Technical Support Specialist II","location":"","salary":"","description":"","term":"$45,000 to $60,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ-1tvp2Z_QYgsmm-xA-5kfnzN-9BaWq3eTat-i32jNy4H6fW9_ZdZAP0Y7kAt7JoeO6fCTWarLFOnzofB88PQmuVk5Dfsu49ZhfKPcYMzwF5SE8goAMT1hYMJ3zTr2VRD8iEGx4RyZnT_kXtu1pU-S3jhOyHk3dq-NS9x7JdY7VvjNGdrb4wZ4iqljkzQ","source":"ziprecruiter","full_description":"Apply below or directly to this link: https://www.ondemandassessment.com/link/index/JB-CVQB5GZQU?source=ZipRecruiter&u=1024304At NovoPath, we develop innovative Laboratory Information Systems (LIS) for the Anatomic and Clinical Pathology, Molecular and Genetic Testing, and Clinical Trials markets. We provide powerful software that enables labs to maximize efficiency and reduce human error, promoting superior patient care. In 2020, NovoPath was awarded with the North American Enabling Technology Leadership Award by Frost & Sullivan.As a Technical Support Specialist II, you will act as a primary contact for clients that request assistance when using company products. The ideal candidate is someone excited to join a small and growing software company. We are looking for someone with fresh ideas, a willingness to learn, and the ability to present possible solutions to any problem the team encounters.What you will doCustomer-facing technical support for NovoPath productsWork directly with clients to provide services and help resolve NovoPath related problemsInvestigate and resolves customer tickets for both defects and non-defect issuesTake ownership of tickets/tasks escalated by first tier supportContribute to after-hours support coverage rotationPerform system administration functions on client test and production systemsValidate and deploy files to clientsWhat do you need to be successful?Bachelor’s degree or equivalent experience in IT related fields4+ years of experience in client facing Technical Support roleRobust command of Windows OSA friendly, service-oriented attitudeExcellent attention to detailSuperior writing and communications skillsAbility to manage deadlinesExtremely high standards for quality of product and serviceNice to haves: Experience using Microsoft SQLExperience offering IT/Support for software in a healthcare settingA high level of creativitySaaS experiencePosition Details & Workplace:This is a full-time, salaried positionThis position is located in Princeton, NJRole reports directly to the VP of OperationsBenefits include: Medical, Dental, 401K, FSA, TransportationFlexible PTO and Sick policyApply below or directly to this link: https://www.ondemandassessment.com/link/index/JB-CVQB5GZQU?source=ZipRecruiter&u=1024304"}