{"title":"Web Developer - HTML/CSS (Digital)","location":"Irvine, CA 92618","salary":"\n\n$80,000 - $105,000 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Participate in agile software development process and code reviews.</li>\n <li>Codazen is looking for a Web <b>Developer</b> who knows how to build and style responsive, cross…</li>\n</ul>","term":1,"jk":"d684bdca70f466b4","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=d684bdca70f466b4","source":"indeed","full_description":"Web Developer - HTML/CSS\n(Digital)\n\nCodazen provides high-touch web development services to companies such as Facebook, Oculus, KBB, and others. We're looking to add to our team of highly skilled professionals. Are you passionate about building world-class websites using the latest technologies and techniques? Codazen is looking for a Web Developer who knows how to build and style responsive, cross-browser web page layouts.\n\nKey Responsibilities\n\n\nAble to hand-code HTML and CSS without using packaged web design software\nParticipate in agile software development process and code reviews\nImplement responsive HTML layouts based on wireframes\nImplement custom styling based on a style guide and/or design comps\n\n\nSkills and Requirements\n\n\n3+ years experience building web sites\nAdvanced skills with HTML and CSS\nA passion for high quality UX and attention to detail\nKnowledge of cross-browser and device compatibility issues and limitations\nExperience with CSS media queries\nKnowledge of CSS3 Transitions and Transformations\nExperience with different image and video formats used to optimize page weight and performance\n\n\nPluses\n\n\nExperience with Adobe Creative Suite\nKnowledge and experience applying SEO best practices\nExperience adding web page interactivity or API usage with JavaScript\nGeneral understanding of JavaScript frameworks and how they integrate into a web page\nExperience with web page templating frameworks (e.g. Handlebars, React)\n\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity and/or expression, status as a veteran, and basis of disability or any other federal, state or local protected class."}