{"title":"C# .NET Developer NEW!","location":"","salary":"","description":"","term":"$70,000 to $90,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKeg0CLHn-j17Z8lQj2-TI3eF5XIhjT1k4uEo-OalFPYIkXPrcZpaABHiMhpKHfRLrTmeDSTmpjT0zt7ICGLM9Eq3GMGxeJf8Mr60DZ5DnnZN6NE00omp9YOLT5citrNjx1Y_OpOSoGjtpI8ehiC5GcSerrWoKuX-q3WRgiP95KXrCpgAbJveFflTLjYg","source":"ziprecruiter","full_description":"Want to stop working on the same boring project, but want the stability of a long-term career? We provide the best of both worlds!OverviewDealer360, an established Automotive IT Infrastructure, and Software company is seeking a Senior C# .NET Developer to develop and maintain web-based applications, API’s and windows services.What we are looking forCandidates should have at least 4 years of experience with:• C# and .NET framework• Visual Studio• HTML/XML• Microsoft SQL server• CSS/Less• jQuery• Microsoft MVC - Model View Controller• JavaScriptCandidates should have the following skills/qualities:• Be a persistent, creative problem solver• Self-Motivated, solution-oriented and a strong capacity to understand new concepts and apply them correctly• Positive attitude• Excellent written and oral communication skills• Fast learner and adapts well to changing environment• Feels comfortable learning and implementing new programming languagesThe Candidate Must have the following Knowledge and Abilities:• Strong C#, .NET, JavaScript, SQL skills• Understanding of MS-SQL database structures and development• Strong problem-solving skills• Excellent communication and people skills• Positive attitudeWhat we offer• Dynamic programming environment with the opportunity to work on many different projects• Fun work atmosphere -- darts, foosball, Xbox and company parties full of traditions around most holiday’s• Stability and growth• Learning environment – Company-sponsored continuing education (Conferences & Online/In-Person classes)Compensation• up to $90,000 (depends on experience)• Performance-based bonus opportunities• Generous vacation policy• Health, Dental, Vision, 401KSummary• Type: Full-time• Experience: At least 4 years• College degree in related field or equivalent experience.• Job Type: Software development• Industries: Computer Software, Automotive, Software Development, Information Technology, IT Support and InfrastructureAdditional InformationThis is an ONSITE position; we are currently not accepting remote or offshore applicants. We do allow some remote work as needed but mainly are in office."}