{"title":"Software Engineer Intern, Android","location":"California","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Experience developing your own side projects with ideas you're passionate about.</li>\n <li>We are an on-demand drone delivery service that can deliver food, medicine or…</li>\n</ul>","term":1,"jk":"03645fd231828446","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=03645fd231828446","source":"indeed","full_description":"About Wing:\n\nWing is reshaping the future of delivery. We are an on-demand drone delivery service that can deliver food, medicine or other items within minutes. We've also developed an unmanned traffic management platform to safely route drones through the sky. Our service is faster, safer and produces far less pollution than traditional delivery. Originally created in 2012 within X, the Moonshot Factory, Wing is now an Alphabet company.\n\nAbout the Program:\n\nWing's Summer 2021 internship will take place virtually in the United States. This 12 week program is for students in their graduating year of school. We will review applications and interview candidates on a rolling basis until March 2021.\n\nStudents from all schools, and students who identify with a group that is historically underrepresented in the technology industry are encouraged to apply. This includes but is not limited to: Black/African American, Latinx/Hispanic, Native American, students with disabilities, veterans, and non-binary people.\n\nAbout the Role:\n\nWing is looking for an intern to join the Human Drone Interaction team! We build the marketplace for drone deliveries by connecting customers with merchants through the Wing Delivery App, available to customers in multiple continents and languages. This internship will improve the Android app responsible for browsing catalogs, placing orders, tracking delivery mid-flight, and other aspects of drone delivery.\n\nWhat You'll Need:\n\nKnowledge of Java\nCurrently pursuing a Bachelor's, Masters or PhD degree in Computer Science or related field, with an anticipated graduation date after December 2021\nStrong examples of hands-on engineering experience from university programs, internships, or student organizations\n\nBonus:\n\nPassion for aviation, drones, or related technologies\nExperience developing your own side projects with ideas you're passionate about\nExperience with Android, IOS, or web development\n\nNote:\n\nParticipation in the internship program requires that you are located in the United States for the duration of the internship program. Individuals applying for this position will not be eligible for immigration sponsorship."}