{"title":"Technical Writer - Level 2","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIDe1HJ6A9K7UkQGMQ1UJNrmw44dxXmHMEACMm5GlIfRzDQ58GYKexD82iRPQwM2cs7CXiCYKBxlEc9pRdUGH2UNzPH8-OiXqtuRBUIMptsxXjxrvbt7i_kqMvQLIm-ZHizdxnhp3Wxy-EZ0IcmGNN0SAT6P3RGe84voqDExQv7sWOzuaD39u-EIWbXLBQ","source":"ziprecruiter","full_description":"Overview Bluehawk is seeking a Technical Writer - Level 2.  Responsibilities Standard Characteristics Responsible for the preparation, review, revision, and maintenance of technical documents including software and systems engineering, system operations, testing, and user documentation Writes and edits technical documentation for all of the project's hardware and software to include installation, configuration and how-to documentation Creates code documentation for software; produces implementation guides and end-user guides for capabilities; provides field, data definition, and data flow documentation and formats technical publications from pamphlets, technical drawings, and consultations with technical personnel and other available resources. Capabilities and Additional Requirements Write technical copy for various types of documents for a program/project of similar complexity. Apply concepts for technical writing based on engineering drawings, technical information from engineering documentation, consultations with engineers and subject matter experts, and other available sources. Produce defense acquisition documentation, user manuals, training manuals, and other documentation utilized by the end-user community of DoD electronic equipment and systems. Interpret engineering and maintenance drawings, operational procedures to understand and blend large quantities of computer related information. Research highly technical subject matter, organize information from multiples sources, and express technical information in written form that is comprehensible to a wide audience of readers. Qualifications Education and Experience High School Diploma + 8 years Associate's Degree + 6 years Bachelor's Degree + 4 years Master's Degree + 2 years PhD + 0 years Training and Certifications DoD 8570 compliance or information assurance certification commensurate with technical objectives and services required within the task order. Applicable software or hardware training and certifications commensurate with the technical objectives, services required and IT environment specified within the task order. Bluehawk, LLC. is an Equal Opportunity/Affirmative Action Employer//EOE Minority/Female/Disabled/Veteran/Sexual Orientation/Gender Identity/ Not ready to apply? Connect with us for general consideration."}