{"title":"Programmer Apprentice","location":"Redding, CA 96003","salary":"\n\n$14 - $18 an hour\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Logical: You enjoy when things have a specific, sensible sequence.</li>\n <li>No prior formal education or job experience is required* as you will receive on the job…</li>\n</ul>","term":1,"jk":"16c0200d93ef9c67","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=16c0200d93ef9c67","source":"indeed","full_description":"Attention, Aspiring Programmers! Does this sound like you?Introverted: You have to gather strength to go to a public eventConscientious: You pay careful attention to detailsCreative: You enjoy brainstorming solutions to sticky problemsLogical: You enjoy when things have a specific, sensible sequenceCurious: Have a strong interest in learning how to program softwareHumble: You understand that you may not have all the answers but are willing to learnIf so, we may have a position for you! A professional and career building opportunity within the fast-growing information technology field is now available here in Redding, CA. Our national company is looking to invest in training the right individual for a computer programmer job.No prior formal education or job experience is required as you will receive on the job training, but some informal familiarity with programming is highly recommended. Those with professional programmer experience or a Computer Science degree are also welcome to apply.Your primary responsibilities as an Programmer Apprentice will include learning how to, and assisting with, the development of new projects, as well as provide ongoing support for the company's existing software and systems. A typical day may include writing code, maintaining technical documentation, performing unit testing, and/or assisting others with troubleshooting software. You will be working with technologies such as the .NET framework and MS SQL Server, languages like C#, VB.Net, JavaScript, PHP, and SQL, and markups like HTML, XML, and the meta-markup JSON.About LifeHelpLifeHelp exists to make it easier for our insurance company partners to get and keep new customers. We do this by handling such back-office administrative tasks such as customer service, record maintenance, billing, collections, customer correspondence, and much more on our clients’ behalf. We do not engage in traditional insurance sales that you might find with another insurance agency.Large doses of resourcefulness, collaboration, and persistence are required to succeed in our world, and we’re looking for more people who value these qualities to join us as we grow.To learn more about our company, check out our Indeed Company Page by clicking our name above, or visit www.lifehelp.com.About the JobHere’s what you’d be doing as an Programmer Apprentice:Assist in the development of new software and systemsProvide programming support to existing software and systemsProvide insight and technical expertise to discussions relating to system design and softwareAnalyze and document processes where procedures or work instructions do not exist and review/revise existing procedures and work instructions where requiredHere’s what we’re looking for:Has a can-do, will-do attitude and is highly receptive to feedbackHas a basic understanding of programming conceptsHas excellent critical thinking & problem solving skillsHas exceptional attention to detailMust live in the Redding area or have plans to relocate hereBenefits:Group medical, dental, and vision coverage (we cover 90% of your expense / 20% of your dependents)401(k) & profit-sharing plansPaid time off & paid sick leave11 paid holidays a yearRegular working hours / overtime almost never requiredSpacious, clean, and comfortable work environmentFriendly and supportive coworkersStable business in operation for nearly 50 yearsOther position facts:Reports to: Nicholas BrownTravel Required? NoManage People? NoMust have own transportation? NoNext Steps*IMPORTANT* To apply, simply click the Apply Now button and attach your resume. Also, please write us a brief note telling us why you're interested in this position.If your resume is selected for consideration you will typically hear from us within 2 – 3 business days.LifeHelp is an Equal Opportunity Employer.Job Type: Full-timePay: $14.00 - $18.00 per hourSchedule:8 hour shiftMonday to FridayApplication Question:Do you currently live in the Redding area? If not, what is bringing you to the area?Work Location:One locationWork Remotely:No"}