{"title":"Technical Support Specialist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALgiJpcBKAX-hMKsSXvBUjWjQ61CQ6-E-jhYvU3q3-bLy0cHG_gqpw2y0EpBZQjd6ib5tPjlGkOaD2YPM1BEq41bLPRWp4vvKgvgZY4v74-jCToA0TXmtPVwFBKIMI751QW_dF-93pfAzwgn4bK3kyDOCgVcEZpW2t6iM-B_9Hjr53DBZ8QdT46EtAmozBR","source":"ziprecruiter","full_description":"Danaher Company DescriptionAt Cepheid, we are passionate about improving healthcare through faster, more accurate diagnostic tests. With our GeneXpert System, we've taken the most sophisticated molecular technology and packaged it into an automated, easy-to-use format that has quickly become the platform of choice worldwide. From the largest laboratories to small physician offices, our game-changing solution delivers critical answers when clinicians and patients need them most. Through strong molecular biology capabilities and ongoing product innovation, we are focused on developing tests for healthcare-associated infections, sexual health, critical infectious disease, virology, and oncology applications. Come join our vision for abetter wayand help make life better for us all! For more details, visit us atwww.cepheid.comor follow us on Twitter (@CepheidNews).**Description*** Job Description Summary The successful candidate is primarily responsible for providing technical support to Cepheid customers and distributors for high complexity cases, including data analysis for all of Cepheid's product lines and instrument systems. The Technical Support Specialist also provides support to Field Application Specialists, Field Service Engineers, and Territory Sales Executives.Regular Working Hours: Monday - Friday, Day Shift, with rotating weekends and holidays. Job DescriptionResponsibilities:o Provides phone and e-mail support on all Cepheid product lines.o Documents customer reported complaints in the complaint management system.o Follows procedures to ensure adequate complaint handling into call tracking database.o Follows procedures set forth in ISO regulations and QSR for medical device.o Conducts preliminary investigation and data collection for technical problems of diverse scope.o Escalates complaints to the Senior Technical Support Specialist as necessary.o Serves as a product specialist (i.e. super-user, subject matter expert) in at least one product line and serves as trainer, resource, and mentor to other staff.o Represents Technical Support in project and/or operations teams and communicates contributions and findings back to Technical Support.o Performs additional tasks as assigned by the Technical Support Manager.o**Qualification*** Qualifications:o B.S. with 2 years of related work experience or M.S. in Science or Clinical Laboratory Science witih 0-2 years related work experience.o 2 years of relevant experience in Assay Development or as a Medical Laboratory Technician/Clinical Laboratory Scientist.o 2 years of Customer Service experience preferably in Technical Supporto Good understanding and ability to follow complex procedures and processes.o Knowledge of molecular diagnostics.o Knowledge and application of commercial computer application packages (MS Office, IE, etc.).o Knowledge of CRM software.o Excellent written and verbal communication skills.o Outstanding troubleshooting and problem-solving skills.o Thrives in dynamic, fast-paced, and constantly changing environment.o Self-motivated, organized, and with strong attention to detail.o Flexible to work different shifts, weekends, and holidays as necessary.Preferred Qualifications:o Knowledge of Cepheid product lines.o Ability to interface with customers in English and Spanish (or other languages).o Physical Demands: Extended computer-telephone interactive tasks.o Experience working in a regulated environment (FDA/ISO) for 1 year./The statements in this description represent typical elements, criteria and general work performed. They are not intended to be an exhaustive list of all responsibilities, duties, and skills for this job./* //***Danaher Corporation OverviewDanaher is a global science & technology innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&P 500 by more than 1,200% over 20 years.At Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We're innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you'll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team.Organization: CepheidJob Function: Customer SupportPrimary Location: North America-North America-United States-CA-SunnyvaleSchedule: Full-timeReq ID:** CEP002564Cepheid is an equal opportunity employer and strictly prohibits unlawful discrimination based upon an individual's race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, mental/physical disability, medical condition, marital status, veteran status, or any other characteristic protected by law."}