{"title":"Sr. Technical Support Engineer DE NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIIbtKnMxNQDw0lkVHKDvQWa8eQ5cMFim9_3fI9Z3PXcStCv9Q5Vd_mzAxh52sPlrR_pFTqyrtubZKe3gJlOk7cg-702Gzb3cn9qe9WAH5cHlICp_NXaDhsSMIQHSpjf2Q9_o_VeBXnDpBbnHKTYW-_jvBnmVRWQyHDBox5sKFw9jrzlGVj3ek1uwJusbDl","source":"ziprecruiter","full_description":"Company Description Our MissionAt Palo Alto Networks everything starts and ends with our mission: Being the cybersecurity partner of choice, protecting our digital way of life. We have the vision of a world where each day is safer and more secure than the one before. These aren't easy goals to accomplish - but we're not here for easy. We're here for better. We are a company built on the foundation of challenging and disrupting the way things are done, and we're looking for innovators who are as committed to shaping the future of cybersecurity as we are.  Job Description Your CareerYou will work firsthand with our valued customers to address their complex post-sales concerns where analysis of situations or data requires an in-depth evaluation of many factors. You're a critical thinker in understanding the methods, techniques, and evaluation criteria for obtaining results. You'll enjoy networking with key contacts outside your own area of expertise, with a strong capability of detailing difficult technical issues to both non-technical and technical professionals.You will regularly participate in technical discussions with multi-functional teams, creating an environment of transparency that ultimately leads to better products, better working environments, and better cybersecurity. Your quick thinking and support to our clients provides the fast assistance they need to keep their environments secure - which means you'll need to move quickly, thoughtfully, and provide technical assistance as needed (often, in high pressure situations).Your ImpactProvide Technical Support to customers and partnersProvide configurations, troubleshooting and best practices to customersManage support cases to ensure issues are recorded, tracked, resolved, and follow-ups are completed in a timely mannerProvide fault isolation and root cause analysis for technical issuesPublish Technical Support Bulletins and other technical documentation in the Knowledge BaseReview of technical documentation for training materials, technical marketing collateral, manuals, troubleshooting guides, etc.Travel to customer sites in the event of a critical situation to expedite resolution as requiredProvide on-call support 24x7 on an as needed basis Qualifications Your ExperienceWilling to work flexible and varying shift times including weekends and eveningsExcellent written and verbal communication skillsExpertise with Remote Access VPN solutions, IPSEC, PKI & SSL, TCP/IP, Authentication Protocols (LDAP, RADIUS etc.)Experience working with Firewall Central Management SystemsExperience working with multi-factor authentication security system (tokens, certificates, CAC cards, and similar)Working knowledge of Security services (IDS/IPS, Firewalls etc.)Strong ability to independently debug broad, complex, and unique networks with mixed media and protocols requiredVirtualization experience (AWS, Azure, VMWare, OpenStack)Experience with Windows and MAC OS is a plus (Debugging, Editing Registries, Plist etc.) Experience with Cisco, Checkpoint, Juniper (Netscreen), and Fortinet products a plus Additional Information The TeamOur technical support team is critical to our success and mission. As part of this team, you enable customer success by providing support to clients after they have purchased our products. Our dedication to our customers doesn't stop once they sign - it evolves. As threats and technology change, we stay in step to accomplish our mission.You'll be involved in implementing new products, transitioning from old products to new, and will fix integrations and critical issues as they are raised - in fact, you'll seek them out to ensure our clients are safely supported. We fix and identify technical problems, with a pointed focus of providing the best customer support in the industry.Our CommitmentWe're trailblazers that dream big, take risks, and challenge cybersecurity's status quo. It's simple: we can't accomplish our mission without diverse teams innovating, together.We are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at [email protected].Palo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.Qualifications: Your Experience Willing to work flexible and varying shift times including weekends and evenings Excellent written and verbal communication skills Expertise with Remote Access VPN solutions, IPSEC, PKI & SSL, TCP/IP, Authentication Protocols (LDAP, RADIUS etc.) Experience working with Firewall Central Management Systems Experience working with multi-factor authentication security system (tokens, certificates, CAC cards, and similar) Working knowledge of Security services (IDS/IPS, Firewalls etc.) Strong ability to independently debug broad, complex, and unique networks with mixed media and protocols required Virtualization experience (AWS, Azure, VMWare, OpenStack) Experience with Windows and MAC OS is a plus (Debugging, Editing Registries, Plist etc.) Experience with Cisco, Checkpoint, Juniper (Netscreen), and Fortinet products a plusResponsibilities: Your Career You will work firsthand with our valued customers to address their complex post-sales concerns where analysis of situations or data requires an in-depth evaluation of many factors. You're a critical thinker in understanding the methods, techniques, and evaluation criteria for obtaining results. You'll enjoy networking with key contacts outside your own area of expertise, with a strong capability of detailing difficult technical issues to both non-technical and technical professionals. You will regularly participate in technical discussions with multi-functional teams, creating an environment of transparency that ultimately leads to better products, better working environments, and better cybersecurity. Your quick thinking and support to our clients provides the fast assistance they need to keep their environments secure - which means you'll need to move quickly, thoughtfully, and provide technical assistance as needed (often, in high pressure situations). Your Impact Provide Technical Support to customers and partners Provide configurations, troubleshooting and best practices to customers Manage support cases to ensure issues are recorded, tracked, resolved, and follow-ups are completed in a timely manner Provide fault isolation and root cause analysis for technical issues Publish Technical Support Bulletins and other technical documentation in the Knowledge Base Review of technical documentation for training materials, technical marketing collateral, manuals, troubleshooting guides, etc. Travel to customer sites in the event of a critical situation to expedite resolution as required Provide on-call support 24x7 on an as needed basis"}