{"title":"Content Developer - Education (Remote)","location":"California","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>We are looking for Content <b>Developers</b> who are subject matter experts in biology, chemistry, physics, and behavioral sciences (psychology &amp; sociology).</li>\n</ul>","term":1,"jk":"cc832e75d1a2a963","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=cc832e75d1a2a963","source":"indeed","full_description":"The Job:\n\nLocation: Remote |California | Hawaii | Illinois | New York | Colorado | Massachusetts | Washington\n\nWe are looking for a Content Developer – Undergraduate Education to join a team building the next generation of a growing education technology platform. We are looking for Content Developers who are subject matter experts in biology, chemistry, physics, and behavioral sciences (psychology & sociology). Accreditation and deep experience in the education field (including experience with e-learning tools) is preferred, but what we want most of all is someone who is ready to push for excellent, genuinely innovative resources and perspectives on this material. This is a part-time to full time opportunity.\n\nWhat you will do:\n\nDetermine the curriculum of Sketchy undergrad products, including which topics to cover and their priority, order, and emphasis within the product\nLearn and execute the steps of content creation, including outlining, scripting, and review of instructional assets and authoring & editing of practice items\nExert strong general ownership over the instructional experience of Sketchy products built in your area(s) of expertise\nEnsure accuracy of instructional & assessment materials\nCollaborate with other teams, such as art, technology, and video production to drive assets and products to completion\nAdvocate for student needs, based on customer knowledge gained through personal experience and/or user research\nAdjust content and operations in response to metrics and user feedback\nAd-hoc projects\n\nWhat you bring to the role:\n\n2+ years experience in teaching or education, interacting directly with learners and/or creating instructional materials or curricula\nDegree or equivalent experience in at least one of the following subject-matter areas:\nBiology\nChemistry\nOrganic chemistry\nPhysics\nBehavioral sciences (psychology & sociology)\nTraining or experience in multiple subjects preferred\nExperience in test prep (e.g., MCAT) and test-taking strategies preferred, but not strictly necessary\nExperience in creative content production (e.g. digital platforms, e-learning, instructional design) preferred\nAbility to learn new techniques, skills, and tools on the job\nComfort with collaboration in a remote-workforce environment\nEager attitude for working with cool people to make awesome new things\n\nWhat We Offer\n\nCompetitive compensation plan\nInnovative, high growth and collaborative culture.\nGenerous PTO package with floating holidays\nFun team events (Monthly and virtual for now)\nGreat Benefits including: Medical, dental, vision, life 401k and more!\n\nSketchyGroup LLC is an Equal Opportunity Employer. SketchyGroup LLC encourages women and minorities to apply and does not and will not discriminate on the basis of race, religion, color, sex, age, sexual orientation, marital status, national origin, disability or any other basis prohibited by applicable law."}