{"title":"Technical Writer - 2 (JobID: WISCJP00014110) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI3uW6-NjTCfqHa751Exgv5gU90Vi3S4uSYle2-o9MVzdW4S4L4owy3hVnZSAiH7POF6VXUc_5WkCh533_Mp9PpH1ZGeNvZG-QMdN5RLrSHySGdhV0LDo7Vwxe5qxJkHo-cfcag3v7VXFZGnB1S6ibWFLrQ_CIyXmzCpJ8mXpbo8vq4iYcOLAsTXYviscU","source":"ziprecruiter","full_description":"Technical Writer - 2 (JobID: WISCJP00014110)+ 4822 Madison Yards Way, Madison, WI 53705, USA+ ContractCompany DescriptionComputer Consultants International, Inc. (CCI) is an IT Consulting Firm with more than 18 years experience providing effective, expert-level services in industries such as Construction, Technology, Finance, Healthcare, and Government. CCI focuses on building long-term relationships while completing projects from design to delivery. People are CCI's key component for success. Recruiting utmost-quality individuals for our clients, CCI fields a workforce of individuals who are selected not only because of their technical qualifications but also for their achievements as substantial, contributing human beings. In government work and in the commercial market, high standards of ethics and accountability are critical. Therefore our people are chosen for their integrity and ability to maintain relationships, as well as expertise in their field. To learn more about CCI, visit us online at www.cci-worldwide.com.Job DescriptionTechnical Writer capabilities with 4+ years of experience in the field or in a related area. This position will be responsible for documentation of ETF Human Resources procedures, processes and updating the employee handbook. This position will also be responsible for developing content for enterprise learning programs and creating e-learning using Articulate Storyline and GoAnimate. This position will require research of compensation plans, statutes, handbook chapters and other resources in order to update or create new processes. If possible, candidates should be familiar with standard concepts, practices and procedures within the Human Resource field.Qualifications + Experience in Technical Writing and Documentation *Required 4 years Additional InformationFor immediate consideration, please send your resume to career(at)cci-worldwide.com with \"Technical Writer - 2 (JobID: WISCJP00014110)-WI Job Location"}