{"title":"Transit Mechanic","location":"","salary":"","description":"","term":"Temporary","detail":"https://www.ziprecruiter.com/k/l/AAJhLRqgp3KmlllJsbrzyXSLRlRLv5_-s-GDhUH-BumTlI-cyfGy24AtxujHi1bJL4RlTJQrA9Z9xkjuiCH7mxM_liA05RnWMtgS1GwCF2cJN5TH0JDRCVeZ_JxyTGvSNjLSFnaE-gTLFrUahStWZbs-YVJSaQgF5cOE0luIpL_mIKvUxKGIQYG6NymNG94","source":"ziprecruiter","full_description":"Summary  Learn how Metro connects you with what matters   About the Transit MechanicIn Vehicle Maintenance there is no such thing as a normal day. This position is responsible for the maintenance and repair of heavy-duty diesel industrial automotive engines, trolleys, coaches, hybrid electric buses, and other vehicles operated by Metro Transit. Providing technician services is a career with meaning. King County Metro Transit is a regional leader in helping people move quickly throughout the region, reducing commuter stress, greening the environment and radically improving urban air quality, by providing comfortable, effective transit services for the thousands of commuters and other residents of King County, Washington. Per the union contract, those hired to this position enter at 90% of top pay. Additionally, shift differential is paid to those working second and third shifts. Shift pay is 5% for second shift and 7.5% for third shift, on top of hourly pay.  Current hourly rates are:$37.59 - first shift$39.47 - second shift$40.41 - third shiftAbout Metro Transit Vehicle MaintenanceThe Mission of Vehicle Maintenance is to provide customers safe, dependable, clean transportation in a timely, cost effective, environmentally sensitive manner, with a workforce that values teamwork, communication and diversity. The Vehicle Maintenance section operates three shifts (day, swing and graveyard) seven days a week at various locations throughout King County. Openings may occur on all shifts. Swing shift employees receive a shift differential of 5% per hour, and graveyard shift employees receive a shift differential of 7.5% per hour. Safety Sensitive PositionThis position is considered safety sensitive. Applicants for positions defined as safety sensitive are required to undergo drug testing prior to employment, and subsequent to commencement of employment, will be subject to random, post-accident, reasonable suspicion, return to duty and follow-up drug and alcohol testing in compliance with Federal DOT alcohol and controlled substances testing program protocols. Job Duties Applying equity and social justice principles is a daily responsibility and a foundational expectation for all King County employees. In this role you will apply equity and social justice principles that exemplify shared values, behaviors, and practices to all aspects of the work. As the Transit Mechanic, you will:Inspect, diagnose, and repair mechanical defects in gasoline, electric, hybrid and diesel powered buses, trolleys, trucks, cars and other heavy motorized mechanical equipment;Operate and maintain electronic diagnostic and related equipment;Diagnose, dismantle, repair and overhaul all types of gasoline and diesel internal combustion engines, automatic transmissions, differentials, hydraulic, pneumatic and electrical systems;Install, maintain and repair electrical and mechanical units and accessories of electrically powered trolley coaches using electrical diagrams and schematics;Perform wheel alignments, adjust/replace brakes and repair pumps, starters, injectors, lights, steering gears, generators and air conditioning systems;Install, maintain and repair a variety of auxiliary systems, equipment and electronics, including fare collection, communication, surveillance and related components;Operate overhead cranes, hydraulic lifts, hoists, jacks, drill presses, and brake turning lathes, as appropriately certified;Perform field repair work and emergency road repairs; drive wrecker truck in order to tow in disabled coaches;Maintain records of completed repairs, time worked and materials used;Enter and extract data in automated vehicle maintenance system;Perform other duties as assigned. Experience, Qualifications, Knowledge, Skills At a minimum, to qualify for this position you will need:Four years of experience in heavy-duty diesel, automotive equipment, aviation or marine repair and maintenance, as a journey-level mechanic. OR Two years of experience in heavy-duty diesel or automotive equipment repair and maintenance as a journey-level mechanic and completion of a two-year vocational or community college diesel automotive mechanics program, or a recognized apprenticeship program. OR Any equivalent combination of education and experience that provides the applicant with the knowledge and skills to perform the work of the position.Regular attendance and performance of duties, as assigned, are required of this position. In addition, successful candidates will also have:Journey-level knowledge of, and skill in the principles, practices, techniques, tools and equipment of the automotive and diesel repair trade;Knowledge of mechanical principles of gasoline, diesel and electric powered engines; fluid, pneumatic and hydraulic systems; power train, suspension, and chassis components and assemblies; electrical, ignition, braking, heating and air conditioning systems;Knowledge of installation, maintenance and repair of auxiliary systems, equipment and electronics including fare collection, communication, surveillance and related components;Knowledge of current diagnostic techniques and equipment used in fleet repair operations;Knowledge of industrial safety rules, shop safety rules, and applicable regulations and procedures that apply to a vehicle repair facility;Basic computer skills required to enter and extract information from automated vehicle maintenance systems and related software applications;Skill in the operation of electronic diagnostic equipment, as well as power and hand tools used in mechanical maintenance and equipment repair;Skill in the operation of overhead cranes, hydraulic lifts, hoists, jacks, drill presses, lathes and related equipment;Skill in the operation of wreckers and associated auxiliary equipment and winches;Skill in the basic mathematics;Customer service skills; skill in working with a variety of individuals from diverse backgrounds;Communication and interpersonal skills; skill in establishing and maintaining effective working relations.Desirable qualifications include: (Please make sure skills are highlighted in application.)Heavy-duty diesel, bus or truck fleet maintenance experience.Experience working with hybrid technology.Experience working with electric propulsion systems.Necessary Special Requirements:All applicants must be 21 years of age at the time of application.All applicants must have a valid driver license with an acceptable driving record.Within 90 days of hire, a candidate must be able to obtain a Class A Commercial Learners' Permit with a passenger endorsement, and with the air brake restriction removed. After hire, King County Metro Transit will provide you with paid training, on our equipment, so that you can obtain a Class A Commercial Driver License, which is required for this position.To find out more about the Commercial Learners' Permit you can go to the Washington State Department of Licensing official website: https://www.dol.wa.gov/driverslicense/cdlcdip.html.  Supplemental Information Who May ApplyThis position is open to the general public and all King County employees.Application and Selection ProcessThis recruitment will remain open for 30 days, however priority will be given to candidates who apply by March 14th. Testing and Interviews may take place in multiple rounds to accommodate first priority candidates and those who have applied after March 14th.Complete the online employment application and supplemental questions completely. It is required to make a separate entry in the application for each job you have worked for the last ten years. (If you have less than ten years of employment history, list information for all years you have.) It is highly recommended that you also include an entry for every relevant job you have had before then, with correct dates and complete description of duties and reasons for leaving. Please note: the \"duties\" section in the Work Experience area of the application is free text and should be used to detail how you specifically meet the experience we are seeking. You can also use this section to list any information you feel it will be important for the team reviewing your application to be aware of. Applicants will be screened for completeness and competitiveness. Unless the job announcement specifically requires that you attach additional documents, such as a cover letter or resume, no attachments will be referenced during the screening process. The most competitive candidates will be invited to participate in a testing process. Those passing the test will be invited to participate in one or more panel interviews. Testing InformationCandidates will have up to three hours to complete a written and practical/hands-on test. In the written section, a candidate will have 60 minutes to complete a 50-question, multiple-choice, basic le..."}