{"title":"Front End Software Engineer - Freckle (Remote, US)","location":"Bell Gardens, CA 90201","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Create, improve and refine workflows and processes for delivering quality <b>software</b> on time and without incurring debt.</li>\n <li>12 Holidays and 2 Volunteer Days.</li>\n</ul>","term":1,"jk":"cc2c95939ebdaaa1","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=cc2c95939ebdaaa1","source":"indeed","full_description":"Company Description\n\nWhen you join Renaissance®, you join a global leader in pre-K–12 education technology. Renaissance’s solutions help educators analyze, customize, and plan personalized learning paths for students, allowing time for what matters—creating energizing learning experiences in the classroom. Our fiercely passionate employees and educational partners have helped drive phenomenal student growth, with Renaissance solutions being used in over one-third of US schools and in more than 100 countries worldwide. Every day, we are connected to our mission by exemplifying our values: trust each other, win together, strive for the best, own our actions, and grow and evolve.\nFor information about Renaissance, visit: https://www.renaissance.com/\nFor information about Freckle by Renaissance, visit: https://www.freckle.com/\n\nJob Description\n\nWe are seeking an experienced, talented Front End Software Engineer to join the engineering team at Freckle in San Francisco (or remotely). You’ll be bringing your talent and expertise to continue building and scaling our highly available and distributed SaaS platform.\n\nQualifications\n\nIn this role you will:\nArchitect, design and develop new web applications, tools, and distributed systems for Freckle ecosystem in Javascript, React, Flow, Haskell, PostgreSQL, and many others.\nBe primarily focused on the frontend of Freckle's SaaS products\nGet to work on your deliverable end-to-end, from the UX to the deployment logic.\n Create, improve and refine workflows and processes for delivering quality software on time and without incurring debt\nWork closely with Freckle educators, product managers, customer support representatives, and account managers to help the business move fast and efficiently through relentless automation.\n\nYou will do it by...\nYou’re part of an agile, multidisciplinary team. You bring your own unique skill set to the table and collaborate with others to accomplish your team’s goals.\nYou prioritize your work with the team and its product owner, weighing both the business and technical value of each task.\nYou experiment, test, try, fail and learn all the time\nYou don’t do things just because they were always done that way, you bring your experience and expertise with you and help the team make the best decisions\n\nBonus points for:Thinking like an ownerDrive for resultsCommunicating with honesty, candor, and respectDesire to help students get the best possible education\n\nYou will love it because…You will build and share products that are making a difference in the lives of millions of students and thousands of teachersYou will collaborate with other brilliant mindsYou will be rewarded and recognized for your high-caliber work, and you will enjoy autonomy\nAdditional Information\n\nBenefits:\nMedical, dental, vision including Health Savings Accounts\n401(K)\nTuition & Professional Development Reimbursement\nParental Leave – 20 weeks total, 14 weeks paid\nVacation Time Off\n12 Holidays and 2 Volunteer Days\nCommuter benefits\nWellness Incentives\nAll your information will be kept confidential according to EEO guidelines.\nFor information about Renaissance, visit: https://www.renaissance.com/\nFor information about Freckle by Renaissance, visit: https://www.freckle.com/\n#LI-Remote\n#LI-HO1"}