{"title":"Manager - Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALG9zGpOBcTawWps7nFovF4ptcuFAazxGE_TktbkaioxD5F1IqDxjsJf-dcBg9YUsYVV5isn7WF2ULSdDHxP_hN-uRqSLIUQS0OE5ASucQvNELsPpDHYu6rd0UULwexpJ2AuVnBXUlb_Oh601aEE5NTetBI177awicQl6oWpA-2Rfn1rHAl0gbzLIP0YCh5","source":"ziprecruiter","full_description":"The ChallengeQualtrics is looking for a network manager to lead our ever expanding team.  We support a network of global Data Centers utilizing a Colo-Cloud hybrid model.  This allows us to use best of breed technology to optimize for the best customer experience no matter the location.  As the company continues to grow, the team is dealing with ambiguous problems that require creative solutions and out of the box thinking.The team is not only responsible for Data Centers but also supporting the connectivity between our offices.  Ensuring a great experience for all our employees as they support our customers world wide.  The team is well balanced between Senior Engineers with decades of experience to recent college graduates who are expanding their own skill sets.A successful manager of the team will be hands on, not afraid to be on the front line with their team.  They will also need to be able to understand what success looks like and how to lead the team to that vision.Expectations for SuccessBachelor degree in computer science or a related discipline required.3+ years experience directly managing engineers, preferably teams larger than 5.Strong problem solving and communication skills requiredExpertise in Data Center technologies like Cisco and Juniper switching, F5 load balancers, CDN and VPN.Comprehensive understanding of network architecture, routing and switching protocols and web hosting technologiesKnowledge of firewalls administration, design. Preference for Palo Alto.Expertise with Cloud administration and setup, AWS prefered.Wireless technologies specifically Cisco Meraki.A Day in the LifeMentor & train team members and empowering them to resolve issuesLead daily standups that help strengthen the communication between team members and help drive daily continuous improvement and strategy deploymentDrive an automation first culture to help reduce errors and ensure standard deployments.Meet with development teams to understand their goals and how the Networking team can better support and enable them.Help define & recommend company network policies and strategyRecommend Hardware & Networking Design that will help drive uptime and stability of our web products and offices.Organize the team to respond to emergencies as needed to ensure availability."}