{"title":"Flutter/Android Mobile APP Developer","location":"Los Angeles, CA","salary":"\n\n$15 - $26 an hour\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Responsible for developing and designing front end mobile architecture in flutter, ensuring the responsiveness of mobile applications and working alongside…</li>\n</ul>","term":1,"jk":"21d45d34a2238fb7","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=21d45d34a2238fb7","source":"indeed","full_description":"WHO WE ARE:\nBased in Los Angeles, CA, eatOS (a division of POSLABS Inc.) is a cloud-based restaurant software start-up that provides Point of Sale, Self-Service Kiosks, Mobile, Online Ordering, Scheduling, Inventory Management and more. We are on a mission to disrupt the market of old, slow, expensive systems and bring innovative products to restaurants worldwide.\n\nWHAT DO WE SEEK:\nNatural problem solvers who take initiative and who have the ambition to become a leader at our company.\nWe need your passion expertise to help us build the eatOS brand.\nWe have built a fun workplace culture with a strong team that comes together to bring 100% of what they do.\nWe seek multiple Flutter & Android Developer's (4) who are comfortable with both front and back end programming.\nResponsible for developing and designing front end mobile architecture in flutter, ensuring the responsiveness of mobile applications and working alongside graphic designers for full-stack developers, among other jobs.\nAs a Flutter & Android Developer you will use a consultative approach to...\n\nRESPONSIBILITIES:\nCreate multi-platform apps for iOS and Android using the Flutter development framework.\nFlutter is very new, so even if you have never launched a production Flutter app, familiarity with it is important.\nExperience developing with Dart, whether with Flutter or for the web.\nExperience contributing to and managing high-scale production mobile apps.\nProficient in using version control and continuous integration, with tools such as Github.\nExperience with third-party libraries and APIs.\n\nREQUIREMENTS:\nAble to self-manage and attention to detail.\nHave built At least two Android and/or iOS apps.\nProven working experience in software development.\nWorking experience in mobile development.\nHave published one or more mobile apps in Google Play or App Store.\nWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologies.\nUnderstanding of the full mobile development life cycle, including automated testing and building.\nExperience working in an agile development process.\nGood communication skills in English.\nExcellent verbal communication skills.\nGood problem-solving skills.\n\nA PLUS IF YOU HAVE:\nStart-up experience (we love entrepreneurs!).\nAWS Certification.\nExperience in working with a virtual team.\nTwo-year community college business degree with bookkeeping or accounting courses preferred.\n\nWORKING ENVIRONMENT:\nFull/Part-time, remote or work from office depending on location.\nMedical, Dental and Vision Insurance Contribution.\nCompetitive Salary and the chance to be a part of something big.\n\n\n\nAbout POSLABS Inc.:\n\nAt eatOS, we have built a cloud-based technology solution exclusively for restaurants. Our team's collective experience in the restaurant industry helps us understand the complexity of running restaurants, which has allowed us to build a customizable solution to help restaurants react and adapt to the industry's needs. We offer a cloud-based platform that works across iOS & Android, adding flexibility for restaurants. Our restaurant management solutions provide the ability to simplify operation for restaurants of all sizes and our approach to guest engagement improves the guest experience by reducing friction. Our technology gives restaurants the ability to engage with the community in new and innovative ways."}