{"title":".NET Developer (BHJOB1435_26124) DH NEW!","location":"","salary":"","description":"","term":"$50 to $52 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AALDOSHY-Uqs2naBUjyGHt7gqPdjmZY9U6ku3wyn2Fmnr9zfO4rkXA8BITcvSNg7YeLxRhL8joMod9tf2QwTWPlEEI-pWOulPScIPOBHYDO1sUl-DWpA4S2FYbsCNaJGFz_2NHXmBskj_fnrwJrv7L7s5qx-gk3hui0-U_oTEoVK51lhwDiAFdRg4CBWSXM","source":"ziprecruiter","full_description":"C#.NET Developer/ProgrammerQualifications:Must have extensive experience working as Full stack .Net MVC/ jQuery / SQL Server in a fast-paced environment.Work with application end-users to determine and document functional requirements for application software and translates those requirements into use cases in Azure DevOps Boards.Serves as the lead developer and subject matter expert on the most complex technical design solutions in software development.Performs comprehensive technical analysis of development and programming solutions for all ABC applications. Independently Code and Unit Test the complex modules according to IT industry best practices.Ensure each module satisfies the requirements of the software at the conclusion of integration testing. Performs quality review of all developer work for completeness, accuracy and fulfillment of requirements.Works with management to provide ongoing updates and challenges. And effectively communicates (verbal, written) with colleagues, end-users.Recent and extensive experience with production support work. Expertise in Manually debugging of web based .Net MVC applications that are in production and going into production.Experience performing maintenance and enhancements of existing applications built in .Net MVC, jQuery and SQL ServerStrong SQL experience in writing complex queries to pull data to meet end-user needs.Fast learning ability to learn and understand the current applications and databases to provide data reports for production support.Demonstrated expertise in all the required qualification skill set below.The continued and dynamic expansion of IT systems and process changes at the Commission is necessary to model new conjoined systems for all critical departments. It also reduces paper reports, increases information sharing among divisions and eliminates repetitive work.The Developer will assist the client’s Commission in the planning, analysis, design and implementation for their Pricing System and enhancements for all existing systems. Their current IT support staff is limited to provide this system support.Required/Desired Skills:General application development using any language(s) Required 12 YearsHighly skilled senior C#, ASP.NET MVC developer Required 10 YearsJavaScript, JQuery Required 10 YearsSQL Server Required 10 YearsDesign and develop web software solutions using agile methodologies and techniques Required 5 YearsProficiency of LINQ-to-objects and LINQ-to-entity Required 5 YearsEntity Framework core Required 5 YearsCreating technical documentation Desired 5 YearsExperience with Razor pages Desired 3 YearsCSS, Bootstrap Desired 3 YearsRestful API experience Desired 3 YearsCrystal Reports and/or any reporting services on SQL Server database Desired 3 YearsKEY SKILLS"}