{"title":"Senior Engineer - Hardware NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIH5UAdCFwU6q8dAv00_mbmt_dit_iqzIbVqmxlLdW4HH30OaKnYzqQbwb3tMUD443A_0ps4P7Q1aVsRaVlZ0OgH9lLvS3MifZ4wOHzI559sslW9_o2Cet5G_u5Zzvg5VVE9KURv9uQ3aS3DU7LOZ4wxCqTOGhCe61YOftJeBX5PGcuSUGarCuOLuYCP6C8","source":"ziprecruiter","full_description":"DISH is a Fortune 250 company with more than $13 billion in annual revenue that continues to redefine the communications industry. Our legacy is innovation and a willingness to challenge the status quo, including reinventing ourselves. We disrupted the pay-TV industry in the mid-90s with the launch of the DISH satellite TV service, taking on some of the largest U.S. corporations in the process, and grew to be the fourth-largest pay-TV provider. We are doing it again with the first live, internet-delivered TV service - Sling TV - that bucks traditional pay-TV norms and gives consumers a truly new way to access and watch television. Now we have our sights set on upending the wireless industry and unseating the entrenched incumbent carriers. We are driven by curiosity, pride, adventure, and a desire to win - it's in our DNA. We're looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story. Opportunity is here. We are DISH. Dish Technologies, in Englewood CO, has an opening for an experienced Digital Design Engineer who will design, develop and maintain satellite receiver and other consumer electronics devices used for satellite and internet based whole home audio/video entertainment solutions and other connected devices. In addition, the engineer will be involved in designing cutting edge products for our future 5G network.**Working location in Englewood, CO is required; relocation assistance available. Responsibilities include: + Digital design, debug, and testing of satellite receivers, remote controls, 5G based devices, and other consumer electronics in a high volume environment+ Coordinate various design aspects of a satellite receiver product development+ Validate satellite receiver hardware for high volume production+ Write test software for use in satellite receiver validation + Interact with other design, test, and manufacturing groups+ Solve technical problems with little supervision+ Technical lead on small design projects+ Domestic and International travel is required. A successful Digital Design Engineer will have the following: + Bachelor's degree in Computer Engineering, Electrical Engineering or other relevant technical field with 3+ years of hardware design experience.+ At least 3 years of experience with board level design experience is required+ Digital design experience in a fast-paced high volume environment is required+ Design experience with high speed interfaces a must. You will stand out if you have the following skills/experience: + C/C++ experience in an embedded environment is a plus+ Practical knowledge of DDR, SATA, USB, ETHERNET, HDMI is preferred+ MPEG audio and video experience is a plus+ Working knowledge of EMC and SI principles a plus+ Good communication skills+ Strong problem solving skills+ Strong digital design skills+ Proficiency with lab test equipment #LI KS2#LI-CJ1 Compensation: $86,400.00/Yr. - $120,200.00/Yr.From versatile health perks to new career opportunities, check out our benefits on our careers website (https://careers.dish.com/life/investing-in-you/) . Employment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test."}