{"title":"Software Engineer (Robotics)","location":"San Diego, CA","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">2-4 years of experience writing C++ and python applications for Linux or embedded systems.</li>\n <li>Coordinate with cross-functional areas of expertise including…</li>\n</ul>","term":1,"jk":"0baa93042326d558","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=0baa93042326d558","source":"indeed","full_description":"Brain Corp is a San Diego-based AI company creating transformative core technology for the robotics industry. Our diverse engineering teams in Software, Hardware Design, and Embedded Systems are creating comprehensive solutions to support the builders of today's autonomous machines in successfully producing, deploying, and supporting commercial robots across industries and applications. Brain Corp is funded by the SoftBank Vision Fund and Qualcomm Ventures. For more information please visit: https://www.braincorp.com/\n\n\nPosition Summary:\n\n\nAs a member of the Software Engineering team, the Software Engineer will be working on a newly launched product and will help to solve complex problems in the material handling space. As a core member of our AI & Platform Division, you will work with our world-class team of engineers and scientists to build a platform for the next generation of intelligent machines. Your experience will be pivotal in advancing our mission: safe and reliable robots everywhere.\n\n\nDuties and Responsibilities:\nDeliver software features/functionality that increases customer value and product scalability.\nIncrease the agility/ software release frequency of the team and organization through code refactoring, simplification, and removal.\nReview performance metrics of production fleet as a key indicator of customer experience from which to identify software product improvements.\nCoordinate with cross-functional areas of expertise including hardware, firmware, platform, user experience, quality, and cloud engineering to deliver world-class customer value.\nRemain up to date with developments across platform, navigation, and other robots, in order to leverage and contribute towards software innovation across all products.\nWhat you need:\nBachelor's degree in computer science, software engineering, or a related field\n2-4 years of experience writing C++ and python applications for Linux or embedded systems\nExperience coding at an industry level with a strong background in programming constructs and idioms.\nExperience designing/developing/testing/deploying/maintaining features and software releases\nExperience working in large code bases of mixed Python, C++, and Python extensions\nSolid understanding of design patterns, data structures, and advanced programming techniques\nExperience with soft real-time and multi-threaded systems\nExperience with version control systems such as git\nDesire to constantly learn as well as teach others\nStrong analytical skills that enable data-driven decisions and prioritization\nThings that make a difference:\nMS in computer science, software engineering, or a related field\nExperience designing and developing robotic systems using robotics frameworks, including ROS, and existing libraries and tools\nExperience with C++11 and newer\nExperience with path planning, AI algorithms, navigation algorithms, or robot behavior systems a plus\nExperience with continuous integration, deployment and release management tools\nExperience with Agile and Scrum methodology\nProven system integration and software architecture skills\nGood working knowledge of robotics and surrounding systems\nPhysical Demands:\n\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Essential functions may require maintaining the physical condition necessary for sitting, walking or standing for periods of time; operating a computer and keyboard; talk and hear at normal room levels; using hands to finger, grasp, and feel; repetitive motion; close visual acuity to prepare and analyze data and figures; transcribing; viewing a computer terminal; extensive reading; lift, push, carry, or pull up to 10 pounds.\n\n\nWork Environment:\n\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The noise level in the work environment is usually quiet to moderate. Employee is exposed to the typical office environment with computers, printers and telephones."}