{"title":"Network Engineer - Colocation","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ_pOGZeaBuMY9P9MuOoHM3O9Sl2Ty3sOra1zm-xLquo2xqy1WFCNf2u4v7LyeM7sGH7WroHzpRxiqYUF6jItzl6oKUzZJBSYI61eZzl8kNM1yJpbAf4vrGd62N1IeYHWMzT5st8bH4erIb95UtwayC4OFDr3mrbj6LjMCzUclSiiXM2LGOYfcSJOdArpYM","source":"ziprecruiter","full_description":"Opportunity Snapshot Digital Realty supports the data center, colocation and interconnection strategies of customers across the Americas, EMEA and APAC, ranging from cloud and information technology services, communications and social networking to financial services, manufacturing, energy, healthcare and consumer products. Now is the time to join Digital Realty and be part of the world's trusted foundation powering digital ambitions to our customers, prospects and partners. Digital Realty's heritage is understanding a customer's local to global data center needs to address mixed workloads and densities. Enterprises are adapting IT strategies on-the-fly to meet rapidly evolving demands. As data creation and consumption are increasing, so are the tools, clouds, networks and resources needed to support it. This data gravity effect can lead to global workflow management that isn't consistent across deployments, only compounding the complexities. As one of the world's largest data center companies, Digital Realty is seeking motivative and imaginative professions to grow our Enterprise business with collocation and scale offerings combined best in class connectivity, cloud and data centric solutions. Opportunity Snapshot The Network Engineer is responsible for the architecture, planning, deployment, operations and support of Digital Realty Networks. The network environment consists of both internal company networks and external customer serving network centric products. The Network Engineer will provide experienced and comprehensive advanced technical expertise for a Data & Transport network and will serve as part of the team to develop and maintain the growing infrastructure. An ideal candidate will have strong technical skills; able to own issues and drive them to resolution. The candidate must be able to work independently and in pressure situations. Candidate must be process oriented. The Requirements 6+ years of network operations and engineering experience. Bachelor's degree in Computer Science or equivalent experience Experience with architectural design experience in an enterprise and data center environment. Strong analytical and troubleshooting skills Ability to understand high-level network design and impacts across the infrastructure relating to underlying hardware and software selection Ability to work independently on complex and unique enterprise engineering projects Expertise with Layer3 networking including BGP and OSPF. Expertise with STP, Trunking (802.1q), Link-Aggregation (802.3ad) and how to properly implement these technologies. Expertise with implementation of network security (ACLs, Control Plane Protection) - Ability to devise and enforce network security policy while balancing the needs of a diverse and dynamic business. Ability to perform (advanced level) configuration, testing, and troubleshooting of routed IP network infrastructure. After hours support, occasional travel to datacenters throughout the globe, and participation in an on-call support rotation Experience with major hardware vendors and platforms, including Cisco, Juniper, and Arista Experience with network protocol analyzers such as tcpdump or Wireshark Security-Focused Strong communication skills Patience working in a small team that wears many hats and adapting to an evolving global strategy. BASH and other scripting languages (PHP, Python or Perl) desired Experience with Linux system administration including BIND, Apache, MySQL highly desired. Technical certifications (i.e. CCNP, JNCIP or higher) desired The Role Install, configure, and maintain networking equipment, software and services to support the customer-serving network-centric products and the enterprise WAN & LAN environments. Activate and test circuits on routing and switching gear. Serve as Tier 3 Support to the technical operations group. Participate in 7 x 24 on-call support rotation to provide escalation support for network problems. Manage, deploy, and maintain Network Monitoring Systems and Change Management Systems. Support backend Linux systems. Perform site survey, documentation, engineering and deployment for network expansions and new PoP deployment. Creation of BOM's, and Engineering packages for new site builds. Provide project management to technical team to coordinate complicated network platform and service deployments. Identify new technologies and alternative networking systems to enhance customer experience Identify operational issues and implement design alterations to address these issues Understand technical issues and the implications to the business, and be able to communicate them with other operation departments within the business Perform detailed, post event analysis of unusual events, and direct needed procedure or process changes in response Generate and update documentation on operational procedures, network topology, and customer database Maintain a broad knowledge of current and emerging state-of-the-art computer/network systems technologies, architectures, and products Manage workflow closely with a variety of different level support organization in the process of providing network support Note: this description is intended to give you a general overview of the position and is not an exhaustive listing of duties and responsibilities. Digital Realty: Where the cloud lives and business thrives We built the global standard for technical real estate, developing a unique capability to acquire, manage, and scale data center campuses. Now, Digital Realty is building a unique ecosystem of open solutions that power customer growth through exceptional service on a foundation of unrivaled data center expertise. The new Digital Realty combines unparalleled data center services, carrier-dense interconnection, real estate acumen, and financial strength to create unique power of choice and value when and where our customers need it. Our Mission To provide our customers with the trusted foundation for the digital world Our Vision To build a network of connected campuses and internet gateways that become the heart of the internet and cloud, powering growth and prosperity for customers, employees and shareholders. Our Values Guide our decisions and actions every day-above all else, we value customers, excellence, talent, teamwork and success. About Digital Realty Digital Realty Trust, Inc. supports the data center and colocation strategies of more than 2,000 firms across its secure, network-rich portfolio of data centers located throughout North America, Europe, Asia and Australia. Digital Realty's clients include companies of all sizes, ranging from financial services, cloud and information technology services, to manufacturing, energy, gaming, life sciences and consumer products Disclaimer: The above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. Digital Realty Trust is committed to employing a diverse workforce. We value and actively seek to recruit, develop and retain people with backgrounds, experiences and perspectives that reflect the full diversity of our society. Digital Realty is a publicly traded company (NYSE: DLR) with investment grade ratings from all three major ratings agencies. Digital Realty offers a highly competitive compensation package, excellent benefits, and an environment that recognizes and rewards your contributions. Digital Realty is an equal opportunity employer, EOE/AA/M/F/Vets/Disabled Please do not forward unsolicited resumes to any employee of Digital Realty and its subsidiaries. Digital Realty is not responsible for any fees related to unsolicited referrals."}