{"title":"Front-End Developer (Work from Home)","location":"Goleta, CA 93117","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Working closely with the tech team to build user-facing elements that execute on our product visualization by enabling functionality to UX/UI design provided by…</li>\n</ul>","term":1,"jk":"79920de7956bd5ba","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=79920de7956bd5ba","source":"indeed","full_description":"We are seeking an experienced Front-End Developer to build responsive client-side UI frameworks that will be pivotal in the success of our product. We are currently using JQuery / Node to deploy the code behind to the browser. One of the first efforts of this position is to lead the design & deployment of our UI to a more modern JS based framework.\nRole will encompass\nWorking closely with the tech team to build user-facing elements that execute on our product visualization by enabling functionality to UX/UI design provided by our designer.\nRegular interaction with our back-end dev team to deliver coded elements to the user.\nMaintain existing UI sitting on our Rails-based application.\nIdentify bottlenecks and bugs, and devise solutions to these problems\n\nThis is a new position to our small team and will require an in-depth understanding of responsive design and development using modern JavaScript based frameworks and related technologies. We strongly prefer experience building UI’s for Rails-based applications, but a good understanding of another open source platform (i.e. LAMP, Java, etc.) would be acceptable for the right individual.\nTechnical experience must include:\nHTML5/CSS3 tools (i.e. Bootstrap)\nJS run-time environment (i.e. Node)\nAPI development & Management (i.e. REST)\nWorking knowledge of QA principles and best-practices\nExperience with embedded Ruby templating (erb) isn't expected, but it would be a fantastic bonus skill!\nAttributes we expect\nTeam members are all fully remote and we prefer someone with a track record of effective remote work. We are not looking for a \"consultant\" - we are looking for someone who wants to join our organization and can get behind our mission\nExcellent communication, presentation, and interpersonal skills\nStrong work ethic and ability to work effectively independently and in a collaborative team environment\nHighly detail-oriented and organized individual who can take direction well and be proactive in your work\n\nPLEASE NOTE: We cannot sponsor visas and will not consider candidates from third parties."}