{"title":"Senior Software Engineer, Quality NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIsgvcDEEJnUyxp2cFPH7wqzAkYNlQMzDbM2sxIndJgnk0dehiyFokbYr86gjhvp_Az5yEAFaetiXjrBe3Ven6xLYIBog-3q0iqXeJD2nQri2dNhvb3Uu-wfZ1HCcut_uEOtIY5caIpXmel2vz4l06CNbGt4RcErkspjCaUKpSoQig5vZCMLRr6fqdF0anN","source":"ziprecruiter","full_description":"Senior Software Engineer, Quality - eBay QELooking for a company that inspires passion, courage and imagination, where you can be part of the team shaping the future of global commerce? Want to shape how millions of people buy, sell, connect, and share around the world? If you're interested in joining a purpose driven community that is dedicated to creating an ambitious and inclusive workplace, join eBay - a company you can be proud to be a part of.What you will do at eBayDevelop best in class test automation codeLead projects and mentor Junior engineers.Carry out functional and non functional testing including web accessibility, product app security, server side load and performance and client side page speedImprove product and code testability by influencing design at architecture phaseDevelop tools to improve efficiency of product development and testing.Promote quality of your productCollaborate with other functions including product management, product development, and designersPlan, define and execute test strategies in a multi-screen, multi-platform,multi-language web application environment and ensure they are released to production with high quality Technical & Testing SkillsStrong computer science fundamentals including data structures and algorithmsStrong coding skills, preferably in one or more high level programming languages. Java a plusExperience with automation testing frameworks Selenium/Webdriver/TestNGProficient with at least one of the following types of databases - Relational or NoSQL databases (Oracle, Teradata, Hadoop, MongoDB)Experience with web development technologies, Http, Javascript, CSS , HTMLFamiliarity with server side load and performance testing tools like jMeterExperience with non-functional testing like web product security, page accessibility and client side page speedFamiliarity with mobile operating systems like iOS, Android as well as application testing tools, emulators, and mobile application development environment.Familiarity with mobile automation tools such as XCTest, EspressoExperience with test modelling, test design and test reportingSoft & Interpersonal SkillsHighly collaborative approach and a phenomenal teammateFocus and attention on customer experienceQuick learning ability to learn new things and independently. seeks areas ofimprovement for personal growth \"Self-driven demeanor: goes above and beyond, proposes solutions and improvements, isinvolved and proactiveStrong communication skills both oral and in writingPrioritise well in a multi-project environmentAnalytical approach and forward-thinking observerEffective negotiator with other teams/functionsSound approach to risk managementBasic Qualifications:Bachelor's degree, or its equivalent in Computer Science, Engineering or a closely related fieldAbout Buyer Experience QE Team:Buyer Experience QE team is a highly dynamic team that enables powering disruptive experiences on eBay including view item, transactions, home page, my ebay, global header, browse, deals, events, interest, warranty, stores, gift cards, notification, coupons.Opportunity to work cross ebay eco systemOpportunity to work with the latest and greatest technology such as node js.We aspire to be full stack engineers.Benefits are an essential part of your total compensation for the work you do every day. Whether you're single, in a growing family, or nearing retirement, eBay offers a variety of comprehensive and competitive benefit programs to meet your needs. Including maternal & paternal leave, paid sabbatical, and plans to help ensure your financial security today and in the years ahead because we know feeling financially secure during your working years and through retirement is important.Here at eBay, we love creating opportunities for others by connecting people from widely diverse backgrounds, perspectives, and geographies. So, being diverse and inclusive isn't just something we strive for, it is who we are, and part of what we do each and every single day. We want to ensure that as an employee, you feel eBay is a place where, no matter who you are, you feel safe, included, and that you have the opportunity to bring your unique self to work. To learn about eBay's Diversity & Inclusion click here: https://www.ebayinc.com/company/diversity-inclusion/eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us attalent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.For more information see: EEO is the Law Poster and EEO is the Law Poster SupplementThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to ouruse of cookiesView ourprivacy policy and accessibility info"}