{"title":"Software/Electrical Engineer -Huntsville, AL NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKMb1Seyk2hpcRZXMiJ8feh1_VAgIDvEzWbqW9I6az0EhiHwLvS3BxwbwJM_yvjnC-LGZw2qKg8kps5hGgmI1Z-ouKd5DWYAQ0Snu-rYQEF6pEW75WkBKxSULshkauOYmfRPAzViL7ohvJEgSTi1tNdJmVm-0AIwBzeVjf8sOrxhdoISoPNjTFR6UTldT_N","source":"ziprecruiter","full_description":"Supports the Software and Electrical Engineering teams in the development of complex electronic and electromechanical systems, which may include manned or unmanned ground/air vehicles, missiles, launchers, and space systems. Works independently or as a member of a highly motivated team to accomplish assigned tasks.Receives guidance from management and senior engineers to complete specifications and requirements. Coordinates and communicates information effectively with management, customers, co-workers, and vendors to ensure program success.**Required*** ABET accredited BS in Electrical Engineering, Computer Engineering, or related engineering field Minimum 1 year related experience Experience with Hardware, Firmware, and Software Architecture, Interfacing, and Communications Experience with various languages (C, C++, .net, python, perl, TCL, java, android, iOS, etc.) Familiarity with schematics and digital/analog circuit design Some travel Ability to obtain and maintain security clearance**Desired*** Experience with modern revision control tools. (i.e. SVN, GIT, etc.) Experience with Development, System, and Test Scripting and Automation Knowledge of DSP, Micro-controller, Embedded development Knowledge of electrical design and analysis tools (i.e. OrCAD, Altium, PSpice, etc.) Knowledge of Scrum Methodology**Necessary Competencies*** Honesty, superior ethics Interpersonal savvy, excellent communication skills Ability to be a team player Initiative Positive attitude* Professionalism** Life at INTUITIVE****Awards: ** INTUITIVE's many awards showcase our success at building a professional and well-rounded culture of excellence. Awards include Best Small and Medium Companies to Work for in the U.S. in Fortune Magazine, Huntsville Best Places to Work, National Prime Contractor of the Year Award, Best for Vets in Military Times Edge Magazine, Top 50 Companies in America for Workers over 50, Torch Award for Ethics, Family Friendly Business Award, Fit Friendly Company Award, and more. Employees take great pride in these validations of our success.Giving Back: Giving in the community includes investment of time and effort, as well as monetary action. Very thoughtful in our choices, we focus on helping children and the elderly, as we feel they are most often overlooked. This approach results in meaningful employee involvement as we volunteer at a local school, support organizations that care for the homebound, assist groups that care for homeless children and families, support veteran organizations and activities, et al. Employee feedback shares how very rewarding such activities are.Fun:  Our natural atmosphere of camaraderie and professionalism fosters our coming together to enjoy many events, the success of which is evidenced by great turn-out, lots of fun, and wonderful feedback.Focus on Health: Very health-conscious from the top down, we incorporate many types of health-related events and activities, resulting in positive impact on health-care cost outcomes. We are a proud winner of the Fit Friendly Company Award from the American Heart Association.Incentives:  A robust focus on recognition for performance, accomplishments, and creativity is part of our attracting and retaining skilled and talented individuals, supporting our outstanding retention rates.Continuing Education: Close attention to the development of our employees and supporting them in many avenues of continuing education are a part of our company fabric, and result in the furthering of the caliber of our capabilities as well as the satisfaction of our employees.Disability Accommodation for Applicants -- Intuitive Research and Technology Corporation is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following alternative email address or phone number to contact us about your interest in employment at INTUITIVE: sonya.tolliver@irtc-hq.com or Sonya Tolliver, 256 922-9300 x1113. Our process is to respond and to work with the requestor to identify a workable accommodation to the application process.Location: Huntsville, ALCompany Order Number: 2021-94HVJob Time: Full Time# of openings: 1"}