{"title":"In-Home Sales Representative - Replacement Windows NEW!","location":"","salary":"","description":"","term":"$65,000 to $100,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALL04Ack6jOh_ECMnBkSQdQ21xsErJ3LfgLTWg4CIoZPO-3ySkxTLL8WskLAjPoAPWYzfMlV4dH_cqkIlQb2ypNoUV904Nrxq_2FYzO7K7i7NqTkNoJZc8FTCTvyKjMEIoUrU-R3sfJVSvCTGSVc9xga1nAoprQbauXtAtNVUr_dVgPDfNdfp2D05VZemY","source":"ziprecruiter","full_description":"​Are you a driven, independent, self-starter who constantly strives to be number one and has a stimulating impact on everyone you meet? If so, we need to talk to you. Pella Windows and Doors is growing now and looking to add four Replacement Window Sales Consultants in the DFW area. Our successful sales consultants are confident, outgoing individuals who are self-disciplined to adhere to a proven process and thrive on the challenge of closing a sales opportunity. We provide independence and an exciting, fast paced and fun work environment. We look for you to provide a competitive drive, an outgoing nature, and the will to be the best sales representative in the industry.We offer:· 100% Commission-based compensation, with opportunity to earn a great income of $60k to $80k in your first year, $70k - $90k in year two, and $100k+ as you continue to develop your skills and knowledge· We issue you a laptop, smartphone, and product samples· You'll enjoy a full benefits package including Medical, Dental, 401K and Profit Sharing plans· You will confidently represent quality engineered product solutions that are unmatched in the Window and Door industry· You'll start with a training salary as you progress through 6-8 weeks of excellent training programs to prepare you for immediate success in the fieldJob Expectations:· Achieve sales goals by following Pella’s in-home selling process when conducting consultations· Own the full sales process by:Assessing customer needsDemonstrating products and build valueEvaluating customer needsPreparing a quote, offering finance options, and closing the saleFollowing up on product installationEnsuring customer satisfactionGain new business through networking and referralsUtilize systems and software to quote products and manage your businessContinually strive for 100% “Very Satisfied” customersPella Corporation is an innovative leader in creating a better view for homes and businesses by designing, testing, manufacturing and installing quality windows and doors for new construction, remodeling and replacement applications. Founded in 1925, Pella is a family-owned and professionally managed privately-held company, known for its history of innovation, making outstanding products, providing quality service and delivering on customer satisfaction. Our privately owned sales branch here in DFW partners closely with Pella Corporation to provide North Texas customers an excellent experience in selecting and installing new windows to improve their home.Apply today and learn about your future as a team member of Pella Windows and Doors.Job Types: Full-time, CommissionSalary: $65,000.00 to $100,000.00 /year"}