{"title":"Systems Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKtJj8uWa6h0hDjFaiZ9c1SLjwivD-f0YULGk2RUqOwBYSOL2W7BCljZu_awQe27fZsmeVG8F63pFbfOhUKCU_f-6vpnDAm_uvGRPAk7OatkiStUKFpbc9bGrH9ntNFvzbJjCgJIgtb6abVDgq5NJ4i0dbKX3kjoRgDQXHgosG7TmSenbTkVO86sDiL86jB","source":"ziprecruiter","full_description":"Description Works closely with System Architect and Cyber Security section to administer the Active Directory and Group Policy of the domain Manage software deployments and Windows Updates Repair and recover from hardware or software failures. Coordinate and communicate with impacted departments. Research and recommend innovative, and where possible, automated approaches for system administration tasks. Identify approaches that leverage our resources and provide economies of scale. Maximizes network performance by monitoring performance; troubleshooting network problems and outages; scheduling upgrades; collaborating with network architects on network optimization. Update, maintain all documentation requested by management and will be tasked with improving such documentation as required. Requirements 5+ years' experience with expert knowledge of all major Microsoft Windows operating systems, Windows servers, and Office 365. 3+ years' experience in VMware ESX/ESXi 6.x LAN Knowledge Proxy Servers Networking Knowledge, Network Troubleshooting, Network Performance Tuning VOIP experience Knowledge of Network routers, switches, firewalls, include software and hardware MCSE, VMware ESX/ESXi 6.x or CCNA preferred. Robert Half Technology matches IT professionals with remote or on-site jobs on a temporary, project or full-time basis. From roles in software and applications to IT infrastructure and operations, we provide you unparalleled access to exciting career opportunities. Our experienced staffing professionals can promote you to employers and advocate on your behalf. We provide access to top jobs, competitive compensation and benefits, and free online training. For more opportunities, get the Robert Half app and receive instant notifications when our AI matches you with jobs. When you work with us, you're working with the best. Robert Half has been recognized as one of FORTUNE's \"Most Admired Companies\" every year since 1998 and was named to Forbes' inaugural list of America's Best Temporary Staffing Firms. Questions? Call your local office at 1.888.490.4429. All applicants applying for U.S. job openings must be authorized to work in the United States. Benefits are available to temporary professionals. Visit https://roberthalf.gobenefits.net/ for more information. 2020 Robert Half Technology. An Equal Opportunity Employer. M/F/Disability/Veterans. By clicking \"Apply Now,\" you're agreeing to Robert Half's Terms of Use (www.roberthalf.com/terms-of-use). Salary: DOELocation: Charlotte, NCDate Posted: February 25, 2021Employment Type: TemporaryJob Reference: 03200-9502865218Staffing Area: Technology u0026 IT"}