{"title":"Senior Android Developer - epocrates","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALuje5o1r_R__pMxWLnOnjLhGLwjuJMAgB2xXenMF5IDDaUU04JqGz3HW4SXa-8glWyDirx4di_xlxu-4EwRiUoJTGT3lKue6RkRQtRITIfvEEXGXUUogKwc5xvX3bOQCl0Umy4XK91XGbY3UJWBkAniGoF4LrttojmsehAsjwoRrO-uF_svls0y-9B38GK","source":"ziprecruiter","full_description":"Join us as we work to create a thriving ecosystem that delivers accessible, high-quality, and sustainable healthcare for all.epocrates is seeking a Senior Android Developer to help us build and modernize our mobile applications. You'll be working on epocrates, the most trusted medical reference application in the US, serving as an indispensable daily tool for 50% of the doctors in the US.The epocrates R&D team tackles a variety of complex challenges every day to ensure that our entire suite of products and tools are constantly evolving and improving to meet our users' needs. Our current tech stack includes native iOS/Android apps, web properties, a suite of in-house and third-party content publishing tools, and a commercial advertising platform. Our multi-disciplinary team of SMEs -- front and backend engineers, product management veterans, medical doctors and PharmDs, visual designers, UX researchers, data experts, and more -- all work together so that it's easy for health care providers to make excellent clinical decisions for their patients with epocrates.As an epocrates R&D team member, you value collaborative environments where you can challenge ideas and learn from your colleagues. You approach your work with insatiable curiosity and have a profound discomfort with unresolved issues. You speak up and take action when you see something that isn't quite right - even if it isn't in your job description or your area of expertise. And you can't wait for the Shout Outs section of our team meetings to give praise to your talented colleagues.At athenahealth, we believe that diverse teams are the strongest teams. We invite applicants of all genders, races, ethnicities, nationalities, ages, religions, sexual orientations, disability statuses, educational experiences, family situations, and socio-economic backgrounds.Position SummaryAs a mobile developer, you will be a technical contributor on a full stack Scrum team working directly with a product owner to continuously ship and deliver value to our users. You'll write high quality, maintainable, testable, readable code and help your team to do the same. You'll work with your team to estimate, plan and deliver work via two-week sprints. You'll take ownership of what your team builds and develop domain expertise. You'll build scalable and secure mobile applications that health care providers trust every day.Job ResponsibilitiesWrite, debug, test, and deploy code to the play store for the epocrates Android mobile applicationUnderstand and follow coding conventions, architectures, and best practicesParticipate and contribute to Scrum activities such as daily stand-up, sprint planning, backlog grooming, retrospectives and story pointingBuild in quality by writing unit tests, integration tests, and UI Automation as part of developing storiesTake ownership of what the team builds after the release; consider customer adoption as success criteriaDrive self-organization; help determine how the team functions in collaboration with peersWork collaboratively across the Technology and Product organizations to ensure alignment with business goalsBuild strong relationships with cross-functional team membersQualifications5+ years of software development experience3+ years of Android development experienceExperience building native mobile applications using Kotlin and/or JavaExperience building clients on top of RESTful JSON-based APIsFamiliarity of working in an Agile environment preferredAbility to learn and adapt in a fast-paced environment, while producing quality codeAbility to write code that is technically sound, performant, scalable, readable, and testableProven track record of following through on commitments and owning the outcomeAbility to assess situations or problems from multiple angles to understand complete pictureAbility to work collaboratively on a cross-functional team with a wide range of experience levelsAbout athenahealthOur Vision: To create a thriving ecosystem that delivers accessible, high-quality, and sustainable healthcare for all.Our Location: This role is based in Austin, Texas at the Seaholm Power Plant. We have access to Town Lake, the Hike and Bike trail, as well as food and coffee options steps from the office.Our Culture: At athenahealth, our employees (or \"athenistas\") are committed to making healthcare smarter. Our success is dependent on the diversity, collective spirit, and contributions of our people, clients and partners. We value teamwork and believe that the strength of our team comes from supporting each other and leveraging our specialized skills. If you are looking for company that will enable you to work outside of your comfort zone to transform the healthcare ecosystem, athenahealth is the place for you.\"Our Perks: Along with health & financial benefits, our athenistas are offered a variety of perks that promote employee wellbeing such as commuter support (We were named one of the 2018 Best Workplaces for Commuters!), tuition reimbursement, collaborative workspaces and dog-friendly offices - just to name a few.athenahealth is committed to a policy of equal employment opportunity-that's why we recruit and hire applicants without regard to race, color, religion, sex (including pregnancy), national origin, disability, age, sexual orientation, veteran status, genetic information, gender identity, gender expression, or any other factor prohibited by law. We're happy to provide a reasonable accommodation, for those with a disability, to complete any part of the application process. If you are unable to access or use this online application process and need an alternative method for applying, please contact us attaoperations@athenahealth.com for assistance.https://www.athenahealth.com/careers/equal-opportunity"}