{"title":"Software Engineer Intern","location":"San Francisco, CA 94111 (Financial District area)","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Some experience working in the cloud: e.g. Azure, AWS, etc.</li>\n <li>Proficiency in a managed language: e.g. C#, Java, etc.</li>\n</ul>","term":1,"jk":"82dd6d46d2bc9318","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=82dd6d46d2bc9318","source":"indeed","full_description":"Description\nAt First Republic, we care about our people. Founded in 1985, we offer extraordinary client service in private banking, private business banking and private wealth management. We believe that personal connections are everything and our success is driven by the relationships we form with our colleagues and clients. You'll always feel empowered and valued here.\n\nPutting you first\nAs an intern, you will gain hands-on experience at a high-growth company that values its people. You'll earn a competitive starting wage while absorbing a culture that emphasizes collaboration, entrepreneurial thinking and quick decision-making. Start doing the best work of your life here.\n\nResponsibilities\nInformation Services\nFirst Republic Bank is looking for software engineers to help grow our core services team and participate in the development of application software that will be used in production. You'll get to work in a professional environment and get exposure to how enterprise software is built and deployed at a financial institution. You'll also get to work in fun environment that celebrates creativity with interesting people.\n\nWhat you'll do as a Software Engineer\nYou'll be assigned to work with in a dedicated feature team building infrastructure for First Republic Bank.Developing middleware or DevOps code that will ultimately be used by the bank.Learn software development process that related to financial institutions.Familiarize with secure software development.\n\nQualifications\nYou could be a great fit if you have:\nProficiency in a managed language: e.g. C#, Java, etc.Proficiency in a scripted language such as Python or TerraformKnowledge of how the web works and experience with web-based markupSome experience working in the cloud: e.g. Azure, AWS, etc.Major in Computer Science, Engineering or equivalent\nJob Demands:\n\nMust be able to review and analyze data reports and manuals; must be computer proficient.Must be able to communicate effectively via telephone and in person.\nOwn your work and your career - apply now\nAre you willing to take initiative and make decisions? Are you willing to go the extra mile because you love what you do and how you can contribute as a team? Do you want the freedom to grow and the opportunity to take charge of your own career? If so, then come join us.\n\nWe want hard working team players. You'll have the independence to learn, lead and drive change. A culture of extraordinary service, empowerment and stability - that's the First Republic way.\n\nThis job description is not intended to be all-inclusive. Employee may perform other related duties as assigned to meet the ongoing needs of the organization. The Company is an equal opportunity employer. In this regard, the Company makes reasonable accommodations for qualified applicants and employees with disabilities in order to enable them to perform all essential job functions, unless doing so creates an undue hardship.\n\nFirst Republic is subject to federal laws that restrict the employment of individuals with certain types of criminal histories, including FDIA Section 19 and FINRA. To the extent not inconsistent with our obligations under those federal laws and regulations, First Republic will consider qualified candidates with criminal histories in a manner consistent with the Los Angeles and San Francisco ban-the-box laws."}