{"title":"Software Engineer (MOBILE) 21200984 NEW!","location":"","salary":"","description":"","term":"$60 to $68 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAJScf1tkfwzCqe-SeZ7aMFHcxHVsTQjg4O3196DY47zLDujDeugEfRVHPHLICmrIiEaUhdZcmhJFd8XcpJbIE3UJ3JoQ_NZ60x88Z51kC_njM4VYUGwtI9QjRl3oYr02Y0ZtlsRT8mEzwLM2Lz7vG8m5rdHrI5SsK3dW6Rq_Gw9P0sAwXgEJMafLZHKfGc","source":"ziprecruiter","full_description":"CTG is seeking a Full Stack Software Engineer (MOBILE) for our global Fortune 500 client in RTP, NC! Project Location: Durham, NC- Start Remote but will need to be onsite once COVID restrictions liftProject Duration: Contract with potential to become fulltimeAre you an exceptional Software Engineer, with deep experience designing distributed systems at scale? Is high availability and idempotent request second nature to you? Do you have a passion for developing software architecture that drives both development teams and the business? Do you want to build your solutions in a fully automated SDLC (software development life cycle) pipeline without any legacy debt?Become the newest senior developer in our client's Digital Platform group. This position will focus on working in our solutions group to generate offerings based on our various platforms, driving innovative solutions for our business that will be designed and built by you and the team. Our client is building their solutions cloud native using Microservices and OpenAPI with a java backend. All services are built with containers for scalability and rapid prototyping and development.This role is for a Full Stack Software Engineer who will work with the latest technologies in the marketplace to help customers modernize and transform their business. This candidate must have knowledge in all stages of software development. This opportunity will provide the candidate the chance to work on a microservices based platform and help code and design functional deliverables.You’ll be working alongside other experienced engineers and developers, collaborating on the various layers of the infrastructure for our client's platform. Qualified candidates will be forward thinking, self-motivated and bring excellence to the development and customer experience.Qualifications:· Bachelor’s Degree in Computer Science or related field· 8+ years professional experience in software development· 3+ years' Experience with Cloud based applications· 8+ years of Object-oriented programming· 3+ years of Experience with Deployment of Cloud Based Applications· Experience taking a leading role in building complex software systems that have been successfully delivered to customers· Experience working with microservices based solutions· Experience working with NoSQl databasesPreferred Skills:· IOS or Android experience· Java 8+ Experience Preferrred· Implementing high quality UX design solutions through wireframes, visual and graphic designs, flow diagrams, storyboards, site maps, and prototypes.· Knowledge of Swagger and REST design· Skills developing and supporting mobile web apps using Apache CordovaCTG does not accept unsolicited resumes from headhunters, recruitment agencies, or fee based recruitment services for this role.To Apply:To be considered please immediately apply to this requisition using the link provided. For more information, contact the recruiter, Sara Wade at 512-937-1094 (call or text) CST. Kindly forward to any other interested parties - thank you!CTG’s Benefits Plan allows you to select insurance coverage that best suits your lifestyle, and take part in our savings programs and educational plans. We offer Flexible Spending Accounts, a 401(k) Retirement Plan, and an Employee Stock Purchase plan. Our educational plan comprises access to more than 2,000 web-based technical, professional and business development courses."}