{"title":"Hardware Support Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIA4EpUKOG9MSyyfEb0JvjYE1MWUaPEwFxL9vS3ckJ6HrBmthfVShKtYm0gnP_kvOXVDWYgij_LyEMvOWgC9HecVGDIjxbbYQNNbZh2O3-wkxrKeDeuGNHIA9S8WbquZPKxnBZjvOcYZX9xyKXN0RFQyuT-91uDTT4crd2F6nTOCpjlrxtHQRBa67t2WGzS","source":"ziprecruiter","full_description":"Hardware Support EngineerAmazon Robotics Fulfillment Center Technical SupportThis position will be based out Cleveland, OH or surrounding area.Are you inspired by invention? Is problem solving through teamwork in your DNA? Do you like the idea of seeing how your work impacts the bigger picture? Answer yes to any of these and you'll fit right in here at Amazon Robotics. We are a smart team of doers that work passionately to apply cutting edge advances in robotics and software to solve real-world challenges that will transform our customers' experiences in ways we can't even imagine yet. We invent new improvements every day. We are Amazon Robotics and we will give you the tools and support you need to invent with us in ways that are rewarding, fulfilling and fun.We are seeking exceptional candidates who possess a blend of technical and customer-facing skills to successfully support the Amazon Mobile-Robotic Systems. This job will require a unique combination of flexibility, troubleshooting, creativity, problem-solving skills, drive and ability to travel. As part of this highly visible team, candidates have the opportunity to work closely with Amazon fulfillment and transportation customers to contribute to the successful deployment and reliable operations of the Mobile-Robotic Systems.A successful candidate will have technical aptitude, a passion for hardware, broad troubleshooting skills, and a desire to work within an elite group at the leading edge of Amazon's Mobile-Robotic systems engineering.Job Responsibilities: Front line resolution of RME technical inquiries and escalations; the topics of these inquiries and escalations may include but are not limited to: Hardware Failures, Degraded Hardware Performance and Safety Critical Issues. Provide On-Site Support to building deployments (recover disabled drives, ensure HW functionality, coordinate and deliver RME Trainer Training, ensure spares & tools are in place, facilitate EAM uploads and set-up etc.). Works with reachback support teams on resolution of complex technical inquiries and escalations. Proactively monitor system performance and react to field issues using pre-defined troubleshooting methods to address concerns associated with hardware and floor health and escalate to RME and HSE Leadership when necessary. Present site hardware status at daily HSE Stand-Up Meetings using established performance dashboards. Collect, analyze, and report field failure data and quality trends to field quality and other reachback support engineers. Coordinate site audit schedule and pre-audit communication. Execute on-site AR audits and prepare audit reports. Work with local teams to develop and track corrective action plans to completion. Collect data and provide preliminary analysis for biweekly SME sessions with site RME teams (Area Maintenance Managers, Lead Techs, and other HSEs). Review hardware performance, training, upcoming retrofits, product quality incidents and maintain action register at the sessions. Collect voice of the customer feedback regarding continuous improvements for AR processes, tools and fixtures. Conduct ARU field training and certification classes for RME. Conduct field tests and collect field data in support of AR initiatives and projects."}