{"title":"Forensic/Analytical Chemist (Mid)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALj5v4eK2nHdDcH1EzXjHLVSPBT2VorHT-IPwUBMrht3dYyWrqaujXSuZxiOZM7EB3yycp1k-FwbSidgZza0s1DPb6rj4cFZQlS3_L_fUhgfCCfQ1gZ8z-7STzpJ1-qsIk_Wt6ruxeCopH-7DTEWhqETU_JgsCgwo8cC4GHCZMNBDHhYmsCZDZi1mBR65fY","source":"ziprecruiter","full_description":"Overview: Customs and Border Protection (CBP) requires expert analytical chemistry assistance to aid in its mission to stem the flow of opioids into the United States. The scientist will support a 24/7 watch floor operation. There may be shift work and work schedules may vary depending on mission requirements. Employees may need to remain on call even when not scheduled. Candidates must be able to pass a technical evaluation and a CBP background investigation to be considered. This an exciting and fast paced opportunity to have a positive impact on the Nation. US CITIZENS ONLY. Relocation assistance is available. The position is located at a government site located in Sterling, VA.Responsibilities:As directed, supervises the work of assigned technical reachback staff.Performs assistant shift lead responsibilities.Conducts technical reviews of report findings from reachback staff.Performs analysis of FTIR and Raman spectra with or without reference libraries.Predicts FTIR spectra based on chemical structure.Reports findings of FTIR and Raman spectra analysis.Prepares and gives oral and written reports on findings as directed within given time and mission parameters.Prepares monthly reports of reachback activity and chemical identifications.Provides troubleshooting and technical support for field chemical screening devices.Creates and maintains centralized libraries of FTIR and Raman spectra.Required Qualifications:Combined 3+ years' experience or Master's degree and 1+ year experience in laboratory analysis and testing, general spectroscopy, and/or interpretation of spectral data.Bachelor's degree from an accredited university or college in a physical science or an equivalent combination of education and work experience.Successfully completed two semesters of organic chemistry and one semester of analytical chemistry.Good written and oral communication skills.Proficient in MS Office suite and computer skills.Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access and suitability.Responsible to ensure all technical and safety protocols are established and followed."}