{"title":"Digital Tools iOS Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIIUxSMaOBn7mPL2FolQRGgctSXvNi5UAOInEXyH8fNMLz-KuiC2tdVY5KCXoMBjn8JIGEC-7CubPCGsWcepQHyhONPns4JtAa7Jjo2leBU_2HoEbKN88GEeRsBQAfR74bBF9lzlZYFzSU-lf6Aco4SN537MTlAMOOyU_-jRaHPlDGqx3tc70UzzPpz6lqF","source":"ziprecruiter","full_description":"The Delta Air Lines Digital team is seeking an experienced iOS Implementation Developer who can help us build best-in-class digital experiences for the Fly Delta App. In this role, you'll be responsible for the entire technology development life cycle, working with business stakeholders and translating UI/UX designs into actual code deliverables enhancing the customer experience on the Fly Delta App. This individual would partner with several key business units to integrate 3rd party SDKs into Delta's tech stack. The ideal candidate will have a passion for developing new and trending digital experiences that drive positive customer sentiment in the Fly Delta app while keeping in mind latest programming principles as it relates to app performance. Every day, you'll work with team members across multiple departments to understand company challenges and present scalable solutions for customers.Preference will be given to a candidate that has experience with mobile marketing technology architecture and roadmap. This candidate can help solve complex digital needs via marketing automation solutions or SDK integrations, and drive implementation and optimization of marketing analytics tools with IT.  Due to COVID, this position has the opportunity to be remote for now, but will need to eventually be based in Atlanta, GA full-time. Responsibilities:  Partner strategically with IT, product management and analytics teams to support A/B testing, mobile personalization and analytics strategy  Manage administrative and development aspects of integrations between marketing systems and business systems including roadmap development  Assist developing new user-facing features for both customers and internal Delta use  Build and maintain a repository of enterprise architecture deliverables, methodologies and business development documents. Assess and recommend the technical feasibility for potential new tools   Implement and improve SDK implementations and integrations  Help optimize app for maximum speed and scalability  Collaborate with IT to ensure proper implementation of code deliverables and SDKs  Monitor current and future trends in the e-commerce, web, mobile, and digital marketing space that will influence internal software direction in the future.  Embraces diverse people, thinking and styles  Consistently makes safety and security, of self and others, the priority  High School diploma or GED equivalent   At least 4 years professional experience with iOS and/or Android Development  Strong interpersonal and communication skills with ability to communicate effectively with non-technical colleagues  Proven track record of successful delivery, meeting deadlines, and working with stakeholders  Must be hyper focused on details, accuracy, and quality  Embraces diverse people, thinking, and styles  Ability to take initiative and be proactive  Demonstrated ability developing with Objective-C, Swift, iOS SDK, UIKit, Interface Builder, and XCode  Knowledge and experience consuming REST web services and communicating with external systems  Understanding of mobile app UX and UI design paradigms  Ability to manage and prioritize many projects at the same time in a fast-paced environment.  Experience working cross-functionally with other developers and other technically-focused professionals  Due to COVID, candidate must have experience and access to a remote working environment and access to internet that can support video conferencing.  Must be able to work closely with teams on premises, but can facilitate long distance relationships and communicate project status back to the broader group  Bachelor's Degree or 5 plus years of relevant experience  Experience with eCommerce, advertising pixels/tags, or marketing technology.   Experience writing modular, reusable code highly desired.   Experience with tag managers such as Ensighten, Adobe Launch, Google Tag Manager, or Tealium.  Technical implementation experience with Adobe Marketing/Experience Cloud solutions such as Adobe Target, Adobe Analytics, and Adobe Audience Manager."}