{"title":"Senior Network Implementation Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKCpiT89T7F5wpTiJVpCrKd7EIkXYIhik85th8ZoEuPaNGgZjWS5NHbWI7SbI1qhC0Cg5DpG4NcfgtTmq_scagNTTtLNMuvPxBk-GlK8DrtALQhnAYHUbIWDn2tlgIHmsUw2ikYjAesU1TQnZBUiSWQ5j6IJ3SbRwTHV-m36lFy1FP1Qm-x7G3AFAzdiIh4","source":"ziprecruiter","full_description":"As a senior network engineer at STEP CG, you will lead the most complex projects. You will oversee the installation of network products such as switches, routers and firewalls. Installation activities include initial setup following standard configuration guidelines, cabling, labeling, documentation and verification. You will quarterback project teams insuring the delivery of “best in breed” solutions. You will demonstrate your understanding of all 7 layers of the OSI model with an emphasis on dynamic and static routing, layer 2 protocols, IP Addressing and security best practices. This position will be remote with desired candidate in the North and South Carolina region. Ongoing tasks include: Troubleshooting of complex issues. Diving deep into customer networks to uncover and untangle performance and scalability issues. You will ensure that the networks you deliver take into consideration performance and security implications without unneeded complexity. You will thrive on a team that is experienced, imaginative, and extremely supportive of one another.Qualifications of a Senior Network Engineer:· Fluency in layers 1 through 3 of the OSI model· 5+ years of relative experience· Experience in developing networks from design through implementation· Ability to detect and resolve multivendor technical issues at all 7 OSI layersPreferred Qualifications:· Experience with fabric networks including 802.1aq Shortest Path Bridging· Proficiency in dynamic routing such as BGP, OSPF and ISIS · Experience with next-gen firewalls, VPN, IPSEC, Multicast, RADIUS/NAC· Ability to effectively communicate with strong command in the English languageBy applying for a role with STEP CG, you will be considered for other open roles as well. Please do not submit applications for multiple positions."}