{"title":"Frontend Software Development Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJqgV-aod2FymEYRLN_zsOPrG0dnx2lOsS2Cm8yD14LkV4dPiAmmlKVAtumW3VTtP1Whr-XwtmuMEG0OpvfE2oryOo-hK7lZZLA2u7DIvZYO3fnpPKTuGJhN9IZD0s25zZmUSt3p180WlwlkB6UzNgvnfIAkehgF0ySwNdu4wMkYasMKAesdwoD_95DoYRd","source":"ziprecruiter","full_description":"OverviewWe're looking for a Frontend Software Development Engineer to join our Feature group and collaborate on a critical part of the platform by delivering world class features to our end users. This team is responsible for developing end user customer experiences, making sure they function as designed, and are delivered on time. We value simple solutions and look for engineers who use a customer first approach to solving problems.Our stack includes: Python, Flask, Jinja, ES6, Vue.js, Sass, WebpackWhat You'll DoLive by and champion our values: #day-one, #ownership, #empathy, #humility.Write web components in Vue.js, Jinja/HTML, and SASS focused on scalability, testability, supportability and maintainability.Implement new technologies to solve ReCharge's technical challenges as they arise.Champion good habits (development techniques, security, tech debt balance, TDD, and agile habits) within your team; improve engineering standards, tooling, and processes.Perform thorough code reviews and troubleshoot complex issues.Work with engineering and product managers to understand roadmap priorities.Build new UI patterns while also refactoring older ones.Assist with documentation of new features, contributing to the documentation of existing ones.Find and address performance issues throughout the application and help identify and fix front-end bugs and issues.Propose new methods and approaches to old solutions, helping to improve/develop standards.Work and collaborate with both the design and backend development teams to help build new features or update existing ones.What You'll BringTypically, 5+ years of relevant development experience in fast paced environments5+ years of experience with JavaScript; Vue.js/React.js a plus3+ years experience with HTML5, CSS3Solid experience with SASS and writing JavaScript (ECMAS 6 / 2016+)Proficient with build tools, Webpack, preprocessors, and asset pipelineProficient with collaborative tools like GitSelf starter with a passion for taking ownership of your work and delivering outcomesExcellent communication skills, a team player with a 'winning as a team' attitudeAbility to work remote-first in a high growth companyBachelor's degree or equivalent experienceWho We AreSince 2014, ReCharge has helped over 15,000 merchants launch and scale their subscription business. Be it a curated monthly box, recurring necessities or access to exclusive perks, ReCharge powers billions of dollars in annual processing for nearly 30 million consumers. Our remote-first team of 250+ is building the future of subscription commerce. Come join us on our mission to connect and empower the world through payments. ReCharge | Instagram | Twitter | FacebookReCharge Payments is an equal opportunity employer. In addition to EEO being the law, it is a policy that is fully consistent with our principles. All qualified applicants will receive consideration for employment without regard to status as a protected veteran or a qualified individual with a disability, or other protected status such as race, religion, color, national origin, sex, sexual orientation, gender identity, genetic information, pregnancy or age. ReCharge Payments prohibits any form of workplace harassment.#LI-Remote"}