{"title":"Manager - Salesforce","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK_dKKIaDxh3PDNvj_ok8p1D7k0RGv3hRTWwOKd3yZsyhhSNFDUm46AqHlpxnD60v1df60P2RsZYXmMfL8pNPvgPfeAdwR0goejfEnXpgUSsWLUO7smAEZ6oBLY82OmUEKKl3OGmgUSEpDrjwOVgFos55hF9mhQaqTurq5y-AhTLOqEdg4o49llsE9V8fw","source":"ziprecruiter","full_description":"About YouI am a certified Salesforce Trailblazer with a passion for helping clients achieve rapid business value and long-term success on the Salesforce Customer Success Platform.I am consultative in nature and have a passion for and experience in helping my clients to succeed.I am thoroughly organized, have exemplary attention to detail, and demonstrate strong analytical and communication skills.I love to manage people, timelines, tasks, issues and risks. I am an expert at motivating my team to have fun, learn more, and deliver.I am dependable; clients ask for me by name and see me as one of their own.I can identify project opportunities and make recommendations for new work based on my thorough knowledge of client needs.I am an industrious team-player; I’m not afraid to roll up my sleeves and work diligently on any task.Job SummaryAs an OnPrem Project Manager, you will dive deep into the client business, working alongside a project team of other analysts, consultants and/or senior consultants. You will engage in different types of consulting projects ranging from the formulation and analysis of business, process, and organizational strategies, to the implementation of technology solutions. The methodologies will range depending on client preference. Facilitating sessions with client executives, you will identify risks and provide mitigation strategies, conduct deliverable reviews and give feedback, and lead your team through hands-on example.Our consultants work at our client sites. As with all consultants, you should be willing to travel on occasion for work. We work in a number of fields, but have a primary focus on the Media & Entertainment industry.About UsWe’re in the business of making businesses better—people, processes, and systems. We’re an end-to-end technology solutions provider focused on connecting disparate parts within organizations. We bring a balance of IQ and EQ to every engagement, and a depth of business and technical acumen to every problem. We are a team that is driven by following through for our clients, and being upfront, honest and sincere.Requirements5-7+ years Project Management, Process, Implementation, SDLC experience3+ years in consulting / professional services, big firm experience preferred3+ years of Salesforce experience and at least 5 full lifecycle Salesforce implementations of either Sales cloud, Service cloud or PlatformExpert in Salesforce configuration (declarative), development or administrationExperience in Lightning, Apex, VisualForce, API integrations, and deploying and managing environmentsSalesforce analytics experience configuring dashboards and reportingExperience in workflows (Flow, Process Builder, etc), approval flows and email templatesExperience in project management, including tasks, budgeting, and resource allocation, and reporting status to clients and internal teamsExperience managing teams through client-facing activities such as requirements gathering, stakeholder workshops, and deliverable review/approval sessionsBachelor’s degree in engineering, information systems, computer science, business administration, or other related fieldsPreferredExperience in Media & Entertainment and/or Consumer Products industriesExperience at a large consulting firm (e.g., Accenture, Deloitte, EY, CapGemini, PWC)Salesforce Admin Certification highly preferred"}