{"title":"Software Engineer","location":"Gardena, CA 90248","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Performs coding; converts <b>software</b> project designs into step-by-step.</li>\n <li>Instructions according to the particular programming language or software.</li>\n</ul>","term":1,"jk":"bb58cdcd26e29598","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=bb58cdcd26e29598","source":"indeed","full_description":"TITLE: Software EngineerDIVISION: Kyocera Document Solutions DevelopmentDEPARTMENT: Software EngineeringLOCATION: Gardena, CaliforniaSTATUS: ExemptPOSITION REPORTS TO: Section Manager- PDLThis individual will contribute to the software development process for various projects involving the development and deployment of Application Software solutions.Responsibilities: Performs coding; converts software project designs into step-by-stepinstructions according to the particular programming language or softwaredesign tool in use.Contributes to the software development process. Analyzes user needs and develops software solutions that benefit our customers.Compares competitive product design and analyze technology requirements for products.Diagnoses and fixes issues reported in a timely manner.Proficient in using source control tools.Documents the status of issues related to the maintenance process using bug tracking software.Qualifications: Bachelor's degree in Computer Science or related discipline is required and an advanced degree is desirable.3 years of application software development experience is required.Excellent verbal and written communication skills are a must.Proficient in C# programmingJavaScript/TypeScript, HTML5, CSSREST/Server-Client architectureFamiliar with ASP.NET Core (Entity Framework), ReactDatabase experience, specifically optimizing database tables and queries is a plusNice to have skills: PythonDockerNGINX / web serveriTextUnit TestingPerforceJIRAContinuous Integration using JenkinsEssential Physical Functions: Occasional lifting of computer, monitor, or small printer no heavier than 40 pounds.Typing, writing, readingSeeing, hearing, and speaking, both nearby and at a distanceFrequent sittingStanding, walking, kneeling.This is a general description of the duties and responsibilities most frequently required of this position. The company may from time to time request that the incumbent perform other related tasks and assume reasonable responsibilities that have not been specifically included in this description.Job Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programEmployee discountFlexible spending accountHealth insuranceLife insurancePaid time offReferral programVision insuranceSchedule:Monday to FridayEducation:Bachelor's (Required)Experience:software development: 3 years (Required)Work Location:One locationVisa Sponsorship Potentially Available:No: Not providing sponsorship for this jobCompany's website:https://www.kdsda.com/homeBenefit Conditions:Waiting period may applyWork Remotely:Yes, temporarily due to COVID-19"}