{"title":"Manufacturing Engineering Technician NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJYaa3KvGlznb6Cqp0JmOimmAf4Xgx6N1jo8xCb41pAYi8Ep6zf0iz1g23zU_r_FJo_-6Vw6pU-C5jmFDfRyXZMpV4mezDWxN1Bpi1G44pJY8ZoBCozckGG7cJM2j8ceAvVIfVmDFbbUb-vjNDqYQfqFP4kMuCdS-gqO6BWJ22XuAsRV2jbMCowFmigOmU","source":"ziprecruiter","full_description":"Anderson Hydra Platforms, Inc. is a growing manufacturing and rental company headquartered in York, SC. We manufacture, sell, and rent under-bridge access platform equipment to assist with the building and rebuilding of the world’s infrastructure. Simply put, we help people get under bridges, whether to inspect, repair, paint, or access utilities. www.andersonunderbridge.com.We are seeking a dedicated, experienced, and well-organized Manufacturing Engineer Technician. Under the direction of the Manufacturing Engineering Manager, the Manufacturing Engineer Technician is responsible for supporting Engineering and Production in the overall quality process of the manufacturing of trailer mounted and truck mounted under bridge work platforms.Duties & Responsibilities:Collaborate with Engineering and Production leadership to continuously improve the usefulness and efficiency of processesSupport manufacturing team by answering questions related to the quality process and engineering drawings/tolerances as neededWork closely with manufacturing team to identify quality improvement opportunities throughout the manufacturing processAs part of the Engineering department assist with design and fabrication of weldment fixtures that improve quality, efficiency and repeatability of finished weldmentsInspect weldment for defects using faro arm scanner and other methods of inspectionFollow-up, complete, and maintain Engineering Change OrdersUpdate blueprints and schematics as neededUnder the direction of the Manufacturing Engineering Manager update Standard Operating Procedures as neededFollow-up, complete, and maintain Defective Material Report database and final product logsWork with production lead to schedule and coordinate pre-delivery inspections for new equipmentSupport engineering as needed for fabrication and assembly proto-type parts for new product developmentSkills:Proven experience as Manufacturing Engineer Technician in equipment manufacturingThorough knowledge of computer-aided design softwareKeen eye for detail and a results-driven approachAbility to fully understand, update, interpret and explain blue printsAbility to fabricate and weld using mig and tig with a pulse weld machineWell-organized and responsible with an aptitude in problem-solvingExcellent time management skillsAbility to interact with team members to develop good working relationshipsStrong ability to maintain a calm demeanor under pressure or stressExcellent communications skills: written, verbal and listeningMust exhibit detail orientation and ability to juggle prioritiesAbility to work well in a fast-paced environmentHigh energy level and positive attitudeEducation and Experience:Associate degree in Mechanical Engineering or equivalentExperienced user of SolidWorks preferredExperienced user of faro arm scanner preferredExperienced user of all Microsoft Office productsMinimum of 2 years work experience as a Manufacturing Engineer Technician in equipment manufacturingPosition:· Job Type: Full-Time· Monday – Thursday 6:00 am to 4:30 pm with occasional overtime"}