{"title":"Software Developer 2 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKVioSkeagc0CWwskhqhtfCvGd-KkRG4_irv0FGl2iK9GOAisd3hzPcp4WO9bkeByG-sWoCDhen97zbzdDch2SMf3MYMQ4KfU1S55p9Udfvw8mZRdmJ3pduyTzFDJ2l9bG_4Ggb0as6xxa1JqR5YRuuId-ZQYZRY4D0ue4-WeXY0tIAr9967nUKiWgV0V0","source":"ziprecruiter","full_description":"Acara Solutions is looking for a remote Software Developer for our Client based in Princeton, NJ.Reviews relevant requirements, standards and other documentation to clarify and understand software engineering requirements. Provides estimates for modules under development, and estimates own work. Completes the development of software test requirements for modules under developmentExecutes software (unit and integration) testsPresents technical findings and developments. Adheres to the software quality process through the execution of module, subsystem and system test proceduresAnalyzes localization requirements and designs/adapts products and solutions accordingly. Positions focusing on analyzing, developing, testing or implementing processes, technologies and systems in their specific field of expertise, from first principles. Targets are short to medium term (best to be characterized as milestones), and achievements are monitored. They may provide functional advice to and integrate services of operational staff or semi-professional colleagues. Pay and Benefits:The salary for this position is $37.30 per hour (Max Pay rate).Required Skills / Qualifications:At least a Bachelor's degree in relevant science major Minimum of 2 years’ experience in C/C++Preferred Skills / Qualifications:Additional Information:Upon offer of employment, the individual will be subject to a background check and a drug screen.Aleron companies (Acara Solutions, Aleron Shared Resources, Broadleaf Results, Lume Strategies, TalentRise, Viaduct, and Aleron's strategic partner, SDI) are Equal Employment Opportunity and Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender identity, sexual orientation, national origin, genetic information, sex, age, disability, veteran status, or any other legally protected basis. The Aleron companies welcome and encourage applications from diverse candidates, including people with disabilities. Accommodations are available upon request for applicants taking part in all aspects of the selection process.Applicants for this position must be legally authorized to work in the United States. This position does not meet the employment requirements for individuals with F-1 OPT STEM work authorization status."}