{"title":"Software Engineer","location":"San Mateo, CA","salary":"\n\n$122,827 - $206,366 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Integrate <b>software</b> components into a fully functional <b>software</b> system.</li>\n <li style=\"margin-bottom:0px;\">Execute full <b>software</b> development life cycle (SDLC).</li>\n <li>Write well-designed, testable code.</li>\n</ul>","term":1,"jk":"b772aa1289af02a0","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=b772aa1289af02a0","source":"indeed","full_description":"We are looking for a passionate Software Engineer to design, develop and install software solutions. Software Engineer responsibilities include gathering user requirements, defining system functionality and writing code in various languages, like Java, Ruby on Rails or .NET programming languages (e.g. C++ or JScript.NET.). Our ideal candidates are familiar with the software development life cycle (SDLC) from preliminary system analysis to tests and deployment. Ultimately, the role of the Software Engineer is to build high-quality, innovative and fully performing software that complies with coding standards and technical design.ResponsibilitiesExecute full software development life cycle (SDLC)Develop flowcharts, layouts and documentation to identify requirements and solutionsWrite well-designed, testable codeProduce specifications and determine operational feasibilityIntegrate software components into a fully functional software systemDevelop software verification plans and quality assurance proceduresDocument and maintain software functionalityTroubleshoot, debug and upgrade existing systemsDeploy programs and evaluate user feedbackComply with project plans and industry standardsEnsure software is updated with latest featuresSkillsProven work experience as a Software Engineer or Software DeveloperExperience designing interactive applicationsAbility to develop software in Java, Ruby on Rails, C++ or other programming languagesExcellent knowledge of relational databases, SQL and ORM technologies (JPA2, Hibernate)Experience developing web applications using at least one popular web framework (JSF, Wicket, GWT, Spring MVC)Experience with test-driven developmentProficiency in software engineering toolsAbility to document requirements and specificationsBSc degree in Computer Science, Engineering or relevant fieldJob Type: Full-timePay: $122,827.00 - $206,366.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceEmployee assistance programEmployee discountFlexible scheduleFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offParental leaveProfessional development assistanceReferral programRelocation assistanceRetirement planTuition reimbursementVision insuranceSchedule:Monday to FridayRelocation Assistance Provided:YesVisa Sponsorship Potentially Available:No: Not providing sponsorship for this jobBenefit Conditions:Only full-time employees eligibleWork Remotely:Yes, temporarily due to COVID-19"}