{"title":"Systems/Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALqSBCmhZqQjQ91Ud5oU37WMsM-YaJ2MhLN0v7utV9fC4LmksO1r2A_5vp188iMvplQJ9tuKj_UjE3vhNh19FyHNSNfb7CkJ05295UNN3uFPoDWn9ewk3F2_SMjS84EcF8zxVKiX9nuGDZK7nn61c_9XUhZJOvCXDBWwTbwFYAIRczQWuYDHtMoe379SDg","source":"ziprecruiter","full_description":"i3 is seeking a Systems Interoperability and Network Engineer to support the SAIL Team at S3I. This position is located in Huntsville, AL.This individual will support rapid prototype integration and test.The candidate should be able to perform requirements analysis, author test plans and procedures, understand/analyze data link Military Standards, perform general lab integration activities, and demonstrate system capabilities.The candidate should be a self-starter and be able to operate with minimal supervision.The candidate must be flexible and work well with other team members.Excellent verbal and written communication skills are required as well as attention to detail.Interaction with site personnel to coordinate platform availability and configurationsAuthoring test plans and proceduresSetting up test network equipmentIdentifying and documenting system engineering requirements from customer requirements documentation, goals and objectives and maintaining working knowledge of changes to data link Military Standards.Other duties as required.Bachelor's Degree in Math, Science, Engineering or related discipline. (Additional years of experience may substitute for degree.)Ability to work independently with minimal supervision.CompTIA Network+ Certification or CCNACompTIA Security+ CertificationExperience with COMSEC and CCIExperience with NIPR and SIPR networksExperience with Blue Force Tracker SystemsExperience with GPS Receiver DevicesExperience with Military Radios and Antenna SystemsExperience with Network Monitoring ToolsExperience with Spectrum ManagementExperience with Tactical Networks such as WIN-T Desired Qualifications:Understanding of tactical communications radios and waveforms (Link16, MUOS, WNW, SRW, ANW2, BFT2, TSM, WaveRelay, GD Fortress, Silvus and Iridium).Experience with Army Aviation PlatformExperience with VMWareExperience with WinTAK, TAK Server, or ATAKExperience with Wave or TOCNET intercom SystemsExperience with GIS Mapping programsExperience with Military Operations and Military Communications Systems Concepts of OperationsUnderstanding of Military Standard Message formats, VMF 6017, 6016, CoT Travel:This position may require that the individual be able to travel to support Continental United States (CONUS) and Outside of the Continental United States (OCONUS) activities.Duration and amount of travel may vary but will be regular. Security Clearance:Must be able to obtain and maintain a United States SECRET level security clearance."}