{"title":"Director of Engineering NEW!","location":"","salary":"","description":"","term":"$175,000 to $185,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJBqKia1R8hzXQZObRKHHKhmw2ybNZY-1EON_WHOVXKrstejcR7H_RtPJ-Ez3hllkfz4F7fDGz4cR2ZiQP1-NU9yLVeSKAinJQu3OnI1dFrKGSUQRVoxTt-TbNlFRpX7P1-FNptfWTXaxRSw0hrLy-nTmfo-4ZSN4dDnff6sEWxdK97bIZwXMiuPRUWNXQj","source":"ziprecruiter","full_description":"Are you looking to deliver exceptional data solutions? Do you have a passion for relentless pursuit of continuous improvement? If settle is not in your vocabulary, then you may be in the right spot. Our Client is seeking a high energy, enthusiastic individual to join their technology leadership team to support our growth efforts.The Director of Engineering for our Client will oversee all aspects of engineering projects with an emphasis on the expansion of our Client’s platform capabilities, user experience, and alignment with business needs. Our Client is looking for a leader who brings deep Engineering Management experience with a proven ability to understand the intersection of data, technology, and business operations to deliver a world-class product.What You’ll DoResponsible for management of our Client’s product lines, including design, development and maintenance of the platforms, solutions architecture and delivery.Leadership: The position will lead key initiatives across engineering projects and analytics workloads. The ideal person projects high energy possesses a passion for state-of-the-art technology, and speaks comfortably from a technical perspective with clients, business partners and across their team.Technology: The ideal candidate has deep technical security knowledge/expertise, systems management and administration experience, and the ability to manage a team facing unique market challenges in talent attraction, development, and retention.Collaboration: Work with all corporate functions and Technology Leadership to drive the data management solutions that provide for insights into performance and business growth objectives as well as cost saving opportunities.Fulfill vision and purpose: Develop & own a high impact, growth driving governance for Our Client that balances long-term growth, short-term opportunities, platform stability, and rapid expansion of product capabilities.Drive results: Manage the day-to-day data and product lifecycle end-to-end.Develop comprehensive metrics and dashboards for monitoring data processing focusing in on quality, speed and accuracy.Engage with Stakeholders: Work with key stakeholders in our executive leadership team as well as stakeholders in our business units to design, build and deliver an exception value to our customers.Technology Enablement: Lead teams to curate data asset integration and key technology processes and provide hands-on support of data enablement for application teams​.What You Bring To The Table7+ year’s engineering management experience in a technical setting.Demonstrable experience of a customer-focused approach to data processing.Experience of Agile methodologies and leading Agile teams in product delivery.Ability and willingness to dive in and work hands on where needed to keep the projects on track.A deep understanding of engineering management processes and methodologies.Strong collaborator with the ability to work closely with cross-functional teams, executives, and representatives across the stakeholder groups.Possess a unique blend of business, data, and technology; a big-picture vision, and the drive to make that vision a reality.Beyond just processing data, you obsess about continuous improvement.Strong work ethic with a do-what-it-takes attitudeDemonstrated leadership capabilitiesStrong written and verbal skills essential"}