{"title":"Patent Attorney or Patent Agent: Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIPBS86BGYGIhfuqDaE0IBOFSqUA0wNyTJMhnEjFHyT1f2R9evsa0M-I3USapZFXnMc9kaQkY_UN7icvZlZbxd6BfDApJpKw-NcpS6o8kmMRCGbcThSydfg22KazdQS-uuBc8Y-W0EkXNXjvgzbm916B9p1EhusdbDS46lyLPCf5Ktlkq2bcSBiX2ps-8Re","source":"ziprecruiter","full_description":"COJK is seeking a patent associate or patent agent to join our firms Life Sciences Patent Practice Group at its office located in Seattle, WA. Responsibilities include, but are not limited to, patent preparation and prosecution, patent licensing, and conducting due diligence. The position requires working closely with clients, inventors, and firm attorneys.Qualified candidates will demonstrate superior analytical, communication, and interpersonal skills, as well as an ability to develop and expand internal and external relationships. The candidate must excel in a team environment, as well as be a motivated self-starter who works well under pressure, with the flexibility to thrive in a fast-paced environment.RequirementsRequirements for associate include an advanced degree in organic chemistry, a J.D. from an accredited law school, 2-6 years of experience in drafting and prosecuting chemistry patent applications, a license to practice law in at least one state, preferably Washington, and admittance to practice before the United States Patent and Trademark Office (USPTO). Candidates should have industry experience of at least two years in organic chemistry; patent experience in the pharmaceutical industry is a plus. Candidates must possess superior academic credentials.Requirements for patent agent include a B.S. in organic chemistry, relevant work experience, a minimum of two years of patent law experience, and admittance to practice before the USPTO.Ideal Requirements:Drafting patent applications and working with the USPTO to resolve patent examiner questionsPatent licensingAssisting clients with patent infringement issuesProviding support to the litigation departmentAdvising clients on the use and protection of patentsAssisting clients with identifying the nature of their intellectual propertyMonitoring existing and proposed patentsAttending meetings and conducting conference calls with clients and contacts in the United States and overseasDealing with general inquiries on patent protectionFiling domestic and international patent applicationsHandling patent renewalsEducation and Qualifications:Advanced degree in organic chemistryAttorney with J.D. degree from an accredited law school or patent agentLicensed to practice in at least one state, preferably WashingtonAdmitted to practice before the USPTOBenefitsMedical/Dental/Vision/LTD/LTC401(k)Metro Pass"}