{"title":"Senior Software Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK2fHL6CzmylmCO8JHly0eC-YaTSWf016On1iZCDDTY0SlFJMq19BGmKoOdBntBWI7CNWWS6GAgy7VYwI1qInKI2xdE0FoSjz-nYZoTovBM0E6hYQBnCZn0jUbO3MlUUeF7J6UQ5QZ_6j45MO2mSQSbPREuNIqpbCnQozAs33k84LRY50ZZj4YoYFc3V0hE","source":"ziprecruiter","full_description":"This position can sit either at San Jose office or Los Alamitos office. If you reside in Southern California we would consider remote or partially remote work.Responsibilities:The Senior Software Engineer performs research, prototyping, design, development, integration and/or sustaining of full stack applications, for both new and existing cloud environments.Research and comprehend contemporary concepts in computer science in order to integrate full software for mobile devices, desktop computers and the cloud. Use this knowledge to design and develop proof of concept and production web applications that interface with our client's consumer electronics devices as well as algorithms that meet and exceed performance targets. Analyze and engineer feature requests for business teams, contribute to roadmaps for specific technologies and propose new projects to management.Recommend optimal approaches to design and efficient implementation based on practicality, best practices, and key technology trade off decisions. Learn and/or evaluate new software technologies Plan, estimate, schedule, and develop software that interfaces with multi function printers, iOS/Android apps, third party reference designs (e.g. Raspberry Pi), multi modal interfaces and server platforms or libraries. Integrate our client's source code with open source software, and software produced by both our client affiliates and third party companies.Investigate problem reports, perform troubleshooting, and recommend remedies for multiple products. Also research, install, test, evaluate and document problems in released and pre-release software from vendors. Review software designs, source code under development by colleagues as needed.Perform unit and integration testing or create test code for features on various platforms.Create or update documents explaining feature implementation and usage.Re-engineer assigned software to improve the performance, scalability, stability, and maintainability.Utilize agile project methodologies. Requirement:Practical experience in Machine Learning preferred (hands-on training or class project experience in Machine Learning will be considered) Have a general understanding of approaches in Artificial Intelligence 5-7 years' experience in designing and developing software for full stack deployments specializing in backend cloud environments that connect standalone products,Completion of an undergraduate program required. (B.A. or B.S.).Experience working with web applications and developing software in one or more server scripting languagesKnowledge of iOS and Android app development and common libraries, object oriented software developmentExperience developing multi-threaded applications, and database formats Working knowledge of backend server application development including Google/Azure/AWS Cloud services, Software as a Service (SaaS), Python, Java, JavaScript, Node.js, RESTful APIs, XML, JSON, HTTP, WebSockets and Socket.IO, SSH, SQL and NoSQL databases.Working knowledge of RESTful architecture concepts, Docker containers, and design patterns, voice user interfaces, Python, Java, JavaScript, Node.js, Software as a Service (SaaS), MySQL or SQLite, one or more NoSQL databases, callback functions, software factories and common server frameworks and machine learning concepts are preferred. Experience with personal assistant (Alexa, Google Assistant, Cortana, Siri) skill design capability is a plus. Volt is an equal opportunity employer."}