{"title":"Front End Developer","location":"Santa Cruz, CA 95060","salary":"\n\n$80,000 - $110,000 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Write clean code for new features, supporting existing features and fixing bugs.</li>\n <li>Test your work and deliver fully functional product features.</li>\n</ul>","term":1,"jk":"6b51ef6aced17153","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=6b51ef6aced17153","source":"indeed","full_description":"Front end developer*Warrior Made is a mission-driven body transformation company that strives to empower everyone to feel great in their bodies. The thread of wellness runs deep in our company, and we believe that our people cannot care for customers unless they care for themselves, which is why we offer generous benefits and time off policies. We’re a startup, so no two days are the same! We’re looking for people who thrive in that ever-changing environment, and who love to grow, communicate and be part of an amazing team.**As a Front End Developer, you will help us build a world class product. You will work with a small team of diverse and skilled devs to identify and fix bugs, test code, and build new features. Ultimately, your position allows us to serve our customers better every day. You are the front line of the product.**Day-to-day you will:-Write clean code for new features, supporting existing features and fixing bugs-Test your work and deliver fully functional product features-Collaborate with the team to build smart architecture and promote innovation-Use GitHub to track code changes**Requirements:-Team-oriented, we-before-me attitude-Great communication skills-Experience with front end languages (CSS, Javascript)-Strong understanding of mobile & responsive design & development practices-Preferred experience with: Angular**Benefits:5 weeks of paid time off annuallyMedical and dental coverage401K with up to 3% company match granted after one year of continuous employmentAccess to company social and team-building events*Job Type: Full-timePay: $80,000.00 - $110,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insurancePaid time offReferral programVision insuranceSchedule:8 hour shiftCOVID-19 considerations:We are currently working from home indefinitely until the COVID-19 pandemic is under control. The safety and health of our employees is critical to our success, and we align our actions with that principle.Work Remotely:Yes, temporarily due to COVID-19"}