{"title":"Python Developer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAK2DUvsaQP9u3atEjxoM7nbuosCbQz9a45rm3guvNas4FiVZpH45MiSIM8eHtOIHkx1ZnEUKrzX9i8Klq8ALmj2v73cPvUfvsLNS_dkZhoLa-S1iMoUZqvscrKfLnw_Nh3gfFsJhpZvsg9xHbYWTSaX-P3c0Rrk4PdpY27et0zkgqs-ovNkDj1rPKw7Or-G","source":"ziprecruiter","full_description":"Our client in the Dallas, TX area is looking to bring on an experienced Python Developer on a long term contract basis. This is 100% remote initially due to COVID but will be onsite in Dallas area in the future. This is not a Dev Ops role.Due to our client requirements, we can only work on a W2 basis. No c2c, h1b, cpt/opt.Key skills: Strong Python development experienceJava experienceData Integration and development experiencePlus skills: Airflow/ApacheExperience7-10 years of increasingly responsible systems development experience on multiple platforms.A minimum of 6 years' experience in the development environment commensurate with the assigned area of responsibility.experience with Google Cloud Platform(GCP) environment is a plus (or must have other Cloud platform)Additional Skills information: Experience with using core Python - Methods, Functions, Iterators, Generators, Exception Handling, File handling concepts, OOPs Concepts and Data StructuresExperience with the GCP Cloud Composer(Airflow), Cloud Dataflow and BigQueryProficient in writing scripts in Python for data extraction and data transfer from various data sources.Expertise in understanding the entire python eco-systemExperience of invoking REST APIs with Python to develop extensible solutions for data acquisition and data integration, according to requirements of the business.Experience using jinja templates with PythonAnalyze/creation of various type of raw file like Json, Csv, Xml with Python using Pandas, Numpy etc.Knowledge and implementation experience with Java with primary focus on building the integration services with message brokers like KafkaKnowledge and experience to use code versioning tools such as Git, Bitbucket etc."}