{"title":"Electronic Engineer NEW!","location":"","salary":"","description":"","term":"$40 to $60 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAJOVgZjZKrFwuqgJJd3VqO1-6aRVMtT81kQBS7PX2peAMFv7HctnnKILhs-8bV2zsWJ1waMNcf3j0FPtKi87FnfMC7hsUuhfKb3fi3_p02V0p4w7DEHmajjZOmhtWRYWynNj2GjQnTyy1W_mlSV4gtM8hKe7H6ZlWieuMPjS1TNWBXHItbrH8_X9qY3IK4","source":"ziprecruiter","full_description":"Electrical Engineer / Hardware needed for a contract to permanent position in Morrisville, NC with a Software/Firmware Development Company.Required Skills Include:Altium Designer for schematic captureDigital, mixed signal and analog circuit designEmbedded microcontroller designsPCB design life cycleTesting protocols for circuit boardsBS Degree in Computer Engineering or Electrical Engineering is requiredResponsibilities and DutiesElectronic Hardware Design EngineerPerform tasks within the hours and schedule allocated as per the project planReport any threats to the project’s budget, schedule or successAttend and be engaged in project meetingsRecognize project scope creep and report to management when it is identifiedWork in a collaborative manner with all other groups within the companySchedule and Budgets:Drive to meet project deadlines and hours estimates.Additional Attributes:Able to clearly write content for feasibility studies in advance of design effortProficient with general laboratory verification equipmentOrganized in capture of verification test resultsHonest/Integrity – does not cut ethical corners, earns and maintains trustOrganized – plans, organizes, schedules and budgets efficiently and focuses on key prioritiesFollow-through – lives up to verbal and written agreementsIntelligent – Learns and understands quicklyAnalytical – structures and processes data to draw insightful conclusionsDetailed – doesn’t let important details fall through the cracksFlexible – adapts to changing prioritiesInnovative – generates new approaches to problemsCommunicator – speaks and writes clearlyThis position starts with a 6 month contract and may convert to become a permanent full-time position. Please rush your resume if you can start a new position in the Triangle Area of North Carolina on a great team with 1 to 2 weeks’ notice!"}