{"title":"Software Developer 5 / Consulting Member of Technical Staff (JoinOCI-SDE) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI36dWZs5_cXyFb-oHwz2061jF0rPN0jBsQNcHbeG7Xu7GaWsB6cZ341fNfTSMDMg3H1Fcag93QjfLqr27l-5QEpLjmjvuqJWCFFx06peYri2sUdLtyZ2024-rF1gVrHl_pDTHxvq7WkZwZtYrvPFDXuv3gkOtAOX4spBHa4_7XVuAbEJAUFGAOhaka_vM","source":"ziprecruiter","full_description":"Cloud Engineering Infrastructure DevelopmentAt Oracle Cloud Infrastructure (OCI), we build the future of the cloud for Enterprises as a diverse team of fellow creators and inventors. We act with the speed and attitude of a start-up, with the scale and customer-focus of the leading enterprise software company in the world. Values are OCI's foundation and how we deliver excellence. We strive for equity, inclusion, and respect for all. We are committed to the greater good in our products and our actions. We are constantly learning and taking opportunities to grow our careers and ourselves. We challenge each other to stretch beyond our past to build our future. You are the builder here. You will be part of a team of really smart, motivated, and diverse people and given the autonomy and support to do your best work. It is a dynamic and flexible workplace where you'll belong and be encouraged. Are you interested in building large-scale distributed cloud infrastructure from the ground up? Oracle's Cloud Infrastructure team is building a new Infrastructure-as-a-Service platform that operates at high scale in a broadly distributed multi-tenant cloud environment. The largest names in technology and global business choose Oracle because we provide best in class end-to-end integrated compute, storage, networking, database, security, and an ever expanding set of foundational cloud-based services. We are assembling an elite software development team with the expertise and passion for solving challenging unique problems in distributed multi-tenant architecture. You will use your knowledge and creativity to design and build innovative new systems from the ground up. These are exciting times in our space - we are growing fast, still at an early stage, and working on ambitious new initiatives. An engineer at any level can have significant technical and business impact across the entire platform and company while working alongside some of the first developers of cloud services.  As a Consulting Member of Technical Staff / Senior Principal you will be working closely with software engineers from the various cloud service teams to build secure services and infrastructure that are fundamentally sound and efficient. Your influence over the design of the full system architecture is critical. You should be familiar with all levels of the software, hardware, and network stack; while having a deep knowledge in a few. Intellectual curiosity and an excitement for solving complex problems of complex massive systems is a must. You should value simplicity and usability as well as security and work comfortably in a collaborative, agile environment.  This is an emerging venture within Oracle and a successful candidate will have a combination of the following: 8-10 years' experience delivering and operating large scale, highly available distributed systems. Strong knowledge of C, C or Java, and experience with scripting languages such as Python, Perl, etc. Strong understanding of databases, NoSQL systems, storage and distributed persistence technologies. Strong troubleshooting and performance tuning skills.   Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. Define specifications for significant new projects and specify, design and develop software according to those specifications. You will perform professional software development tasks associated with the developing, designing and debugging of software applications or operating systems.Provide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 or more years of software engineering or related experience.This is a remote/office based position which may be performed anywhere in the United States except for within the state of Colorado.Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law."}