{"title":"Lead Android Engineer - SDK, Graphics NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJLF61xYfeTZ0Ri2O4w99Kwxtb8D09yFqeRGQfKdXdOOOHg1iA9veNs0aKpA7SbBm2QwU-0o2Vy9O_Vu9zq_OtD8hiAIlFnVQDbf6jN_Z4sQcV9w97UJipAZYsbfrNqVvHeQ5msiPDVJQdvRONYzlpLYZyZv38YiGWTKe_M8b6lYArCGnq_Jl1CbgWiGqX8","source":"ziprecruiter","full_description":"Lead Android Engineer - SDK, Graphics Lead Android Engineer - SDK, Graphics - Skills Required - Java, Android, C/C++, OpenGL, Graphics, Computer VisionIf you are a Senior/Lead Java Engineer coming from an Android background looking to join a thriving late stage startup developing interactive holographic display technology for mobile devices, please read on!We are working at the forefront of display technology by applying proprietary nanotech to give any display the ability to produce holographic content... with not glasses, no tracking! We're a tight knit team of scientists, engineers and artists working with the latest tech stack.This is a very important role to our team - you will be The Lead Android Developer, building a camera app that captures images and videos in holographics 4v!Located: West Menlo Park (near the Stanford Golf Course / University)What You Will Be Doing Working with designers to define what is possible for the product. - Designing stereo camera pipelines. Carefully consider tradeoffs between frame-rate, power consumption, quality and code maintainability. - Working with Android Camera APIs to configure preview and capture streams. - Integrating our computer vision and computational photography technologies.What You Need for this PositionMore Than 5 Years of experience and knowledge of: - BSCS Degree or similar - Java - Android - SDK - GraphicsBonus points for: - C/C++ or Android Native Development Kit - Real time graphics using OpenGL ES - Computer Vision / Machine Learning - VR/AR (Oculus, Unity, Unreal, ARCore, ARKit)What's In It for You Competitive Pay - Full Benefits - HUGE room for growth!So, if you are a Sr. Android Engineer looking to work on Holographic / Camera APIs, please apply today!Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.*Lead Android Engineer - SDK, GraphicsCA-West Menlo ParkBJ1-1518414*"}