{"title":"Java Developer","location":"Los Angeles, CA","salary":"\n\n$80,000 - $120,000 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Los Angeles software company which develops enterprise SaaS products on Java/Spring is hiring a USA-based back-end Java <b>developer</b> for a full time position.</li>\n</ul>","term":1,"jk":"1dbc3a215e9fdcdc","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=1dbc3a215e9fdcdc","source":"indeed","full_description":"Los Angeles software company which develops enterprise SaaS products on Java/Spring is hiring a USA-based back-end Java developer for a full time position.Qualifications:5+ years of professional software engineering experience in Springworking knowledge of SQLability to communicate clearly through writing and diagrammingactively seeks to match the team's existing norms and processesis excited to build fault-tolerant and scalable software systemsResponsibilities:write coding plans from feature specsdiscuss and defend those coding plans to the teamwrite Java codetest and debugclearly document what was done and what remains to be doneThis position requires working from home and will involve travel to internal meetings up to 6 times per year. It is best suited to a highly organized engineer who enjoys collaboration, who likes to share, learn and discuss strategies with others, and who can operate independently between meetings.Headhunters and recruitment agencies may not submit resumes/CVs through this website or directly to managers. We do not accept unsolicited headhunter and agency resumes, and will not pay fees to any third-party agency or company that does not have a signed agreement with us.We are an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law.In compliance with applicable law, all persons hired will be required to verify identity and eligibility to work and to complete employment eligibility verification.Job Type: Full-timePay: $80,000.00 - $120,000.00 per yearBenefits:Dental insuranceHealth insurancePaid time offVision insuranceSchedule:Monday to FridayExperience:Java: 5 years (Required)Work Location:Fully RemoteThis Job Is:A job for which all ages, including older job seekers, are encouraged to applyCompany's website:http://www.tonicdm.com/"}