{"title":"Senior macOS Developer NEW!","location":"","salary":"","description":"","term":"$130,000 to $160,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKxPjInYJVWjSnaqTbDSGmYi9UYbelBXdSxiH0WG5Bcy_o695VGU81CR3O-RNx8eSlp8grwxYDz-FBf0wQew7cX634pnay7cxfRQ5IUcLXEPMFpTs6wgUVQgqjBUx-b1IBkgwDvqi9fqhWnmc9EY7euhLT07aCkExrvAQI2q2jlfvWAiJ_Ci3YRhi8wcV0","source":"ziprecruiter","full_description":"You will be a co-located member of the engineering team, working with both internal and sourced developers driving a consistently high-quality macOS product for customers. Our current solution integrates deeply with the operating system to handle authentication by leveraging Bluetooth and network communications. Self-motivation and a personal strive for building great things is a must for this role.macOS Developer Responsibilities:· Architecting, designing, and building applications and tools for Apple’s macOS platform· Collaborating with the team to define app features· Ensuring quality and performance of applications· Identifying potential problems and resolving performance bottlenecks· Fixing application bugs· Bachelor’s degree in Computer Science or Software Engineering· At least 3 years experience driving development of high quality customer facing applications for macOS· Proficient in Swift and UIKit· Well versed in application architectures and design patterns· Experience with macOS internals such as kernel, POSIX, security, or related functionality beyond front end applications· Understanding of dispatch queues, multi-threading, and asynchronous processes· Scrum / Agile development experience· CI/CD Pipeline experience· Understanding of concurrent programming and the tools available on iOSKnowledge of Apple’s design principles and Human Interface Guidelines· Experience with Git for version controlmacOS Developer Requirements:Additionally, it could be valuable if you had any of the following:· Experience with Bluetooth LE· An understanding of security concepts such as FIDO/FIDO2, WebAuthn, PKI, or related technologiesTo be successful in this role, you must be a highly motivated individual who is experienced enough to plan ahead and document your work amidst a fast-paced environment."}