{"title":"Principal - Android Developer, Tech Lead NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKaS7LJItDoDEjvi-26zArStZ1smet3zmiUhJG87nAJxQboFe7RSN3vV-qrsDS7Bg2rVlI8paFAK_sQOX5clHtAvrMtCUcf8vAM0vyQvU4bLELfJUjZnzGt3vFrLcL_DLycAdbEcBEGV2Fhx7J_5hcG4ilQNJitAspm8RG3LtAeuwfqkoMUsStHWmQts9Oc","source":"ziprecruiter","full_description":"Position Description The Mobile Technology Lead will be responsible for being a servant-leader for a high performance team of developers in the design, development and implementation of the Ally Bank mobile channel initiatives. Ally Bank currently builds and supports the following native mobile applications: iPhone/iPAD (Universal App), Android phone/Android tablet/Kindle tablet (Universal App), and Windows Phone. As a Sr. developer/tech lead, this individual will partner with the product owner, scrum master, solution architect, technical analysts, developers in helping and guiding the scrum team in all aspects of mobile application delivery, from requirements through deployment. Experience in the Agile development methodology is required.Job Responsibilities Extensive experience and track record in leading development teams in native mobile development on Android and iOS platforms. + Extensive native development experience (minimum 5 years) on Android. iOS native mobile development experience a plus. + Experience with web service integration (REST, SOAP, JSON, XML). + Excellent refining, scoping and estimation skills within the scrum process. + Excellent communication skills (written and verbal) within the team and across the organization. + Ability to facilitate a highly productive and collaborative work environment. + Excellent organization skills. + BS degree in computer science or related technology major. + Finance/banking industry experience is a plus. + Experience in implementing unit tests. + Experience in implementing accessibility standards in mobile apps is a plus.Qualifications Lead the mobile development team to success within the scrum framework. + Conduct design and code reviews. Mentor team members in performing effective code reviews. + Motivate the development team to deliver successful sprints and deployments. + Partner with solution architects and leverage industry best practices to design and deliver high quality native mobile applications. + Proficiency in platform native UX style standards. + Assist business and technology leadership in understanding the options, costs and timing tradeoffs for potential decisions. + Work with the developers to ensure that stories are properly refined before accepting into sprint. + Escalate issues to the appropriate people early before they create significant impact to a sprint/release. + Review security testing reports/results and remediate potential vulnerabilities in a timely manner (within SLA). + Stay abreast of emerging technologies or trends that could impact the mobile channel. + Innovation. Make suggestions for opportunities to improve the Ally apps. Participate in spikes and hack-a-thons. Be creative. + Work with product owner and scrum master to maintain a minimum 2 sprints worth of stories refined in backlog.Ally OverviewAlly Financial Inc. (NYSE: ALLY) is a leading digital financial services company and a top 25 U.S. financial holding company offering financial products for consumers, businesses, automotive dealers and corporate clients. Ally's legacy dates back to 1919, and the company was redesigned in 2009 with a distinctive brand, innovative approach and relentless focus on its customers. Ally has an award-winning online bank (member FDIC), one of the largest full service auto finance operations in the country, a complementary auto-focused insurance business, a growing digital wealth management and online brokerage platform, and a trusted corporate finance business offering capital for equity sponsors and middle-market companies.Business Unit/Enterprise FunctionAlly's Information Technology (IT) organization is focused on supporting and improving the position of our industry-leading business franchises through cost effective, innovative IT solutions, as well as overseeing critical functions that enable the day-to-day operations of the entire Ally Financial enterprise. IT is also responsible for the administration and execution of information protection, disaster recovery and IT risk management.Total Rewards Information Ally's compensation program offers market-competitive base pay and pay-for-performance incentives (bonuses) based on achieving personal and company goals. Plus, we have a flexible paid-time-off program including time off for volunteer opportunities. Ally's Total Rewards Program is designed to enrich your life at work -- and outside of it and includes: Industry-leading 401K retirement savings plan with matching and company contributions + Wellness program encouraging healthy living with financial rewards + Flexible health insurance options including dental and vision + Pre-tax Health Savings Account with generous employer contributions + Pre-tax commuter benefits + Other work-life integration benefits including parental and caregiver leave, adoption assistance, backup child and adult/elder day care program, child care discounts, tuition reimbursement, LifeMatters Employee Assistance Program, subsidized and discounted Weight Watchers program and other employee discount programsAlly is an Equal Opportunity Employer We extend equal employment opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity or expression, pregnancy status, marital status, military or veteran status, genetic disposition or any other reason protected by law.Job Title: Principal - Android Developer, Tech Lead Company: Ally Financial Inc. Category: Information Technology BU Function: Ally Bank Experience Level: Experienced Requisition ID: 20-5092"}