{"title":"Intern Conversion - Back End Developer","location":"California","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Software <b>Developers</b> at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run…</li>\n</ul>","term":1,"jk":"e2340940cae9d367","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=e2340940cae9d367","source":"indeed","full_description":"Introduction\nSoftware Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.\n\nYour Role and Responsibilities\nSTART DATES FOR THIS POSITION ARE IN 2021\n\nAt IBM we have an amazing opportunity to transform the world with cognitive technology. By using the vast amounts of information available today to identify new patterns and make new discoveries, we are helping cities become smarter, hospitals transform patient care, financial institutions minimize risk, and pharmaceuticals find cures for rare diseases. Join the forward-thinking teams at IBM solving some of the world’s most complex problems – there is no better place to grow your career!\n\nEntry-Level Back-End Developers:\nAre experienced with client-server architectures, networking protocols, application development, and using databases.Have experience using and developing APIs.Understand user and system requirementsHave an understanding of, or experience with, Agile development methodology.\nWhat You’ll Do:\nYou’ll work in a dynamic, collaborative environment to understand requirements, design, code and test innovative applications, and support those applications for our highly valued customers.\nYou’ll employ IBM’s Design Thinking to create products that provide a great user experience along with high performance, security, quality, and stability.\nDesign and code servers, services, applications and databases that are reusable, scalable and meet critical architecture goals.\nCreate Application Programming Interfaces (APIs) that are clean, well-documented, and easy to use.\nCreate and configure Infrastructure as a Service (IaaS), Platform as a Service (PaaS) and Software as a Service (SaaS) applications. Design and implement large scale systems and Service Oriented Architectures (SOA) that enable continuous delivery.\n\nWho You Are:\nYou are highly motivated and have a passion for creating and supporting great products.\nYou thrive on collaboration, working side by side with people of all backgrounds and disciplines, and you have very strong verbal and written communication skills.\nYou are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues.\nYou have a basic understanding of software development and programming languages.\nYou have the ability to learn new skills quickly and use the skills efficiently.\n\n\nEntry-Level Back-End Developers are in demand across IBM's growth areas. You'll be matched to a development team based on your skills, location preference and business needs. Positions are based in one of the following IBM offices:\n\n\nMarkham, Toronto, Ottawa, London, Fredericton, Calgary\n\nOpportunities in all locations will vary based on business demand\n\nMust be eligible/legally entitled to work in Canada\n\n\n\nRequired Technical and Professional Expertise\nMust have basic knowledge in one or more of the following technology areas: C++, C, Java, C#, Ruby, Python.\n\nPreferred Technical and Professional Expertise\nMust have basic knowledge in one or more of the following technology areas: C++, C, Java, C#, Ruby, Python.\n\nAbout Business Unit\nNo matter where you work in IBM, you are making an impact. As an Early Professional with IBM, you will be taking on a key role with one of our industry-leading business units to work on the technology that is solving our most challenging problems and changing the way the world thinks.\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\nLocation Statement\nThis role will involve working with technology that is covered by Export Regulations sanctions. If you are a Foreign National from any of the following US sanctioned countries (Cuba, Iran, North Korea, Sudan, and Syria) on a work permit, you are not eligible for employment in this position.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}