{"title":"Administrative Services Manager - Seattle Crime Laboratory NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJTOoJALZ3B5OeKdPElO9vWqcppOQCrFwArB55bhoZvgv9nXtOWOquxNcP_Zo3vRPWovKeiv9jB5Cq8MykXW6_ntZsnc1pxGogp0gmE_1tAtp_l-93N3WGJUGTMk1oH1K2fxHO7i-r480Lgo3jTEQUP1AfoT5Y9vJqD084SCFBN5NGc92Ub53O-rZSG5uU","source":"ziprecruiter","full_description":"Description In addition to the base salary, this position is eligible for 5% premium pay for positions located in King County.     ARE YOU LOOKING FOR:Excellent benefits?Career growth opportunities?Opportunities to impact your community?A professional workplace that fosters respect, commitment and trust?Employment opportunities that recognize military veterans and/or military spouse per Governor Executive Order 19-01?As an employee of the Washington State Patrol, you will be part of a team of dedicated professionals responsible for providing safety and security to the citizens of the State of Washington. Troopers patrolling the highways are the most visible part of this agency.  However, there are over 1,200 civilian employees who serve behind the scenes supporting the agency mission.  To name just a few, we have: 911 dispatchers who are the critical vital link between calls for assistance and emergency response;Commercial Vehicle Enforcement Officers that work to inspect commercial vehicles to ensure safe and efficient travel on public highways;Deputy State Fire Marshals who help prevent fires in homes and workplaces;Forensic Scientists who process evidence that assists in prosecuting criminal cases;Records staff that process criminal information to ensure crimes are reported accurately so that offenders do not end up working with vulnerable people.Administrative staff who provide exceptional customer service and respond to information requests while ensuring the agency runs smoothly and efficiently. Apply today and join us in providing \"Service with Humility\"!  The individual hired for this position may also be qualified for the Public Service Loan Forgiveness program.  For information on this program click on  Public Service Loan Forgiveness Program . Duties The WSP Crime Laboratory Division's mission is to provide forensic science services and training for our user agencies (customers) within the criminal justice system. We are committed to providing the highest quality overall forensic services which ultimately enhances public safety for the citizens of Washington.This position is responsible for the supervision and leadership of the administrative support staff of the Seattle Crime Laboratory and ensures that the staff work seamlessly to provide services to our law enforcement customers and scientific staff in the laboratory. This position is also responsible for the security and storage of criminal evidence, and for office duties associated with providing excellent customer service. This position will provide extended administrative services support to other WSP staff in the Airport Way facility. PRIMARY RESPONSIBILITIES INCLUDE:Supervision of two Office Assistants and three Property and Evidence Custodians (PEC).Ensures the consistent scheduling, training, mentoring and evaluation of assigned staff.Plan, organize, implement coordinate and control all administrative services for the Seattle Crime laboratory.Interpret, implement and enforce agency and local administrative policies and procedures. Prepare budget estimates and accountability of spending for the Seattle Crime Laboratory Manager when required.Have working knowledge and effectively perform back-up duties of Administrative and PEC staff.Prepare the Administrative and PEC section for Quality Audits, External ISO accreditation Assessments and quarterly Seattle Crime Laboratory Evidence Vault Audits/RMD Audits.Responsible for filing systems, maintenance of case files, and records retention.Coordinate and schedule building maintenance by working with the City of Seattle as the WSP liaison.Track purchases of goods/services and prepare vouchers for payment based upon agency procedures.Oversee and ensure proper evidence handling procedures and accurate entry into the Laboratory Information Management System (LIMS). Qualifications Required Qualifications:At least two years of administrative services experience, to include knowledge in the planning, organizing, implementing, performing and/or controlling of administrative work.Valid, unrestricted Washington State Driver's LicenseMust provide an oral DNA sample to be used in the CODIS Elimination Profile Index.  Desired Qualifications:A Bachelor's degree involving major study in business administration or closely related field. Experience and/or knowledge in criminal evidence handling procedures as part of law enforcement work in an accredited laboratory.Experience in planning, organizing, implementing and coordination of administrative services for a department, college, division or other medium-sized organization entity.Experience in supervision and team leadership of administrative and/or technical personnel.Experience in working under stressful and demanding situations and a demonstration of flexibility and adaptability to meet given deadlines and complete high quality work at a supervisory level.Experience in contract management, project management, budget and cost estimates, and working efficiently and effectively with other agencies, groups or teams. Supplemental Information The act of submitting application materials electronically is considered affirmation that the information is complete and truthful. The agency will verify this information and any untruthful or misleading answers will be cause for rejection of potential employment.How to Apply:Please complete the on-line application process at www.careers.wa.gov.If you have questions regarding this announcement, please contact Tracy Moore at (360) 688-6813 or tracy.moore@wsp.wa.gov. Polygraph & Background Investigation:Prior to a hire, a polygraph examination and background check including criminal record history will be conducted. Information from the background check will not necessarily preclude employment but will be considered in determining the applicant's suitability and competence to perform in the position.Applicants are required to sign release of information forms and will not have access to any investigative materials, files, or results. The Washington State Patrol has strict guidelines relating, but not limited to, personal and employment characteristics, arrests, convictions, and illegal drug usage, etc.During the polygraph examination, candidates are required to sign an assessment sheet and participate in an oral interview process to verify responses to the Personal Background Evaluation, the Personal History and Background Questionnaire, and a Pre-Employment Interview. Untruthful or misleading answers or omissions will be treated as a falsification which will be cause for rejection of potential employment.Transcripts:Education verification is part of the selection process.  If selected as a top candidate, all education, to include high school and equivalent, indicated in your application materials, will be verified. If you are selected as a top candidate you will be contacted by the Human Resource Division and asked to provide official transcripts at the appropriate time.Other Information:Persons with a disability, who need assistance in the application or assessment process, or those needing this announcement in an alternative format, may call (360) 704-2317.  Applicants that are deaf or hard of hearing may call through the Washington Relay Service 7-1-1 or 1-800-833-6384.The Washington State Patrol actively supports diversity in the workplace and is an Equal Opportunity Employer."}