{"title":"          Intuit Again: Mobile Software Engineer NEW!        ","location":"","salary":"","term":"Contractor","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAIAU5t9EzftzCbeDRreSIJTCNWYZEMoFU5qsXMZbcYEho_Uxidq_GIzqB1RHaMCm1GnqAaCPWw5QaAKuithAUqgO87NSjbWqZC_geKS2hmMyBT6AQ7oDKYJR8BQpryXaZx7X99RPIHUUrEXeMX9VyKtNTXHYHE9RlCbtkScRP_9cYoibfzEmHauGU7vHDY","source":"ziprecruiter","full_description":"\n        Company Industry: TechnologyOpportunity: The Mom Project is helping to source candidates for the above client who is looking for an Intuit Again: Mobile Software EngineerCommitment Level: 40 hours per week, 75% remote, on-site, contract through August 2021The Mom Project is thrilled to partner with “Intuit Again”, a returnship program at Intuit for professionals returning to the workforce after taking time off from their careers for caregiving. During this returnship you’ll receive 16 weeks of paid employment doing work you love for one of the world’s most innovative companies. You’ll have the chance to update your skills, add new work experience to your resume, and make professional connections.After completing the 16 weeks of the returnship program, there will be the potential opportunity for a full-time offer. The program is open to anyone who has at least five (5) years of professional experience and have been out of the full-time paid workforce for at least eighteen months (18) to focus on caregiving. If you meet these criteria and your skills match our needs, we welcome you to apply.In this role, you can help engineer solutions that empower millions of businesses/customers worldwide. Your role is to work in small agile scrum teams to deliver awesome products that not only delight customers, but that are highly scalable and reliable. Using your detailed understanding of technologies and applying your intellectual curiosity you will help design, develop, and improve the features that help our customers run their businesses easily every day.Responsibilities• Leading the gathering of functional requirements, developing technical specifications, and project & test planning• Define, implement & automate Continuous deployment, Zero-downtime, Rolling update workflows• Build well-tested high-quality tools to improve Developer Productivity and Developer Experience• Acting as the technical subject matter expert: Mentoring fellow engineers, demonstrating technical expertise, and leading a small teamsolving challenging programming and design problems• Work cross-functionally with various Intuit teams including: product management, QA/QE, various product lines, and/or business units to drive forward results• Architecting and developing Android or iOS mobile apps, prototypes, or proofs of concepts• Generate technical documentation and PowerPoint presentations to communicate architectural and design options, and educate development teams and business users• Resolve defects/bugs during QA testing, pre-production, production, and post-release patches• Demonstrate a passion for developing well architected mobile apps that integrate into a complex set of services and dependencies• Experience with Agile Development, SCRUM, or Extreme Programming methodologies• Roughly 80-90% hands-on codingQualifications• BS/MS in computer science or equivalent work experience• 5+ years’ experience designing and developing mobile applications• Emphasis on rigor and security required for a financial government compliance offering is a plus.• Experience developing in both Android and iOS is a plus• Practical experience in developing applications integrating with services, building out high scale platforms, engineering and operational excellence• Experience with building solutions to improve Developer Productivity• Good understanding of CI/CD workflows. Using Jenkins to set up and report on continuous integration (CI), nightly builds, and code deployment• Strong coding abilities, architecture, debugging, and performance/diagnostics measurement skills• Experience in developing cutting edge native apps using mobile technologies.• Excellent communication skills: Demonstrated ability to explain complex technical issues to both technical and non-technical audiences• Expertise in the Software design/architecture process• Expertise with unit testing & Test Driven Development (TDD) using frameworks like Mockito• Expertise with any of the following Object Oriented Languages (OOD): Java, Swift, Kotlin\n      "}