{"title":"Civil Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIEVhzzu2jRvzpL6GQwZCTIBGhLT6Y5F-3L0QItbYiftKnyRwq-24mfxWbX7B2hwfVAx4XIblGI9RPeD_pUnUsAnV9sbV3jx-pTkbk9sda5T61w9STFixriKcBfeQ5k_BWnIMhG3OQ9OCh5d5Dj2kJsooLLeCqsENwAh_zsz7J7S0q9v23uPZp3sYJKuD-f","source":"ziprecruiter","full_description":"Since 1993 Ragle Incorporated has completed numerous construction projects in the States of Indiana, Kentucky, Texas and Illinois. Ragle, Inc. concentrates primarily on highway and bridge construction but also performs work in deep excavation, demolition, commercial buildings, grading and pipe work. We value our reputation for meeting contractual commitments while achieving economic results for our clients. Ragle, Inc. uses their highly experienced personnel to complete projects to the owner's satisfaction.We are very pleased to announce that Ragle Inc. is now is looking for a highly motivated, hardworking Project Engineer who is interested in working for a young company with great advancement opportunities. Our IN Heavy Highway Division is seeking team-focused, innovative, and results-oriented individuals who are looking for new learning experiences, and a desire to contribute to our clients’ success.Primary Responsibilities:Contract administration and management of subcontractorsAssist in change ordersExposure to job cost reporting and analysisDeveloping detailed work plans, schedules, and resource plansConducting project meetings for tradesEnsuring adherence to quality standards and safety policiesRequired Qualifications:Accredited bachelor's degree in civil engineering, construction management or construction technologyTwo- years of related experienceStrong leadership and communication skills.Goal Oriented – able to set goals and achieve them.Organizational Ability – able to plan, prioritize, organize and monitor activities and projects.Ability to handle several projects simultaneously and ensure quality of work.Traveling within the state of Texas could be required.Basic computer knowledge in Excel, Word, Outlook, and scheduling software.Candidates must include a detailed resume with references and job descriptions.Ragle Inc. provides equal employment opportunities to all applicants and employees without regard to race, color, religion, sex, gender, national origin, age, disability, or status as a Vietnam Era or special disabled veteran in accordance with applicable federal and state laws. Ragle Inc., complies with applicable local, state and federal laws governing nondiscrimination in employment at each location the Company operates. This policy applies to all terms and conditions of employment, including, but not limited to: hiring, placement, promotion, termination, leaves of absence, compensation, and training. Ragle Inc. participates in E-Verify."}