{"title":"Senior Help Desk Technician NEW!","location":"","salary":"","description":"","term":"$20 to $25 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIUIHgOvbb4EqqKK6AvrTxVvH7aiJvIJm2JAh_lv90nOeB8uCD05bBTKVhDmUTdE5nYTqmDpqX18aijm_78x2AMUpIz1GpYX1W4CaCU_3qs7Q-BB_NzymsUPwprBCAh94PKnacCpU95vL37IK3gVr55pQ9tZFSgYDxVEbs3CIuZVGP8hIY54tBFMUobHzc","source":"ziprecruiter","full_description":"Company OverviewNovel Engineering, Inc. was founded by business professionals who had a common quest to create a company that delivers on its promises while fostering a work environment that is constructive to its employees. Having decades of solid experience in engineering services to the aerospace, transportation, controls, and government/military industries, Novel continues to deliver projects that meet our customers’ needs while leveraging cutting-edge tools and processes.Responsibilities and DutiesNovel Engineering is seeking a Technical Support Specialist to work closely with our client to understand user needs and translate these needs into a successful support program. You'll support our client's customers in the use of their product, troubleshooting of operational issues, monitoring of systems for health and status, and performance of preventive maintenance.In this role you will spend time with the client's Engineering Team to build a system and application level understanding of their products. The result will be to function in a first-response role for the fielded product. You will interface directly with the customer's user community. Your goal in this role will be to quickly understand the customer's issue and provide a solution.Qualifications and SkillsMinimum: 3 years experience with direct customer contact or technical support background. Excellent customer service skills, proficient in database and data entry, excellent organization skills, general office equipment skills.Associate's degree in Computer Science, Computer Engineering, Software Engineering, Information Technology or 5 years work experience (applicable technical, administrative or customer service or technical support background considered in lieu of degree).Experience in developing written procedures and instructions.Experience with ticket logging systems to record interactions.Experience setting up and managing Kubernetes (or other container management systems).Fluent English, both written and spoken. Second language a plus. Excellent writing skills.Position is subject to pre-employment drug and random drug and alcohol testing.Desired skills and experienceBachelor's degree in Computer Science, Computer Engineering, Software Engineering, Information Technology.Experience with Microsoft Office (Word, Excel, Power Point (Access exp.+), Google docs.Ability to multitask and prioritize.Aptitude for learning new software programs and concepts.Attention to detail, strong organizational and communication skills (both verbal and written) and an ability to think clearly on one's feet.Patience and empathy for customers.Critical thinking skills to understand how to translate customer needs into technical decision.Excellent Communicator - both written and spoken - you must be able to articulate issues clearly and understand your audience.Good Technical Writing skills - you will generate process documents, to build to the client's knowledge-base.EducationBachelor’s degree (preferably in Software Engineering or a related field) desired but not required.Benefits and PerksNovel Engineering offers a competitive employment package. This includes competitive compensation, vacation, dental, vision, employee profit sharing plan, flexible schedules, and a professional yet relaxed culture that gives you the opportunity to work in a team-oriented environment, innovate with co-workers, and thrive as an individual."}