{"title":"Senior Managed Services Engineer - Cisco Network","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIsXXokjL0eNO9_A2o6ur9ERlSCGiiH1crBX3L9DeP1RtMQgQocswfEZA6CwR2JNa5VRxORJIioYDvbXUZJOpVP9d4EgNer2El8Y3HE35mfdwBVaQnfIUdtxZ7A6nx5zlS7KJkOstJGcSsHlb6L1JbmkWbmz77lBEOZPQGEVymdEmNprBOfFvnLAQatF8A","source":"ziprecruiter","full_description":"Senior Cisco Network Engineers with CDW's Strategic Solutions and Services practice are in the middle of the action deploying enterprise level technical solutions for our customers. By joining CDW, you will be partnered with industry leading Engineers, Technical Leads, Project Managers and Solution Architects enabling your continued development and success. CDW is honored by holding the highest level of certifications and accreditations with our vendor partners such as Microsoft, Cisco, EMC, VMware, IBM, HP and more. Interested in helping our customers achieve their complex and challenging business goals with leading edge technologies? If you GET IT and are interested in delivering client facing solutions like deployments, implementations & configurations, don't wait, take the first step and apply now. The incumbent of this position will:+ Perform client consulting in the area of network engineering (hardware and software) using routers, switches, network security devices, protocol analyzers, TCP/IP, VPN, Frame Relay, and MPLS + Design, plan, and implement LANs and WANs using the latest technology Identify and troubleshoot hardware and software technical problems related to LANs/WANs + Conduct throughput analysis, problem solving, and infrastructure planning Participate in various client projects intended to continually improve/upgrade network infrastructures Minimum Basic Qualifications+ Bachelor degree in business, computer science, a related technical degree or equivalent + Three years experience delivering complex technical solutions including planning, development, implementation and support Other Required+ Minimum of one year experience in programming or analytical work + Experience with troubleshooting router, switch and virtual network configurations + Ability to work weekends and/or off hours as necessary to meet clients' needs + Ability to effectively communicate with clients and end users + Physically able to lift up to 50 pounds of equipment. + Attention to detail on inventory and logistics is important Preferred Qualifications+ Consulting experience preferred + CCNA, CCDP, or CCIE certification preferred + Some knowledge of voice components preferred People are what make CDW special. We encourage our employees to think of innovative ways to solve problems for our clients. As an equal opportunity employer, we encourage this independent thinking, and embrace the diversity of our staff. We're committed to hiring and advancing the best individuals available, based on job-related qualifications. We value the perspectives and innovations that come from having employees of different race, gender, age, ethnicity, color, national origin, religion, disability, and marital or family status. We encourage all of our employees to help build and support strong, vibrant communities, improving quality of life and making a positive difference where we live and work. *Senior Managed Services Engineer - Cisco Network* *Madison, WI * *20002071*CDW is an equal opportunity/affirmative action employer committed to a diverse and inclusive workplace. All qualified applicants will receive consideration for employment without regards to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status or any other basis prohibited by law. If you are an individual with a disability and need assistance in applying for a position, please contact us at Helpdesk-Recruiting@cdw.com."}