{"title":"Technical Writer","location":"","salary":"","description":"","term":"$35 to $40 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AALQdXWh_cpC7V1cFH6R27C3GAsQJLR2_Jyt7bwub3U_tJLF9-HLe8Mb33jt9_0RRDkUIt2OE6H-8vh6tmnB_OuwcYVl2nIm0Hx_Y-WMgbRrgzoUBQBKnsdbybVQ92JXB4ntPrkwkCr0daU2mp3Ltqny1rn9yQJhyUensP4VAINMP8nUcvoYdTyGbrj8fNV-","source":"ziprecruiter","full_description":"***REMOTE OPPORTUNITY***This position is part of the Technical Publications organization. This organization is dedicated to shaping and delivering global performance improvement strategies. This includes driving competitive advantage through documentation as well as leveraging new learning technologies to deliver innovative and intuitive knowledge experiences.Responsible for the development of technical documentation to support Software and Solutions products. Designs and develops content for use in user manuals, quick start guides, installation guides and programmers guides that address the needs of both internal and external users. Our mission is to establish best-in-class knowledge transfer and to contribute to overall customer satisfaction for users of our products.Write and deliver high-quality API documentation that marries a branded website for business stakeholders with the developer code documentation in APIM’s subscription developer portal.Responsibilities:1. Develop and write technical content including descriptions, installation procedures, operating instructions, maintenance and troubleshooting information.2. Conduct interviews with SMEs to gather data for content. Responsible for handling multiple projects at one time in a dynamic environment.3. Coordinate, manage and control documentation projects and deliverables.Qualifications:1. Excellent writing skills with the ability to clearly translate highly technical information into easily used and understandable text and illustrations.2. Excellent interpersonal skills necessary to communicate with engineering, marketing, SMEs and external team members to obtain the information necessary to carry out assignments.3. Proficiency with various authoring and CMS tools and familiarity with task management software: Confluence and JIRA.8+ years experience preferred BUT will accept Top Line candidates with a bit less experience."}