{"title":"Senior Software Engineer - Frostbite Engine Systems - C++","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJWol7eu02AvuwbkUgbIOgCl1cZXLdfTb_sIJ_GPLd0AelEZ8HOhrQ1Jg6VyEPT-EGTX9tH0AE0HHg9LJX-rsKqXvMSrnJezikBWOgcbQ7Mp6GtRzznwHkAQoZEUDP8GJtbFZh4rebG7N6MBcY9ZYUa_bjH_ErJiEI9CW0yhUz-uTTWB-u1f75S9myIGesM","source":"ziprecruiter","full_description":"Senior Software Engineer - Frostbite Engine Systems - C++FrostbiteFrostbite is EA's state-of-the-art multi-platform game development engine. Our global team empowers game creators to shape the future of gaming by developing creative engine features and outstanding tools. We are honored to have thousands of game developers all over the world using Frostbite to create some of the most amazing games and player experiences in the industry.Why join the Frostbite Team?As a systems engineer on the Engine Systemsteam you will be working on technologies that are the fundamental building blocks of the Frostbite engine. The team works on low-level technologies that span a huge number of domains. There are many opportunities available for learning and gaining unique expertise. You will be a part of daily interactions with many of the most experienced engineers in the company to help solve some of our most engaging problems, you will work on the latest gaming hardware, manage low-level hardware interactions like the file system and memory management. You will be part of a team that is passionate about pushing our technologies forward.ResponsibilitiesDesign and implement complex low-level systems used by thousands of game developers across EAProvide architectural guidance, technical direction and oversight for complex systems level feature setsWork with the wider Frostbite engineering team to determine strategic direction for systems level technologyCollaborate with team leadership to build roadmapsHelp improve the tools, technical processes and best practices for the team. Help in improving team productivity, code quality and sustainable developmentBe a mentor to help develop the teamImplement automated testsSupport others using Frostbite Core's technologiesQualificationsBachelor's degree in Computer Science or related field, or equivalent training and professional experienceHigh level of proficiency with C++Multithreaded programming and debugging experienceProfiling and optimization experienceUnderstand memory management and multiple processor useExperience using source control systems on code bases with a large number of active developers7+ years of professional software development experienceBonusesExperience in game engine developmentExperience in game console developmentStandard C++ library, concurrencyC# for scripting or .NET/WPF development"}