{"title":"Geometry Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALqTVHeQgxNg7jEqS8uuDFH9CKON11UjA0f1NT_b0jyv8STukHqYRHoHI_0F06cUkRQtq_yc4Ab3D4DXFNRhgW1hRR6pSQa4gKr6qr6ARn8DN55U-mPpXdrjLZ_mdOGyVw_ChjBDWonyMedPVQUJJ5CguDd2s3HhrCfsNH6uCYrqh40ktGG1ycZghSLh7k","source":"ziprecruiter","full_description":"About Us: At nTopology, we are passionate about building next-generation engineering solutions. We enable the most innovative engineering companies in the world to transform how they develop, test, and manufacture better products faster. Our software has been used to engineer mission-critical satellites, deliver stronger and lighter medical implants for patients in need, and allow engineers to create complex, high-performance products never before possible.  And our technology enables companies to fully utilize advanced manufacturing methods like 3D Printing. If a fast-paced, collaborative and high-performing environment excites you, we'd love for you to join us.  We are looking to add smart ambitious teammates who are passionate about problem-solving and passionate about technology. Does this sound like you?  nTopology is hiring for a Geometry Software Engineer. The role of the Geometry Software Engineer is to build high-quality innovative software features for nTop Platform, our next generation design engineering system, in order to create and process complex generative design geometry consisting of a combination of prismatic shapes, organic shapes, and volumetric micro-structures. The Geometry Software Engineer will analyze software requirements to identify geometry processing requirements, research and evaluate suitable mathematical solutions, translate mathematical solutions into well designed data structures and algorithms, and implement and maintain them with high quality code.  This role reports to the Lead Geometry Engineer. What You'll Do Work with product and sales teams to translate customer needs into technical solutionsDesign and implement geometry processing algorithms to develop and maintain advanced modeling, analysis, and manufacturing software featuresParticipate in full software development life cycle (SDLC)Integrate software components into a fully functional software systemComply with project plansPrepare clear documentation as needed to prepare reports, presentations, etc. Who You Are Master's degree or higher in computer science, mathematics, or related field with a focus on geometry processingStrong geometry/mathematics background demonstrated via publications, industry projects, or masters thesis or similar projects Proven experience in C and C++Experience with a scripting language like JavaScript or Python and eagerness to learn other languages Experience with git or other modern version control systemsA passion for robust development practices including test-driven development, continuous integration and agile methodologiesExcited to work in a fast-paced, team oriented environmentStrong verbal and written communication skills in English  It's a Plus If You Also Have Experience in developing computer aided design/manufacturing systemsExperience with graphics programming using OpenGL, GLSL, or other graphics APIsExperience with general purpose GPU programmingExperience using commercial or industry grade geometry processing libraries (e.g., Parasolid, CGAL, OpenVDB) and software systems (e.g., Solidworks, NX, CATIA, etc.)Knowledge of modern simulation and optimization applications such as topology optimizationKnowledge of additive manufacturing is a plus Benefits Competitive salaryOutstanding PTO and leave policyStock optionsHealthcare with optional Dental and Vision plans401k with matchingSTD & LTDCommuter benefitsWeekly Team Lunches nTopology is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. nTopology is committed to working with and providing reasonable accommodations to applicants with physical and mental disabilities."}