{"title":"Remote Embedded Software Engineer","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJMx0GyhTh36PJZZvJe-_Gv2QZLLaKVZdUXIk6RYaScxY7jG9CX0SqWkAWwqQdQR_2n-kW2xXWKDi0zY-YMcy_t1gKGX8J3l2Mf_a_QhuBToSZBOlAIhCicVF6l03R80Fkxnlfq6HA1vahvydO7-YJwRB1trRKXbdv9shEDF8dO7Y_EcnG54xObzehCgEgM","source":"ziprecruiter","full_description":"We have a 4 to 6 months contract for a Contract Remote Embedded Software Engineer.This position will assist in building a medical device platform. ResponsibilitiesContribute to all phases of the software life cycle, including requirements analysis, design, implementation, test coordination, release, support, and documentationCollaborate closely with cross-functional engineering teams to add input regarding the software requirements and produce designs that fulfill project visionDesign and implement reusable high-quality software that meets the business and project requirementsEnsure regulatory compliance during development of software for standards such as IEC 62304, IEC 60601-1, and other applicable FDA guidanceRequired QualificationsBachelor's degree in Computer Science, Computer Engineering, or Electrical Engineering with 3+ years developing C/C++ in an embedded environment on microprocessors or microcontrollersTroubleshooting and root cause analysis skillsKnowledge and exposure to basic hardware design and ability to read schematicsCapability to use hardware tools such as multimeters, oscilloscopes, and logic analyzersCompetency with software development tools (IDEs, compilers, linkers, debuggers)Ability to effectively use source control (git). Use in conjunction with code review is a plusExperience with peripherals such as Flash memory, Analog to Digital converters (ADC), Digital to Analog Converters (DAC), Real Time clocks (RTC), watchdog timers (WDT), and sensorsExperience with embedded busses such as UART, I2C, I2S, SPI, CAN, USB, and EthernetDesired QualificationsExperience developing embedded systems (i.e. microcontroller-based custom products and custom electronics)Familiarity with embedded wireless systemsExperience in a regulated environment such as Medical Device or Aerospace is a plusEmbedded GUI development (knowledge of Qt for Embedded Linux is a plus)RTOS embedded software development knowledge and experienceMust be authorized to work in the US now and in the future, no sponsorships available at this time."}