{"title":"PHP Developer","location":"Los Angeles, CA 90056","salary":"\n\n$88,000 - $90,000 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">NO H1B sponsorship available at this time.</li>\n <li style=\"margin-bottom:0px;\">LOCAL CANDIDATES OR ABLE TO RELOCATED QUICKLY.</li>\n <li>We are looking for a talented, PHP Software Developer.</li>\n</ul>","term":1,"jk":"58573c0aaa16f6d4","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=58573c0aaa16f6d4","source":"indeed","full_description":"Job DescriptionNO H1B sponsorship available at this timeLOCAL CANDIDATES OR ABLE TO RELOCATED QUICKLYPosition DescriptionWe are looking for a talented, PHP Software Developer. In this role, you will be developing, supporting, maintaining, and debugging client-related web development projects. The ideal candidate is a highly motivated, resourceful, self-starter capable of getting up to speed quickly and adhering to company standards. The candidate must have excellent verbal and written communication skills with a result-driven, consultant style attitude.NO H1B Local Candidates onlyKey Tasks and ResponsibilitiesAbility to work as part of a team and work closely with external clients, as well as our consulting team to design, build, and test development projectsProvide technical troubleshooting, configuration and deployment for applications and their underlying infrastructureDesire to investigate development issues, resolve problems, and communicate statusPrioritize internal development activities along with urgent, often unscheduled, development requests with a high level of urgency and responsivenessDevelop and maintain technical documentationPartner with consulting teams to assist in special projectsCommunicate with third-party software vendors for additional supportAssist with estimating development efforts and timelinesKeep current on development techniques and apply those techniques when analyzing and developing enterprise applicationsFlexible and open-minded attitude as you may be called upon to troubleshoot client issuesReview functional and design specifications to ensure full understanding of individual deliverablesIdentify any potential quality issues per defined process and escalate potential quality issues immediately to Product ManageEnsure that validated deliverables meet functional and design specifications and requirementAbility to think abstract; ability to not conform to the norm.Willingness to learn and expand skills and repertoireRequired Skills: Minimum 2+ years of extensive experience in web-based applications using LAMP, WAMP, PHP, Drupal, WordPress SEO technologies.Good working experience in designing and implementing various web applications in LAMP (Linux, Apache, MySQL, PHP).Solid knowledge and understanding of internet technologies including XML, web services, JQuery, Joomla, Drupal, Magento, etc. Experienced in PHP5, MySQL, Python, OOPS, Design Patterns, HTML5, CSS.Strong understanding of API driven design with versioning.Excellent experience in designing and developing interactive User Interfaces, usability, web and client/server applications using HTML5, CSS3, JavaScript, and JQuery.Expertise in a client scripting language and server-side scripting languages like JavaScript, jQuery, JSON, DOJO, bootstrap, Node.js, Angular.js, backbone.js, Require.js, JSF, and JSP.Experience in working with CSS Backgrounds, CSS Layouts, CSS Positioning, CSS Animations, CSS Text, CSS Borders, CSS Margin, CSS Padding, CSS Table, Pseudo Classes, and Pseudo Elements.Solid experience in developing Graphic User Interface GUI to display report data using JQuery in Cross-browser compatibility and Web application scaling.Extensive experience in implementing AJAX features using JavaScript and jQuery.Relevant experience in web applications using CakePHP. Extensive working experience with Content Management Tools such as Drupal 6 and Drupal 7, Joomla, WordPress, and Magento.Good Working knowledge of .NET framework and C#.Good Working knowledge of MSSQL Database. Competencies:Accountability and Professionalism – Takes responsibility for the quality of applications released to the production environment; demonstrates appreciation for the importance of their workCommunication – Clear communicator (written and verbal); ability to write technicalrequirements and communicate with developers and other stakeholdersInitiative – Ability to focus on and meet deadlines and deliverables; ability to perform in a fast-paced development environmentJudgement and Problem Solving – Creative solving of technical problems; ability to translate business requirements into solid functional and technical requirementsTeamwork – Experience working directly with subject matter experts, end-users, and quality assurance teams on complex technical platforms; hold and facilitate technical requirement and code reviews with cross-functional team membersJob Type: Full-timeJob Type: Full-timePay: $88,000.00 - $90,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceFlexible scheduleHealth insurancePaid time offVision insuranceSchedule:Monday to FridayAbility to Commute/Relocate:Los Angeles, CA 90056 (Preferred)Experience:JavaScript: 2 years (Preferred)PHP: 2 years (Preferred)C# and .NET: 1 year (Preferred)Work Location:One locationBenefit Conditions:Only full-time employees eligibleWork Remotely:Yes, temporarily due to COVID-19"}