{"title":"Multi-Care Mechanic","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALA3pUTljkY6qKT172S6vbAZHlcBiXRk8az8DwCjMVg0BCpBE9Jr4iyyep--AGEGP0iiMMFhYo8Z4WVzJ7muBgfN2R-2Kn0q2y_XlBEa-wUb8wrM5p_LL1dqi_Hrav-3LbqzWjGgihuuQ9kkfvhWBU-ZXOcYpucMaPcfocpJaQVxd9MOysmuFy8UeXRhqVG","source":"ziprecruiter","full_description":"Job SummaryAs a Multi Care Mechanic, you will be responsible for servicing our guests' vehicles, ensuring quality workmanship in a fast-paced environment. Mechanic must have his or her own tools. Multi Care Mechanic's (MM) responsibilities may also include but not limited to:Performs repairs and overhauls in all car and light truck systems.Must be able to perform complete disc or drum brake service including, but not limited to replacing all braking components as well as performing full brake flushesMust be knowledgeable and understand the full mechanics of the braking system. Also be able to explain the brake servicing process and answer all guest questions.Must be able to diagnose and pinpoint issues in the braking system.Must be able to diagnose the following key components and potentially make any/all necessary repairs:Engine Performance,Suspension and SteeringElectrical o Heating and Air ConditioningAbility to use our current computer system to provide estimates for parts and labor. You will be using the following programs/apps: All DATA, AutoZone, O'Reilly, Advance Auto Parts, and NAPA, Etc.Road-test vehicles (before/after) to ensure all work it completed up to standard.Secondary duties may include performing any/all ancillary services such as: Transmission and Radiator Services Fuel filter replacement o Fuel system cleaning Tire rotation o Belts and Hose replacement Assist with vehicle inspection, Report on Condition (ROC)Experience Required:1-3 years of automotive experience. 1-2 years of experience working on brake systems.Provide training and supervision to the stores apprentice teammateEducation/Training Requirements: National Institute of Automotive Service Excellence (ASE) certification in: A5 - Brakes Certification Automotive Service Excellence (ASE) certification(s) in: Engine performance, Suspension & Steering, Electrical Systems, Heating & Air Conditioning preferred. Automotive technical or trade school degree a plus High school diploma or equivalent Must have and maintain a valid driver's license during employment with a clean driving record"}