{"title":"Mobile Trailer Mechanics / Technicians - All Shifts, Up to $75K Plus NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKUvl9aJ34dppH9H6fP852Cs1HVe8Ny0H5WHObPwz1cF1OHh15_MkKee9yRzyEfeP-cZ1xiFIpJ-9nwevGG2KV2_JXkL1_XY1d_Du2e8mWJr99u6f85uV6KsOfZAc8MDlox_duV0ppwErIib8rivgaNIQbjMzTq3cvlCTlDLWN9VqqbgWaiDMBV8hAOE9_G","source":"ziprecruiter","full_description":"Dallas, TX AreaMobile Trailer Mechanics / TechniciansFull-Time Positions - All ShiftsFleet Repair Solutions LLC strives to provide honest, timely and reliable services and sales across our multiple locations including Grantville, PA, Allentown, PA, Atlanta, GA, and now Dallas, TX. Our Company provides large transportation companies with tractor & trailer maintenance solutions, collision repair and heavy-duty parts sales. We believe that culture makes a difference and we focus on building relationships with our employees, our customers, and our community.What we offer:Immediate openings!Full-time positionsPaid Holidays5 – 20 Paid Days off per year, in addition to HolidaysHourly pay with Overtime (time and a half after 40 hours per week)$42,000.00 - $75,000.00 anticipated annual earnings, based on experienceAlways hourly … Never flat rate!Up to a $5,200.00 Performance Bonus Available Every YearWeekly Paychecks with direct depositMatching 401(k)Medical, Prescription, Dental, and Vision InsurancesHealth Reimbursement Account (up to $6,000.00 per year)Free Life insurance ($10,000.00)Free Short Term Disability insuranceFree Long Term Disability insuranceFree AD/D insuranceUniform allowanceEducation Reimbursement for you and your spouse (up to $5,000.00 per year)Tool allowance (up to $600.00 per year)Apply Online, Call, or Stop by Today! (833) Go-Fleet (463-5338) Ext.1012Responsibilities - Mobile Trailer Mechanic / Technician:Perform Federal Annual & Preventive Maintenance inspections and repairsPerform minor – major mechanical and body repairs on semi-trailersWork in a shop setting as well as perform mobile repairs and inspections at customer's lotsBe capable of completing work orders, inspection forms, and other shop-related paperworkProvide excellent customer serviceMaintain a clean and organized work areaFollow all company safety policies and proceduresQualifications and Requirements - Mobile Trailer Mechanic / Technician:CDL-A License preferred, but not requiredHigh School Diploma or GED equivalent (or 18 and still in High School)Driver’s licenseCDL License is plusMinimum of 2 years trailer experienceWilling to work overtime on a regular basisBe physically fit and able to lift up to 100 pounds on an occasional basisHave a high moral standing or willing to work towards oneWe are an Equal Opportunity EmployerAll applicants must be able to pass pre-employment testing to include felony background,* driving record, and drug screen(*Criminal offenses do not necessarily disqualify you from employment opportunities.)"}