{"title":"Applications Engineer IV NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAK-kEggyXp5U4zG4fXbimLoq4B5oz7cZxBU8rqxIHvOO96OTEmPRlzx3Nhlah8oyevxNg_m6lj_nrB6Ple3ykTcefZsol6OFdC-0gIkmgeWJlN0SOFPF5y2tFcalCdtUakzAMn46yTA9ACxL-B4USkFJFaePbs64KgQGyggcndfXiJCkQ4_jYEU13lfaD8","source":"ziprecruiter","full_description":"We are hiring a Applications Engineer IV for a Contract position in Denver, COOur client, a leading provider of computing, applications management, IT procurement, network, and telecommunications services to public organizations, is looking to hire a Applications Engineer IV. Key Responsibilities. Implement bug fixes and enhancements to the Trails environment utilizing tools AzureDevOps, Oracle and Visual Studio.. Provide support and debug issues identified within the Trails environment. Create and enhance scripts/snippets of code for the application to be run on the RedHat Enterprise Linux environment.. Developing client server application/process and libraries.. Document the required system information.. Identifying bottlenecks or bugs and troubleshooting integration issues.. Testing code quality and durability.. Maintaining the automation and quality of the code. . Independently develop .Net solutions to enhance a web enabled Modernized Trails environment. . Be capable of maintaining source repository using AureDevOps/Team Foundation Server. . User Acceptance Testing (UAT) coordination with state program staff on changes and meeting user story requirements.. Perform unit testing and documentation of developed code.. Debug issues identified within testing efforts and generate bug descriptions and service desk tickets as needed.Requirements and Skills. In depth knowledge of application development, and application design . Demonstrated a high level of understanding in development concepts, technical designs, database designs, application specifications and system integration.. Full stack application development experience and experience mentoring/assisting junior team developers on team of Front End Technologies/Concepts: HTML, CSS, Javascript, JQuery.. Back End Technologies/Concepts: .NET core, C# and RESTful API design, Micro-Services and . Relational (Oracle, SQL Server) and Document Based (No-SQL/MongoDB) Databases. Familiar with Oracle interoperability experience - Required. Working with legacy code - Required. Shell Scripting - Required. Networking, Debugging networking issues - Required. Working knowledge of Continuous Integration/Continuous Deployment and DevOps principles. Experience with TFS and Azure DevOps tool suite is strongly preferred: Boards, Wiki, Repos, Pipeline, Test Plan, Artifacts, etc.. Excellent team player with the ability to influence and negotiate. Effective time management. Must be able to prioritize and multi-task effectively. Passion for enterprise-level agile development, problem solving, the ability to quickly learn new concepts, and must be able to interact with all levels of technical and business teams. Team player, self-motivated and able to work collaboratively across organizations and geographic locationsWho is Calance?Calance is a global IT company with operations in the United States, Canada and India. Over the years, Calance has grown organically and has acquired numerous successful IT Services firms along the way. As a result, the company today is a mix of diverse cultures, talents and expertise that collaborate globally to bring our best capabilities and thinking to clients. Calance also offers benefits which includes Medical, Dental, Vision care and 401K.Calance - the place to grow.www.calance.com"}