{"title":"Big Data Application Developer Java 8+ NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJJuwJtEUJ2SFznxud2ErQhj7SzL9K-dCubGEaj7Zdxc3yV2qfHFSNo7_FXawPqio7j03g0T9fH6DzZdtqSBaBpziUWKB28EshA9BJ6q83w4HA_0WhfaG0ryor0ANxQ0Z16aUQMCc6XxCuT-7xPmBUjZNUN7WnU4_9iSksMD8t6OCS0lazVkMqZHsCJbnFN","source":"ziprecruiter","full_description":"Title: Java 8+, Big Data Applications Development Specialist – Contract - Job# 2947Location: Remote until offices re-open / Chicago, Illinois 60606 or Dallas, TexasJob Description:Our Client, a leading financial services firm, is seeking an experienced Big Data, High Speed Distributed Framework Java 8+ Applications Developer with proven Risk & Security Vulnerabilities Design attributes experience. The position is on a long-term contract basis. Work will be remote initially; ultimately reporting to offices in Dallas or Chicago. Experience in large/complex Corporate IT SDLC environment and prior experience with Financial Risk applications in a regulated environment is highly preferred.ResponsibilitiesPrimary responsibility is application development of big data application for business requirements in agreed architecture framework and Agile environmentAnalyze requirements, develops, tests, and documents software quality to ensure proper implementationFollows agreed upon SDLC procedures to ensure that all information system products and services meet: both explicit and implicit quality standards, end-user functional requirements, architectural standards, performance requirements, audit requirements, security rules are upheld, and external facing reporting is properly representedApplication and project risk analysis and quality improvement recommendationsProvide advice on system functionality and fixes as requiredCommunicate in a clear and concise manner all time-delays or defects in the software immediately to appropriate team members and managementExperience with resolving security vulnerabilitiesRequired:Java 8+ experience, including deep understanding of Java fundamentals as Memory Model, Runtime Environment, Concurrency and MultithreadingExperience in computer algorithms and data structures, including ability to articulate and apply in practice different type of sorting, hashing, partitioning, and search operationsAbility to identify both time and memory complexity for the written codeDesired:Experience with high speed distributed computing frameworks AWS EMR, Hadoop, HDFS, S3, MapReduce, Apache Spark, Apache Hive, Kafka Streams, Apache Flink etc.Experience with distributed message brokers Kafka, RabbitMQ, ActiveMQ, Amazon Kinesis, etc.Experience with cloud technologies and migrations. Experience preferred with AWS foundational services like VPCs, Security groups, EC2, RDS, S3 ACLs, KMS, AWS CLI and IAM etc.Experience developing and delivering technical solutions using public cloud service providers like Amazon, Google, etc.Experience working with various types of databases like Relational, NoSQL, Object-based, GraphWorking knowledge of DevOps tools. E.g. Terraform, Ansible, Jenkins, Kubernetes, Helm and CI/CD pipeline etc.Familiarity with monitoring related tools and frameworks like Splunk, ElasticSearch, Prometheus, AppDynamicsUnderstand and apply in practice Object Oriented and Domain Oriented Design PatternsExperience following Git workflowsExperience writing unit and integration tests with testing frameworks like Junit, TestNG, Citrus etc.‘Get stuff done’ and flexible mindset for greater good of the organizationIntellectually curious and eager to learn."}