{"title":"Sr AV Audio Systems Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIaV4hpz0D1CFMNx0FOaPwlefVfW-WoB9iO7zb2HsceUcMp25_LMIgQlfPS3sTWcc_w61O2Sv7rxcSk0pPGe3Os9BYAYEhOVrZMjM5X94Av7HRYk391OKbPPSgjdo4ZOWWBudcF5FtKTRWIS9lh_OfqJ1ozJB-qPODjkG2fwaEiFZhECwJUztraFQ-Fbkff","source":"ziprecruiter","full_description":"Tygart is currently seeking a Sr. A/V Audio Systems Engineer to support telecommunications initiatives for a DoJ customer. The ideal candidate will have practical experience engineering and troubleshooting audio solutions. This position requires that the candidate have a current Top Secret security clearance.Responsibilities include: Install and troubleshoot audio systems within conference rooms.Provide Tier 3-4 troubleshooting support for audio systemsDesign and engineering enterprise audio solutionsAbility to travel to locations for installation and/or troubleshooting A/V systems as needed.QualificationsThe ideal candidate will have the following:Bachelor's degree in Engineering, Information Technology, Computer Science, or related field.Five (5) years of experience engineering and troubleshooting complex audio systemsIn-depth knowledge of audio system design and troubleshooting of conference room audio solutionsIndustry audio-spcific certification also desiredWorking knowledge of Windows Office 2013 and newer along with Windows 7 operating systems and newer is requiredAbility to travel to locations for installation and/or troubleshooting systems as neededMust be able to well under pressure, and possess excellent oral and written communication skills, as well as excellent organizational skills. Tygart Technology, Inc. is a premier professional services and software development organization providing a broad range of Information Technology (IT) services to public and commercial sector customers. Founded in 1992, Tygart's customer first mind set and agile development methodology have led to our continued success. Tygart supports the Department of Defense, Federal Bureau of Investigation, Intelligence Community, Federal Election Commission, Pension Benefit Guaranty Corporation, and various other Federal and State organizations and maintains offices in West Virginia and Northern Virginia.Tygart Technology, Inc. is an equal opportunity/affirmative action employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, disability, veterans status, sexual orientation, or any other protected factor.For information on Tygart and our career openings, please visit http://www.tygart.com/careers/."}