{"title":"Immediate opening for Remote Android Engineer with world's leading online payment service company NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKm4oVK4zPRTUN-TXAiTk_H1tZfEU4fjmdnJ_7jBLCrPHGRfs3MXHWCSSs1jqfZ1ebafNPkoR1pWViFUH8g5wT7dFX9J1MlcP9iXsxBDgqNMZTHnaryA-e0Um8H4fYrOckTJxiGMK7FI1mNp-reindOzBTX5diVe4DSEJuZ4z2UdeUoaOT-M9J18-UO_ug","source":"ziprecruiter","full_description":"We have Multiple openings for Android Developers with world's leading Payment Services company based out in Bay area. Dure to pandemic all positions are remote.Job Title: Android Engineer Hackerrank and 2 rounds of Zoom InterviewResponsibilities:Assist in design and development of Android application Native Android app development and converting ideas, designs and requirements to concrete stable production builds Coordinate and collaborate with the Product and Engineering teams to understand problems, come up with creative solutions, and help with tracking and delivering within the release plan Understand and implement Android specific design patterns Desired Skills and Experience:At least 3 years of native Android development experience. 6 years total experience Extremely comfortable with understanding and implementing internet application with REST services at the backend Super awesome with Android concepts like fragments, location services, Google Cloud Messaging API, UI transitions, Image processing and multi-threaded communications, among others Familiarity with continuous integration (Jenkins), application monitoring (Crashlytics and fabric.io), mocking tools (Appium and Apiary), build tool development and enhancements, using unit testing and cucumber tests for functional tests Extremely comfortable with understanding and implementing client-side handlers for web services with REST services at the backend Knowledge in Android Studio and GitHub is a huge plus Experience with Cucumber testing framework desired B.S. or equivalent degree in Computer Science is desired 'If interested, please send your resume to subrata@agiledatapro.com"}