{"title":"Chemist - Quality Control","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJKJ59S5c54is64Ctu2MWfUeoE8eBWTCUz_itXMSeEIc3b_GFqjusC6XxnBK_eG4aRAYQiealB-mR2wfqJ7VXMd5PaNqU5IQ37FVGu5HfGc1nlILjdOB43TmefmXTuOtqdraIkVcxBuPQNnWtF9izUpGLAvCY7XMO5K_ISPahJ33a7JMV4DE1ErY7UeGBxX","source":"ziprecruiter","full_description":"Job DescriptionThe Sr. Chemist or Chemist – QC is responsible for testing of raw materials, packaging materials, in-process samples, finished products and stability samples. Candidate must have experience with the instruments like HPLC, GC, Dissolution, IR, Disintegration, AAS etc. Experience with the Empower software 3 is must.Major Areas of Responsibility· Testing in process, raw materials, packaging materials, finish products and stability samples for commercial products.· Hands on experience and Knowledge of instruments used in QC lab like HPLC, Dissolution, UV, IR.· Receiving and Sending samples to contract testing laboratories.· Analysis of developmental samples and stability samples in support of ANDA Submissions· Conduct method validations/verifications/Method transfers all under GMP protocol· Participate in feasibility and experimental method development to optimize the analytical methods· Create certificate of analysis for all the type of materials and products· Prepare test methods, specifications, protocols and reports· Knowledge and understanding of cGMPs, Good Laboratory Practices and Good Documentation Practices. · Demonstrate professionalism to coworkers, customers and an understanding of quality in a regulatory industryTechnical expert and experience with the instruments HPLC, GC, AAS, Dissolution, IR, DT, UV etc is must.Must be able to able to work independently, organized, effectively prioritize projects and work in team environmentProficient with Microsoft word and ExcelExperience with laboratory note book documentation is preferred.Required Knowledge, Skills and Abilities· Excellent interpersonal skills and ability to establish and maintain effective working relationships with both internal and external stakeholders· Excellent verbal and written communication skillsAbility to work with minimal supervisionExperience establishing and maintaining relationships with key decision makersStrong analytical skills and ability to understand business and financial implications of contracts· Self-directedEducation and Experience· Minimum BA or BS requiredMinimum 2-5 years in Analytical development or Quality control of Pharmaceutical Generic Products preferredPhysical Demands· This position requires the employee to routinely use a computer and telephone.Ability and willingness to work additional hours as required by business needsWork Environment· General office environmentIngenus Pharmaceuticals LLC. is an Equal Employment Opportunity (EEO) employer and welcomes all qualified applicants. Applicants will receive fair and impartial consideration without regard to race, sex, color, religion, national origin, age, disability, veteran status, genetic data, or religion or other legally protected status."}