{"title":"Service Desk Coordinator NEW!","location":"","salary":"","description":"","term":"$17 to $17.50 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAK2Y_pIq9wP_fn7jAvxkL58ClqjHynnh9HUtuNPXQ_eJa47Y0P8aHpt6tdDZ3KhTp7gAyrtp_vyEAnVE6mtc5d7QV66aMcqG5q-p1KTBwOCXOOyIPDnVJnqvuhRB9-OgNTDJ7q4JcT4uQM58c-Qu2EV7MQLCVDsQkeXgFGKlMM1nZeXX9c2tNpL8P81YwyC","source":"ziprecruiter","full_description":"Location : 8627 Research Blvd, Austin, TX 78758Duration : 12+ Months Contract (Possible temp to hire) Job Description:The Service Desk Coordinator Performs day-to-day work activities of coordinating the delivery of Move/Add/Change (MAC) Services and/or Break-fix cases - the ad hoc rearrangement, addition or deletion of product and service components or features such as software, hardware, carrier provisioning or other network components. Responsible for scheduling and closing all assigned cases including communicating, tracking, reconciling, and documenting the cases accurately within designated guidelines, deadlines and margin requirements. Coordinate within NASI and various functional groups to complete assigned MAC/Break-fix cases to the customers’ satisfaction and within specified SLAs. Ensure Service/MAC coordinator services are delivered to clients in a high quality and professional manner consistent with company initiatives, client expectations as well as internal and external SLAs. This role is an integral part of the service delivery team and works closely with sales, procurement, finance, service desk, MAC engineers, project management office and technicians to ensure client satisfaction. Key Responsibilities· Primary point of contact for clients requiring MAC Services on computer equipment or technology (including software) including installations, relocations, upgrades and deletions.· Responsible for facilitating the successful completion of the change of equipment or technology location (move), installation of new equipment or technology (add) or change in existing equipment or technology, bandwidth upgrade to a transport circuit, or configuration change to a router or switch (change).· Plan and coordinate activities for MAC tickets to ensure that events are accomplished within the established time frame and budget parameters.· Work closely with sales, project management office, MAC engineering, dispatch, procurement and finance teams, as applicable, to provide MAC technical solutions that meet client business needs.· Utilize escalation and exception paths, processes and systems to report current performance and make recommendations for improvement of performance.· Utilize related technology systems and tools for efficient execution of MAC activities.· Assist with Incident closing services for an estimated 900+ weekly incident tasks .· Analyze MAC ticket data to identify and implement lessons learned, efficiencies and enhanced client service.· Continuously expand, research and leverage knowledge of technology, market and industry trends and benchmarking to identify, recommend and implement best practices, methodologies and relevant analytics.· Continuously develop and enhance knowledge, skills and abilities through various learning channels to expand technical and non-technical capabilities. Ensure further expansion of skill-set in the products & services that BBOX supports.· Meet all financial performance objectives for area of responsibility and take corrective action as needed.· Implement and make recommendations to improve methodologies, core competencies and processes for MAC services to ensure stable and quality product & service delivery consistent with company objectives and client expectations.· Maintain and enhance a strong client service-oriented environment focused on problem prediction, detection and resolution. Proactively identify and remove barriers to meeting client expectations. Provide timely documentation of issues, action plan and outcome. Achieve all client satisfaction objectives and internal and external SLAs. · Actively and consistently recommend and support all efforts to improve, simplify, automate and enhance day to day service delivery operations and the client experience.· Foster and contribute toward collaborative working relationships within operations and across all levels and departments of the organization to execute MAC engineering functions and company priorities.· Achieve performance targets established by leadership for applicable Key Performance Indicators.· Perform other duties as assigned by management. Requirements:· High School / GED or equivalent Required. Associates’ Degree in Business, Information Technology or related field, preferred.· Minimum of 2 years of project coordination or IT dispatch experience, or related technical experience. Technology Services or Manages Service Provider industry experience preferred.· Knowledge and experience in management of technical staff, methods and techniques and ability to match resources to technical issues appropriately.· Service awareness of all organization’s key product and service offerings for which support is being provided.· Ability to listen to and understand client requirements and individual preferences with successful track record of ability to develop creative and innovative solutions.· High proficiency to multi-task· Ability to work independently with little supervision· Quickly learns new systems· Excellent problem solving and systems analysis skills with demonstrated success in root cause analysis, effectiveness measurements and related documentation.· Demonstrated experience of continuously expanding and leveraging knowledge of technology, market and industry trends with success in identifying, recommending and implementing best practices and methodologies.· Ability to work effectively across all functional groups to optimize product & service offerings, fostering a seamless internal and external client experience and track record of timely and accurate issue resolution.· Proficient in MS Office (Word, Excel, PowerPoint), Outlook, SharePoint, ERP, service delivery management tools and related cloud based technology systems.Supervisory Responsibility· This position has no direct reports.Knowledge, Skills, Abilities· Accountability - Demonstrates an understanding of the link between one’s own job responsibilities and overall organizational goals and needs, and performs one’s job with the broader goals in mind. Looks beyond the requirements of one’s own job to offer suggestions for improvements of overall organization operations. Takes personal ownership in organization’s success.· Customer Focus - Demonstrates concern for meeting internal and external customers’ needs in a manner that provides satisfaction for the customer. Considers the impact on the external customer when taking action, setting policies or carrying out one’s own job tasks. Looks for external trends that are likely to shape the wants and needs of customers in the near future. Looks for creative approaches to providing or improving services that may increase efficiency and decrease cost.· Decision Making - Makes good decisions using a combination of analysis, knowledge, experience, and judgment. Analyzes and distinguishes core problems by looking at the symptoms. Resolves key issues behind major problems in the short term while developing and executing long term solutions. Has a strong record for making decisions that are correct and accurate. Applies strategies to implement effective decision making during crises.· Interpersonal Relationships - Demonstrates appropriate and professional behavior at all times. Uses a high degree of tact and diplomacy in working with others. Models and exercises sound judgment regarding personal conduct. Is aware of one’s own style or preference and its impact on others. Earns the respect of others.· Results Focused - Demonstrates concern for achieving or surpassing results against an internal or external standard of excellence, shows a passion for improving the delivery of services with a commitment to continuous improvement. Sets and maintains high performance standards for self and others that support organization’s strategic plan."}