{"title":"Mechanic - Seattle NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAIKRSXvadRNUYYjHPa1lw0_ONo9Qa-P1ke9B26TqnAEXljVnSlD149LeoA3fhKNHrQujqlwc2rpAyzx_xinkUGklprePknwo2xHt4PROPbc5urCjv3vCqtwQlmC5HLQLAL-dZ5SORe5ZFm39tXtkUnBLgEavl38ZNBeLLBS0iLXcsNxZLq4MDICTUFJN74","source":"ziprecruiter","full_description":"Lime is a smart-mobility provider that offers cities an array of mobility products including Lime-E e-assist bicycles and Lime-S electric scooters. Lime aims to revolutionize mobility in cities and campuses by empowering residents with cleaner, more efficient, and affordable transportation options that improve urban sustainability. We are looking for mechanics to maintain our fleet of electric scooters! This role is ideal for mechanically-inclined operations professionals that want to broaden and build their career experiences in a highly flexible position. Teamwork is at the heart of our operation, as mechanics work together to identify critical parts of our product lines that can be improved and ensure the safe working condition of our fleet. What You'll Do Be responsible for the maintenance of e-scooters in Lime Warehouse Perform all the type of repairs from a screw tightening to the most complicated electronic part replacementHave responsibility for Ops App compliance Be instrumental in other mechanics integration and team spirit creation Follow processes. Able to comply with and to enforce processes Follow established safety procedures and techniques to perform job duties and make sure Lime riders are on the safest vehicles Maximize the number of operational vehicles in the fleetProblem solve. Will need to spot issues and find creative ways to overcome obstacles that come your way About You 2+ years of experience as a mechanics in the transportation industryGood communicator capable of motivating a team and communicate issues clearlyMotivated, energetic individual who isn't afraid to roll up their sleevesStrong attention to detail, and able to enforce processesComfortable learning and adapting to new concepts and using new toolsSome technical expertise in mechanics and basics knowledge in electricity  What We Offer Opportunity to help build a startupPlay a role in the transformation of urban mobility and sustainabilityWork with a team of fun and motivated individuals We here at Lime strive to build a workforce comprised of individuals with diverse backgrounds, abilities, minds, and identities that will help us to grow, not only as a company, but also as individuals. Lime is an Equal Opportunity Employer. This is a contract position with a third party employer."}