{"title":"Entry Level Analytical Chemist NEW!","location":"","salary":"","description":"","term":"$18.50 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIanUAD36kNjatyZwvh0YU8L669HLlqTsaJpe88cYnfE7WAWixuAeVhTBr_3bvRegya9wDsOHqVBRN4BMh9tebA8D_cQEepfDVggSsRskfjcd-JTfUssjvWX5U3vOh2WtPgFXqvt6iGcc0eaaATl_eF-LDfxTYS5A_aiMM14J8-la8qgyPl34tdCf7ur-PZ","source":"ziprecruiter","full_description":"We are seeking an Analytical Chemist / Lab Technician to join our team! You will be working in a bleach manufacturing plant. Your main responsibility is to maintain and operate lab equipment to provide accurate data for the operation of the plant processes, provide quality data such as COA’s for finished products, and input data into plant computer system.Responsibilities:Report accurate data to operating personnel and quality data for plant products.Entering data into a computer system, such as excel.Assist other disciplines in the plant as required.Willing to work overtime and adapt to flexible work schedules (shift work).Other projects and responsibilities may be added at the company’s discretion.Knowledge & Competency Requirements:Knowledge of lab equipment set-up, calibration, and basic maintenance. Includes balances, titrators, spectrophotometers, gas chromatographs, turbidimeters, etc.Knowledge of lab techniques.Inductively Coupled Plasma Atomic Emission Spectrograph (ICP)Ion Chromatograph (IC)Gas Chromatograph (GC)HACHTitrationAble to understand and interpret data generated.Knowledge of sample collection techniques.Responsible attitude for personal safety and the safety of co-workers, contractors, and the public.Self-starter and ability to self- direct work.Good communication and interpersonal skills.Good computer skills, including Microsoft Office applications.Team oriented, flexible and able to work with minimal supervision.Qualifications:High school diploma or equivalent required.One year college level basic chemistry required.Visit us at www.AlliedUniversal.com**E-Verify and Equal Opportunity Employer**"}