{"title":"CNC Programmer/Machinist NEW!","location":"","salary":"","description":"","term":"$18 to $30 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIiIVXypjPx8u0zHnKMZm1CGb8IC0m2i9ljuvtKjtHjpG9XbQ4LyqFXtd-SRXBqbEAQ_GIiv9Cu4lyWdBnQ4KHNMY9Si_CHwZvlDt_6XrrnHNuVch5c76jWfHYE2_cAUV_zE1WPdtSJzctig_PIzuaM7nOceDI0HQ2LZimZzyk9_8c21RdLszOaYZzG_nty","source":"ziprecruiter","full_description":"CNC Programmers! Are you looking for a 2nd or 3rd shift opportunity? Are you ready to get back to work?Our client in Atlanta is looking to add a full time CNC Programmer to their team. Could it be you? See the job details below:Key Responsibilities and Accountabilities:• Create, save and maintain CNC programs using MasterCAM software from Auto-Cad or step files.• Setting up jobs to run for self and others including production.• Maintain quality standards and tolerances.• Keeping records as directed in work orders for time and materials and programs in the drawings files.• Maintain equipment per OEM and PSG requirements.• Maintain supplies.• Perform repair operations to dies or help with change overs.• Set up and operate standard milling machine, lathe, drill press, grinder and other machine tools as directed under general supervision.• Work directly with engineering to design and manufacture tool, fixtures and production needs or production CNC set-ups or programs.• Support production needs or production CNC set-ups or programs• Perform other duties as required or assigned by supervisor.• Follow all OSHA and internal safety standards.Qualifications:• High School Diploma, GED, or equivalent work experience.• 3 years minimum verifiable machinist experience and/or Technical Diploma.• Ability to perform standard shop computations (math).• Ability to read schematics (blue prints), engineering drawings, and technical manuals.• Ability to perform basic maintenance of equipment.• Working knowledge of CNC programming and operation.• Knowledge of heat treating.• Ability to read, understand, follow and enforce safety procedures.• Ability to make administrative/procedural decisions and judgments as well as work within a team environmentDon't wait, Apply today!Remember, when you apply for one job with Qualified staffing, it's like applying to hundreds of jobs all at once."}