{"title":"Sr Network Engineer (1.0 FTE, Days)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALXqyvz5wZe2lZ8_0RmEHuyF6zO-nwaBem1Qp82Jyp5OTUNd3fMD-u2q4D6jS_9bn1XCQ0L9uSFHkYsVA1RDFTghFVdugFp6R1d-aKxmmHFiVbjhTD6EdXA0p3kayVYCtpOzKRmbH_Pd-gzgkr93PqMQ6PkIKRuPFyuF6yqpWb57DuojqYJ6ZiDFXt41NL2","source":"ziprecruiter","full_description":"Information Technology 1.0 FTE, 8 Hour Day ShiftAt Stanford Children's Health, we know world-renowned care begins with world-class caring. That's why we combine advanced technologies and breakthrough discoveries with family-centered care. It's why we provide our caregivers with continuing education and state-of-the-art facilities, like the newly remodeled Lucile Packard Children's Hospital Stanford. And it's why we need caring, committed people on our team - like you. Join us on our mission to heal humanity, one child and family at a time. Job Summary This paragraph summarizes the general nature, level and purpose of the job. The Sr. Network Engineer is responsible for designing, implementation and supporting WAN, LAN and all related aspects of the Network Infrastructure in our facilities. The Sr. Network Engineer will report directly to the Network Manager and is responsible for hands-on engineering activities to ensuring the successful operation of a mission critical network architecture spanning multiple data centers and locations. The Senior Network Engineer will have excellent knowledge of network administration, best current practices, denial of service mitigation, IP transit, routing protocols and all aspects of networking needed to support a highly available environment. The Senior Network Engineer will be participate in on-call support of all critical network functions, demonstrate strong abilities to collaborate with vendors, contractors, consultants and other technology groups that operate within the Information Services Department. Furthermore as a senior member of the network engineering team they will pursue technological compliance with corporate goals and values. Essential Functions The essential functions listed are typical examples of work performed by positions in this job classification. They are not designed to contain or be interpreted as a comprehensive inventory of all duties, tasks, and responsibilities. Employees may also perform other duties as assigned.Employees must abide by all Joint Commission Requirements including but not limited to sensitivity to cultural diversity, patient care, patient rights and ethical treatment, safety and security of physical environments, emergency management, teamwork, respect for others, participation in ongoing education and training, communication and adherence to safety and quality programs, sustaining compliance with National Patient Safety Goals, and licensure and health screenings.Must perform all duties and responsibilities in accordance with the hospital's policies and procedures, including its Service Standards and its Code of Conduct. + Design, implementation, support and maintenance of WAN, LAN, Data Center and related technologies. + Network operations excellence supporting a highly available, mission critical network environment. + Participation in the documentation processes including network diagrams, staff contacts, vendor contacts, utilization of monitoring/resource/inventory management tools. + Optimizing the stability and reliability of the technology's performance. + Implementing new and additional technologies that will improve the infrastructure. + Working with managers to develop standards in line with the company guidelines and monitoring those standards. + Assisting with the resolution of escalated issues and actively participating in problem management activities. + Cross-training other IT staff members in the maintenance or usage of the technology. Minimum Qualifications Any combination of education and experience that would likely provide the required knowledge, skills and abilities as well as possession of any required licenses or certifications is qualifying.+ Education: Bachelor's degree in Computer Science, Engineering, or related field from an accredited college or university or equivalent experience. + Experience: (7) seven years of progressively responsible and directly related work experience including minimum of 5 years of network engineering experience in critical datacenter network environments. + License/Certification: CCNP Knowledge, Skills, & Abilities These are the observable and measurable attributes and skills required to perform successfully the essential functions of the job and are generally demonstrated through qualifying experience, education, or licensure/certification.+ Expert level knowledge of network administration, architecture and engineering in mission critical environments servicing large server deployments. + Knowledge of a wide variety of network equipment including but not limited to; routers, switches, firewalls, denial of service mitigation, serial consoles, and load balancers. + Requires strong working knowledge of Cisco network hardware, software, LAN/WAN connectivity, Wireless Controllers, APs, etc.' + Working knowledge of Windows based operating systems and networks. + Self-driven professional, very detail oriented. + Strong verbal and written skills are required. + Must be able to work in a fast-paced, dynamic environment. + Exceptional analytical, conceptual, and problem-solving abilities. + Exceptional understanding of the organizations goals and objectives. + Strong leadership and project management abilities. Ability to lead cross-functional project teams in implementing projects of a complex nature. + Proficiency with applications (Spreadsheets, apps, systems, how to run them). + Excellent documentation and communication skills. Equal Opportunity EmployerLucile Packard Children's Hospital Stanford strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, LPCH does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements, and where applicable, in compliance with the San Francisco Fair Chance Ordinance.REQNUMBER: 13271-1A"}