{"title":"iOS Mobile App Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIXiD45eChCZygrDZySP_TeBNYUJwn6CfrnI3TJzViKCc0hKcYUUnaEM4ZmrOIbfrspIzfZTnrxK19qCMGe3Sm3DCDSS4cKPRrD4RsnZ7WgDN2_nr-1Mnprj0pmYpjkRzeHs4BVGFTy5orVgXD9i2M7Icuzz_EmW5OaBYf__dob_g5tfNBbQC0nA_ZcUnSB","source":"ziprecruiter","full_description":"About this PositionSeeScan is currently seeking an iOS Mobile App Developer to ­help us develop companion apps for our market leading utility locating and plumbing diagnostic equipment.Your MissionIn this position, you will bring your technical skills, creativity, and experience in app development to implement solutions based on iOS that help our customers around the world run their businesses. You will work on our SeeSnake HQx Live app, available on the App Store, as well as any potential new apps that serve our customers in the plumbing diagnostic and utility locating industries. Our ideal candidate is a self-starter with a broad development skillset and an interest in developing apps that control hardware.ResponsibilitiesCollaborate on a small team of mobile developers on the design, implementation, and testing of iOS mobile applicationsWork on a cross-functional team including Product Management, UX designers, and other engineers to develop new features according to customers’ needsDeliver innovative solutions to increase performance and usabilityQualifications Capable of developing responsive applications for iPad and iPhone with support for landscape and portrait orientations Proficient in multithreaded application development and performance optimizationKnowledge of Auto Layout Capable of creating prototypes and demonstrating ideas quickly Able to develop unit and integration tests Experience developing apps based on iOS, with specific experience with the following preferred:AVFoundation, especially related to recording videoIntegrating Bluetooth LE accessories Objective-C and swiftDeveloping web services and communicating with other devices on a local networkDeveloping apps for multiple regions and languagesLocal storage and persistence using Core Data or comparable frameworksEvaluating and integrating third party libraries using a dependency management tool such as CocoaPodsDebugging existing applications with little guidance or documentationTeam player with strong communication skillsDemonstrated ability to learn new skills and technologiesOther Helpful SkillsExperience or interest in Mac Catalyst to bring iOS applications to Mac Experience developing cross platform native applications and working with related frameworksTest-driven development and experience with mocking APIs or services Experience with CI/CD systems and concepts Web development experience - experience with node, Vue.js, or AWS We OfferA position within an established company, growing from humble beginnings in our founder’s garage to a team of over 300A culture of transparency, growth, and innovation – read more about it below!Medical, dental, and vision coverageTraditional and Roth 401(k) investment options, with a current company matching contribution of up to $50 per paycheck (biweekly)Flexible Paid Time Off plan with no cap or “use it or lose it” requirementIf this position is of interest, please apply online at https://careers.seescan.com. In your application, please include your resume and a thoughtful cover letter explaining why you are the ideal candidate for this position. We are looking for a long-term, in-house team member to join us, not a contractor or consultant.This is a remote position initially with the possibility of transitioning to onsite in the future. Preference will be given to candidates living in the San Diego area.About SeeScanModern life depends on the infrastructure that brings water, electricity, gas, and communications to our homes and businesses. SeeScan’s mission is to deliver the highest quality products that protect these vital services. We are an original equipment manufacturer in San Diego, CA that builds diagnostic and utility locating equipment from the ground up, from initial product conception to prototyping, testing, and final assembly.What is it Like to Work at SeeScan?Working at SeeScan is unique. We have the stability of a larger company—we’ve been in business for over 30 years!—but our company culture is one of transparency, collaboration, and innovation. We don’t promote a stuffy corporate atmosphere, and our mission is to create the best products in our industries and continue our growth – not to line shareholders’ pockets. Our best work happens when we work as a team, from the engineers who design our products to the manufacturing and production teams who build them, and to all of the individuals across the organization who keep our business running and profitable.There is a reason why our turnover is so low. We know that SeeScan is more than a collection of facilities, technologies, and products. SeeScan is a community of people. Working here, you’ll be part of a group of people who take pride in their work and their community. We’re passionate, but there’s more to it than that. We have a sense of ownership of SeeScan’s success and a shared commitment to continuous improvement. You won’t just be a cog in a corporate machine here – you’ll be our most critical investment, and we’ll do our best to empower you with the tools you need to find success at SeeScan.NotesNo recruiters, contractors, or consultants, please.No relocation assistance or visa sponsorships available for this position.SeeScan is an Equal Opportunity Employer."}