{"title":"Sr iOS Developer - Only GC and USC","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAIfzfriymPTQACYBnMUc4w6vz9PW9UBtvU-lKWRO05DfzflLNLfC4uD7EglEzakCYEPFjM1mIJ40XqEzkoip4KIbpsYFass5n6POot1dJbrwSbiu4bsee_pxnxYbY6M8qNiukAgrvphcCqDZ5i_9GUULsfKsDZeU5aSUnIU7a159PUAvFN7QGlWqhDCKHfO","source":"ziprecruiter","full_description":"Job title : Sr iOS Developer  Location : Irving, TX  Duration : 6+ months  Rate : $60 Max... Overview; Looking for a Sr. Software Engineer - iOS to join the Digital Technology Team. You're joining a multidisciplinary team of product managers, marketers, designers and engineers who create digital products that hundreds of thousands of people experience every day.  About the job: The candidate must have a strong and continuously growing proficiency in iOS application development with Swift and Objective-C. This includes actively participating in designing, developing, reviewing, unit testing and releases iOS apps for iPhone and iPad to drive our digital products.  About you: You have a passion for code and putting the customer first and delivering an exceptional experience through the creation of extendable and re-usable products.  Responsibilities Executes full product lifecycle (inception through deprecation) to create reliable and flexible iOS apps bound for the iOS AppStore and retail customer's devices. Collaborates with other Engineers, Creative/UX designers, Scrum Masters, Product Managers, Business Analysts and Architects.  Qualifications: Expert in iOS App Development on Swift and Objective-C Experience with offline storage, threading and performance tuning Solid understanding of iOS Human Interface Guidelines Comfortable with integration to RESTful APIs 3-5 years of experience in product development as engineer or senior engineer. Ability to work in an Agile /SCRUM environment. Well organized with a bias for action with minimal direction. A team player with a start-up/intrapreneur mindset. Ravenous about learning technology and problem solving. Strong writing and communication skills. Familiar with frameworks such as React Native, Angular and Ionic"}