{"title":"Principal Android Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKj9_HwybFhrwlj6UZsWVM6VqpX2rCqF4SsKYe5dKAvWk06oa25Z8i7GFLYM3cOd_2haWdKh4siZDUZ2dKwg6zMRH2_GT2uZ6HKPJlZNOWcRzpbigca4Xe2h_I49QFkQEjSxfEh7N0jK8-ynOP1JK8lnB--Vd3hzWdgs2HsIa_mhZmVGjfS4OsriaNN3dkp","source":"ziprecruiter","full_description":"Title: Principal Android Engineer No. of Positions: 1 Position Summary: It's a new day in health care. Combining CVS Health and Aetna was a transformative moment for our company and our industry, establishing CVS Health as the nation's premier health innovation company. Through our health services, insurance plans, and community pharmacists we are pioneering a bold new approach to total health.We are looking for a Principal Android Developer with experience working in fast-paced startup like environment. A talented software development professional with a technical background and experience building excellent user focused solutions and who will contribute to the innovation and delivery of cutting-edge application solutions. If you're passionate about mobile platforms and translating code into user-friendly apps, we would like to meet you.The ideal candidate will be able to contribute to the delivery of software projects through their technical efforts effectively with cross functional and cross organization teams. Req ID: 1540750BR Sourcing Requisition: No State: MA Business Area: CVS Health Location - State/City: CT - Hartford, GA - Alpharetta, MA - Burlington, NY - New York Job Category: Digital City: Burlington Preferred Qualifications: Experience with MVP and Clean Architecture Experience with Jetpack Compose Experience with accessibility development Country: United States Job Type (Expected Hours Category): Full Time Street Address: 77 S. Bedford Street Location code: AO063 Requisition Template: Professional Education: Bachelor's degree or equivalent experience FLSA: Exempt Clinical Licensure Required: N/A Zip Code: 01803 Required Qualifications: 10+ years of experience with modern software development frameworks that deliver world-class digital experiences for the consumer or enterprise spaces Expertise in Kotlin. Ability to act as a technology leader, facilitating technical discussion and decision making Contributions of released applications on the Google Play Store As a mobile developer, you'll collaborate on the development of complex systems; including requirements analysis, estimation, design and development, implementation and testing Strong desire to build in test from the start with TDD development  Desire to create awesome user experiences within the mobile space Contribute to the implementation of product features and key technology choices Passion for technology and a high technical aptitude Promote proper implementation of Agile processes, techniques and principles Excellent verbal and written communication skills Experience with Agile/ SAFe Software Development Principles Business Overview: At CVS Health, we are joined in a common purpose: helping people on their path to better health. We are working to transform health care through innovations that make quality care more accessible, easier to use, less expensive and patient-focused. Working together and organizing around the individual, we are pioneering a new approach to total health that puts people at the heart. We strive to promote and sustain a culture of diversity, inclusion and belonging every day. CVS Health is an equal opportunity and affirmative action employer. We do not discriminate in recruiting, hiring or promotion based on race, ethnicity, sex/gender, sexual orientation, gender identity or expression, age, disability or protected veteran status or on any other basis or characteristic prohibited by applicable federal, state, or local law. We proudly support and encourage people with military experience (active, veterans, reservists and National Guard) as well as military spouses to apply for CVS Health job opportunities."}