{"title":"Sr. iOS Engineer - Apple Pay","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIZaCmYY5BrAVvWamWNZDeT_GlfmK8-0yyZhejKBb9vqYy2wi65mPF7yPA_nZGqchBI8gUOF1C_rJ-7GNJVhx8Aw05kgjxYttgPri22GPxcKd_VY26EwiBW0JFWsiWa10uJPvBkN_LLUd9GUJJVqujx_4cYret1mjIjU_7EJiU0lseh35Qsol7oao0vRX38","source":"ziprecruiter","full_description":"Sr. iOS Engineer - Apple PayNew York City,New York,United StatesSoftware and Services+ We are looking for someone who has 5+years of experience in Object-oriented design and programming - specifically in Swift or Objective-C. + Proven experience with crafting and integrating client side REST APIs + Debugging experience with stack traces, spin traces, performance & concurrency/threading issues. + Able to thrive in a reciprocal environment and clearly communicate across many teams + Passionate about details that are relevant to our customers + Self-motivated, critical, and outstanding analytical skills**Description**Apple is looking for a Software Engineer to work on our user authentication technology. You should possess strong interest in the area of Authentication, Single sign-on and Second Factor protocols, cryptography, and code protection. You should also have a deep understanding of consumer expectations and behaviors in this space. Multi-platform experience and working with different types of devices is a plus. Good communication skills are required for working with other groups within and outside the company.**Education & Experience**BS/MS in Computer science or related field**Additional Requirements**+ Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. + Apple participates in the E-Verify program in certain locations as required by law. + Apple's committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.**Apple Footer**Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant (Opens in a new window) .Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. United States Department of Labor. Learn more (Opens in a new window) .Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law. If you're applying for a position in San Francisco, review the San Francisco Fair Chance Ordinance guidelines (opens in a new window) applicable in your area.Apple participates in the E-Verify program in certain locations as required by law. Learn more about the E-Verify program (Opens in a new window) .Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace. Reasonable Accommodation and Drug Free Workplace policy Learn more (Opens in a new window) ."}