{"title":"Industrial Maintenance Technician - Austin, TX","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIzjVFMVn_-_CTP58fl4n2GD2CResOUUGksCHNmoZfxRFeXJf0edHuFXTaGDb2x4FpuRXe50fBPLAxB5N5a6qHV5xAglhGsvDuCRI-LOcksX8kx5Gfr58afBeQVGITO7iJDJTV5Wwmp1o6IOTfUmxbKdf85DXzpTk-NU-MKa3hkX62WjTCacYw_kM4a-HU","source":"ziprecruiter","full_description":"The Maintenance Technician maintains, repairs and installs plant equipment, machinery and related facilities; maintains a variety of records; participates in special projects; and performs a variety of technical tasks relative to assigned areas of responsibility.Must be proficient in Mechanics and Electrical fields to work independently as well as understanding and maintaining typical industrial componentsResponsibilities & Duties:· Electrical - Perform scheduled preventive maintenance activities on equipment. Troubleshoot and repair Line equipment. Support the facility by effectively interfacing with the team by repairing other equipment as needed. Troubleshoot and repair electrical equipment. Evaluate and make recommendations regarding required repairs and maintenance.· Welding - use Mathematical skills to carry out calculations and measurements, so that the alignment and dimensions of items being welded are done properly. Use welding equipment such as stick welders and cutting torches. Required to read sketches and blueprints.· Electronics - Replace P.C. Boards, Program VFD's· Mechanical- Identify, Repair, and replace broken machine components. Diagnose malfunctions and analyze results using testing devices. Perform preventative maintenance and inspect parts for signs of excessive wear or damage. Repairs, modifies and/or replaces parts on all production and facility equipment.· Pneumatic - maintains, replaces, and repairs all pneumatic equipment. Troubleshoot complex pneumatic system issues.· Refrigeration/HVAC - maintains and repair refrigeration components· Plant Systems - Repair and maintain, Air compressors and other plant utility systems. Identify energy loss and correct issues.· System troubleshooting and problem-solving of team production problems.· Hydraulic - replace/repair hydraulic cylinders, valves, and pumps.Qualifications, Experience, Education, Certification, Licenses & Registrations, Skills, Physical Demands· High School Diploma preferred or equivalent; must have valid driver’s license· Basic math skills· Bilingual - English/Spanish beneficial· Flexible availability: we work night and weekend shifts· Employee is exposed to extremely cold temperatures and moderate noise levels on a regular basis· The employee must frequently lift and/or move up to 50 pounds and occasionally lift and/or move up to 75 pounds· Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus"}