{"title":"Software Engineer","location":"Davis, CA 95618 (Downtown Core area)","salary":"\n\n$60,000 - $125,000 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Collaborate cross-functionally with data scientists, business users, project managers and other <b>engineers</b> to achieve elegant solutions.</li>\n</ul>","term":1,"jk":"b7825383f0e8f77b","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=b7825383f0e8f77b","source":"indeed","full_description":"Stratovan is a leading developer of next-generation interactive imaging software for the global medical device and diagnostic markets. Our solutions have broad application to disciplines beyond healthcare, such as life sciences and airport security. Stratovan's core product line includes a range of novel next-generation visual analysis applications including 3D image viewing station software, airport screening simulation software, and system solutions including Automated Threat Recognition (ATR), DICOM and DICOS (Digital Imaging and Communications in Medicine/Security) based toolsets. Our innovative 3D surgical planning and diagnostic tools are used in orthopedics, craniofacial surgery, neuroimaging, oncology, ophthalmology, otolaryngology, paleontology, anthropology and veterinary medicine.We are looking for a Software Engineer to help expand and reinforce our collection of applications through high quality code, novel techniques, and collaboration. The ideal candidate has experience in Full-Stack development using C++. They must have a strong background in Object-Oriented Programming, be comfortable with Linux, macOS, and/or Windows development, and have the ability to fashion robust scalable solutions that can manage large data sets efficiently. They should be at ease working in an agile environment and should embody a passion for continuous improvement and test-driven development. Most importantly, they should have a strong passion for “saving lives through software”.ResponsibilitiesWork alongside other engineers on the team to elevate technology and consistently apply best practices.Design and execute abstract coding requirements into concrete solutions.Test software development methodology in an agile environment.Provide ongoing maintenance, support and enhancements in existing systems and platforms.Collaborate cross-functionally with data scientists, business users, project managers and other engineers to achieve elegant solutions.QualificationsMust be a US Citizen due to nature of work with US government and undergo background check process.Hands-on experience working with C++Experience with test-driven development and automated testing frameworks such as GoogleTest and GoogleMock.Experience with Scrum/Agile development methodologies using Jira.Capable of delivering on multiple competing priorities with minimal supervision.Excellent verbal and written communication skills.Bachelor’s Degree in Computer Science, Computer Engineering, or equivalent experience.Preferred QualificationsExperience in the medical, life sciences, or airport security industries.Experience with Cyber Security, Computer Vision, Machine Learning, and/or 3D Visualization.Master’s Degree or PhD in Computer Science, Computer Engineering, Mathematics, or similar field.Job Type: Full-timePay: $60,000.00 - $125,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insurancePaid time offRetirement planVision insuranceSchedule:Monday to FridayCOVID-19 considerations:Currently all work is being done remotely until COVID-19 recommendations are lifted.Ability to Commute/Relocate:Davis, CA 95618 (Required)Company's website:https://www.stratovan.com/Company's Facebook page:https://www.facebook.com/Stratovan/Work Remotely:Yes, temporarily due to COVID-19COVID-19 Precaution(s):Remote interview processPersonal protective equipment provided or requiredSocial distancing guidelines in placeVirtual meetings"}