{"title":"Software Engineer, Robotics","location":"San Francisco, CA 94103 (Yerba Buena area)","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Use strong communications skills (verbal and written) to collaborate with localization, perception, control, and machine learning teams to source the right…</li>\n</ul>","term":1,"jk":"092ad69109676db3","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=092ad69109676db3","source":"indeed","full_description":"Software Engineer, Robotics - Motion Planning (Postmates Inc., San Francisco, CA)\n\nDesign, integrate, and maintain solution to global routing and obstacle avoidance subsystems for autonomous platforms operating in complex outdoor environments. Help vehicles understand how to navigate from point A to point B in the real world, which looks a little different every time the robot leaves the depot. Contribute to obstacle prediction, path planning, obstacle avoidance maneuvers, route optimization, and/or congestion management strategies. Solve real world robotics problems. Design novel algorithms and produce robust, well-tested software. Balance research, cross-domain resources, and product-driven milestones. Use strong communications skills (verbal and written) to collaborate with localization, perception, control, and machine learning teams to source the right pipelines to solve issues. Benchmark and validate routing and planning subsystems. Scale solutions to deployed systems.\n\nMinimum Requirements: Master’s degree, or U.S. equivalent, in Electrical Engineering, Computer Science, Computer Engineering, Mechanical Engineering, Robotics, or a related field, plus 3 years of experience in software development (including planning, analyzing, designing, developing, implementing, testing, and maintaining software systems or applications), developing graphs-based data structures, developing efficient multi-threaded systems and professional experience using programming languages (including C++ and Python) for low-latency systems. Must also have the following: 1 year of professional experience developing planning algorithms (including A*, Lattice, and Probabilistic Planning) to design global routing and obstacle avoidance subsystems for autonomous platforms; 1 year of professional experience developing configuration spaces; 1 year of professional experience developing graph-based data structures (including quadtree and KD-tree); 1 year of professional experience designing kinematics and dynamics and designing their constraints; 1 year of professional experience developing real-time autonomous robotics applications; 1 year of professional experience using real-time sensor fusion (including IMU, lidar, camera, and radar); 1 year of professional experience using nonlinear optimization strategies; 1 year of professional experience solving statistical issues (including uncertainty, unpredictability, stochastic processes, or game theory); 1 year of experience in applying Machine Learning algorithms to decision-making problems, using classical machine learning techniques including supervised and/or unsupervised methods.\n\nPlease send resume to: Melanie Tern, Postmates Inc., 201 3rd Street, San Francisco, CA 94103. Must specify Ad Code ACMT. EOE. MFDV.\nA bit about us\nPostmates is changing delivery for good. While you may know us as the clever brand loved by celebrities and millennials, we are so much more. We are industry-first leaders in the modern logistics space, creating groundbreaking tech products that positively impact millions of customers, merchants and gig-economy workers as well as the underserved in the communities where we work. How will you help us change delivery for good?\n\nBenefits\nPostmates has your back. In our impact-first work environment, we value huge company vision. As you strive to build the future with us, we’ll support you with a competitive rates and equity plan, along with access to our 401k plan and robust benefits including: health benefits, flexible paid time off, parental benefits, and food perks.\n\nPostmates is proud to be an equal employment opportunity and affirmative action employer. Qualified applicants at Postmates are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation."}