{"title":"Software Development Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIiiZrdinm3q66PhhPsezxwbtjD9n1jnTQcAGpgtH4My5uWmY73l47-I7ivQ11wA9qOyRimJQtg___TosGTnrO7MiSf2VrneN0XkIiwXh1HRtBjo-tMackycPQYjQRwMjyWLRICwdXXHTOcYiZmquExAFh2xOtGTu50PHfDSepYC1Ffubja3clCI5zA6Jjj","source":"ziprecruiter","full_description":"Job TitleSoftware Development EngineerJob PurposeWhat does a great Staff Android Engineer do? Our Staff Android engineers on the Integration Platform team design, build, and support the core architectural technology that facilitates success for thousands of merchants and hundreds of second and third party integrators. We build high performance, extensible, and observable integration service layers that are used around the world. This position focuses on Android; However, we must think on a much larger scale than Android alone. We have integrators using .NET, iOS, JavaScript, and Enterprise Java containers who depend on us to deliver a highly reliable financial platform.Clover is looking to leverage integrators as a key aspect to growth over the next 5 years. This person will help make the platform both more extensible and more reliable as a core principal to facilitating 10x growth of our platform.Not only will this role contribute to the overall architecture processing billions of dollars in GPV, this person will also help scale the team through mentorship and solid software design principles.Though the bulk of this Engineer's time will be spent in a massive multi-repo Android environment: this person should be eager to design and debug across numerous technology boundaries from an embedded RTOS performing secure contactless communications, through android and into the cloud over mutual TLSBasic Qualifications for Consideration:Bachelors in Computer Science, Science, Engineering, or commensurate experience successfully performing senior engineering roles.10 Years software engineering experience in a modern engineering language: Java, C, C++, JavaScript, .NET, Swift, Objective CDemonstrated experience implementing both Android software design patterns and Enterprise design patterns.At least 2 years Software Engineering technical leadership experience.Preferred Skills, Experience, and Education: Service Design in AndroidPassionate about debugging across technology boundariesEmbedded systems developmentMobile software development in either iOS or AndroidLeadership experience of cross functional teams with diverse engineering backgroundsTravel required: between 5% and 12% as required to facilitate highly technical interactions with cross functional teams.Who We Are:The Integration SDK team facilitates second and third party integrators adoption models of \"Clover as a Platform\" and \"Payments as a Service\". We do this through the design, implementation, and support of nine SDK's written in five languages: Android, iOS, JavaScript, .NET, and Java. The result: we support billions of dollars of GPV (Gross Payment Volume) per year and are growing rapidly. The Integration SDK Team publishes artifacts on NPM, Maven Central, NuGet, CocoaPods, and GitHub. We achieve amazing agility through the development and deployment of highly reliable, highly available robotics backed test automation integrated into our modern CI pipeline.Join an engineering team whose SDK's are used by thousands of merchants and hundreds of integrators around the world generating billions of dollars in transactions a year and used 24 hours a day.Fiserv is an Equal Opportunity Employer/Disability/Vet.Thank you for considering employment with Fiserv.  Please:Apply using your legal nameComplete the step-by-step profile and attach your resume (either is acceptable, both are preferable).Fiserv is an Equal Employment Opportunity Employer, and it is the Company's policy to make all employment decisions without regard to race, color, religion, creed, age, sex, national origin, veteran status, disability (as long as the individual is able to perform the essential functions of the job with or without reasonable accommodation), and any other characteristic protected by Law."}