{"title":"Remote JavaScript/Qualtrics Developer (Python pref.)","location":"","salary":"","description":"","term":"$50 to $60 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJkC6m0dx4OVlMAEEmqCo9WywZ3pa_qSTtUkcmh_nZAzX4UyzKbGS9lbXDSRsnJdKTTd8Ll08Ep1fG_2_QaDPW_an0vAE_nBiH7nyPRd7w-a-4y29ClQ79mr36Bjdgc1WEf4cDWUFbwKsLfJaZgNiuEjTic9B-6GSBuSHDcrlHtPwhfqykRVFbXSBUK0Ann","source":"ziprecruiter","full_description":"Remote JavaScript/Qualtrics Developer (Python pref.) - Contract - $50.00-$60.00/hr The end client is unable to sponsor or transfer visas for this position; all parties authorized to work in the US without sponsorship are encouraged to apply. An American Company is seeking a Remote JavaScript/Qualtrics Developer (Python pref.). Role Description This effort is to support the return to campus- bringing people on campus-we've been shut down since March and everyone was sent home, including research units, teaching units. In Summer, we started bringing people back and more people in the fall. This is work to support from IT perspective, several components built out of Qualtrics - custom components- sophisticated - you can do configuration and associated scripts for a set of surveys to support scheduling COVID 19 tests on campus, testing programs, scheduling application is supported by Qualtrics, rather complicated, schedule of appointments but quotas because there is only a certain number of spots, spots reserved for certain types of student, priority testing because on campus. Lots of rules, complicated, a dozen other surveys - tracked through APIs, script data to informing people's status for being approved to come back to campus, notifications, reminders. Looking for augmenting that with someone who can do a little bit of all of these things. A lot of different things they could be doing, configuration, scripting, coding. Important to also have experience from the front end perspective, not so much design- but knowing a user interface needs to be responsive, load test to make sure it's robust. Skills & Requirements * Scripting - they use Python and JavaScript -Must have JavaScript Qualtrics * Plus Skills: Python Other important skills: * Powershell and JSON are also important- maybe someone with a little Systems Admin. would have those. Powershell is not required - but need some system level scripting; JSON is important to be able to work with API's and manipulate * Database experience is important * Systems Configuration is extremely important- such as Qualtrics of Salesforce or other complex system. * Knowing how to build reports- Jasper- equivalent to Crystal Reports and Tableau is less important because we have other teammates who can do this. * We've been approved to have someone for two months total (we may not have them work the week of Christmas and the week of New Years- we typically like to shut down during this time) * Open to remote candidates- same time zone or nearby timezone Why Hays? You will be working with a professional recruiter who has intimate knowledge of the Information Technology industry and market trends . Your Hays recruiter will lead you through a thorough screening process in order to understand your skills, experience, needs, and drivers. You will also get support on resume writing, interview tips, and career planning, so when there's a position you really want, you're fully prepared to get it.  Additionally, this position is a contract role where Hays offers you the opportunity to enroll in full medical, dental or vision benefits. * Medical  * Dental  * Vision  * 401K  * Life Insurance ($20,000 benefit) Nervous about an upcoming interview? Unsure how to write a new resume? Visit the Hays Career Advice section to learn top tips to help you stand out from the crowd when job hunting.  Hays is an Equal Opportunity Employer. Drug testing may be required; please contact a recruiter for more information."}