{"title":"Software Development Engineer","location":"San Francisco, CA","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Twitch is looking for backend and full stack <b>engineers</b> with the curiosity, drive, and creativity to develop user experiences, services and APIs that support the…</li>\n</ul>","term":1,"jk":"0cc7829e0f521626","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=0cc7829e0f521626","source":"indeed","full_description":"About Us\n\nLaunched in 2011, Twitch is a global community that comes together each day to create multiplayer entertainment: unique, live, unpredictable experiences created by the interactions of millions. We bring the joy of co-op to everything, from casual gaming to world-class esports to anime marathons, music, and art streams. Twitch also hosts TwitchCon, where we bring everyone together to celebrate, learn, and grow their personal interests and passions. We're always live at Twitch. Stay up to date on all things Twitch on LinkedIn, Twitter and on our Blog.\n\nAbout the Role\n\nTwitch enables content creators to live-stream content to their communities across the globe. Advertising is a core part of Twitch's business model, and spans across many product areas. We take pride in our mission to help creators earn a living by entertaining and educating their viewers. On the Advertising team you'll work with a passionate, and customer obsessed team. We have a growing team comprised of product and engineering professionals based in the Twitch HQ at downtown SF.\n\nTwitch is looking for backend and full stack engineers with the curiosity, drive, and creativity to develop user experiences, services and APIs that support the advertising and promotion business. These systems give creators opportunities to make money, the data they need to do this, and in a way that promotes viewer involvement.\n\nThe ideal contributor has experience building and delivering high-quality production, UXs and web services in a distributed systems environment.\n\nYou Will:\nDevelop new product features on web platforms\nScale and improve existing APIs and services used to power the Twitch advertising platform\nImprove engineering processes to increase team effectiveness\nWork across teams and organizations to deliver value to our creators, viewers, and advertisers\nYou Have:\n3+ years industry experience\nBachelor's degree or above in Computer Science or prior engineering experience\nProficient coder in one of the following: Go, JavaScript, Elixir\nExperience developing web application backends and APIs\nBonus Points\nFamiliarity with one of the following frameworks (Ember, React, Rails, and Phoenix)\nFamiliarity in the AWS ecosystem of services (EC2, RDS, Dynamo, Lambda, and CloudWatch)\nFamiliarity or experience building GraphQL APIs\nFamiliarity with Data pipelines (Kinesis, Apache Airflow, Redshift)\nExperience with Docker, Kubernetes and the container ecosystem\nExperience integrating with an ad platform or SDK: Amazon Ad Exchange, Google IMA/GMA SDK, DoubleClick API\nPerks\nMedical, Dental, Vision & Disability Insurance\n401(k)\nMaternity and Parental Leave\nFlexible PTO\nCommuter Benefits\nAmazon Employee Discount\nMonthly Contribution and Discounts for Wellness Related Activities & Programs (e.g., gym memberships, off-site massages)\nBreakfast, Lunch & Dinner Served Daily\nFree Snacks and Beverages\n\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nWe are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}