{"title":"SCIENTIST LEVEL 2 - Chemistry - US","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALGQ28ZubQ5iM_sDRv0S6E2W0FQb0onpPUJ9vTbHL0MeYI2m4PqtH_4tWAPJk6bttmS8TLmVPjFaL3fwL-5wzODkHm6ZlEWZjBJUf5sbZTObfjjbVekdragqz6AEM4skHgauUWaU1nW2IkGgKoNZDSwt0l4_blHIPsqJbcNN2B8j1CXmxceRZDtr3kpNsRX","source":"ziprecruiter","full_description":"Luminex is seeking dedicated and talented individuals with a proactive and positive 'can-do' attitude to join our team. If changing the diagnostic landscape and revolutionizing patient care sounds like something you would like to be a part of, we invite you to apply today!  Together, we can help healthcare providers improve patient outcomes,  make a differencein fighting the COVID-19 outbreak, and tackle the world's most pressing health issues.   You can learn more about our values, mission, and vision by visiting our website https://www.luminexcorp.com/about-luminex/. The Scientist Level 2- Chemistry will be responsible for:A Brief Overview The Scientist II will be responsible for  Preparation and evaluation of reagents: e.g. dyes, linkers, oligonucleotides, surfactants, buffers, etc; evaluation of reagents developed in collaboration with other companies, e.g. surface modifications; assisting customers with processes; and product development and transfer.  Testing, evaluating, and validating new Luminex instrumentation, software and assay formats.  The completion of evaluations includes the interpretation and reporting of results from experiments including appropriate documentation of results.  What you will do  Invent new Luminex technology to improve existing products or create new products  Take on the role of technical lead on core teams for development projects  Prepare manufacturing instructions and QC test methods. Organize process validations.  Interact with various internal and external groups to facilitate the completion of Luminex assay and platform improvements  Other duties as assigned. Education Qualifications  Ph.D. Ph.D. in Chemistry with 2 years' experience preferred or  Master's Degree Master's degree in Chemistry with more than 5 years related experience preferred or  Bachelor's Degree Bachelor's degree with 7 years' experience preferred or  Experience Qualifications  1+ Years Experience working independently in a fast-paced environment with rapidly changing priorities required  Training and Skills  Highly organized with proven time management and prioritization skills (High proficiency)  Ability to work independently and with minimal supervision (Medium proficiency)  Ability to handle the pressure of meeting tight deadlines (Medium proficiency)  Ability to present results orally or in written form. (Medium proficiency)  Fluent in English (Medium proficiency)Luminex Corporation is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, disability status of an otherwise qualified individual, citizenship status, membership or application for membership in a uniformed service, or any other protected characteristic or category protected by applicable law. Apply Now"}