{"title":"Java Developer III (JobID: WISCJP00013759) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALcTM39f7VaQfl7O_dgOTIyTZGwN53zjASgupwkzdL1a0Lacb8ZqOTX-zUcvth1JwhxMIogX6FYziKcQ-XZLBCfQcaikm2BC8rioz5-C0BWA-W8EIk1EuKYxpD4s0_xNf8Tx3cBHZKv5kEKRjpWHzcxcBKHrZEU3S09QthK-3p-JHyEioLHPWlb-KEyXkwd","source":"ziprecruiter","full_description":"Java Developer III (JobID: WISCJP00013759)+ 17 W Main St, Madison, WI 53703, USA+ Full-timeCompany DescriptionComputer Consultants International, Inc. (CCI) is an IT Consulting Firm with more than 18 years experience providing effective, expert-level services in industries such as Construction, Technology, Finance, Healthcare, and Government. CCI focuses on building long-term relationships while completing projects from design to delivery. People are CCI's key component for success. Recruiting utmost-quality individuals for our clients, CCI fields a workforce of individuals who are selected not only because of their technical qualifications but also for their achievements as substantial, contributing human beings. In government work and in the commercial market, high standards of ethics and accountability are critical. Therefore our people are chosen for their integrity and ability to maintain relationships, as well as expertise in their field. To learn more about CCI, visit us online at www.cci-worldwide.com.Job DescriptionDesigns, develops, and implements web-based Java applications to support business requirements. Follows approved life cycle methodologies, creates design documents, and performs program coding and testing. Resolves technical issues through debugging, research, and investigation. Requires a bachelor's degree in area of specialty and 4-6 years of experience in the field or in a related area. Familiar with standard concepts, practices, and procedures within a particular field. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks. A wide degree of creativity and latitude is required. Typically reports to a supervisor or manager. Qualifications + Excellent communication skills in a java developer field *Required 8 years + JavaScript Library Experience *Required 8 years + Java*Required 8 years + Java Development with Eclipse *Required 8 years + JavaScript based responsive HTML 5 applications + Java Spring Framework *Required 5 years + Mobile Application Development - Objective C and iOS or Java and Android or Mobile Web Application *Required 1 years Additional InformationFor immediate consideration, please send your resume to career(at)cci-worldwide.com with \"Java Developer III (JobID: WISCJP00013759)-WI\" as the subject line. Job Location"}