{"title":"Senior Software Engineer - Common Experience","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIyjusE70t0sXOrssif-TkxVRLJXnP-R-w5T2N2no5sZaub5x-ZcfdTNHv4tKOktuVxL7JpRttmA_xYhCnkOZ6qTilnAknCXcTGaY9oz8GJiy0db6q7kX5GsycV8aRX8Tbt51UczDyRDaTOI2Ib7qYyhfD90OplwFZ5rFXiV_cpkC5aVzpyJgQwyPV_7N8v","source":"ziprecruiter","full_description":"About Bill.com Bill.com is a leading provider of cloud-based software that simplifies, digitizes, and automates complex, back-office financial operations for small and midsize businesses. Customers use the  Bill.com platform to manage end-to-end financial workflows and to process payments. The  Bill.com AI-enabled, financial software platform creates connections between businesses and their suppliers and clients. It helps manage cash inflows and outflow. The company partners with several of the largest U.S. financial institutions, the majority of the top 100 U.S. accounting firms, and popular accounting software providers.  Bill.com has offices in San Jose, California and Houston, Texas.  Mission Bill.com is seeking an engineer to join our Common Experience team. In the Common Experience team in which our charter is to build common cohesive experiences for our customers by creating common components, patterns and code that the engineering team uses.  With your wealth of knowledge on Angular, you will bring out the best of our UX and provide our customers the best experience possible. You will be expected to be mindful of time to first interaction, ADA, and other best practices for UIs. One thing is for certain - you are passionate about providing customers a beautiful and easy to use UI experience.  Key Requirements 5+ years of development experience as a full stack or UI developer5+ years experience in Javascript (ES6) and TypeScript, including writing cross-browser codeDeep knowledge of Angular practices and commonly used modules based on extensive work experienceProfessional, precise communication skillsKnowledge of build systems for SPA - webpack, ES6 transpilers, CSS frameworksWeb: HTML(5), CSS(3),CDN, Web ComponentsOther: Mobile Development, SOA/REST, NodeJS, Application scalability Competencies (Attributes Needed to be Successful in Role) Functional/Technical Expertise Experience with AWS and Fintech is a plusLearning Mindset - willing to learn a new domain while building on experiencesCommunication, written and spokenCollaborationCoaching and developing team membersProblem Solving & Decision Making Bill.com is committed to a policy of equal employment opportunity. We recruit, employ, train, compensate, and promote without regard to race, color, age, sex, ancestry, marital status, religion, national origin, disability, sexual orientation, veteran status, present or past history of mental disability, genetic information or any other classification protected by state or federal law.Bill.com Culture:       Humble - No ego       Fun -  Celebrate the moments       Authentic - We are who we are       Passionate - Love what you do          Dedicated - To each other and the customerOur Applicant Privacy Notice describes how Bill.com treats the personal information it receives from applicants."}