{"title":"Systems Engineer III","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL9xQe0SHcr90pMl0Ld6cyQDgW3u-XPS5JnFX_s445b0awigxOrHao46DZGsIHr6CN5hcONvu3v0QoLEQtQS05v8B4FnWrJrgKS_M2Ypj6opovATs3HcVx5DeH_s2URJzSrQSgwUs0J0vlIJwTo5KZ4yNFWoh6KqIfRHSMCFcBapxDePsg9cW6fz3aCX9uM","source":"ziprecruiter","full_description":"JOB SUMMARY  The Systems Engineer III translates task objectives to technical approach and plan to complete within scope, deliverable, schedule, and budget constraints.  RESPONSIBILITIES Performs system functional analysis, timeline analysis, detail trade studies, requirements allocation and interface definition studies to translate customer requirements into system hardware and software specificationsEvaluates project level designs, assuring project specific requirements are in compliance with System requirements and interface definitionsEvaluates product configuration item integration plans and approach, assuring the integrated product meets system requirementsWorks with engineering specialty disciplines in a manner that assures that the system meets its \"Ility\" requirementsEnsures the logical and systematic conversion of customer or product requirements into total systems solutions that acknowledge technical, schedule, and cost constraints Develops System characteristic models, simulations, and analyses that quantify system capabilities and improvement opportunitiesSupports the continuous assessment of System capabilities and deficiencies and develops product improvement proposals for Program, Organizational, and Functional Management review. Proposals should be realized in the creation of Independent Research and Development (IRAD) projectsDevelops and manages System budgets, including, power, weight, reliability, error, etc.Proactively manages area of responsibility to execute to plan and, where variances occur, develop and implement corrective action plans to complete within commitmentsApplies creativity and advanced design concepts to system solutionsDetermines the technical approach by developing and trading off design concepts that satisfy requirements and constraintsCommunicates with the project team, labs and suppliers, customers and functional managementPerforms formal problem root cause analysis and corrective action planning and executionProvides support for hardware and software integration and testLeads all aspects of project initiatives to conclusion, within cost and schedule constraintsAll employees are expected to be in compliance with government and corporate laws, rules, regulations, policies, and procedures EDUCATION Bachelor's degree in Engineering or related field EXPERIENCE Nine to thirteen years of experience with requirements definition, design, integration, and validation of systems, including ruggedized industrial and/or military grade electro-optics equipment ADDITIONAL SKILLS and QUALIFICATIONS Must have a work ethic that enthusiastically persists until project goals are achievedEffective and efficient management of engineering changesResults-oriented team player who leads by exampleSelf-accountable for performanceTakes absolute ownershipExperience with rugged, industrial design to meet military specifications and standards such as MIL-STD-810, MIL-STD-461/464, MIL-STD-1472, MIL-STD-882, etc. Experience with prototype fabrication, integration, and evaluationExperience with field testing and evaluationExperience with planning and conduct of design verification testingIn-depth knowledge of structured System Engineering principles, methods and processes, including requirements development, system definition, hardware design, software design, integration, verification and validation. Working knowledge of the DOORS database toolWorking knowledge of the Microsoft tools suite, including Word, Excel, Project, Power PointUnderstanding of Trade Study methods and tools, system modeling and simulation techniques, system budgeting, system life cycle analysis, and design of experimentsWorking knowledge of chemical, biological, and explosives detection capabilitiesWorking knowledge of Systems Engineering processes and proceduresWorking knowledge of System Failure Mode and Effects and Fault Tree Analysis techniquesWorking knowledge of Risk Analysis and Mitigation techniquesHigh proficiency in written and oral communicationWell organizedProven Product Development skillsMust have the ability to obtain DoD clearance PHYSICAL REQUIREMENTS  Lifting, carrying, pushing, pulling, or otherwise moving objects, weighing up to 10 pounds occasionally and/or a negligible amount of weight frequently. Involves sitting most of the time but may involve walking or standing for brief periods of time. Use of computer.  DISCLAIMER  The preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.  EQUAL OPPORTUNITY EMPLOYER  The company shall afford equal opportunity to all employees and applicants for employment regardless of race, color, age, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or membership in any other class protected by an applicable federal, state, local, or foreign anti-discrimination law. The company shall abide by the requirements of 41 CFR 60-1.4(a), 60-300.5(a) and 60-741.5(a). These regulations prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, sex, sexual orientation, gender identity, or national origin. These regulations also prohibit discrimination against any employee or applicant for employment because the employee or applicant inquired about, discussed, or disclosed the compensation of the employee or applicant or another employee or applicant.  CSES maintains a policy to take affirmative action to ensure that applicants are recruited, employed, promoted, demoted, transferred, laid off, terminated, trained, and compensated without regard to race, color, age, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. The company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant."}