{"title":"Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIDX0mzaRVmBbiJ8gtfr3kdcVtcp6ANPK3NzueGrgtAGh_sgHIMF5repcjTF-Jmqf7ea6UJSByF_EPrCA8Q9y4T-5Kn7aK1NY11ZV82z7us_FIx6TS_r3RvJfapAGKQhlKRe1NXJH3fg6o9wmZ_yDNGI9zxfoJZM2_9k8ResagiSMFjl18XudFx1MYa3JHa","source":"ziprecruiter","full_description":"LER TechForce, an LHP affiliate, previously LHP Engineering Resources, is looking for hardware engineer with Power Electronics experience. Preferably inverter/power generation experience.This role will interact with a team based in India and will need to coordinate work with India therefore, work 6am EDT. This role requires an engineer who is a green card or U.S. Citizen.Key Responsibilities:Participate in all phases of embedded power electronics hardware developmentSpecification / Tech profile creation and requirements management over the entire product development cycle using PTC IntegrityApplies electronic hardware development processes and tools. Processes include basic problem solving techniques (5 phase, 7 step, 8D or similar), design for EMC robustness, design for manufacturing, familiarity with embedded electronic hardware development process, requirements analysis. Tools include worst case analysis, circuit simulation (Saber, Cadence PSpice, or equivalent), DFMEA/PFMEA, Fault Tree Analysis (FTA), schematic capture, PCB layout (Mentor Graphics, Zuken, or equivalent), Specification Compliance Matrix (or equivalent)Prototype build activities: material procurement, assist with builds, prototype test & debugMakes decisions in the areas of hardware requirements, design, validation and test that impact unit cost, functionality, and prototype deliveryEngaged in all aspects of product development: electrical, mechanical, low level software and environmentalApplies Engineering Standard Work (ESW) and architectural standards.Integrate electronic hardware with software and higher level systemIndividual will be frequently communicating with: a global design center in India, external design and test service suppliers, component vendors, contract manufacturers, and product customers (internal and external to client).Individual will take direction from Design Team Leader, but will be responsible for managing project specific deliverables from other resources: component engineering, mechanical engineering, India design center, external test facilities, etc. Education, Licenses, Certifications:BSEE + 2-7 years experience or MSEE + 2-5 years experience"}