{"title":"Software Engineer","location":"Fresno, CA","salary":"\n\n$60,000 - $125,000 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">This role is primarily in-office, working on day-to-day operations with the companies CEO.</li>\n <li>Transaction Management: Automate &amp; Manage the companies…</li>\n</ul>","term":1,"jk":"8151c314a7976d76","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=8151c314a7976d76","source":"indeed","full_description":"Oak Valley Homebuyers – Visalia, CA$60,000 – $125,000 a yearWho we are... Oak Valley Hombuyers is a local investment company that specializes in purchasing real estate throughout the state of California. Our mission is to transform distressed property and make an everlasting impact, one family at a time.ARE YOU A GO-GETTER LOOKING FOR A BIGGER LIFE? We are looking for people with die-hard enthusiasm, a flair for achievement, and a willingness to do what it takes to succeed. We are looking for the best of the best!! If you want to work in a high energy environment with excellent income potential, send us your resume. We look forward to hearing from you!Responsibilities and DutiesThis role is primarily in-office, working on day-to-day operations with the companies CEO.This role will be responsible for overseeing design & implementation of the following departments:Transaction Management:  Automate & Manage the companies transaction process from purchase too close.Operations:  Review metrics by and streamline reports by department.Finance:  Prepare & Report on the companies P&L by department & current projects.Sales:  Review metrics and create reports on the performance of our sales departments. Build a fully integrated multi-platform system to handle the sales process from lead capture through close-of-sale and customer follow up.Admin:  Automate & manage the companies data structure and review metrics for companies data department.BenefitsSalary plus Bonus with potential to earn $60k-$125k+Job Types: Full-time, BonusSalary: $60,000.00 to $125,000.00 /yearJob Type: Full-timePay: $60,000.00 - $125,000.00 per year"}