{"title":"Software Engineer","location":"San Francisco, CA 94102 (Downtown area)","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Collaborate with digital product managers, and deliver robust cloud-based solutions that drive powerful experiences to help millions of Americans achieve…</li>\n</ul>","term":1,"jk":"4166775580b60842","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=4166775580b60842","source":"indeed","full_description":"201 Third Street (61049), United States of America, San Francisco, California\nSoftware Engineer\nDo you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who love to solve real problems and meet real customer needs.\nWe are seeking Software Engineers who are passionate about marrying data with emerging technologies to join our team. As a Capital One Software Engineer, you’ll have the opportunity to be on the forefront of driving a major transformation within Capital One. Learn more about #lifeatcapitalone and our commitment to diversity & inclusion by jumping to slides 76-91 on our Corporate Social Responsibility Report.\nWhat You’ll Do:\nCollaborate with and across Agile teams to design, develop, test, implement, and support technical solutions in full-stack development tools and technologies\nWork with a team of developers with deep experience in machine learning, distributed microservices, and full stack systems\nShare your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal & external technology communities, and mentoring other members of the engineering community\nCollaborate with digital product managers, and deliver robust cloud-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\nWork with cloud native stack, build on AWS, use technologies like Kubernetes and Serverless\nBasic Qualifications:\nBachelor’s Degree\nAt least 2 years of experience in software engineering\nPreferred Qualifications:\nMaster's Degree\n2+ years of experience in Agile practices\n1+ years of experience with AWS, GCP, Microsoft Azure, or another public cloud service\n4+ years of experience in at least one of the following: Java, Scala, Python, Go, Javascript/TypeScript, Angular/React.js, or Node.js\n2+ years of experience working with big data technologies (e.g. Hadoop, Spark, Presto)\n2+ years of experience working on streaming data applications (e.g. Kafka, Kinesis, Flink, or Spark Streaming)\n4+ years of experience in open source frameworks\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position."}