{"title":"Software Developer - REMOTE (United States) #2392 NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAIDHLygJoWFafk0jvxRBv5jLI6qwMH-S5G9m6O0wSwU3glonZkGhIrfgtYJH-5JTLSzMO86sHGvF66yyYcT21w5cgopZ03qnuSYm8VXLyhR2RsCC8lpzFrqGyrVhKz0AgHiMZyYaI1Z20ckUgosr_vwiarUcdHNnO4kTAanYzdWpgbc-fDI2GQXKadwrGhs","source":"ziprecruiter","full_description":"100% REMOTE Opportunity! Contract to Hire!IntegriSource is working with a nationwide employer who is looking for a Software Developer (1-2 years of experience) with both JavaScript and Node.js experience for client and server-side development. The successful candidate will be assisting with the implementation of a Software as a Service solution to new customers through agile development. This is great opportunity for someone early in their career to work and learn. · This a 12-month contract role with an opportunity for hire after 12 months. 100%· Remote work environment – must reside in United States.***Important Notes***· The rate range for this role is at the 1-2 year level.· Employer will conduct background check prior to employment.· Sponsorship is NOT available for this role.Education: Undergraduate degree in Computer Science, Engineering or similar field or comparable experience. Required Skills • Previous working experience as a Node.js developer.• Experience in using technical specifications to write server and client-side JavaScript• Experience in developing object-oriented JavaScript.• Familiarity with full web stack including protocols and web server optimization techniques• Web application development experience: must have knowledge of the HTML DOM and experience with JavaScript frameworks and libraries including jQuery.• Experience working with Version Control Systems (Git, TFS, etc.).• Experience working with REST APIs.• Experience testing and debugging code.• Familiar with agile project management software Jira.• Adaptable to project coding standards.• Comfortable using development, debugging, and testing tools, including npm, Visual Studio Code, Postman, and similar tools.• Strong communication and collaboration skills, comfortable interacting with customers, project managers, and team interaction• Consultative background, ability to work with client deadlines and fixed priced projects.Preferred experience:• Experience writing SQL queries.- No resumes from 3rd parties#Integrisource #softwaredeveloper #developer #nodejs #javascript #remotework #remote #remotejobs #readytowork #itjobs"}