{"title":"Support Engineer (Technical Support)","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AALRs8K-u84-N3tKscr-LlBCggkMZmfxXEsjsA-LmSmMv6YTdJPegs7pNvRU3_fRY--6VMA1BgjncT3ksFzs2LDwSUUIRQwTCGVejWQTNESJgMxjmnRLmwyW-W2ZJX3hmQAq7rF6HfC1GzIqx91DZZ29R_zpOzVGtz6BDwffHYeT0ZE2XeVinXEBriWGwhhI","source":"ziprecruiter","full_description":"A Support Engineer job in Seattle, WA is currently available through Belcan. To be considered for this role you will have Experience with GraphQL/React Native Ability to write intermediate level database queries. SQL skills. Understanding of web services, workflow modeling, web application development, and industry-standard commerce systems Strong debugging/troubleshooting skillsDescription:REQUIRED SKILLSBS in Computer Science, Engineering or a related technical field  4+ years overall development/technical support experience  Knowledge of Java based technologies  Experience with GraphQL/React Native  Ability to write intermediate level database queries. SQL skills.  Understanding of web services, workflow modeling, web application development, and industry-standard commerce systems  Strong debugging/troubleshooting skillsPREFERRED SKILLS BS/MS in Computer Science/Engineering or related disciplines  5 to 8 years of experience in development/network systems/infrastructure/Production Support  Hands on experience with distributed and/or enterprise applications  Knowledge of the UNIX/Linux operating system  Able to write complex scripts and automation (using any one of Shell, Ruby, Perl, Python)  Excellent verbal & written communication skills  Strong understanding of support processes - handling tickets, monitoring, processes and metrics  Ability to solve complex problems independently  Familiarity with load balancers, network components and infrastructure components  Strong as an individual contributor creating and managing standard operating procedures and internal processesIf you are interested in this role job in. please apply via the 'apply now' link provided. Belcan is a leading provider of qualified personnel to many of the world's most respected enterprises. We offer excellent opportunities for contract/temporary, temp-to-hire, and direct assignments in the engineering, IT, and professional fields. We are the employer of choice for thousands worldwide. Our overriding goal is to provide quality staffing solutions that help people, organizations, and communities succeed. Belcan is a team-driven Equal Opportunity Employer committed to workforce diversity. For more information, please visit our website at http://www.belcan.com.prg145Education: Bachelor (BA, BS...)Employment Type: CONTRACTOR"}