{"title":"Sustaining Engineer - Hardware NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIvMet6HzZGWzCqUBOenEEUP5FJf23XtxUfhhGeO3vujxGoLw99leGWNQ3lY1sm9oAuw17hwrdpWuaBEaeuII_0A84UVwEzUucL7YwmNBvnUfYxxmGhX_aAb459UQelVKLHL0sRQBSLeM3itBiuggo1_6UMJYMXCALeFPIwQfpoRJk5boDWOKyfOzmZNiJM","source":"ziprecruiter","full_description":"DISH is a Fortune 250 company with more than $13 billion in annual revenue that continues to redefine the communications industry. Our legacy is innovation and a willingness to challenge the status quo, including reinventing ourselves. We disrupted the pay-TV industry in the mid-90s with the launch of the DISH satellite TV service, taking on some of the largest U.S. corporations in the process, and grew to be the fourth-largest pay-TV provider. We are doing it again with the first live, internet-delivered TV service - Sling TV - that bucks traditional pay-TV norms and gives consumers a truly new way to access and watch television.Now we have our sights set on upending the wireless industry and unseating the entrenched incumbent carriers. We are driven by curiosity, pride, adventure, and a desire to win - it's in our DNA. We're looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story. Opportunity is here. We are DISH. Dish Technologies, in Englewood, CO, is seeking a Hardware Engineer to support the development of products (design inception to market release) and maintain 'in production' products (market to obsolete). Primary responsibilities fall into the following categories: + Maintain and update design of products from market introduction until obsolescence.+ Maintain product configuration requirements, design and electrical component qualification, as well as product failure analysis.+ Primary focus of position is on digital set top boxes, 5G and wireless development and accessories for DISH and similar services. A successful Hardware Engineer will have: + BS degree in Electrical Engineering, Computer Engineering or related field + Less than 2 years of experience in the electrical engineering discipline+ 2 years of experience reading and understanding technical documentation, including schematics and block diagrams Preferred Qualifications: + Working knowledge of common electrical test equipment such as Digital Oscilloscopes, Spectrum Analyzers, and Digital Multi-meters.+ Proficiency with Microsoft Office applications such as Word, Excel, and Outlook.+ Strong written and oral communication skills. #LI KS2#LI-CJ1 Compensation: $48,600.00/Yr. - $76,650.00/Yr.From versatile health perks to new career opportunities, check out our benefits on our careers website (https://careers.dish.com/life/investing-in-you/) . Employment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test."}