{"title":"xIL Systems and Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIGACN1PYfHDyfYUUf0iCrLZpKFQ5idnOE9OcfqeGhp9eF0e40yqk2_WuJyJvmz8YNyegsimRf1hTO4n0FJUewOQXXRPBK6i6H9PeXiZkijGlTzXdZT509fDzxPxQ7CojusFeSJTkhjp2VKzEd3gHgmSD1MtPSNx88ejfCOOZ_5hntjb_gDiftA5RDJOeEP","source":"ziprecruiter","full_description":"xIL Systems and Hardware Engineer Job ID:1042288 Career Area:Engineering & Design Job Category:Product Design & Engineering-PowertrainLocation:Auburn Hills,MI 48326,US Date Posted:January 20, 2021 Brand:FCA GroupApply (http://www.candidatecare.com/srccsa/RTI.home?c=40&d=fcagroup.candidatecare.com&r=5000678525310&rb=SYMPHONYTALENT) Refer A Friend Share this job+ Share on Facebook+ Share on Twitter+ Share on Linkedin+ Share by MailJob OverviewQualificationsFCA's EE &SW organization is seeking a xIL Systems and Hardware Engineer on the Virtual Engineering team to work on Hardware-In-the-Loop simulators. The candidate must have demonstrated knowledge and experience in development of HIL systems (dSPACE, ETAS, NI etc.) with thorough knowledge of HIL simulator hardware, ECU electrical interface definition and harness development. The candidate will be the primary interface between xIL development team and external teams for xIL requirement analysis and impact analysis. In this position, the candidate shall interface with cross-functional team of ECU Hardware, Systems, SW, Controls, Plant Modeling and Calibration engineers to rapidly resolve xIL simulation environment and/or integration issues, triage, troubleshooting during commissioning of xIL test properties. The candidate must be a strong team player, systems focused with interdisciplinary experience and expertise (ADAS, EE, electric and hybrid systems). The engineer must be willing to work in a fast-paced environment. The engineer will be working with global teams (NA, EMEA, APAC and LATAM). Other responsibilities include conducting benchmarks, evaluating new HIL technologies, working with teams on process, methodology and tools.Basic Qualifications: + Bachelor of Science degree in Electrical/Electronic Engineering, Computer Engineering, or a closely related Engineering degree from an accredited university+ 1 year of experience in electrical/electronics, hardware, software or controls+ Knowledge and experience with ADAS, EE, electric and hybrid Systems+ Demonstrated Hardware- In-the-Loop systems experience (dSPACE, ETAS, NI HIL systems)+ Experience with model-based development tools such as MATLAB/SIMULINK+ Experience with C/C++ code generation+ Experiences with scripting languages (e.g. Python, Perl)+ Experience with HIL electrical/ wiring harness, load box design, implementation and troubleshooting+ Knowledge of CAN stack, SPI, LIN and Flash bootloader integration+ Knowledge in diagnostic management: CANalyzer, CANoe+ Knowledge of Simulation Tool (e.g. CarMaker, ASM)+ Knowledge\\experience with UDS, XCP protocol+ Familiarity using trace capture tools, data acquisition and analysis tools such as ETAS - INCA+ Experience with HIL testing, vehicle integration and validation+ Outstanding interpersonal and problem solving skills+ Demonstrated ability to work independently and in a team environment+ Strong communication skills, both verbal and written, with the ability to speak with individuals at all levels in the organization+ Experience working cross-functionally Preferred Qualifications: + Master of Science degree or higher in Electrical Engineering or Computer Engineering+ Working experience of MIL/SIL validation and verification+ Basic knowledge of vehicle dynamics and specific simulation software+ Knowledge of AUTOSAR adaptive platform+ Knowledge of ROS environment+ Experience of working within an AGILE or Scrum framework+ Experience in Test Automation+ Experience with Ethernet networking protocols such as 802.3, 802.1AS, TSN, and requisite transport layer formats+ Experience with HD Mapping protocols such as ADASIS-NG or equivalent+ Ability to adapt to changing environment with minimal effect on productivity+ Strong understanding of the development of embedded software Our benefits reflects the FCA commitment to helping you reach your personal and professional goals. In addition to an environment that promotes career development, we offer benefits for a healthy lifestyle and a rewarding future, designed to take care of you and your family, in various stages of life.As a global company, our employee packages will vary by country, customary norms and the legal entity into which you are hired."}