{"title":".Net Developer :- Remote NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAIP7NYHNZE6QO4AIAabNNaQtk1bfhy5XltzPx_V9fjv-PgHEuBZI_0oEE6naBNAGUB_8iQ9GwieRzmwAtlE6hHWowl-PAs4rbapsI9OiIgeehHDTsM5Axd-bSg_kvwyycAwUylXwtUdL8Q_ZPsTPVpgaAXUL2QUnn6ENIbS_jjOr89zFnM3dK8h-3IuFf4K","source":"ziprecruiter","full_description":"Title: Staff Software Engineer (100% Remote)Location : RemoteDuration: 12 MonthsAs Staff Software Engineer you will design, code and review software for complex applications and interfaces, lead a team of engineers to deliver high-quality code, and mentor other developers.Requisites:· Strong technical background as listed in the job description· Education and Experience requirements from the job description· Track record of successful work with a cross-functional teamResponsibilities:· Working with a small team to develop applications using Agile and DevOps principles.· Developing full stack solutions using new and existing components.· Crafting and reviewing solutions to specific problems.· Working with stakeholders to ensure that software applications meet functional and technical requirements.Requirements:· Ability to perform in a team environment.· Experience with much of the following.· Automating software build and deployment for CI/CD· Test automation and integration testing· Source control management such as Git and Git Hub.· Cloud platforms such as Azure.· Developing ASP.NET Core and .NET Core applications.· Reporting tools such as SSRS.· Secure coding principles.· Microservice architecture.· Web frameworks such as ReactJS or Angular· Messaging technologies such as Kafka, RabbitMQ, Azure Service Bus· Software integration with devices such as barcode scanners, iris scanners and fingerprint readers· Agile development· Developing desktop applications with WPF or Electron· Developing touch-based web or desktop applicationsEducation and experience required:· B.S. Computer Science degree and 6-8 years’ experience or commensurate experience in Software Engineering.Software Development Process.· Proficiency in 2+ Software Languages."}