{"title":"I.T. Engineer/Electronics Test Support NEW!","location":"","salary":"","description":"","term":"$60,000 to $90,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAK-QDMlYI75yJycpfETemYbQxWFMQFGwT7hBLMCNMrstQcAe8LfIqqH0Xe8SctfxUX7sNmurtOlMaaczbRIEgUW-6VVR3rO_gSh6yaThThzhy3cZGXGf7i9k-9VnKM8kZY2XaMwVoutVInNC1L3scM7ArbluzctSPKI1NorUWNBL8NZlgt4tmL4AULQL8La","source":"ziprecruiter","full_description":"IT Engineer/Electronics Test Support (Hiring Now!)Leading Systems Technologies (LST Inc.) is a company built on providing Independent Verification and Validation (IV&V) for government and commercial products. LST has the proven ability to quickly provide thorough and efficient solutions to complex IT and Testing Problems. We are looking for an IT Engineer with RF Testing Skills to assist with testing RF Systems and Antennas. IT work involves setting up / monitoring VPN’s, maintain firewalls and diagnosing / resolving technical hardware and software problem in a multi-user environment. RF Testing involves utilizing RF Equipment to evaluate commercial and custom designs, ranging from networking / computer systems to Antennas. All applicants MUST hold or have possessed an active US Government Secret Security Clearance or higher within 18-months. Please send resume to lhall@leadingsystemstechnologies.com.IT Qualifications Required:Bachelor's degree in IT or Electrical Engineering (or a related discipline), or equivalent.Minimum 5 years of professional experience.Hands-on experience with Install, configure, maintain, monitor, and support internal and external client’s IT infrastructure including but not limited to: servers, routers, switches, firewalls, wired and wireless networks, laptops, printers, remote access points.Hands-on experience with Support existing security policies and procedures, as well as the creation and implementation of new security procedures. Experience with recovering user accounts and laptop security profiles. Experience with managing the installation of email software to handheld devices. Experience with managing the additions and changes of users and computers in Active Directory. Experience with Create supporting documentation for projects, to include procedures and user manuals. Self-motivated with excellent verbal and written skills. Ability to interface with all levels of internal management, external customers and subcontractors.Must be a US Citizen and Possess an active US Government Secret Security Clearance.RF Qualifications Desirable: Hands-on experience with RF test equipment, such as spectrum and network analyzers. Experience developing and testing MATLAB applications. Experience in the following Operating Systems/Languages: Linux (Debian/RHELOS), Windows, C/C++, Java, Python, Agilent VEE and/or LabVIEW. Programming experience with micro-controllers and/or embedded Linux.Company Opportunities & Environment: Small, family-friendly company. Employee health and dental plans. Retirement Savings Plan - 401K plan with company match. Tuition/educational assistance program. 9/80 work week. Ten holidays and three weeks paid time off. Convenient location to Dunn-Loring Metro Station."}