{"title":"Network Engineer - Level 4","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALYgzogOgcpkYfWgNw5Jo8z6Qlj35wJY2BvNa6noz-FqQyP3GXMXGwk_XxW_EHjRdDAN668vqiTRTM7ft9ueOdl-f4-wLjW1TgnDvQS_bPuBNZYB7GG7FbAUNBi10AQdhmRw7fC-elvy8-NdhX6sAZw5_ZLnQtwBwLHrrj2RJjShVES-yCKCSma-aP5t9k","source":"ziprecruiter","full_description":"OverviewBluehawk is seeking a Network Engineer - Level 4. Responsibilities\"Standard Characteristics Apply Standard Characteristics of Labor Category Capability LevelsIn addition, advocate and recommend network-level solutions to resolve requirements. Monitors and suggests improvement to policy. Interact with customers, IT staff, and high- level corporate officers to define and achieve required objectives. Provide the Government assistance to ensure that the architecture and design are functional and secure, including program of record systems and special purpose environments with platform IT interconnectivity. Provide expert guidance and work product evaluation to one or more network engineers that support engineering teams for the design, development, implementation, evaluation, and/or integration of secure networking, computing, and enclave environments.Can perform tasks of senior level technicians, specialists, and or managers not performed at Level 3 due to the size and/or complexity of the tasks. Provides expert guidance and direction to Government and Vendor senior level technicians and managers. Directs multiple contractor and subcontractor teams through to project completion.\"Qualifications\"Education and Experience High School Diploma + 12 years Associate's Degree + 10 years Bachelor's Degree + 8 years Master's Degree + 6 years PhD + 4 years\" \"Training and Certifications DoD 8570 compliance or information assurance certification commensurate with technical objectives and services required within the task order. Applicable software or hardware training and certifications commensurate with the technical objectives, services required and IT environment specified within the task order.\" Bluehawk, LLC. is an Equal Opportunity/Affirmative Action Employer//EOE Minority/Female/Disabled/Veteran/Sexual Orientation/Gender Identity/ ID2021-2015Job LocationUS-CO-Colorado Springs"}