{"title":"Director, Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALz0JF073jQKdBuItLMojmdCfUWXLNgyaCWU6VhY6dBYTqOPng-XdMuHdoICSeSMJlN-3I13LYOhVq9h1BAtyqrr-ATDGm4OVnMEMlWF9VLOGkN16sz9xYLRgNiGxhryPger0iNK20Nm-ZlYCf6W_fT9zmZg_zmVQfRM8nH-hqkoXSQXbwh32uGWxuYWPk","source":"ziprecruiter","full_description":"Ascent Life Sciences is hiring a Director of Chemistry to oversee phosphoramidite synthesis team. The successful candidate will be deeply experienced with performing efficient oligonucleotide synthesis using DNA/RNA synthesizers and experienced in downstream purification of the oligos. The successful candidate will build and oversee a team preparing synthetic RNA and chemically modified synthetic RNA oligonucleotides using DNA/RNA synthesizers and perform downstream purification and characterization of the oligonucleotides by cartridge, HPLC and other methods. This person will lead the analysis of data using analytical instruments including NMR, DLS, HPLC, MS. UV/vis, etc., and ensure detailed documentation records and batch records and other materials are properly kept and maintained to facilitate tech transfer and regulatory submissions.To be considered for this position, the well qualified candidate will have an advanced degree to include a Masters' degree (MS/MA) or a PhD in Chemistry or Biochemistry with five or more years of experience in manufacture, purification ad characterization techniques to include some experience managing others involved in nucleic acids chemistry and oligonucleotide synthesizer method development OR equivalent, plus some experience in operating DNA/RNA synthesizers for nucleic acid chemistry, synthetic organic and analytical chemistry. The lead candidate will have experience with oligonucleotide/siRNA purification and characterization techniques using analytical instruments including HPLC, MS, NMR, UV/vis, etc., and preferrably have experience in conjugation chemistry applied to biological systems (peptide chemistry experience will be a plus.) and experience managing projects to include IND enabling studies.For immediate consideration please email resume to Neha at npotdar@ascentsg.com"}