{"title":"Network Engineer - 446807","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKfshTUy9bPlSp3-zcuat87hNviyanpaUAMAt6AH-_V5pWtpDYVY-18VvFD2zGazBOiSWNbgb_dFExaA_O7fwm0ev4kUwy4L427z0lIcVqZYqHbEMorlrhuvJTEhmXxYYFxzRvZVNnXlp5EYwUF2Bfjcs3sArgz6zunZkw6CAIrVRieR6unkV1q3XqsSihY","source":"ziprecruiter","full_description":"OUR GOAL: Treat our consultants and clients the way we would like others to treat us — we are honest, stay true to our word, and work in the best interest of our clients, consultants, and candidates. Many say they work this way, but few actually do. We are a company that does. Additionally, we bring joy to the world of IT staffing and IT recruiting by making the hiring experience memorable, fun, and different.  OUR MISSION:Find and provide the best talent for clients and excellent career opportunities for consultants and candidates — whom we treat as part of our team. Interested in joining our team? Check out the opportunity below and apply today!Reference: 446807Our Columbus, Ohio client has a contract need for a Network Engineer who will be responsible for partnering with Network Team resources to assist with documenting the current overall network environment and subsequently shutting down a client-owned data center while maintaining business transactions.Requirements:5+ yrs network engineering experienceCisco, Juniper core network switchesCisco ACIMerakiSonet RingMPLSWAN ArchitectureBGP.OSPFIPSECABOUT REVEL IT: Revel IT (formerly known as Fast Switch) is one of the fastest-growing, privately held, IT Staffing companies in the nation. Our client base includes 32% of the Fortune 25. We have major offices in Dublin, OH, Tucson, AZ, Los Angeles, CA, and Austin, TX, and are rapidly expanding into new markets from coast to coast.WHY REVEL IT: In addition to standard health and 401k benefits, we offer referral bonuses and training/continuing education opportunities.5-year client retention: 99%No. 1 supplier with customers: 53%Top 3 supplier with customers: 77%Consultant retention: 94% We do our jobs in a way that brings delight every day to our clients and the people who work with us. Life is simply too short to grind through every day as a small cog in a huge recruiting machine. As a young and high energy company, we aim to help consultants and candidates land fulfilling jobs that offer real career growth. #IND2021 #gdr4900"}