{"title":"Hardware-in-the-loop (HIL) Software Engineer - New Glenn NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALWjXJ0UZK01jhT1jm441RXouunq2Yi-oXnmsuJkvviSfnq4vbhyOy6brLAHuE_lWOvGe0oBF3tERgX1tbpB6qtCjcUwGDZruFLRk5F3yPSvgZ4ZzbyxV5LroRO-uikauxmIhfjuDGOjL9sicfOlB-qvt8qe3q34KbKslxIhtGn9Pk5niXRMj6hScns5E41","source":"ziprecruiter","full_description":"As part of a small and dedicated team, you will be responsible for designing, commissioning, and maintaining the Hardware-in-the-Loop (HIL) and Software-in-the-Loop (SIL) systems for avionics validation and verification on the New Glenn Launch Vehicle. As an integral part of this team you will design and implement software to allow system development on a developer's workstation, to support hardware and software qualification, and maintain and update the New Glenn testing infrastructure. This hands-on position requires a strong history of developing, validating and verifying critical software systems. This position will directly impact the history of space exploration and will require your dedicated commitment and detailed attention towards safe and repeatable spaceflight.+ Develop software requirements, design to implement highly reliable software systems+ Analyze requirements and develop test/simulation environments+ Support the development of validation and verification plans for software qualification+ Design and implement virtual systems for avionics software development+ Develop verification systems for the HIL and SIL systems+ Drive adoption of proper engineering practices for software development+ Collaborate with software, hardware and test engineers to troubleshoot integration issues+ Communicate, develop and implement strategies for continuous improvement+ Identify risks or opportunities during the software lifecycle+ Develop infrastructure to improve HIL availability and usage + BS degree in Computer Science, Computer Engineering, or related disciplines+ 5+ years of relevant experience in software development and testing+ Experience with low-level and high-level programming languages+ Strong C, C++ and Python development skills+ Clear understanding of hardware and operating system concepts (interrupts, threading, memory management, etc.)+ Demonstrated ability to adapt new tools and languages as needed+ Excellent written, verbal, and interpersonal communication skills+ Must be a U.S. citizen or national, U.S. permanent resident (current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum + Experience in cross-disciplinary teams or positions (design, development, testing, project management)+ Strong software testing background+ Familiarity with hardware emulation systems+ Experience with ARM based microcontrollers+ Experience using MATLAB and Simulink+ Solid understanding of IP networking concepts+ Familiarity with electrical and electronic engineering concepts+ Experience using and customizing continuous integration systems External Company Name: Blue Origin External Company URL: www.blueorigin.com SystemID: 3525 Street: 21218 76th Ave S"}