{"title":"Field Service Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALb40Iq9XhlVbVRuF4TENXx4z1hI-FpIn_2oBlcx9pzPkc9PY7lg7sWsSwx0HBcc2CM3VvYI0JrTZB5b9EgVItaQT0BEYgZTiftFshZQMt_ez1-VAm-YsUNLi1FtSviW6-40YvPcIFJEixsWZSaoIMCk_k4U538_oGOBLHaPaBSH_jvj2-7XslOTDkMyok","source":"ziprecruiter","full_description":"We are excited to launch this opportunity to diverse men and women experienced in field service engineering with a large, multinational production and services corporation. Roles and ResponsibilitiesUnder minimal direction, serve as lead to assigned customers; complete troubleshooting, installation, validation, maintenance, and service repair needs on designated equipment. May assist and/or train newer Field EngineersProvide excellent and efficient service to customers, along with technical training on productsRepair, maintain, and install product line(s).Complete timely and accurate Preventative Maintenance and Field Modification Instruction as neededTravel throughout the district territory, experiencing all the various places our instrumentation is utilizedDocument and report all repairs and product failuresKeep up to date on administrative responsibilities such as maintaining customer service logs and internal service records in a timely manner, ordering repair parts, and adhering to cycle timesHelp with the development of preventative maintenance proceduresFocus on customer needs and satisfaction, while building on and enhancing the relationship with the customer to ultimately become a perceived partner in their businessApplicant will require ability to lift up to 50 pounds. This would be to include tools, replacement parts, consumables etc.Maintain a Valid drivers license that meets our safe driver standards and vehicle policiesVendor credentialing requirements include without limitation, yearly background checks, immunizations, and various trainings.Effective communication and customer service skills.Instill customer satisfaction that is recognizable and valuable to the customerStay compliant with the companys standard background check, including a post-offer drug test.Strong time management and organization skills.RequirementsRequired:Associates degree1-3 years of proven track recordTechnical Associates degree or equivalent in military experienceHold a current valid drivers license and good driving record over last three years is requiredWilling to work different shifts as business needsAbility to travel and provide service in assigned geography, as well as periodic travel to other regions or for trainingPreferred:Bachelors degree.3 + years experience diagnosing and repairing mechanical, electromechanical, and/or electronic equipment.Experience collaborating with internal team members and external customers.BenefitsCompetitive compensation that typically has key components including base salary, variable annual incentive compensation based on personal and company performance, and long-term incentive. We also offer comprehensive healthcare plans, savings plans, paid time off, and other benefits."}