{"title":"Sr. Software Engineer I NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKeCCJGc7JleYKPbVQQ5mVXk4BbYroi_edyhV6bhYWsPL57TGeQIgHc5G-TKljH5PH_OId4bVNvj2Mv0u2wiLVlZBQ4eIHDoCxcKpLaSykSsbjAmDBVpmoBojxTXQzoVUnAYkmZfGE8xpQeZYCmwY9LIc2gpF30KXlPo4wbcrK5JNskT11gd3wCGTeotXTy","source":"ziprecruiter","full_description":"Description As a Sr. Software Engineer, you will work with a cross functional team of Database, DevOps, Salesforce, Software, QA engineers, and Technical Project Management as a development lead on solutions for critical projects.  You will split time between development and maturation of projects such as ETL pipelines, API's, and web apps, supporting day to day operations on existing solutions, and working closely with Product on critical initiatives. What you'll do...Act as Technical Lead on business-critical initiatives. Specifically, collaborate with Product on the design, architecture, and development of the solution. Own technical requirements and develop solutions that meets business functionality. Support other members of the team by providing guidance and leadership on projects, learning, and improvements.  Review existing solutions, projects, and infrastructure to provide recommendations for enhancements and structural improvements. Develop, maintain, and optimize pipelines and engineering projects to ensure continuous operation and improvement. Mature, scale, and automate existing systems and infrastructure. Work with application developers, users, operational leadership, and subject matter experts to understand current and future operational goals. Contribute to all parts of the software development and deployment lifecycle, including design, development, documentation, testing and operations. About you... Bachelor's Degree in Computer Science, Engineering or related field, or equivalent experience. 3+ years experience in Software Engineering or Web Development roles  Strong knowledge of Python, PHP, or similar programming language. Comfortable with Git and remote service such as GitHub for version control. Strong experience working with MySQL or similar relational database systems. Strong experience with Docker. Strong experience with AWS or similar cloud service. Strong experience with CI/CD Pipelines such as CircleCI, Jenkins and GitLab CI. Strong experience with developing and maintaining large-scale data ETL pipelines. Strong experience in assessing, developing, troubleshooting, and enhancing RESTful API systems for performance optimization, increased scalability and security, and development standards.  Experience with AWS Lambda or similar serverless computing. Experience working in an agile Scrum environment. Ability to prioritize, communicate well, design for repeatability and scalability, exude ownership, and dig beneath the hood with technology. Ability to translate business requirements into technical specifications. Strong communication skills to effectively work with technical and non-technical teams.  Flexibility to both improve what we have in motion and to innovate on new capabilities. Experience with NoSQL databases such as MongoDB is a plus. Experience in IaC tools such as Terraform or CloudFormation is a plus. Proficiency with front-end development in HTML/CSS and JavaScript frameworks such as React, Vue, or Angularis a plus. Experience with Cloud Networking is a plus. About Progyny: Progynyis a leading fertility benefits management company in the US.We are redefining fertility and family building benefits, proving that a comprehensive and inclusive fertility solution can simultaneously benefit employers, patients, and physicians.Our benefits solution empowers patients with education and guidance from a dedicated Patient Care Advocate (PCA), provides access to a premier network of fertility specialists using the latest science and technologies, reduces healthcare costs for the nation's leading employers, and drives optimal clinical outcomes. We envision a world where anyone who wants to have a child can do so. Our mission is tomake any member's dream of parenthood come true through a healthy, timely,and supported fertility and family building journey. Come join a companythat'sbeen recognized by Modern Healthcare as one of the Best Places to Work in Healthcare. Our perks: Family friendly benefits: Paid maternity and paternity Fertility benefits (including egg freezing and IVF) Emergency childcare program Parent's group Health, dental, vision and life insurance options for employees and family Paid vacation and summer flex time Company equity Bonus program 401K Match Monday breakfasts/ Friday lunches/ healthy snacks Company social events Sit/ stand desks Progyny is anEqual Opportunity Employer.We respect and seek to empower each individual and support the diverse cultures, perspectives,skillsand experiences within our workforce."}