{"title":"Software Engineer - ColdFusion","location":"Roseville, CA","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Receive great benefits like 401(k) match, and health benefits, PTO and paid holidays.</li>\n <li>Evaluate the short- and long-term implications of every implementation…</li>\n</ul>","term":1,"jk":"d99e97b085de345a","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=d99e97b085de345a","source":"indeed","full_description":"We're looking for a talented and highly motivated software engineers to join our team. As a growth stage technology company, Clear Capital is seeking developers eager to be part of a team, working closely with every part of the company from operations to our executive team. Learn more about our engineering teams here.\nWhat you’ll do\nWrite high quality, well-tested, extensible and scalable code\nEvaluate the short- and long-term implications of every implementation decision\nYou’ll work with a tight-knit team solving tough problems by building quality enterprise solutions with a professional design and coding process\nLearn from accomplished developers through mentoring and committed collaboration and take your dev chops to the next level\nMake an immediate impact by quickly getting up to speed and building features from start to finish\nWho we’re looking for\nYou love tackling really tough problems, and value the correct solution over a sloppy one\nYou have a passion for software development, with side projects to prove it\nYou understand the value of tested solutions, and you’re a capable debugger\nYou’re comfortable reading & writing code, and can describe what each part of the code is doing\nYou’re great at taking constructive feedback on your work\nYou’re passionate about our mission to disrupt how banks, lenders and investors value real estate\nOur tool kit\nWe believe in using the most effective tool for the job, and also relying on the strengths of our team.\nOur stack and tooling includes: ColdFusion v. 12 (2016), Oracle 19c and modern tooling like JIRA, Jenkins, Git in an Agile environment\nWhy you’ll love it\nDisrupt the Real Estate data industry by bringing cloud based, enterprise software and data services to the market for big banks, lenders and investors\nSee your work move into production quickly, and avoid the bureaucracy that slows down larger companies\nEnjoy a modern office layout that is quiet, yet collaborative surrounded by top quality engineers that enjoy working with each other\nReceive great benefits like 401(k) match, and health benefits, PTO and paid holidays\nWork with a growth oriented company that is transforming itself and an industry where you can have a real impact on the company's future\nAbout Us\nClear Capital is the premier provider of real estate valuation, analytics, and technology solutions. Powered by its more than 45 years worth of information on nearly every U.S. metro, neighborhood, and property, Clear Capital’s solutions are trusted by community credit unions and billion-dollar financial institutions alike. Clear Capital is headquartered in Reno-Tahoe with a team of more than 500 nationwide, dedicated to going wherever it leads, and doing whatever it takes.\nTo all recruitment agencies: Clear Capital does not accept agency resumes. Please do not forward resumes to our jobs alias, Clear Capital employees, or any other company location. Clear Capital is not responsible for any fees related to unsolicited resumes.\nCompensation\nSalary commensurate with experience\nClear Capital is an equal opportunity employer\n\nINDT"}