{"title":"QC Chemist or Analyst - 2nd Shift","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJeHPRPZgFNvQRPKpdHLe1OHboyWTCoyZOn-tjEKhE_OB2y4NpRqI95uHZRTs13lnOy_4dYtU981KYspGDQkUV1WwL_R-rS4omGsgLE0AlL-wyDhKKzDuxHjotzeG5BybljAkxqs_LZHHUhg9aPFwbEhEL_XfK6EGJ_OEzLC1zI6VBwA5rzg_fIFu9j6Xgb","source":"ziprecruiter","full_description":"Roles and Responsibilities:The Quality Control Chemist (QCC) reports to Quality Control (QC) Management. The QCC will stay current on publications released by USP, FDA and other pertinent regulating bodies to ensure the Quality Control Chemistry Laboratory complies in the areas of analytical applications, release specifications, and documentation practices. The QCC will assist in evaluating new testing applications and instrumentation, either developing methods or adopting compendial methods. This person will aid in transferring these new methods into a Quality Control function for routine use. The QCC will ensure at the least, these methods are accurate, precise, and robust for daily use on specific samples.The QCC will assist in the purchase and commission of analytical instrumentation. This person will aid in developing purchasing and comparison strategies to ensure the most applicable analytical technology is fit for the purpose. The QCC will work with Management in scheduling of service technicians and outside contractors for set up/PM/calibrations.The QCC will track and coordinate all laboratory calibration events. The Chemist will work closely with the Calibration Coordinator in determining the type of calibration needed and the frequencies for all laboratory instrumentation. The QCC will ensure all calibration work has been properly documented and archived according to procedure and all deviations are justified appropriately. The QCC will assist the laboratory personnel in resolving Out of Specification (OOS) results in the QC Laboratory. The Chemist will ensure the proper use of the analytical instrumentation and there are no malfunctions causing the OOS result. The QCC will ensure there are no other interferences coming from the product formulations causing the OOS result.The QCC will assist in training new laboratory personnel. All training performed under the supervision of the QCC will be documented in accordance with established SOPs and the Nutramax training program.The QCC will follow Current Good Manufacturing Practice (cGMP) documentation guidelines to record all procedures in a timely fashion. The QCC will maintain a safe working environment and will ensure that all equipment used in the testing procedures is calibrated and properly maintained.The QCC should be able to handle specific QC projects and other necessary functions.Perform other assigned duties as may be required in meeting company objectives. Communicate effectively with other departments within the organization and function within a team environment.Minimum Requirements : The QCC will have three or more years of laboratory experience in a cGMP facility, including experience with operation of laboratory instrumentation including Gas Chromatography (GC) and/or Liquid Chromatography (LC) required, troubleshooting, generation and revision of SOPs and test methods. Effective interpersonal, self-motivation skills, and the ability to interact with all levels of personnel are required. Education and Experience: A Bachelor of Sciences (B.S.) or Bachelor of Arts (B.A.) degree in Chemistry or a related science is required for the QCC position.Employment Type: FULL_TIME"}