{"title":"Assistant or Associate Professor, Organic Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJvuV2ixhFeXQxLI-QIz0KQailvQuoZt8BlO8lfVgyUcXnohR7Y_suWQTegz2AgvY-U2uSCDlaDgEhmiI1cF1ctci7HntAo61Jbp_1jf85Y7fIoPQrprg2TFUv5TNALQzAAlA1e2jbNyDBV3rFgGgJVz9Mc1Vug5cvaaQt79ZZgYGt-nE_M0MM5SroFwmM","source":"ziprecruiter","full_description":"About This Role:The Department of Chemistry invites applications for a tenure-track position at the Assistant or Associate Professor level in the area of Organic Chemistry, broadly defined, to begin in August 2021. The successful applicant will be expected to direct an independent research program that will attract extramural funding, provide research training for graduate and undergraduate students, and excel in teaching graduate and undergraduate courses in Organic Chemistry. Applicants must have a Ph.D. degree in Chemistry or a closely related discipline and a strong track record of scientific achievement. Senior applicants must also have a strong history of successful mentorship and extramural funding. Why Join Us:The Chemistry Department at Kansas State University hosts active, vibrant teaching and research programs and is widely recognized as one of the University's leaders in these areas. It was founded in 1873 and belongs to the College of Arts and Sciences. The department is housed in King Hall and the CBC Building and is populated by 22 tenure track and teaching faculty, approximately 65 graduate students and postdocs, and many undergraduate researchers. Research projects within the department span a broad range of topics in the areas of medicinal chemistry, materials science, and biological chemistry. These projects are well funded by numerous federal, state, and university agencies as well as by private foundations and industry. Our departmental teaching and research programs are facilitated by a glass shop, a machine shop, and an electronics shop, all of which are staffed by professional technicians, as well as a chemical storeroom and departmental instrument labs with NMR, HPLC, and X-ray crystallography capabilities, staffed by Ph.D-level specialists.This position is benefits eligible: health insurance, life insurance, retirement plans, tuition assistance program, paid time off - vacation, sick, and holidays.To learn more visit: We Support Diversity and Inclusion:The Department of Chemistry in the College of Arts and Sciences seeks to foster diversity in a commitment to recruit, retain and resource peoples historically under-represented in university education in the United States. Fostering diversity goes beyond increasing the numbers of under-represented students, faculty, and staff. It also includes a commitment to substantial curricular offerings, resources, and programming that foregrounds the knowledge, perspectives, cultures, and histories of marginalized communities. A truly diverse college culture and structure will benefit all members of the university community to better serve and excel in an increasingly global and multicultural worldWhat You'll Need to Succeed:Minimum Qualifications:A Ph.D. in ChemistryAbility to establish an active, productive research program that attracts extramural funding and capable co-workers.Ability to excel in teaching organic chemistry at the graduate and undergraduate levels.Ability to work effectively with faculty, staff, and students from diverse backgrounds.Preferred Qualifications:Post-doctoral experienceResearch interests in organic chemistryOther Requirements:Applicants must be currently authorized to work in the United States at the time of employmentHow to Apply:Please submit the following documents:One PDF file containing letter of interestcurrent curriculum vitaedescription of research plans not to exceed seven pagesstatement of teaching interests.Names and contact information for three professional references. Individuals should be notified that they will be asked to send recommendation letters. Review of Applications Begins:Immediately. For best consideration, apply by October 30, 2020.Equal Employment Opportunity:Kansas State University is an Equal Opportunity Employer of individuals with disabilities and protected veterans and actively seeks diversity among its employees.Background Screening Statement:In connection with your application for employment, Kansas State University will procure a Background Screen on you as part of the process of considering your candidacy as an employee."}