{"title":"Senior Scientist I, Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK-PARzb2bix6yzlgvUqsH0tEVEP7qgIhEJ8vT9FvvbNARvbiILT8SoHd1sodNxlVyOhYerGt2R0b4EDCxri4se6pNbYT5pYvYFxfyotGtFv-qoX5ADeN4joPJFSC2cY3Rst6TeJkgarbwM-E3hpdk465IZXs0Z3BPVepkY83F2-GPHgB7-L7Lkj0jwINs","source":"ziprecruiter","full_description":"Company Summary: Deciphera Pharmaceuticals is a commercial biopharmaceutical company focused on discovering, developing and commercializing important new medicines to improve the lives of people with cancer. We are leveraging our proprietary switch-control kinase inhibitor platform and deep expertise in kinase biology to develop a broad portfolio of innovative medicines. In addition to advancing multiple product candidates in clinical studies, QINLOCK is Deciphera's first FDA-approved drug, a switch-control kinase inhibitor for the treatment of fourth-line gastrointestinal stromal tumor (GIST).  QINLOCK, an oral oncolytic, is also approved in Canada and Australia for the treatment of fourth-line GIST.  Deciphera (NASDAQ: DCPH) is a publicly traded company headquartered in Waltham, Massachusetts. Our state-of-the-art research facility is located in Lawrence, Kansas.     We offer an outstanding culture and opportunity for personal and professional growth based on our \"PATHS\" Core Values: - Patients - places the importance of improving the lives of patients and their caregivers at the forefront of every day's work. - Accountability - for our performance and the way we work with coworkers and other stakeholders. - Transparency - in our intent and actions to both internal and external stakeholders. - Honesty and Integrity - fosters trust and strives to deliver on our and the company's promises. - Stewardship - values and uses wisely the resources and investments provided to the company.Position Summary: The Senior Scientist I Chemistry, will be part of a new initiative aimed at expanding Deciphera's compound library of proprietary kinase inhibitors developed using the company's switch control platform technology. The Senior Scientist I Chemistry will apply modern organic synthetic methodologies, parallel synthesis and high throughput purification techniques to generate focused chemical libraries of switch control kinase inhibitors to support Deciphera's new discovery projects.  The successful candidate will hold a PhD in Organic or Medicinal Chemistry with 0-2 years industry experience.     This position will report to the Senior Scientist II and Chemistry lead on the chemical diversity initiative.  The position is based in Lawrence, KS, in Deciphera's state-of-the-art research facility near the University of Kansas campus. Key Responsibilities: Contribute scientifically and intellectually to Deciphera kinase inhibitor programs especially in the areas of parallel synthesis, library construction, and high-throughput experimentation (HTE)Design and implement synthetic routes to prepare proprietary small molecules in a parallel and automated fashionTrack structure activity relationships for optimizing potency, selectivity and pharmaceutical properties of small molecule librariesOperate, maintain, and supply laboratory equipment related to parallel and automated synthesisManage interdisciplinary engagement with others in the organization and with various CROs in the areas of small molecule library design and synthesis, kinase inhibitor switch control technology, and structure-based drug design with respect to kinase biochemistry, Generate reports and presentations as required by the organization, and provide input on intellectual property activitiesValues other people and promotes the welfare of the organization and colleagues Required Qualifications: Ph.D. in organic or medicinal chemistry with 0-2 years industry experience as synthetic organic chemist. High level of creativity and productivity with strong synthetic chemistry problem solving skillsDemonstrated excellence in organic synthesis, conversant with the current literatureIn-depth knowledge and hands-on experience with a wide range of techniques in synthesis, purification, and spectroscopic characterization of novel compounds (NMR, LC-MS, HPLC, etc.)Experience with high-throughput experimentation (HTE), parallel synthesis, automated synthesis, design of experiments (DOE), and/or flow chemistry is preferredExperience using the concepts and tools of structure-based drug design is a plus, but not requiredCapable of setting up and analyzing multiple reactions, and working independently in an organic chemistry lab settingExcellent and effective oral and scientific/technical writing communication skillsProven interpersonal skills with the ability to work collaboratively as a member of a cross-functional team and maintain effective working relationshipsDemonstrated proficiency using MS Office and ChemDraw applications is required"}