{"title":"Compliance Operations Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL1bwwU6RPflHiFZTlRqmrIP61fkNPbq--Rf0KeVZRD2sTBk8V--vMmu7rht6mYN4vCYBM_HtPglcJfgSThXvUBHFTo1TtDE-f-GcaGocJTjtPwKyG1YnOC1Wv36tuZIiTsKGF4Fb6YQDB3fw0QZY1O6BQDSMzvmWxnZ8h_G9f3WuBja9CFtC-ujfK3s8o","source":"ziprecruiter","full_description":"*At present, due to COVID 19, all employees are working from home/remotely at this time.*Our Mission: To actively connect people to their next great opportunity. Who We Are: ZipRecruiter is a leading online employment marketplace. Powered by AI-driven smart matching technology, the company actively connects job seekers with millions of businesses of all sizes through innovative mobile app, web, and email services, as well as partnerships with the best job sites on the web. ZipRecruiter has the #1 rated job search app on iOS & Android. Summary of JobZipRecruiter is looking for an Operations Engineer to join our Compliance Team. You will be working on a collaborative cross functional team that includes members of the Technology, Legal, and Product Management teams. Our Development teams are actively involved in building compliance with CCPA, GDPR, TCPA, and other regulations and laws.Being an Engineer at ZipRecruiter requires familiarity with UNIX/Linux, a willingness to learn, and to be an advocate for our compliance initiatives. We value self-starting can-do attitudes. You'll have a high level of ownership over your work and opportunities to expand your skills and knowledge in Compliance and Software Engineering.A great candidate will have excellent people skills. Kind, respectful interaction with both internal and external parties is an integral part of our culture. This position also requires clear and concise writing skills to keep everyone aligned via different channels. We are seeking a candidate with all of these skills who will also be sensitive and welcoming to a wide diversity of cultural and technical backgrounds that we encounter in our global business.Key focuses:Guide, support, and partner with Engineering, Product, HR and Legal on compliance initiatives and obligations. Own and drive individual contributions on compliance projects and prepare presentations as needed.Where possible, deploy Open Source software to solve our business challengesCreate or improve compliance controls at all layers of a three tier web applicationInvestigate and document systems that collect, store, and process dataModify existing software to operate appropriately for different jurisdictionsBuild systems that manage the retention and access of data in a cloud environmentRemove or anonymize data in a distributed systems environmentBe a subject matter expert for other teams as they build new systemsWork with the Security Team in areas of shared responsibility and focusJoin in on discussions on internal policy and risk mitigationMinimum Requirements:3+ years of experience in software engineering A Bachelor's degree in Computer Science, a degree in a related field, or relevant Software Engineering experience  Strong written and verbal communication skillsFluent in UNIX/Linux (general use, searching, basic configuration) User level knowledge of git (branching, committing, merging, pushing)SQL proficiency:The ability to create queries with joinsManipulating the DDL including creating and altering tablesSimple performance tuning using \"explain\" and similar tools provided by database clientsMinimum Requirements:Go, Perl, Ruby, JavaScript, Python, or JavaAn ability to create web front ends at a \"Programmer Graphics\" level.Linux ContainersKubernetesAWS (especially S3, DynamoDB, Redshift, Aurora, and other database products)TerraformAs part of our team you'll enjoy:Competitive salaryExceptional benefits packageFlexible Vacation & Paid Time OffEmployer-matched 401(k) plan  For information about ZipRecruiter's processing of California job applicant personal data, please see our Privacy Notice at: https://www.ziprecruiter.com/careers/california-job-applicant-privacy-notice\"ZipRecruiter is proud to be an equal opportunity employer and provides equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity or genetics. Category: Computer/Software"}