{"title":"Formulation Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJbYS17ePZzKqsWzU5mVLbU2jLlwaRIVttRJ3sFbWlyND6qL18CQsmMvZsSX_bwifEPMldVi7txmygnNBW_5BSu4vBLtcmBFtmiJHLoRz5so-gAc6gcPx5GquP3q8ISF6Nf2VuLUT9t8HqwKjLBy3ZM6f0Fjl_Wm_3YUFRix13mxOdnUrHwW6cozrDu9rEr","source":"ziprecruiter","full_description":"Advancing Eco Agriculture Formulation ChemistAdvancing Eco Agriculture is a rapidly growing company in the specialty plant nutrition, bio stimulants, and crop consulting industry. We are looking to expand our R&D department with a qualified Formulation Chemist. We are looking for an individual who has extensive laboratory and/or formulation in manufacturing experience with a solid research skillset and has a strong desire to impact Agriculture. This position will be located in Middlefield, Ohio at AEA headquarters.Advancing Eco Agriculture has a great company culture with a very collaborative and supportive environment. We value clear and coherent communication, and work to grow and develop our team members. At Advancing Eco Agriculture, we believe that putting our team first and creating an optimal team environment will lead to enhanced customer experience and continued company growth. Please follow the instructions below to apply.Responsibilities· Work with the R&D Director to coordinate and prioritize all formulation and ingredient projects.· Formulation and product development of soil amendments, nutrient inputs, and crop availability/delivery technologies.· Evaluate current and potential raw materials, production methods and equipment.· Coordinate with procurement and production to perform QA/QC on all incoming and outgoing materials.· Evaluate current product chemistry, production methods and equipment to identify areas for improvement and keep pace with a changing marketplace.· Continue the optimization and expansion of in-house lab capabilities in line with Good Laboratory Practices (GLP).· Coordinate with Regulatory to ensure new ingredient/product compliance with AAPFCO, NOP, COR, EPA and other federal/state regulations.· Conduct pilot batch production of developmental products and processes.· Attend ingredient and lab method trade shows.· Assist in collecting and providing technical information to the Director of R&D for preparation of presentations, training courses and customer-facing materials.· Coordinate, as necessary, any work with outside experts in additional R&D fields of interest.Qualifications and Competencies· B.S. (required), Masters or Ph.D. in Chemistry, Organic Chemistry, Biochemistry (Ag-centered), Biological Science (Ag-centered), or other chemistry/agriculture combination.· Good understanding of formulation development and testing principles.· Experience with trials/field testing desirable, but not required.· Knowledge of laboratory operations, equipment, and safety requirements.· Creative mindset, interest in uncovering new chemistries.· A desire to first seek to understand, then seek to be understood.· Project management, data logging and database maintenance skills.· Excellent communication, documentation, and organizational skills.· Ability to work independently and in a team environmentTo Apply: Send a cover letter - no templates, please, because we want to know WHY you think this position with AEA is the perfect fit for you. Your cover letter needs to convey your authenticity in a meaningful way.Include CV/Resume and desired salary range.Provide three professional references and three personal references.Submit all materials via email to Eric Girdler, Chief Operations Officer, at hr@advancingecoag.com."}