{"title":"Software Engineer, Tools NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKRW1oaWKPP3mO60BcqDsmlhyWxanQjGQTru4SR_K-p4V9ZZLTwaVi5c6HKqhYKUXc3vu-gHHiwvtydBSbZYhiDzsWMMjeE3TyZC7e3ko_xFtyAmZJcL95B_KCOnhnqDpSDa1cZ48wipYxezLlF68izSYotKm2u5dYqCi-xgz7VtbPoRhPmBJZc5lhymXU","source":"ziprecruiter","full_description":"As a Software Engineer on the Tools Team, you will work closely with our CX, Trust & Safety, and Client Services teams to ensure that agents can efficiently and effectively help process customer issues. Additionally, you’ll work closely with other engineering teams such as Security, Accounts, and Wallets to ensure that the back-of-house processes employed by Poloniex are fast, reliable, and secure. This is a full-stack web development and application engineering role, meaning you will have the opportunity to do everything from designing new systems and database schemas to working with a variety of backend technologies to implementing frontend components. What you’ll work on: Build secure, reliable, scalable features for all in-house software enabling a 24x7x365 cryptocurrency exchange Help design and build new systems and features Enhance and maintain existing backend (PHP, TypeScript, Java) systems Enhance and maintain existing frontend (React, Vanilla JavaScript) systems Collaborate with stakeholders and engineering teams across the organization Work with engineering managers and product managers to gather business requirements and deliver solutions Be empowered to drive new initiatives and make a real impact What you’ll bring to the team: 2+ years of full-stack web development and application engineering experience Experience with one or more backend scripting languages (PHP, Node.js, TypeScript) Experience with one or more frontend frameworks (React, Vue.js) Experience with version control (preferably Git) Solid SQL and relational database knowledge (MySQL, Postgres) Proficiency with at least one unit testing framework Comfort shifting gears and working on an evolving product without having all the answers A willingness and desire to use pair programming, communication, and iterative efforts to provide the best possible results"}