{"title":"Youth Leadership Advisor NEW!","location":"","salary":"","description":"","term":"$11 to $12 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIaCxJ-5xZ7do6XUbIS7Vf4E5fmdUMD9elSntDfqZv4HH8S7YvgbRomW2rM3gMgLNmZZT09ktX5wvXlXspws0BZVPx0fN3L61uSrl3956AeOCET-Ni6_oqQKgzMLPmJL-whXuEiywciuwMGWPljOZOnopBFibDfn8PFnfq5IoEs4D6fJ9JNeNFYRQAZ4bo","source":"ziprecruiter","full_description":"Youth Leadership Advisors (YLA) employed by Riverview Christian Academy are to provide at-risk teens with supervision and support in the areas of education, interpersonal communication, daily chores, spiritual growth, life-skills development, and family relationships based on Biblical principles. YLA’s with Teen Rescue are in a ministry position and are to exemplify Christian values both on and off duty and demonstrate the Love of God in all dealings with students and staff.YLA’s use Biblical principles to guide students to work through issues related to drugs, alcohol, sexual abuse, eating disorders, adoption, and dysfunctional family dynamics. YLA’s also provide one-on-one support in the classroom. This includes tutoring, grading student homework assignments and assisting the School Administrator as needed.YLA’s have a high level of dedication, energy, and patience; possess excellent inter-personal skills coupled with a desire to engage and interact closely with staff and students. YLA’s will engage and interact with students in several ways ranging from outdoor physical fitness activities such as hiking, various sports, and other exercise related functions; modeling life skills and preparation for joining the workforce. YLA’s are responsible for building positive relationships with students and giving them an understanding of God’s loving character and provide them with the hope, direction and skills needed to become healthy adults.Our environment is a family atmosphere built on exceptional morals, values and ethics and based on the ten pillars of:Safety, Order, Kindness, Respect, Belief, Collaboration, Accountability, and Authenticity, Integrity, and Hope.It is our desire to see students and staff reach their full potential. Opportunities for personal growth and career progression exist within Teen Rescue.QualificationsMinimum age requirement is 21 years old. Only hiring female staff currently. YLA’s must be spiritually mature with great communication skills and have a willingness to learn. A heart for working with troubled teens is vital, as staff are responsible for providing the love and support students need, while maintaining the discipline and accountability required. YLA’s serve as role models to students with respect to mature appropriate behavior, problem solving and coping responses, initiative, active listening and other social skills, punctuality, grooming and dress, and accepting direction from the Director and other managerial staff.The ideal candidate will possess the following traits:Detail-oriented -- quality and precision-focused; would rather focus on the details of work than the bigger pictureTeam-oriented -- cooperative and collaborativePeople-oriented -- enjoys interacting with people and working on group projectsDependable -- more reliable than spontaneousAdaptable/flexible -- enjoys doing work that requires frequent shifts in directionInnovative -- prefers working in unconventional ways or on tasks that require creativityHigh stress tolerance -- thrives in a high-pressure environmentListening Skills --The ability to listen to and understand information and ideas presented through spoken words and sentences.Speaking Skills --The ability to communicate information and ideas in speaking so others will understand.Problem Sensitivity — The ability to tell when something is wrong or is likely to go wrong.Valid driver’s license is required.Average characteristics of job duties and responsibilities include, but are not limited to:● Ensures students safety and well-being; actively supervises students in accordance with each student’s needs,program policies and procedures● Maintain students’ schedule● Supervise student chores● Take students to appointments off campus● Individual prayer with students● Assisting students with Christian curriculum and issue talks● Tutor students in institutionally recognized academic and Christian courses● Facilitate physical education sessions● Participate with students in off campus church services: Facilitate discussions based on biblical principals● Coordinate extra-curricular activities and off-campus field trips"}