{"title":"iOS Engineer (Consumer Apps) - San Francisco/Seattle","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKMnYZp8Sch-lR6Gq3thDHxa9Os06ikU8MdIPDBjcaFf7sU7GMDLorPsa4pAnTumJzw0hGlMHw_yJuwE83enG-BxQuNfIeGx0nyrbV1FMObvo3czqe_GJd6F1AXJYnYZ_iDCAHdN2kSsv0Dz0b2ETOBFFBDF8GO70HBwDwh0Zdt5Bag8-12T-cuvYhNUHz_","source":"ziprecruiter","full_description":"Redfin is revolutionizing the $75 billion real estate industry. We use data, beautiful software, and innovative design to put customers first at every step in the home-buying and selling process. Get ready to dive headfirst into our award-winning mobile apps, solving complex business problems in a highly visible, customer-centric way. If you value doing great work in a collaborative environment, join our team!As an iOS engineer on the Consumer Apps engineering team, you'll join a passionate team working to build engaging experiences to make it easy for users to find their next home. We support the infrastructure to ensure our app is fast and stable and build features for our customers that allow them to interact with the home buying experience while on the move.The RoleDesign and implement complex, technical projects that change the way people make one of the biggest decisions of their lives.Collaborate with your teammates by reviewing code, writing documentation, refining best practices, and building maintainable and testable codebases.Work closely with our product and design teams to understand user and business needs.Drive the team forward in iOS best practices and design principles, bringing in industry trends where applicable.Who You AreYou continually obsess over improving the user experience, whether it's collaborating with product managers and designers to build beautiful products or finding and squashing performance bottlenecks.You have 3+ years of development experience with at least 2 years of iOS experience.You have practical experience building iOS applications in Swift and Objective-C, and a solid understanding of computer science and engineering fundamentals.Effective communication: you can collaborate across distances and experience levels, and you can disagree constructively with respect for everyone's opinions and ideas.You stay on top of what's happening in the iOS community and are always looking for ways to improve the products you make.You love working with a smart, talented team because you know that makes you better.You have a passion for well-architected, clean, well-written code.Experience with running experiments and experimentation frameworks a plus.We OfferA mission that matters. So far, we've helped over 54,000 people buy and sell homes, saving them over $336M in fees!Competitive compensation packages with a salary, bonuses, and stock grants.Generous benefits, including three weeks of paid vacation, medical, dental, and vision insurance, and fully paid family leave.Support and resources to continue learning, a brilliant team with which to collaborate, and a commitment to your career so you can grow with the company under a management team that has experience building startups into profitable, publicly traded companies.Redfin is an equal opportunity employer committed to hiring a diverse workforce."}