{"title":"ConvergeHEALTH Product Engineer - iOS Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIk86KdLJZeWGyMlnrFzCOv5wHZ70OvSY5w02FagYadbMFbVES6O32MpCnBDZMFFzSi1WEG_w3DCwPiuq3qnyKftqTWcVqSOLTDNW1R9sbFeG7UuuA3v1VBd9gM7JUI_go74l79cdF1CCSpSwCFOXiaOQecPKV2SEROaSdo5A65bZdtPlJ49HmJt-qLRNc","source":"ziprecruiter","full_description":"ConvergeHEALTH Product Engineer- IOS DeveloperAbout Deloitte Consulting Innovation PracticeDeloitte Consulting's Innovation practice is a Service Area within Deloitte Consulting whose goal is to build an environment and culture of continuous innovation to drive profitable revenue through the identification and incubation of breakthrough ideas in new and adjacent businesses and markets.Deloitte's commitment to innovation inspires our clients to new possibilities. From innovation labs to fresh new products and services, we deliver value at every turn. Working with clients, we explore new approaches to critical business issues. Our innovation agenda is designed to deliver tangible results in the near-term, and sustainable competitive advantage for years to come.About ConvergeHEALTH by DeloitteConvergeHEALTH supports the information-based transformation of healthcare by enabling healthcare and life sciences organizations to answer the \"hard questions\" in healthcare-what works, for whom, why, in what context, and at what cost? ConvergeHEALTH brings powerful analytics platforms and data models from Recombinant, advanced proprietary and open source analytics, content and benchmarks from collaborations with industry leaders such as Intermountain Healthcare, and significant experience from Deloitte Consulting LLP's Life Sciences and Healthcare practice to help our clients survive and thrive in the new paradigm of value-based, personalized medicine. Our mission is to enable a \"learning healthcare system\" where each encounter with the healthcare system becomes a learning event that will lead to greater efficiency, higher quality care and sustained innovation, to the benefit of improving patient outcomes.Responsibilities for iOS Developer Design and build advanced applications for the iOS platform (Swift and Objective-c ). + Collaborate with cross-functional teams to define, design, and ship new features. + Work on a new development, bug fixing and improving application performance. + Continuously discover, evaluate, and implement new technologies to maximize development efficiency.Qualifications: Bachelor's degree plus 3-5 years of hands-on mobile app development experience. + Proven working experience in iOS software development and proficient with Swift 4.0 , Objective-C, and Cocoa Touch in XCode development. + Experience working with iOS frameworks such as CoreData, UIKit, WatchKit, HealthKit, ResearchKit and CareKit. + Experience with third-party libraries, custom libraries and APIs. + Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies. + Solid understanding of the full mobile development life cycle. + Experience with source control such as Git, Bitbucket, Stash. + Experience with RESTful APIs to connect to back-end services and OAuth 2.0. + Have published one or more iOS apps in the app store. + Limited immigration sponsorship may be available. + Ability to travel up to 20% (While 20% travel is a requirement of the role, due to COVID-19, non-essential travel has been suspended until further notice.)Preferred Qualifications: Experience developing backend applications with AWS, Java or NodeJS. + Experience writing some Javascript, HTML5, and CSS. + Healthcare experience.How you'll growAt Deloitte, our professional development plan focuses on helping people at every level of their career to identify and use their strengths to do their best work every day. From entry-level employees to senior leaders, we believe there's always room to learn. We offer opportunities to help sharpen skills in addition to hands-on experience in the global, fast-changing business world. From on-the-job learning experiences to formal development programs at Deloitte University, our professionals have a variety of opportunities to continue to grow throughout their career. Explore Deloitte University, The Leadership Center. (https://zoomforth.com/s/deloitte/du#home)BenefitsAt Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits.Learn more about what working at Deloitte can mean for you. (http://www2.deloitte.com/us/en/pages/careers/articles/life-at-deloitte-benefits-and-rewards.html)Deloitte's cultureOur positive and supportive culture encourages our people to do their best work every day. We celebrate individuals by recognizing their uniqueness and offering them the flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. We offer well-being programs and are continuously looking for new ways to maintain a culture where our people excel and lead healthy, happy lives. Learn more about Life at Deloitte. (http://www2.deloitte.com/us/en/careers/life-at-deloitte.html?icid=top\\_life-at-deloitte)Corporate citizenshipDeloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte's impact on the world. (http://www2.deloitte.com/us/en/pages/about-deloitte/articles/deloitte-corporate-citizenship.html)Recruiter tipsWe want job seekers exploring opportunities at Deloitte to feel prepared and confident. To help you with your interview, we suggest that you do your research: know some background about the organization and the business area you're applying to.Check out recruiting tips from Deloitte professionals. (http://www2.deloitte.com/us/en/pages/careers/topics/recruiting-tips.html)Category: Management ConsultingAbout Deloitte As used in this document, Deloitte means Deloitte LLP and its subsidiaries. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law."}