{"title":"R&D Aerosol Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ435B4gi2tQSUfHowLkBsTglje63SdnM78pT5HA_Kui4u4VMSS2CLUuEzZY_2DsOBcF3j4lfH2GOu1kDoejRv25CoCgS1st5rb_cL0WzO9TrnscwzHkMIxzoJTtka3jHXbo6I8vfGN97-FiPuCSoi-pz6wUwm08nhR5l8UxYvHdDxnFkfH0uLwO6xPuGEn","source":"ziprecruiter","full_description":"R&D Aerosol ChemistTri-Pac, Inc. a contract development and manufacturing company (CDMO) specializing in liquid and aerosol filling for personal care and pharmaceutical marketers, is seeking an experienced R&D Aerosol Chemist for immediate addition to our fast growing team. Primary FunctionsFormulation and reverse engineering of topical, oral, cosmetics and personal care products for aerosol and liquid formats, employing GMP & GLP methodsFormulation with Propellants, Bag on Valve technology, Foaming technology, emulsions, gels, mousses, Medical Devices and OTC formulationsGrowth by design through innovation and R&DDrive new business opportunities through packaging, formulation and dispensing technologiesExperience in 21 CFR 210/211/820/ 700-740Expertise and subject matter experience in technical aspects and troubleshooting of aerosol and bag on valve developmentsExperience in lab, pilots and scale upsCollaborative approach with validation and engineering teamsDocumentation and recording techniques per GLP, GDP and GMP guidelinesConducts and tracks all required performance and stability tests, interprets, records and reports resultsOther responsibilities as assigned by the Technical ManagementCore Competency & RequirementBachelor of Science in Chemistry or related discipline required with a minimum 5-7 years' experience in formulation development with a majority of this experience working with aerosols, foams and BOV technologiesMaster of Science degree in related discipline preferredGrowth by design, trends and innovationIn depth knowledge of principles of otc, medical device and consumer productsAbility to formulate and test product formulationsSelf motivated and highly structuredAbility to communicate effectivelyDetail OrientedKnowledge of lab Instrumentation including GC, HPLC, FTIRGMP, GLP, GDP, LIMSBenefitsCompetitive Salary/ Pay & Packages, Vacations, Insurance, 401K, Life Insurance, Disability (Long term/ Short term) and Continuous Training. Work where you are HAPPY! Tri-Pac, Inc. also recognizes the importance of continuing education and offers Education Assistance to our employees to encourage continued personal development and growth.www.tri-pac.usThank you for your interest and consideration of a career with Tri-Pac, Inc.Tri-Pac, Inc. is an Equal Employment Opportunity / Affirmative Action EmployerTo Staffing & Recruitment Agencies: Our Company does not accept unsolicited CV's or applications from agencies. We are not responsible for any fees related to unsolicited CV's or applications and explicitly reserve its right to contact candidates presented in such unsolicited CV or application.COVID-19 considerations:All employees are mandated to wear masks while in any of the facilities. All employees are mandated to wear face shields, booties, hair nets and other PPE as required.Powered by JazzHRaPp2X9PnXo"}