{"title":"Customer Service Representative NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJNP_Pxq0wmbwnAWrvydH8ze1A0ibog4vTlVfV4zqU7J5Zf5NFoZj-iKUFVUliLE0QoPMNXFwsyyo-j0IGtnmwUrdpjjbK3xVw-mCeZ4KVcqpExzzwIkIN54tW662AgUzrzJvg9aMKnljP9PHnlgGT-MYgteOlNmcg816vCfOpp0rq3yOYKimO7YqyX6j_J","source":"ziprecruiter","full_description":"Dewitt Move Worldwide seeks to hire an experienced professional, with excellent customer service skills, to assist our transportation and logistics department with customers moving household goods and personal effects around the world. This compensation range for this position is $16-$18 p/hr depending on experience.Hours: Monday-Friday 8am-5pmDuties and Responsibilities:Interacts with customers via telephone, email, or online chat to provide support and information on services.Collects and enters orders for new or additional services.Fields customer questions and complaints; when the issue is beyond the representative’s knowledge, forwards to the assigned specialist or other appropriate staff.Ensures that appropriate actions are taken to resolve customers problems and concerns.Maintains customer accounts and records of customer interactions with details of inquiries, complaints, or comments.Performs other related duties as assigned.Qualifications:Two (2) years’ experience in strong administrative and customer service skills. Including, answering phones, typing activities, data entry, reviewing and validating customer documentation.Transportation and moving experience required.Strong verbal and written communicationWorking in a networked environment using Windows and/or Windows like interface using Microsoft office suite such as Word, Excel, Power Point and Outlook at a proficient levelHigh school diploma or equivalentBenefits:Medical & DentalFSA & Guardian BenefitsPaid Time Off401KPaid Holidayshttps://www.thedewittcompanies.com/ccpa/Equal Opportunity Employer: Women/Veterans/Minorities/Disabled"}