{"title":"Field Service Technician II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIBnzR1sK1WCUOPYnMJyUpA9-bE7PW1znGqXFimm3I0wkHlUAauz7KKaREqOn5D4J1o12gioxMsEUOqPMZb-neAz7xkS4BnYFmg6-s5p0HUJlXJv993afxH_6vQfX_4JRe1b5HPTVzVOWlKC0BskMak4mijBGvfiqwHgN4nVSDafxbkYKeSRiNBEFgxcB_d","source":"ziprecruiter","full_description":"The Field Service Technician II has a proven electronics background with at least 2 years’ experience in a lesser role or 3 years’ experience in a casino technical role. This position is responsible for the servicing, installing, converting, upgrading and preventative maintenance of all AGS gaming equipment. The Field Service Technician II position does not work standard set hours as work activities may occur throughout a 24-hour day, 7 days a week, including holidays. This position reports to the Field Service Supervisor.ResponsibilitiesCan provide technical training on most aspects of installations, theme changes, game software upgrades, server upgrades, etc.Part of advanced support team sent in to troubleshoot and resolve technical problemsPerforms site surveys at new Class II or Class III locations and functions a primary liaison with IAA for communicating project requirementsExpert contributor to field service message boards and provides documentation for technical assistance with known problemsCompletes all required preventive maintenance in a timely manner without proddingCan easily identify replacement parts and their associated part numbersMust be skilled at performing all gaming-specific work ordersWill complete Site Surveys (Technical Info tab) for basic work ordersPerforms project management activities for basic work ordersGood understanding of computer networking infrastructureFamiliarity of all AGS slot platforms and electronic table game equipmentStrong working knowledge of slot cabinet topography and ability to diagnose and troubleshoot problems from top to bottom of machinePerforms preventive maintenance and general maintenance on AGS slot machines and cabinetsMay participate in installations or removals of old machinesCompletes all reports and paperwork in a timely mannerMust have excellent customer service skillsSkills/RequirementsHigh School diploma or GED requiredMinimum of 2 years’ experience as a Field Service Technician I or 3 years’ experience working in a technical gaming environmentRequirement to obtain licensing approval by tribal and/or state gaming regulatorsMechanically inclined; ability to use hand toolsMust be able to move 75 lbs. assistedWill provide technical support to Field Service Technician IMust have a good working knowledge of customer’s policies and procedures prior to performing work ordersAdvanced understanding of AC/DC electronics; must pass AGS online AC/DC electronics courseCan use a multi-meter to troubleshoot electrical issuesHighly developed problem-solving skillsUnderstands networking with CAT5 and fiberHigh proficiency in multi-platform installs/upgrades/theme changesSome working knowledge of the difference between Class II and Class IIIBasic understanding of computer networkingNote: All offers are contingent upon successful completion of a background check and drug screen*Posted positions are not open to third party recruiters and unsolicited resume submissions will be considered free referrals.AGS in an equal opportunity employer."}