{"title":"Software Engineer","location":"San Jose, CA","salary":"","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">Effectively partner with <b>software</b> development, QA, and release teams solving hard problems and improvements.</li>\n <li>With a razor sharp focus on well tested, performant…</li>\n</ul>","term":1,"jk":"cc78fb370a3404ff","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=cc78fb370a3404ff","source":"indeed","full_description":"Join us as we pursue our disruptive new vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun and most importantly to each other’s success. Learn more about Splunk careers and how you can become a part of our journey!\nRole:\nSplunk is the only purpose-built Security Automation & Orchestration platform, and the first to provide an open growing and community for sharing playbooks, apps and new technologies. It makes security smarter, faster, and stronger.\nWe are looking for an exceptionally motivated Operating System and Python Developer with a solid grasp and real passion for security to extend the capabilities of our premier platform. With a razor sharp focus on well tested, performant code, come help protect the world's networks.\nResponsibilities:\nDesign and implement new features to reduce mean-time-to-resolution of security events\nAbility to troubleshoot, diagnose, and develop the platform specifically at the operating system level - Installation, Upgrade, and Maintenance\nAct as a liaison between development teams and support teams, developing support runbooks to make the support team more effective at their role while offloading repetitive support issues from engineering.\nEffectively partner with software development, QA, and release teams solving hard problems and improvements\nClearly communicate complex ideas and improvements to co-workers and interested parties of all skill levels\nRequirements:\nPassionate about Python, scripting, automation, and development\nGood understanding of operating system level shell scripting, RPM/package installation, dependency debugging, file system behavior and performance\nGood understanding of functions, improvements, classes, comprehensions, exceptions and problem solving in Python is a huge plus\nUnderstanding of the threading limitations of Python, multi-process architecture, fundamentals and analytical skills.\nTake pride writing reusable, scalable, testable, and rapidly growing efficient code\nFamiliar with unit testing, Exceptional debugging skills\nDeep understanding of code versioning tools (e.g. Git) is a huge plus\nProficient and growing understanding of REST APIs and requests module\nExperience and real passion for Security and new technologies is a plus.\nBachelor's Degree in Computer Science or equivalent experience.\nWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.\nFor job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records."}