{"title":"Technical Project Manager (Telecom) NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAKEgY_dLtcAwiaZydRfyxQD1RzJS1eXInznuqvUUOSBt4iNUNXUKLCTbBDO4QBiHPhDWUO_qpApwH-zlrcaTUhH-6AV5auYDy0xwts5sqrUK-5cMFq6tuKcRyb69MAwTYtIyr8mD4NiVdm1q_D9eyI3mdESCdsjVgcbVFuI_JpyfCrAP3D0X76qZwKx4cPr","source":"ziprecruiter","full_description":"The 12-month contract Technical Project Manager role will support the implementation of multiple technical projects to refresh and harden the optical and IP networks to improve availability and to support next generation services. The total capital expenditure of projects in scope is in excess of US$20M. We are looking for a candidate with a strong understanding of large scale network architecture, planning, engineering, and implementation phases of network hardening projects. In scope projects include but not limited to the replacement of end of life hardware at a very large scale, software upgrade to core routers, POP builds, equipment decommissioning, capacity augmentation, telemetry implementation, network integrations, and circuit migrations. The ideal candidate will possess technical knowledge and working experience in multiple disciplines of building large scale telecom networks supporting enterprise customers. ResponsibilitiesManage the overall planning, execution, and delivery of a number of concurrent projectsPrepare technical and financial documentation and reports for internal and external stakeholdersWork closely with architecture, planning, and engineering teams in resource planning, prioritization, and implementation activities.Plan and complete projects on timeTrack project status as well as manage and escalate project issues and risks as appropriateContribute to the development and sharing of project management best practices within the CTO organizationQualificationsUniversity degree in Computer Science, Computer Engineering, Electrical Engineering or related field with 5 to 10 years of related experience in telecommunications or service provider industryHigh level understanding of design, planning, costing, and implementation of telecommunication services and architecture including Ethernet/IP, MPLS, SONET core and edge switches, metro/long haul CWDM/DWDM systems, and fiber constructions.Experience translating technical information into non-technical languageAbility to synthesize disparate sources of information into a cohesive narrativeHigh level of professionalism with outstanding ability to work effectively and efficiently with peers and with all levels of managementExcellent time management skills as well as the ability to work independently and handle multiple projects simultaneouslySuperior written and verbal communication skills, and the ability to capture an audience during a presentationExperience with Salesforce, SiteTracker, Google Workspace, Jira, and Confluence PreferredPMP certification or equivalent project management experience requiredEnergy, passion, humor, compassion, and enthusiasm"}