{"title":"Android Developer (contract)","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJXMhf0bjfSrBTdLEWecfuuR-S60VRgwiVx-aes3thwNuvr2LyXpy0uXoJ0uKmD0QloFitOyLBA9Mkd6T8TkZdqsz3iv1EXV2fFnGfVX_3ugbgn5WKqavqCZopo4Sxd-6VTzRsrKUY3prwvKmBOyR0Kju8pFiLqHdQ98BboYGFub5d_4Guv38oF7h2Lpz5Q","source":"ziprecruiter","full_description":"Duration: 6+ monthsResponsibilities:Translate designs and wireframes into high quality codeDesign, build, and maintain high performance, reusable, and reliable Java codeEnsure the best possible performance, quality, and responsiveness of the applicationIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatizationSkills:More than 6 years of experience.Banking ExperienceStrong knowledge of Kotlin, Android SDK, different versions of Android, and how to deal with different screen sizesFamiliarity with RESTful APIs to connect Android applications to back-end servicesStrong knowledge of Android UI design principles, patterns, and best practicesExperience with offline storage, threading, and performance tuningAbility to design applications around natural user interfaces, such as “touch”Familiarity with the use of additional sensors, such as gyroscopes and accelerometersKnowledge of the open-source Android ecosystem and the libraries available for common tasksAbility to understand business requirements and translate them into technical requirementsFamiliarity with cloud message APIs and push notificationsA knack for benchmarking and optimizationUnderstanding of Google’s Android design principles and interface guidelinesProficient understanding of code versioning tools, such as GitFamiliarity with continuous integrationThe Capgemini Freelancer Gateway is enabled by a cutting-edge software platform that leads the contingent labor world for technology innovation. The software platform leverages Machine Learning and Artificial Intelligence to make sure the right people end up in the right job.A global leader in consulting, technology services and digital transformation, Capgemini is at the forefront of innovation to address the entire breadth of clients’ opportunities in the evolving world of cloud, digital and platforms. Building on its strong 50 year heritage and deep industry-specific expertise, Capgemini enables organizations to realize their business ambitions through an array of services from strategy to operations. Capgemini is driven by the conviction that the business value of technology comes from and through people. It is a multicultural company of over 200,000 team members in more than 40 countries. The Group reported 2018 global revenues of EUR 13.2 billion."}