{"title":"Video Game Tester","location":"Gilroy, CA 95020","salary":"\n\n$22 - $57 an hour\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li style=\"margin-bottom:0px;\">There is up to a $25,000 signing bonus for exceptionally qualified applicants.</li>\n <li style=\"margin-bottom:0px;\">Be between 17-39 years old.</li>\n <li>Not have any felony convictions.</li>\n</ul>","term":1,"jk":"35b2d9fbc6e662ff","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=35b2d9fbc6e662ff","source":"indeed","full_description":"We are looking to fill numerous positions in the video game testing/esports department for the US Navy. There is up to a $25,000 signing bonus for exceptionally qualified applicants. The ideal candidate will:-Be between 17-39 years old-Not have any felony convictions-Be a US Citizen or Permanent Resident-Be able to pass a basic math and English aptitude test-Be in Gilroy or the local area-Have a High School Diploma or GED-Be able to pass a drug test, and a background check as applicable by Federal, State, and Local laws-Be willing to relocate if requiredThe US NAVY is branching out into ESports, Video Gaming, Social Media, and Video Game Testing and we are looking for you! Ever wanted to get paid to play video games? Ever wanted to travel the world and be a brand ambassador? Submit an application or call 408-209-0644!Job Type: Full-timePay: $22.00 - $57.00 per hourBenefits:401(k)401(k) matchingDental insuranceDisability insuranceEmployee discountHealth insuranceLife insurancePaid time offParental leaveProfessional development assistanceReferral programRelocation assistanceRetirement planTuition reimbursementVision insuranceSchedule:10 hour shift12 hour shift8 hour shiftWeekendsSupplemental Pay:Bonus paySigning bonusCOVID-19 considerations:To keep all parties safe, applicants will be screened for COVID-19 exposure, and will have their temperatures taken. Masks and hand sanitizer are available, and social distancing will be enforced. Phone interviews are available on a case by case basis.Education:High school or equivalent (Preferred)This Job Is:Open to applicants under 18 years old, provided it is legally allowed for the job and locationA good fit for applicants with gaps in their resume, or who have been out of the workforce for the past 6 months or moreA good job for someone just entering the workforce or returning to the workforce with limited experience and educationOpen to applicants who do not have a college diplomaCompany's website:www.navy.comCompany's Facebook page:www.facebook.com/navygilroyWork Remotely:No"}