{"title":"Senior iOS Engineer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAK2fc72lTmqF8k_XMXd7OXjXLzaWDQYpIBWbKSxlSmWsU3pvshCRgEB7efwohiOPcXyTIDAyysH10sJCinnNd81D6Apt1Y3qZyNgI_chwOJM-Ht0UxV4bshF_QOPld2UaLbM3hi8KjjiegewBV4eeYpGuSRyzdxi7IUa_5ZScY7dv_wfNcFvdVRSe-ZrU0","source":"ziprecruiter","full_description":"We have an immediate need for a Senior iOS Engineer with our client in the Financial Services Industry. This is a 12 month contract opportunity with long-term potential and is located in Charlotte, NC. Please review the below job description and contact me ASAP.Position SummaryFocus on setting technical direction on groups of applications and similar technologies as well as taking responsibility for technically robust solutions encompassing all business, architecture, and technology constraints. May be responsible for coordinating teams to accomplish development in a matrixed organization. Required SkillsDesign, Develop & Prototype iOS native customer application for phone and tablets for internal and external use. Participate in full app life-cycle: concept , design, build, deploy, test and release to app store Work with product teams on new product ideas, designs, prototypes and estimate. Keep up-to-date on current and upcoming features in relevant products and platforms. Drive a best practices approach to the continuous improvement of our products, processes, and tools. Write and maintain documentation for all features in development.Desired SkillsExperience working with iOS Mobile Application technologies. Demonstrated interest in technology, technology-related issues and analytical analysis. High performance and standards as demonstrated by academic or previous job experience. Effective collaborator with both non-technical and technical team members. Motivated self-starter with a high attention to detail. Ability to thrive in a fast-paced, team-based environment. Strong written and verbal communication skills. Strong focus on troubleshooting and issue resolution."}