{"title":"Senior Consultant - Salesforce Administration","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALuQ9YWfNvawK5LbUuoXlctrTnLmf7AJfOQduYUzNiaSARKw2g52vzt6XDd1pHEfy-SIhlHiei78NwxTvcO7VliqgTal7mBfkfPinXr3GESgSa0A9-MWBD2EYy2GVrZkjyYBXX_nFqbQg_g_Lyf4Ya7vcnPhf6tN2T3H-sFp4bgQzP_Htc3c_O_ngcGH_s","source":"ziprecruiter","full_description":"About YouI am a certified Salesforce trailblazer with a passion for helping clients achieve rapid business value and long-term success on the Salesforce Customer Success Platform.I am consultative in nature and have a passion for and experience in helping my clients to succeed.I am thoroughly organized, have exemplary attention to detail, and demonstrate strong analytical and communication skills.I am an industrious team-player; I’m not afraid to roll up my sleeves and work diligently on any task.I love to help plan or lead client-facing meetings.I thrive when working with senior-level members of my team to ensure project goals are met.I am passionate about the company I work for and love to help with internal initiatives.I bring an innovative spirit and a superior work ethic to every engagement.I excel when working with a team, even when faced with demanding deadlines.Job DescriptionAs an OnPrem Senior Consultant with Salesforce Administration experience, you will engage in several technology and business consulting projects ranging from the implementation of technology solutions, to organization and process analyses. You will dive deep into the client business, working alongside a project team of other analysts, consultants and a project manager. You will identify risks and provide mitigation strategies, conduct initial reviews of deliverables and give feedback, provide project status to your Project Manager and/or client, and lead client meetings (e.g. stakeholder interviews, workshops, etc.)Our consultants work at our client sites. As with all consultants, you should be willing to travel on occasion for work. In this role, you may have an opportunity to mentor junior resources.About UsWe’re in the business of making businesses better—people, processes, and systems. We’re an end-to-end technology solutions provider focused on connecting disparate parts within organizations. We bring a balance of IQ and EQ to every engagement, and a depth of business and technical acumen to every problem. We are a team that is driven by following through for our clients, and being upfront, honest and sincere.Requirements3-5+ years System Implementation, SDLC, Integration, and Project Management experience3+ years in consulting / professional services, big firm experience preferred2+ years of Salesforce administration experience, and at least 2 Salesforce implementationsSalesforce Lightning experience, with experience in deploying and managing custom controls and app exchange productsExperience managing code migration and environment synchronization using change sets/ant migration toolExperience debugging and fixing issues related to build (change set and salesforce ant migration tool)Experience debugging and developing workflows (e.g., Flow, Process Builder), approval flows, email templates, visual force components and custom controllers (apex)Maintain, enhance and create workflows, functions, and manage all aspects of security and configurations within the Salesforce.com environmentSalesforce analytics experience configuring dashboards, reports and other reporting elementsExperience with client facing activities such as requirements gathering, meeting facilitation, and deliverable review/approval sessionsExperience with project planning, including tasks, budgeting, and resource allocation and balancingExperience with software development lifecycle (SDLC) principlesBachelor's degree in engineering, information systems, computer science, business administration, or other related fieldsPreferredExperience in Media & Entertainment/Broadcast and/or Consumer Products industriesExperience at a large consulting firm (e.g., Accenture, Deloitte, EY, CapGemini, PWC)"}