{"title":"Technical Escalation Specialist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKGyNk0tTViWTLLWCSJ1PmSgws1glgnyxUzTtksUNljKMJr7Q_cefKcjOsaj2FvpyTz5wFliUAwxc9P9MBTXUmut2Cnab83-5DZM4uGtsGTk46u_xuDNb7k-7k4v1Om9XBNBzEwgC_P8guJM7DVs6MNs4dqrRpTVJ2BKjuN2pZD8nTjzF68rdmfFxoRrCBq","source":"ziprecruiter","full_description":"The Role:Privy is on the lookout for a Technical Escalation Specialist, dedicated to resolving questions and technical problems for both our customers and internal audiences with poise, positivity, confidence, and professionalism. As the main point of contact between our customers and our company, you play a pivotal role in ensuring our customers' professional success and happiness through email, chat, and phone. You are resourceful, patient, and determined while guiding customers and your peers through advanced technical issues. You are technically oriented with a driven-mindset to troubleshoot and are able to provide or create clear documentation.Experience at other SaaS companies and/or with marketing tools geared towards small and medium-sized businesses will give you the background for understanding how Privy fits into our customers' marketing ecosystems. Comfort with these kinds of tools and with software, in general, are essential for this role. A moderate understanding of HTML/CSS languages to help forefront the more difficult problems our merchants face is required. You are motivated to develop an in-depth knowledge of the software and services and can promptly evaluate the customer's technical capabilities on the product to ensure the interaction is fluid. You'll also act as a liaison between customers from all industries and internal audiences. You'll represent the voice of the customer by tracking issues, and providing insight into customer feedback. Responsibilities and Tasks:Respond to questions from customers via email and live chat or outbound phone callsTroubleshoot, research, and resolve advanced technical questionsHelp customers use and get the most out of Privy's productsProvide a great customer experience and represent Privy's positive, customer-focused values in your communicationsUse Zendesk, Slack, Privy, and other software tools in your day-to-day workIdentify potential leads and hand-off to SalesLead workshops, peer training, and shadowing Submit feature requests based on customer feedbackHelp identify and escalate bugs and act as a liaison between the Customer and Product teamsMonitor the escalated ticket queue and work respectively with our Engineering team to prioritize, relay information and resolve conflictsForefront advanced questions stemming from merchants and internal teams for our Engineering teamAble to identify but not dedicated to resolving JavaScript or CSS conflicts Assist with advanced customizations for higher-paying merchants Candidates Should Have: 2+ years of Customer Service experience requiredExperience in SaaS-based company preferredExperience with eCommerce or marketing tools a plusImpeccable judgmentEmpathetic disposition Excellent written and verbal communication skillsAbility to stay focused and positive when under pressureAbility to explain complex topics simply for non-technical audiencesAbility to properly understand and convey tone via written communicationsModerate understanding of HTML and CSS languages requiredFamiliarity with using and navigating the developer console Previous experience with tracking and debugging issues is preferredExperience with Zendesk, Salesforce, GitHub or Jira, or similar tools is a plusYour Team:"}