{"title":"Developer III - EDI","location":"Rancho Cucamonga, CA 91730","salary":"\n\n$111,550 - $142,230 a year\n","description":"\n<ul style=\"list-style-type:circle;margin-top: 0px;margin-bottom: 0px;padding-left:20px;\"> \n <li>Under the direction of the EDI Technical Manager, the EDI <b>Developer</b> III designs, developments and implements all enhancements and new systems as well as…</li>\n</ul>","term":1,"jk":"9ab570fea98574ee","detail":"https://www.indeed.com/viewjob?viewtype=embedded&jk=9ab570fea98574ee","source":"indeed","full_description":"Position Summary/Position\n\nUnder the direction of the EDI Technical Manager, the EDI Developer III designs, developments and implements all enhancements and new systems as well as oversees analysis and reporting related to Claims, Encounters, Eligibility, Pharmacy and other EDI systems and processes.\nRequired position will report to IT Supervisor or Manager. An EDI Developer III is expected to mentor other members of the team on development standards, best practices, quality and deliverable timeliness. Major Functions (Duties and Responsibilities)\n\n1. Design and development of solutions related EDI processes.\n2. Collaborate with other IEHP departments and data stewards to assess and prioritize needs, and assist with developing strategies, plans, policies and procedures related to providing effective EDI solutions.\n3. Design and implement effective solutions by utilizing best practice approach, making sure that new code is source saved and reviewed prior to implementation.\n4. Participating in interviews, surveys, brainstorming sessions, storyboarding, prototyping, and use cases.\n5. Mentor other members of the team on data quality, data completeness, data accuracy, and deliverable timeliness are built into every reporting solution\n6. Manage and prioritize user requirements to help manage overall project scope\n7. Discover, explore, analyze and document data from all source and target systems to better understand the total scope of data availability at IEHP\n8. Design, develop and implement processes and systems related to Encounters and other EDI processes.\n9. Identify and communicate issues and risks to management in a timely manner\n10. Contribute to development and enforcement of IEHP standards\n11. Gathers, analyzes requirements and develop processes and reports to meet business requirements\n12. Establish and maintain effective working relationships with others throughout the IEHP organization\n13. Demonstrate a commitment to support IEHP’s strategic priorities to become a 5-Star Health Plan and incorporate LEAN principles into daily work. Experience Qualifications\n\nSix (6) or more years in systems design, development and implementation of complex data driven processes.\nExperience in report writing and analysis.\nExperience in database design, query development, table joins and report development and creation.\nStrong development experience and database capabilities. Preferred Experience\n\nData analysis experience in the areas of medical or health services preferred. Education Qualifications\n\nBachelor's of Science degree from an accredited institution required. Preferred Education\n\nMaster’s degree from an accredited institution preferred. Knowledge Requirement\n\nKnowledge of EDI standards. Working knowledge of diagnosis and procedure coding, medical terminology, knowledge of managed care, claims payment processes, and insurance terminology preferred. Skills Requirement\n\nStrong expertise in Microsoft SQL Server, .Net, Database design.\nStrong data analysis.\nExcellent interpersonal/ communication skills.\nStrong analysis and critical thinking skills. Abilities Requirement\n\nAbility to multi-task while maintaining careful attention-to-detail.\nAbility to handle multiple projects, data input, strong problem solving capability.\nIndependent self-starter who is driven to success, takes great pride in accomplishments and works with a sense of urgency to meet deadlines and address competing priorities. Commitment to Team Culture\n\nThe IEHP Team environment requires a Team Member to participate in the IEHP Team Culture. A Team Member demonstrates support of the Culture by developing professional and effective working relationships that include elements of respect and cooperation with Team Members, Members and associates outside of our organization. Working Conditions\n\nWord processing involving computer keyboard and screens.\n\nStarting Salary: $111,550.40 - $142,230.40\nPay rate will commensurate with experience\n\nInland Empire Health Plan (IEHP) is the largest not-for-profit Medi-Cal and Medicare health plan in the Inland Empire. We are also one of the largest employers in the region. With a provider network of more than 6,000 and a team of more than 2,000 employees, IEHP provides quality, accessible healthcare services to more than 1.2 million members. And our mission and core values help guide us in the development of innovative programs and the creation of an award winning workplace. As the healthcare landscape is transformed, we’re ready to make a difference today and in the years to come. Join our Team and Make a Difference with us! IEHP offers a Competitive salary and a benefit package with a value estimated at 35% of the annual salary, including medical, dental, vision, team bonus, and retirement plan."}