{"title":"Recent Chemistry or Biology Graduates NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAKY4vhV20OwGOwWIoxKLJ5IC_Yz7Ny5K7XL1CtrUi544lrbfubmLTVmJVrsre8ygdiiiZeB7nfaAy8nRco9yGOUij1pPl9lms9dyf2kheMFoUWdtmYbTi87ftuKEZCPl3i5AzLpBoetV303A10yerFd0tauDpfYZzS7JLDpvpWBd1psEQohox_QIxp_Ux9S","source":"ziprecruiter","full_description":"Seeking recent Scientific Degree graduates with a Bachelor's in Chemistry, Biology, Biochemistry, Microbiology, or Biological Science.Responsibilities:• Strictly adhere to Current Good Manufacturing Practices (cGMP), Current Good Documentation Practices (cGDP), and Standard Operating Procedures (SOP) and report all discrepancies immediately.• Plan, schedule, prepare and maintain microbiological culture media samples and equipment.• Sanitize/sterilize equipment, facilities and materials.• Complete required documentation (MBRs, SOPs, checklists, etc) in accordance with cGMP and cGDP.• Maintain aseptic personnel certification and practice good aseptic techniques in performance of duties.• Record, retrieve and report data using GMP software.• Assist in training of personnel in assigned areas.• Aseptically collect and process microbial samples for assigned test areas (critical utility systems, aseptic processing environments and personnel, sterility, bioburden, BET, LAL, biological indicators, microbial identifications, etc.)• Perform routine analysis of raw materials, finished goods, products, packaging components, complaints, investigations per schedule and per standards/SOPs.• Collect and analyze critical utility and/or environmental samples.• Collect, calculate, and interpret test results.• Enter and report test results including LIMS Data entry.Education:• Bachelor of Science: Chemistry, Biology, Biochemistry, Microbiology, or Biological Science. Entry level OK.Skills:• Excellent written and verbal communication skills.• Excellent organizational skills.• Strong analytical skills.• Strong mathematical skills.• Strong computer skills.• Attention to detail.• Ability to multitask and adapt to changing priorities.• Possesses initiative and trouble shooting ability.• Should possess initiative, inquisitiveness and the ability to solve scientific problems.• Must be able to work on multiple projects at once."}