{"title":"Senior Quality Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIPCDMy5H2dlwWTiyr-FaRdwqM1lTeC9J16Lx25ooTf5s1kchqie8VIBh6YYKgcKp-MlY2EV-OBC-ayLjGugSicHAMIjAy7zwPzgx3bFXuTCtD44IO6VsTQOilS5H5qRMZ5WqGeHtOXzWlwiqvktjRcnequq5p_2HOfWjkMZJ6ZXwNpdM3AhCB9hAjd6wqL","source":"ziprecruiter","full_description":"Position Summary :  The Senior Quality Chemist will have responsibility for process/product safety testing, new vendor raw material evaluation, and Process Development experimental work.  The conclusions drawn should be based on sound scientific principals and based on data and/or statistics as possible.   The ideal candidate will demonstrate technical leadership and acumen to develop new analytical methods; test and qualify new analytical instruments; solve challenging quality issues related to Operations and customer complaints; and lead technical and capital projects as needed.  The Senior Quality Chemist must also demonstrate safety leadership through individual assignments and committee participation.   Essential Duties and Responsibilities:EHSEnsure area complies for all regulatory and process training.Experience with an MOC process a plus.Full participation in company, department and site safety programs including incident and near miss reporting, self-assigned safety action items.Business SupportInterface with others in various parts of the organization to ensure existing and future customer requirements are met.  These include Operations, Supply Chain, Sales and Marketing, Applications R&D, Process Development, Quality Assurance, Transportation, Accounting and other FMC sites.The main technical responsibilities for this position are as follows: Compare and resolve differences between customer methods and results and resolve the differences.Develop new analytical methods and introduce new instruments to support customers and business needs on an aggressive timeline.Work with company tollers to align test methods and results.Design and lead projects for packaging, product stability and shelf-life testing.Upgrade existing analytical methods for key products to meet IATF 16949 Standards, including adding an appropriate MSA section.Work according to priorities established by the Global Process Development Manager and provide regular updates.Document analytical methods and intellectual property (good written and oral communication skills required).Accountable for transfering new and improved lab methods and training of QA chemists on these methods (the training is usually done in conjunction with R&R studies so basic knowledge of statistical methods is required).Responsible for adhering to the quality programs, including ISO, NSF and cGMP. Interface with others in the organization to ensure internal and external customer deadlines and requirements are met.PeopleActively engage in the development of junior professionals; serve as a mentoring resource for the group.Responsible for planning, assigning, and directing work for projects where the Senior Quality Chemist is the project manager.Actively engage with people and customers remotely to drive results.Train QC chemists on new analytical methods.Supervisory Responsibility:  NoneEducation and Experience:B.A. or B.S. in Chemistry or related technical degree with 15 plus years professional experience or advanced degree with commensurate experience in an analytical laboratory.   Knowledge of and experience with Automotive Quality Standards IATF 16949 and/or process development a strong plus. Extensive experience with inorganic analytical techniques, including ICP-OES, required. Experience with ICP-MS a plus.Demonstrated history of new method development.Ability to speak Chinese, Japanese and/or Korean a plus.Knowledge and Skills Requirement:General working knowledge of plant engineering, quality assurance practices, and environmental management.  Experienced with business software systems (SAP); MS Office, MiniTab, and LQM.  Knowledge of advanced analytical skills and statistics with advanced computer skills. As a senior researcher, must have an ability to work independently to solve problems with minimal input. Familiar with ISO 9001, cGMP laboratory practices, and internal quality system auditing. An ability to conduct hands-on lab experimentation is required. Proven ability to lead teams, train and problem solve.  Good written and oral communication skills.Excellent interpersonal skills required including customer-interaction skills. Able to manage multiple tasks simultaneously.Other duties as assigned.Competencies:Technical / Functional skillsAction OrientedDrive for resultsCustomer FocusInformingStrategic AgilityPhysical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. While performing the duties of this Job, the employee is regularly required to sit and talk or hear. The employee is frequently required to walk and use hands to finger, handle, or feel. The employee is occasionally required to stand; climb or balance and taste or smell. The employee must occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision and color vision.Work Environment:  The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job.  While performing the duties of this job, the employee is occasionally exposed to toxic or caustic chemicals. The employee is occasionally exposed to wet and/or humid conditions; moving mechanical parts; fumes or airborne particles; outside weather conditions. The noise level in the work environment is usually moderate.Safety Requirements:  All employees are expected to carry out their work functions in a healthy and safe manner, to encourage and support safe work practices at all times, and to immediately report and/or rectify any unsafe conditions that may come to their attention.Personal Protective Equipment - Must wear PPE as required based on job duties. Travel Required: 10% travel to international plant sites and customers as necessary to perform the responsibilities of the role."}