{"title":"Sr. Consultant Android Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL1rFp3dLh0lhGMQhju0kk0LuPii_tqi5NrIIzKCMc_eIzzcs4icNJxHyt0Zu1xUNlx-qmcdm2z41QyN9IzHSetdsCsr_qC5H5nbIZXWQzbUgbBkzeXCfgGgl3pI8svUGr2-0rKcOFavidrMmoqUz0Y06OUssZ5XN6uPtN8e_aFwBXvw8Qtt9S5O0Sqa8I","source":"ziprecruiter","full_description":"About the roleWe believe that the best developers obsess over quality, consistency, and performance. As an Android developer at Avanade, you will be presented with an amazing opportunity to develop interesting and challenging mobile applications, and receive mentorship from some of the brightest minds in Toronto's Software Engineer Community. On your first project, you will be a part of an agile team - working alongside your colleagues and our client to write efficient and optimized code, gathering and working on requirements, and integrating with their organization to build and deliver a complex solution. In this role, you will be consistently collaborating with your fellow software engineers, product managers, scrum masters, and technical program managers.We take tremendous pride in creating the best bespoke software for our clients, and are thrilled that our team continues to learn and grow together.Day-to-day, you will:  Influence technical strategy to build products clients and their consumers will love   Contribute to all stages of the software development cycle, including definition, design, development and rollout of Android-based solutions  Participate in the integration of on-device solutions with enterprise services, including but not limited to content management, analytics, authentication and profile stores  Identify and fix bugs and bottlenecksAbout youYou have a passion for all mobile technologies, specifically Android development. Your background includes experience delivering native Android applications, with experience in Kotlin or Java. You likely have experience as a consultant, working with external clients on a regular basis.Your technical and business skillset likely includes:     Excellent knowledge of Java, and Kotlin      Experience in all parts of the Android development lifecycle including: application development (application structure; device and operating system Application Program Interface (API's); debugging; performance; security), deployment, updating, and roll-out, 3rd party integration points     Strong understanding of object-oriented programming and software design patterns     Experience with dependency injection and reactive programming (RxJava) frameworks     Experience with and a desire to learn other mobile technologies, including iOS, Flutter, React Native etc.     Experience with back-end architecture and implementation (web services, databases, security), on platforms and technologies such as Windows Server, Windows Communication Foundation (WCF), Open Data Protocol (OData), Azure, Structured Query Language (SQL) Server     You likely have a Bachelors degree in Computer Science (or equivalent experience) as well as 4-8 years of Android experience"}