{"title":"Senior Hardware Engineer - Cloud Hardware Infrastructure Engineering","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI56A9UPlzfgL-5rSGNibsvDZeT7AteJdrsY3YG-pyJT8cVee5VY3TFYC1iuecrwPP6MWhUPbGStIZ1DCLEDl_kE8ceA5nKNeRyv2hp16-u7Tl7zWtr5ENLaPn3qT_otwLWB6MFCtsgdnhJeAsZABGr6wDjky4MvBWS9ZWEPEC4did5liv1hKGSKzK_228","source":"ziprecruiter","full_description":"Microsoft Cloud Hardware Infrastructure Engineering (CHIE) is the team behind Microsoft's expanding Cloud Infrastructure and responsible for powering Microsoft's \"Intelligent Cloud\" mission. CHIE delivers the core infrastructure and foundational technologies for Microsoft's over 200 online businesses including Bing, MSN, Office 365, Xbox Live, Skype, OneDrive and the Microsoft Azure platform globally with our server and data center infrastructure, security and compliance, operations, globalization, and manageability solutions. Our focus is on smart growth, high efficiency, and delivering a trusted experience to customers and partners worldwide and we are looking for passionate, high energy engineers to help achieve that mission. As Microsoft's cloud business continues to grow the ability to deploy new offerings and HW infrastructure on time, in high volume with high quality and lowest cost is of paramount importance. To achieve this goal, the Cloud AI & Advanced Systems Engineering (CAASE) team is instrumental in defining and delivering operational measures of success for hardware manufacturing, improving the planning process, quality, delivery, scale and sustainability related to Microsoft cloud hardware. We are looking for seasoned engineers with a strong passion for customer focused solutions, insight and industry knowledge to envision and implement future technical solutions that will manage and optimize the Cloud infrastructure.Microsoft is seeking a highly motivated FPGA or ASIC design engineer to help build, test and deploy hardware accelerators for next generation networking, storage, and AI/ML applications. Azure has the largest deployment of cloud FPGAs in the world. Candidates should be able to drive projects with both hardware and software teams, and both inside and outside of Microsoft. Microsoft products touch the lives of millions of users daily, and this is a unique opportunity for hardware developers to see their RTL code go to production within weeks instead of years. Come help build one of the few truly hyperscale global clouds with innovations possible at every level of the computing stack.Candidates should have experience architecting, implementing and debugging interfaces such as Ethernet, PCIe and DRAM using SystemVerilog in FPGA architectures. Candidate should have a strong desire to learn how software solutions can be used to develop FPGA and/or ASIC solutions for Microsoft's next generation of cloud servers and applications. The candidate will contribute to a team developing IP for both FPGAs and ASICs. The successful candidate will be a strong communicator, creative, a critical thinker, and able to analyze and resolve complex issues.#AZURE #Cloud #CAASE Employment Type: Full-Time"}