{"title":"Associate Director - Network Engineering ( remote / work at home eligible )","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALISdYSrckba2Nx_6qes2m-jFwVRGYA87BEj9etYR4kzCivi1-nYeGskH-UWjFY1LDEQFQ_PKp9i8JrbP0CC4Yo_AjyRNq-6hK-F51CPD3FdIeIpp-WgRkwjXtn49YEATuey6HpFd4VA1iaWwKSylwg2cyIjUIUGtaCqsTcagdyXRlMP43YtyrgQpvLooo","source":"ziprecruiter","full_description":"DescriptionThe Associate Director, Network Engineering designs, analyzes, plans and modifies network components supporting customer communication implementation activities. The Associate Director, Network Engineering requires a solid understanding of how organization capabilities interrelate across department(s). ResponsibilitiesAssociate Director of Network & Telecommunications Engineering is an expert in Network Infrastructure Technology and will be responsible for leading, managing, architecting, building, deploying, operating, and optimizing Network and Telecommunication products and services to enable efficient and effective delivery of reliable, cost-effective healthcare services and high quality experiences for members and associates. YThe Associate Director, Network Engineering develops and evaluates network performance criteria and measurement methods. Prepares the analysis of the short-term or long-term capacity needs for switching, routing transmission and signaling. Conducts network architecture design, feasibility and cost studies. Develops alternative routing scenarios and changes in required sequence of network activities. Conducts economic and population growth studies to determine impact on network capacity and development plan projections. Decisions are typically related to identifying and resolving complex technical and operational problems within department(s), and could lead multiple managers or highly specialized professional associates.Required Qualifications Bachelor's Degree + 10 or more years of technical experience + 4 or more years of management experience + Must be passionate about contributing to an organization focused on continuously improving consumer experiencesPreferred Qualifications Strategic planning and roadmap to optimize assigned portfolio of products and services. + Plan, conceive, architect, design, acquire, build, adapt, implement and deploy secure, scalable and innovative solutions to solve complex problems. + Research, evaluate, assess feasibility with proof of concept, pilot new technologies, solutions and delivery models to transform products and services. + Plan, define, organize, staff, execute, manage, track, control projects to achieve objectives and realize approved roadmaps and initiatives. + Manage system and technology and the full lifecycle of the assigned portfolio. + Ensure secure, fault tolerant, robust, reliable delivery of products and services and meet service levels. + Plan, define, adapt, implement, deploy and optimize processes, workflows, technologies to improve efficiency, productivity and effectiveness of operations. + Maintain accurate, up-to-date data in assigned portfolio of products and services. + Effectively manage vendors, contracts and maintenance agreements for products and services in assigned portfolio. + Track, report, manage and optimize Service Levels and Project Status for products and services in assigned portfolio. + Define, document, design, build, test, and operationalize disaster recovery plans and capabilities, and mitigate business continuity risk. + Define, keep up-to-date and enforce policies, standard practices and operating procedures and ensure continuous compliance with applicable regulations and organizational policies and standards. + Create, track, manage, report and improve financial performance and budgetAdditional Information Experience with network integration mergers and acquisitions Interior Gateway Protocol/Border Gateway Protocol (IGP/BGP) configuration and troubleshooting Equinix Cloud exchange design and configuration Data Center networking design and configuration including Arista and Cisco Nexus platforms including VXLAN/EVPN Network security stack design and configuration including Palo Alto and Cisco Wide Area Network (WAN) design and configuration, SD-LAN Network Configuration, Digital Network Architecture (DNA), Software Defined Network (SDN), QoS, Network Function Virtualization (NFV) and Network Segmentation Technologies SD-WAN design including Cisco Viptela and Meraki platforms Cloud inter-networking design including AWS, GCP and Azure Wireless Network Technologies Understanding of DevOps Culture Infrastructure automation design and deployment through Ansible and Python is preferredScheduled Weekly Hours40"}