{"title":"Warehouse Logistics Coordinator","location":"","salary":"","description":"","term":"$19 to $20 HourlyTemporary","detail":"https://www.ziprecruiter.com/k/l/AAIVsXMbdRvOw4oPBTfg00q4VUreGqLDWxvbVZwRtgInaB9Rtwzm1T71DXQKTFqBTDM8OZberzREfqmp3C0Gg1-i2elK004Qj2TufITsC1RYBHCEE_0PkCal8QavUGcYlrS9Tq2OhKXT4lnoTz72hYP1yvfmzYGszXONG92DKLVhLgAkp5LlgV-uw6vLZCjw","source":"ziprecruiter","full_description":"Great Manufacturing company in Irvine is looking for a Warehouse Logistics Coordinator. 8am start time.Apply to www.staffmark.com and use Job ID 1140907Job Details:manufacturer of industry leading green technologies, including tank-less water heaters, combi-boilers and boilers. Our North American headquarter building is located in Irvine, CA, where this job will be located. We have satellite offices in Moorestown, NJ and Woodbridge, ON, Canada as well as supporting field sales people throughout US, Canada and Mexico and growing into Latin and South America The Navien name was created from three words: Navigator / Energy / Environment.Our Mission is: To provide customers with the ultimate comfortable living environment through energy efficient products using innovative technology to create a healthier environment for our future generations.WHAT WE ARE LOOKING FOR:The Logistics Coordinator will be responsible for freight logistics activities and domestic trucking. This candidate will report to the Logistic Transportation Supervisor. The ideal candidate should have a background in domestic, international, inbound and outbound logistics and will work closely with representatives from Account Management, Warehouse and interdepartmental teams.Essential Job Functions:• Process, handle and prepare shipping documents for warehouse workers. Log and track BOLs, commercial invoices and pack slips. • After outbound shipments are completed, file and scan signed Pack Slips BOLs and commercial invoices and submit to Account Managers.• Track inbound outbound shipments on a daily basis; record keeping on daily shipment excel report• Input logistics data, including date of pick up, estimated time of delivery, freight charges, weights, commodity, consignee contact, special delivery instructions, costs, and POD data• Check transit status on a daily basis to ensure on-time delivery• Check shipment value and quantity against PO for liability insurance and freight claim purposes• Maintain data accuracy by following up with transportation vendors on shipping documents• Report any shipments that require carrier attention or additional follow up• Arrange BOLs and pick up tags with trucking companies• Provide Warehouse and account management teams daily reports with no. of shipments, trucking company names, pickup time frames and report delays or no shows.• Scheduling third party truck company, arranging pick up and drop offs and scheduling loading dock use by working with Warehouse Supervisor to ensure drivers are arriving on time• Work with Logistics Supervisor to improve processes and improve transportation performances• Checking and verifying shipping records, handling questions or concerns of shipping shortages or overages and addressing any problems with inventory control.• Work with Logistics and warehouse management, Account Mgmt. and Operations Manager on claims follow up and settlement progress.• Responds to internal and external inquiries concerning shipments and / or issue resolutions.• Perform other related duties as requiredNon-Essential Job Functions:• Support and provide assistance in any other department as needed.• Complete miscellaneous projects as assigned by the Account Mgmt. Operations Mgr. Skills:• Customer Service, listening, and follow up skills.• Strong data entry, problem solving, multitasking, and highly skilled quality of work.• Logistics/ocean freight import experience is helpful• Team oriented, excellent attitude and willing to help service• Excellent verbal & written communication skills• Intermediate MS Excel, Outlook and Word skills• High attention to detail and ability to work in a fast- paced environment• Ability to multi-mask, prioritize and manage time effectively• Ability to process productivity quality checks, high proficiency and accuracy.• Excellent Excel, MS Outlook, PPT, Word, MRP Systems (e.g., SAP). • Excellent organizational, time management skills.• Ability to learn and apply new concepts. Education/and or Related Experience:• High school diploma or general education degree (GED)• 2-3 years of verifiable experience performing these duties in a like position in the logistics and/or transportation industry;• A strong background in LTL, Truckload, Air, Ocean and Intermodal modes of transportation desired• Proven experience with vendor/carrier price negotiation;• Knowledge of DOT regulations helpful• Ability to process a large number of details in coordinating loading of trucks;• Ability to handle high volume of data entry, email and phone calls, while providing superior customer service;• Ability to work effectively in a fast-paced environment and within short deadlines;• Ability to develop and maintain effective, positive internal/external working relationships with a diverse group of individuals;• A successful team player;• Ability to read and comprehend simple instructions, short correspondence, and memos.• Ability to write simple correspondence.• Ability to effectively present information in one-on-one and small group situations to customers, clients, and other employees of the organization;• Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals.• Ability to compute rate, ratio, and percent and to draw and interpret bar graphs; Initiative and ability to resolve issues skillfully, appropriately and in a timely manner;• Ability to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form. Ability to deal with problems involving several concrete variables in standardized situations;• Must be able to lift up to 25 pounds.About Staffmark Staffmark is committed to providing equal employment opportunity for all persons regardless of race, color, religion (including religious dress and grooming practices), sex, sexual orientation, gender, gender identity, gender expression, age, marital status, national origin, ancestry, citizenship status, pregnancy, medical condition, genetic information, mental and physical disability, political affiliation, union membership, status as a parent, military or veteran status or other non-merit based factors. We will provide reasonable accommodations throughout the application, interviewing and employment process. If you require a reasonable accommodation, contact us. Staffmark is an E-Verify employer. This policy is applicable to all phases of the employment relationship, including hiring, transfers, promotions, training, terminations, working conditions, compensation, benefits, and other terms and conditions of employment. All employees are directed to familiarize themselves with this policy and to act in accordance with it. All decisions with respect to employment matters and other phases of employer-temporary employee relationships will be in keeping with this policy and in accordance with all applicable laws and regulations."}