{"title":"Hardware Engineer I I - 10190798","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJty31cFP7RN-wmtQxpGKruRr-8xrbosFoyvToJhOxBC6K_P54UxGdSFy9XxQPlzxoP2SaSwLmVCNhA-KxRTjTUXvkIvPYdJ_91ab9jIq1kQ_VKR_AXFD5_E8O_Icfa434-xLabqKFWRTfjKP2B_hK33L_3dh1mIakmG1rB902EEKFYSPPGb2M24X6IR5Iu","source":"ziprecruiter","full_description":"Analyze performance of hardware / software systems. Distill performance bottlenecks into specific hardware or software change recommendations. Comfortable doing analysis well in advance of both software and hardware architecture freeze. Capable of operating in highly dynamic environment sharing attention between different issues across multiple hardware / software systems. Participate in performance validation tasks after an issue has been identified. Should possess strong interpersonal skills to communicate with other engineers and present complex concepts to non-technical staff. Must also understand hardware and software interactions and plan accordingly for product evaluation. Skills: Must Haves: 0-5 years of experience within the industry. Not targeting sr. candidates (5+ years) for this position Experience scripting w/ Python Experience using C Experience in computer architecture (will accept academic experience or general interest in the field) Nice to Have: SystemC development Experience using VPI (Verilog procedural interface) / DPI (Direct Programming Interface) Interview Process: Phone Screen w/ Coder Pad Test in C Onsite interview: 2 hr + lunch based on timeblock Education: BSEE, BCSE, BSCE or higher Some industry experience mandatory (internship if straight out of college prefferred) Required Skills: BSEE, C++, MSEE, ENGINEER, ARCHITECTURE Additional Skills: PERL, PYTHON, ROOT CAUSE ANALYSIS, SCRIPTING, VERILOG Required Skills: BSEE, C++, MSEE, ENGINEER, ARCHITECTURE Additional Skills: PERL, PYTHON, ROOT CAUSE ANALYSIS, SCRIPTING, VERILOG PERL, PYTHON, ROOT CAUSE ANALYSIS, SCRIPTING, VERILOGBSEE, BCSE, BSCE or higher Some industry experience mandatory (internship if straight out of college prefferred) Req. Code: 2020-16030 External Company Name: L&T Technology Services External Company URL: www.lnttechservices.com"}