{"title":"Software Engineer Manager","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJjMTuerKckKybhH_RnnJQydFEqChY2QyvYIAyrqJrrdYj5G8FpWUKpPPtW6hPKxcpk3Ok9-3mIJU1wri7pOj_OsxJkaSXwO5D8xmyn9RpSZzc4zl_wBMeZ050VVfJIFpXp5a_i9uKAqfTIgKY3-3clsa1TTV3fJy0MnqgvdT3tGuAxXwHSl6RsIVp8XHM","source":"ziprecruiter","full_description":"MetroNet is looking for you! MetroNet has an immediate opening for an energetic; Software Engineer Manager in Evansville, IN or Overland Park, KS! At MetroNet, we pride ourselves on providing cutting-edge technology combined with outstanding customer care. We are a fast-growing telecommunication company, offering 100% fiber-optic technology. MetroNet specializes in fiber to the premise TV, voice and internet services that provide our customers with some of the fastest internet speeds in the world. Recognized for being one of the Best Places to Work in 2020 by Glassdoor. We are committed to revolutionizing the industry by enhancing the overall customer experience and optimizing the talent of our valued associates. We’re looking for tech-savvy, innovative thinkers to join our team and help us create what’s next!What is in it for you?Competitive total compensation package80% of Medical premiums paid for by companyCompany paid Disability and Life insurance401(k) company match and 100% vested on day 1Discounted MetroNet service in our serviceable areaFlexible scheduleLocally owned, friendly, fun atmosphereJob Summary:Manages and oversees the design, development and testing of software applications. Provides leadership to a team of software engineers in a fast-paced environment toward quality production rollouts.What you will be doing:Coordinate the software development process using best practicesEnsure the team meets overall development goals in accordance with long-term product development plan and short-term project deliverablesBuild healthy team relationshipsTake initiative to improve product development processesLeads team with hands-on participation like code-reviews What You Need For This Position:Bachelor’s Degree or better in related field4+ years of team lead experienceGood analytical problem solving skillsGood written and verbal communication8+ years of professional software experience with strong skillsDependability, adaptability, flexibility and creativityAbility to understand complex issuesPerl, C# or C++ or Java (required)Unix/Linux command line environment experienceSQL/relational database skillsGit command line plus Gitlab or GitHub (preferred)Experience developing, running, and supporting microservice-based architecture in a production environmentExperience developing web services (SOAP/REST)Experience with API Management platform (ex: Mulesoft), API architecture (desired)Experience mentoring other developersExperience with Agile methodologiesReady to take the next step?After submitting an application, please complete our programming assessment located at: https://www.metronetinc.com/wp-content/uploads/MetroNet-Developer-Test-2020-08-31-1.pdfIf you have a strong desire to impact, the success of our organization by ensuring we continue to attract and retain committed professionals, please apply today!MetroNet is an EQUAL OPPORTUNITY EMPLOYER#ZR"}