{"title":"Senior Staff Software Engineer (Back-End), Voice Services NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKXjIEbnBsJ5H7IgyYkmhJOSVCP-xE-JAw1M4Rquq-fawJhiAlLc3yNEj-KaM5g8QEouQrV5cMypwKjQlkjWhmjywPse12Oa5cr1BwB8WpK-KhnD4isEi5S2sIbvxOrAtUNrgP-g-gSOI5bNaWmTNxcsis4ES48xccEOFOVJ_qsHK85MEXjc8uTvs80wXQp","source":"ziprecruiter","full_description":"The Role Making and receiving voice calls are a key component of the Outreach product offering. While a lot of telecommunication problems are \"solved\" in the realm of PBX software, our customers need more. Outreach customers complete many calls with their prospects on our voice platform on a daily basis. The Voice Team is hiring software engineers to increase the momentum in this space. If you have experience in building high availability voice communication systems with open source real-time communication software and commercial communications platform APIs, we'd love to talk to you about this opportunity. Real-time system development is a little different from other web development. The features we build are inherently heavy on state, complex in workflow, and include extensive third-party integrations. You'll have to be creative, build on top of a lot of existing technology, and stay focused on Outreach's core value proposition of revenue efficiency. You'll be building systems to ensure calling is simple, reliable, and crystal clear; so that our customers can reduce the time on clicking around or performing repetitive actions and focus on what matters most - interacting with their prospects.About the Team On the Voice Services team we: - Own features end-to-end, from the customer need all the way to the back-end implementation - Are highly collaborative and distribute technical leadership throughout the team - Do Agile development, with Sprints and regular retrospectives - Function in a highly progressive, quick-iteration environment focused on delivering consistent, incremental customer value - Have something new to demo every week! We're currently shoring up the core functionalities of our telecom product. In the long term we want to give customers the same edge with calling and messaging that they have with email: the ability to optimize and constantly improve how they interact with customers. We will face new challenges as we continue to scale out to ten times the volume of calling we have today and beyond. These efforts present a diverse gamut of work that will help enhance Outreach's competitive edge by making our customers more effective. Your Daily Adventures Will Include Working with commercial CPaaS APIs and open-source real-time communication software to manage calls, messages, and securityFinding ways to engineer high availability into a system that has lots of moving parts, not all of which are directly under your controlWorking with stakeholders to make sure our customers have the tools they need to be successful on our platformFinding quick ways to prototype and test possible solutions to large problemsLooking up and down the stack for the best return on investment for any given pain pointWorking on one of the most visible parts of Outreach's product - to both our customers and the rest of our organization Basic Qualifications Experience with building applications on top of existing VoIP systems / solutionsExperience with building high availability, distributed systems with a system-oriented architectureExperience with building back-end services using Go and C++Experience with cloud-based service applicationsFamiliar with continuous-deployment projectsEnjoy building and consuming REST APIsExperience with VoIP, specifically using WebRTC and SIP to facilitate real-time communication between users and with phone numbers across the globeWilling to go above and beyond to help other team membersAbility to prioritize details along a path of iterative deliveryAbility to quickly ramp up new technologies and start contributingWhy You'll Love It Here Generous medical, dental, and vision coverage for full-time employees and their dependents  Flexible time off  401k to help you save for the future Company-organized and personal paid volunteer days to support the community that supports us Fun company and team outings (or virtual events these days!) because we play just as hard as we work Diversity and inclusion programs that promote employee resource groups like OWN (Outreach Womxn's Network) A parental leave program that includes not just extended time off but options for a paid night nurse, food delivery, gradual return to work, and the Gottman Institute's Bringing Home Baby course for new parents Employee referral bonuses to encourage the addition of great new people to the team Plus, unlimited snacks and beverages in our kitchen (once we're back in the office, that is!) We're an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status"}