{"title":"          Manufacturing Support         ","location":"","salary":"","term":"$13.50 to $14.85 HourlyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAJI-iNqBPA5tcsoSTwDLFz_v0tg2-4ddxsx7628UneBYArjnZ6KRPq7YK2QpGJGclwwx-oYn9kBuZqleZJSG6JESBcv_z-BdDm9uKB581qGgFwC3mK8Wo8cocL3EUoy2ORNG4XRg3QUVDNH_chl2Ps3CGl7yl7RKpEAUgo8WzIPdt441Qivfph0L-YEmB7O","source":"ziprecruiter","full_description":"\n        Location: North Austin (Howard Lane / I-35)Schedule: 1st Shift: 6am to 3pm + OT (could go as late as 7pm) $13.50 2nd Shift: 12pm to 8pm + OT (could go as late as 1am) $14.85 Monday – Friday with some Saturdays/SundaysPay: $13.50 base rate. Second shift 10% premiumDuration: Long term, full timeJob Summary:Responsible for assisting the Weld Shop with various repetitive support activities in a cleanroom environment. Responsibilities include performing specialized cleaning, bagging, part mark, leak check of weldments.Essential Duties and Responsibilities:· Buffing, tweaking, leak check, DI washing, tacking (temporary hold of parts)· Data entry (9 key) must be comfortable using a computer daily· Holding pipe assemblies varying from ¼ in. – 1 in.· Clean and bag gas lines with cleaning chemicals· Leak check weldments· Label gas lines· Inventory and audit parts· Perform Type 1 Chem Clean, this is an (alkaline wash)· Restocking Vendor Managed InventoryPrints and files various manufacturing documentationKnowledge, Skills and Abilities: Must effectively communicate information across all levels of business.Must be detail oriented and organized with the ability to multi-task.Proven computer skills including Microsoft Office Suite products, especially Excel and Word.Demonstrated written and oral communication skills.No experience required!· Work is performed primarily in a clean room environment.Physical Demands:· Ability to stoop, kneel, crouch, reach, walk, push, pull and grasp.· Ability to lift up to exerting up to 25 pounds of force occasionally, and/or up to 10 pounds of force frequently, and/or a negligible amount of force constantly to move object. Ability to move arms, hands and fingers.· Required to have visual acuity to perform assigned tasks.· Will be standing the whole shift surrounded by loud noises\n      "}