{"title":"          Technician Associate V         ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAJY7ZZpOVkrJKD5J3_fpqOnKvGfqVKkY3zK7bjsfXwhwLXinN1quOOaNV3cCTKVXlfAKEoFPcP3s31BvRReCzCRBJS3iea0C9-aHal4SCuP6Fq1n84bfaNPbTwh_YaEdJe0LfvKVhcSVwsy9zSsbPnEeUC9FtB_3z4fAz226UXTjvhiiPBHmO3WKPia6jo","source":"ziprecruiter","full_description":"\n        Bio-Rad is looking for an enthusiastic Electro/Mechanical Technician to support its global organization. You will be part of the innovative Mechanical Engineering Team developing complex solutions for the Next Generation ddPCR instrument systems.  We need a proven techical troubleshooter who gets excited about pushing the boundaries of medical diagnostics, is highly analytical, and sees the big picture needed to evolve a concept into an instrument. You will report directly to the Head of Mechanical Engineering and be part of a larger multi-disciplinary R&D team.  Come join us and be a key player in our next innovative instrument. You will work with engineers, chemists, and molecular biologists to develop integrated chemical and fluidic systems (including droplet-based digital PCR). This work will span from the research stage through product launch. At our Pleasanton R&D center, you can have big company impact while working at a small, nimble and dynamic site.ResponsibilitiesSupport engineering development activities including but not limited to design, fabrication, assembly, modification, and test of complex electro-mechanical medical instruments, assemblies, and components.Build and test R&D prototypes during the engineering development lifecycle.Support transfer of development instruments to manufacturing.Support test and fixture development for laboratory testing.Support Reliability, Verification and Validation Testing.Generate test reports, assembly procedures, and troubleshooting guides.QualificationsAssociates degree in an engineering discipline (Mechanical or Electrical Engineering preferred).Minimum of 10+ years of professional experience required.Strong written and verbal communication skills.Demonstrated ability to perform mechanical, electrical, and/or system level troubleshooting, leading to the identification of root cause and corrective action of instrument failures.Demonstrated proficiency with hand tools, precision measurement equipment, soldering, crimping, electrical test equipment, and/or machine tools - machine shop experience a plus.Ability to read and understand mechanical drawings and electrical schematics.Knowledge of CAD package(s) is preferred.Experience working in a regulated environment is preferred.Multi-tasking skills and ability to work in a multi-disciplinary environment.About Bio-Rad:Bio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 8,000 employees and a global network of operations serving our customers, we help people live longer, healthier lives.Bio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.EEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age Agency Non-Solicitation: Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes.\n      "}