{"title":"Tier Two Wireless Technical Support Specialist","location":"","salary":"","description":"","term":"$16 to $17 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKhlvpmJ8q5Rbyw1jTiqyYpAYF-2e3_h0KRQnOPhsYNZDjip_rlJxd1yXBqjAzCOWDKWvpMyzwjZjvsiuvurI2Wx0a7a20FIAagY8MWw_BJSQXVHQlH8Pztkl1nstej3nSxVSRLNItcb__Bo5U4qKsPulzUz2VlK0oNWhfb-qwJwqbsNrG7tm4fjraxNRTg","source":"ziprecruiter","full_description":"Viaero's Tier 2 Wireless Technical Support Specialists are our in-house subject matter experts when it comes to resolving technical device and Network issues for our customers. Our specialists will strive to provide one-call resolutions. Tier 2 Specialists will work closely with Customer Service, Network Operations and Field Operations to provide technical support and assistance to our customers. Because of the nature of this position, candidates must possess an outstanding work skills including, but not limited to, excellent verbal and written communication skills, ability to multitask and work under pressure, and most importantly a commitment to the customer for a fast resolution. Candidates must live within a reasonable daily commuting distance from Fort Morgan, Colorado. Responsibilities and Duties:Handling a large volume of inbound calls from internal and external customers for technical issues regarding Viaero's wireless products and servicesCommunicating with internal and external customers in a professional manner while demonstrating courtesy, and patienceProviding support to internal and external customers for text, multimedia messaging and internet equipment and servicesUtilizing tools and resources to troubleshoot network complaints and provisioning errors Documenting problems with high degree of accuracy utilizing a trouble ticket systemAchieving quality assurance standards for consistent performanceDemonstrating consistent and punctual attendance. Must be able to work a variable schedule and overtime when necessaryProviding input on the implementation of new products to improve the efficiency of resolution of network issues Qualifications:High School diploma or equivalent is requiredAssociate Degree preferredTech savvy and have a passion for technologyEnergetic, able to work under pressure in dynamic, fast-moving environment Exceptional customer service skills Outstanding verbal and written communication skillsDetail oriented The ability to multitask and strong troubleshooting skills The ability to learn about our network and technical features of our products to improve efficiencyExperience working with Windows-based computers, including general office softwareWhat we offer:Competitive pay Growth opportunitiesComprehensive benefits package includes health insurance benefits (Medical, Vision and Dental), Short-term Disability, Life Insurance, free phone/service, tuition reimbursement, 401(k) with company match, vacation, sick leave, and holiday pay."}