{"title":"Hardware Team Leader","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALiXDNvG1IZIF9iDkjTeQ_hOL3b2bRplo9YWIi9qOmzyHEBKjJTJsXWfZt-sip31x4pffsvgWC7xymA7NvgRouebHXdNFnxAOQGNCq90oCXO9iqX1qyZgzusN6M6OmK8eh0BOudcMA6F4W6M5scRZfQa3VpTUoN06i-BXCILB2uYz0aaEF38qQuW3NJZi0","source":"ziprecruiter","full_description":"A Hardware Team Leader job is available with a manufacturing client in Seymour, IN. You will be responsible for providing all the means and resources needed by a project. Electronic system & component project development is a large part of the role. Support project in front of the customer directly in meetings or by providing adequate materialYou control the status of progress of hardware actions in line with P1/P0 project milestones with respect to CIP and Valeo development standardsSupport the availability of the required documentations in a given project (hardware specification, DFMEA, requirement traceability, hardware design justifications, hardware verification, electronics schematics, and simulation tools such as Simulink and Simutrix)Consolidate and guarantee the consistency of the answers to the RFQSecure technical choices using all necessary support from design center, PG research center, and GEEDSRequest the support of experts and / or appropriate network as neededOrganize Hardware Design Reviews, supply all necessary reports to the project, and to project CommitteeSecure availability of all required inputs (internal or external) to perform 'right first time'Qualifications Bachelor\"s Degree in Electronic Engineering or a similar field5+ years of U.S. based experience in development and industrialization of electronic component for the automotive market. Previous or current management/supervisory experience of a team of engineersStrong technical knowledge necessary to coach a team of engineersAutonomous knowledge on hardware design of DC/DC converter typologies (design, justification, verification and validation)If you are interested in this job please apply via the 'apply now' link provided. Belcan is a global supplier of engineering, technical recruiting, and IT services to customers in the aerospace, industrial, and government sectors. Belcan engineers better outcomes through adaptive and integrated services-from jet engines, airframe, and avionics to heavy vehicles, chemical processing, and cybersecurity. Belcan takes a partnering approach to provide customer-driven solutions that are flexible, scalable, and cost-effective. Our unique capabilities have led to continuous growth and success for nearly 60 years. We are a team-driven Equal Opportunity Employer committed to workforce diversity.Education: Bachelor (BA, BS...)Employment Type: FULL_TIME"}