{"title":"          Senior Cloud Software Developer NEW!        ","location":"","salary":"","term":"$180,000 to $200,000 AnnuallyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAL1D2hgCv-e6H2D3CHd2WdoMEFhMguhXoA5afgF0OxxkM3YahgsP6SLnBGBxhq33Q88ZjfD8mn3EpyI-4jQX5Xn00iPCk_wvmZOJqg2eZjNyXFJerp2Tfs2eH6N-fPmS4yud4NSIhtUa71TssgHIW9I9RIelx26ekgxKE9I7pNSvnYB7ld5DByb4Juc5yD8","source":"ziprecruiter","full_description":"\n        Senior Cloud Software Developer If you are a Senior Cloud Software Developer with experience, please read on!Based in Santa Clara, CA we are a technology powerhouse on a mission to develop the next generation of cutting-edge, networking products and services for our customers! Due to explosive growth and increased demand for our products/services, we're looking to expand our team with talented, expert-level software engineers with experience in cloud applications. The ideal candidate will have 3-5+ years of experience working in cloud development in an agile environment.Top Reasons to Work with Us1. Recognized industry leader!2. Competitive base salary and benefits!3. Opportunity for professional growth!What You Will Be DoingAs a Senior Cloud Software Developer, you will work hands-on developing and implementing cloud applications. This role will focus on developing and releasing cloud applications in a production environment using AWS, Azure, GPC, etc. You will have a strong grasp of OOD, common data structures, standard algorithms, distributed computing, and cloud computing paradigms. You will work closely with the team and product marketing to create, design, and implement requirements.What You Need for this PositionMinimum of 3 years experience in the following: (ideally 5+) - Java and/or Python- AWS- Cloud technologies: Kubernetes / Docker Containers- Postgres (RDBMS)- NoSQL: Cassandra / Kairos DB / ElasticSearch- Distributed Systems: Kafka / Redis- Azure / GPC / Private Cloud exposure- Bachelor's degree in Computer Science or related degreeBonus points for: - Golang / Go programming - gRPC / RabbitMQ / OpenShift / SQL Aurora / Spark- Envoy / Couchbase / Dynamo / Redis / Maven- Masters Degree in Computer Science or related fieldWhat's In It for YouFor your hard work and dedication, you will be rewarded with a competitive base salary, RSUs, and benefits including but not limited to:- Medical (HDHP + HSA, PPO, HMO, EPO, ACO options)- Dental- Vision- Life AD&D- 401(k) + Match- Flexible Spending Account (FSA)- Short Term and Long Term DisabilitySo, if you are a Senior Cloud Software Developer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n      "}