{"title":"N1-Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKQJL7NiknuCTAQSe9CN6F0cK6nfrmnqmCMs8O1L9hRdHDgP6rmZOK_KqVDZZudDJHsLK6af5FKahTzj_1G5rmOcC_s2tCs_RltLEXCelhHwI6SkDiGXnLnGs_F16tEy2Qq9VTMXWjuuAZ398VSq6RtJ3k6XSbln7Ot0eXS6uAttS48EtzglwdGtOIZDe99","source":"ziprecruiter","full_description":"**Position Summary**For decades, Samsung has been leading the charge on innovation. We see beauty in achieving excellence and our passion for change fuels our discoveries, inventions, and breakthrough technology. We believe that technology can, and should, make the world a better place, so we create new possibilities for people everywhere, push the limits of what's possible, and constantly innovate.At Samsung Electronics America, we take pride in the creativity and diversity of our talented people - they are at the forefront of everything we do. Their skillset and mindset drive our continued success. Only the resilient and resourceful thrive in the daily dose of unexpected at Samsung. We unapologetically push to achieve unforeseen potential in everything we do, both within the workplace and at home. We fearlessly face challenges head-on, conquer the unconquerable, and are comfortable living in the uncomfortable zone. Together we make the impossible possible. Because at Samsung, we Own the Unknown.Are you ready to #OwnTheUnknown? Join us.Description The Hardware Engineer's role is to support wireless equipment deployments and new technology trials. This includes participation in installation, monitoring, maintenance, support and optimization of wireless network hardware, software and communication links. This individual will also analyze and resolve network hardware and system trouble in live networks.**Role and Responsibilities****Responsibility**+ Interface between customers and Samsung R&D center for product design, implementation, and issue resolution + Overseeing and participation in installation of wireless communications equipment + Troubleshooting of wireless network issues through the systematic test and debugging of hardware and software systems + Testing and characterizing performance of wireless networks through logging, monitoring, and reporting on key performance indicators + Developing methods of procedure (MOPs) and providing training for field technicians**Skills and Qualifications****Knowledge and Experience**+ Experience and familiarity with 3G/4G/5G cellular communications systems infrastructure (RAN and CORE) and user equipment (UE / CPE) + Basic RF engineering skills including familiarity with 3G/4G/5G radios/antenna systems + Design and deployment of LANs, WANs, and wireless networks, including servers, routers, hubs, switches, UPSs, power plants, HFCs, and other networking hardware+ Experience with basic electronic test tools such as DVM, fiber test sets, RF power meters + Experience with basic laboratory test equipment like Ethernet test sets, base station analyzers, oscilloscopes, spectrum analyzers, signal generators+ Competence with diagnostic and standard hand tools + Good working knowledge of AC and DC power design & testing including 3 Phase AC+ Experience and familiarity with configuration, design, and operation of 24VDC & 48VDC power supplies+ Familiarity with networking equipment, fiber optics, GPS systems + Familiarity with electronic equipment installation best practices and regulations + Basic familiarity of electronic equipment regulatory certifications + Excellent hardware and troubleshooting experience + Proven analytical and problem solving abilities + Excellent communication skills, both written and oral + Self-motivated and willingness/ability to work independently + Travel up to 20% of the time + BS Electrical Engineering, Computer Science or related field + 15+ years relevant experience\\#LI-BT1* Please visit Samsung membership (https://account.samsung.com/membership/pp) to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here (http://careers.eu.samsung.com/PrivacyNoticeforEU.html) .* Samsung Electronics America, Inc. and its subsidiaries are committed to employing a diverse workforce, and provide Equal Employment Opportunity for all individuals regardless of race, color, religion, gender, age, national origin, marital status, sexual orientation, gender identity, status as a protected veteran, genetic information, status as a qualified individual with a disability, or any other characteristic protected by law.**Job Alerts** : If you would like to be notified of new opportunities when they are posted, please click here (https://sec.wd3.myworkdayjobs.com/Samsung\\_Careers/jobAlerts) . You will be asked to create an account first if you do not already have one.**Samsung Electronics** is a global leader in technology, opening new possibilities for people everywhere. Through relentless innovation and discovery, we are transforming the worlds of TVs, smartphones, wearable devices, tablets, digital appliances, and network systems, and the entire semiconductor industry with our memory, system LSI, foundry, and LED solutions. Samsung is also leading in the development of the Internet of Things through, among others, our Smart Home and Digital Health initiatives.**Since being established in 1969** , Samsung Electronics has grown into one of the world's leading technology companies, and become recognized as one of the top global brands. Our network now extends across the world, and Samsung takes great pride in the creativity and diversity of its talented people, who drive our growth. To discover more, please visit our official newsroom at ( https://news.samsung.com/global/ )."}