{"title":"Technical Operations Technical Writer - WA NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJXWQ2sHM-GK6xqWIGYwxeMr0rf1uolY06aVxnNLL_PcnUVlGsivsw6_LAC5euDe5S-UqQoVmNMSslFC8p-3ofeo__ydJLvCN9FpKRRgWaXCnx4l1NLnMjdzkP40ZG6uAf5GREaYDtbX6pbxjlHg8Jq8PeNVrO2J03Xwv_GxdJLBH5LT9itDFo4r3ivxM8G","source":"ziprecruiter","full_description":"Technical Operations Technical Writer - WA in Bothell, WA at APEX Systems Date Posted: 1/23/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: Bothell, WA + Job Type:Project Management Office (PMO) + Experience:Up to 7 year(s) + Date Posted:1/23/2019Job DescriptionJob #: 933693 Technical Writer Core Job Functions: + The primary focus of the Technical Operations Technical Writer role will be to provide technical writing support for manufacturing and quality documents describing the operational aspects for Client's operation in Bothell, Washington. + This will include technical writing assistance for policies, standard operating procedures, analytical methods, validation reports, and others in compliance for all applicable regulatory agency requirements. + This role will closely interact with multiple functions to create high quality documents that support Client's product compliance strategy, manufacturing, quality and other scientific and administrative functions.Knowledge/Skills/Abilities (KSAS): + Bachelor's degree (or equivalent) in a science-related discipline (e.g., biology, chemistry, microbiology, immunology). + 5-7 years' experience in a regulated industry (drugs and/or biologics). + 3-5 years' experience in technical writing. EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}