{"title":"Hardware Engineer III","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJfqrAM5qAqgvTANUFu9h9I4SpUs_nacjRoh1VTbbn1z9az4asSwThrTETVvb6mv6p_RNSHxIvRtiUiEuABG_hrJNpNjoMM6hxhhFPQk3WDeqNQUpP9eU9uOIxiYgl_cFIfQZVj3lIcRPwrk_7tVgCm6Zsx_wbX5z4nq6bF27Nv4AWfN9Zvrof1fjZqzy8","source":"ziprecruiter","full_description":"A Hardware Engineer III job in Kent, WA is currently available through Belcan. In this role, you will be responsible for development and verification of avionics FPGA-based HDL solutions. To be considered for this role, you will have a Bachelor degree and five plus years of FPGA/HDL experience. This is a very visible, contract opportunity with a growing company and has excellent upward mobility. Hardware Engineer III Job duties: * Development and verification of avionics FPGA-based HDL solutions * Share in the impact of design, coding, verification, and integration  Qualifications: * Bachelor degree * Five plus years of FPGA/HDL design/verification work experience in Verilog or VHDL * Experience developing FPGA solutions for embedded systems, including software and hardware integration * Must be a US Citizen or national, US permanent resident (Green Card holder) * Programming and scriptin skills: C, C++, TCL, Python, and MATLAB/Simulink is preferred If you are interested in this Hardware Engineer III job in Kent, WA, please apply via the 'apply now' link provided.  Belcan is a global supplier of engineering, technical recruiting, and IT services to customers in the aerospace, industrial, and government sectors. Belcan engineers better outcomes through adaptive and integrated services-from jet engines, airframe, and avionics to heavy vehicles, chemical processing, and cybersecurity. Belcan takes a partnering approach to provide customer-driven solutions that are flexible, scalable, and cost-effective. Our unique capabilities have led to continuous growth and success for nearly 60 years. We are a team-driven Equal Opportunity Employer committed to workforce diversity."}