{"title":"Network Engineer (CCNA level)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKba4iCGeTwJ56GHiaDc2HIFmQf1-uBX5KGV99DGhIJZ5dnnSxHCf3t9Z7PccgzIhLc_qjubFcaA1Hw9AU8O_MezrOdUkdW52R0txrJaS64iBtDVs_jwvGedSzW1lKZoDmMwdCct_FHy-OTRNFcDwEl8vRyVoXVeEo-gBdO7T7PEnP0-3gz5niqYnRei6KY","source":"ziprecruiter","full_description":"Network EngineerLocation: Seattle, WA Type: Contract Job #: WD350229127Note: This job is not open to C2C or 3rd party candidates.IGNW is an engineering-based resourcing company headquartered in Portland, OR with GEO based teams in Seattle, WA / Austin & Dallas, TX / Southeast US / California. We have global partnerships to deliver the industry's top technical solutions and talent to every one of our clients. Some of our strategic partnerships include Google Cloud, Hashicorp, Puppet, Cisco, and Docker.WHY IGNW? So many reasons, one being IGNW being voted Glassdoor’s Best Places to Work in 2020 across the U.S. and eight other countries. See the details here https://www.thrillist.com/news/nation/glassdoor-best-places-to-work-2020. IGNW also earned the Best of Staffing Award for providing remarkable service to job seekers, hiring managers and current contractors. Check it out! https://www.bestofstaffing.com/agency/ignw/We are proud to foster a great team working environment and offer highly competitive compensation and full benefits packages including medical, flexible spending accounts, dental, vision, 401k and more Take a look and see if this is a match…. or any other jobs posted!Project Scope:Our client has an immediate need for a Network Engineer with the following skills and experience:Responsibilities:Configuration of Route/SwitchConsolidation of BGP treesConsolidating data centerCoordinate and collaborate with the rest of the infrastructure teamDecommission old network gearRequirements:CCNA level going towards CCNPVery strong Cisco on prem Route/Switch skills, specifically NexusGeneralist personality, willing to help where team needs itF5 experience- HIGHLY desirable.Nice to have:ACI experienceCloud experiencePlease note: Candidates may need to pass a drug and/or background check. Please send in your resume today and be sure to get a quick response from one of our onsite recruiters: resumes@ignw.ioCheck out our reviews here: glassdoor.comTo view other IGNW opportunities please visit https://www.ignw.io/jobs#IGNW#TJD"}