{"title":"Senior Software Engineer - Development NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKKmLoF72SrtPobuLInGYVKWwbIym0X5i3MAVDOdW05LfYPRh5S00tSJHcDBxEyczbORQvpMiV__bHVTwnt4K8Kzap1eoSZxoeYECSkkZP3EhLqRnnHfJvrOr23AR2vYnWIZy7MBo5RvXWYrlxy399U2o1kZHdaWQkiF4YsyU-E4WJuuFOA4PK2Pa1elhw","source":"ziprecruiter","full_description":"We are looking for a self-motivated and energetic software engineer to join our software development team working on network automation products in San Jose, CA. The ideal candidate will be able to define, implement, and unit test network management software for managing various Cisco devices. Major Responsibilities: Understand product specifications, architecture and technical designs, develop and unit test software using best development practices Build user interface for the products using React.js, Express.js, Node.js, jQuery. Team communications on new ideas and presentations to other team members and other BUs Perform document and code reviews to provide peer feedback Key Requirements: B.S. with minimum of 7 years or M.S with minimum of 4 years in CS/EE/CEE of experience. High desire to learn and strong learning skills. Strong analytic and logic reasoning skills. Strong and proficient programming knowledge and experience with C/C++, Java, J2EE and other commonly used languages. Strong and proficient in Javascript, Spring, Hibernate, React.js, Express.js, Node.js, jQuery, Python, PyTest, JUnit frameworks. Knowledge of JMS Message bus implementations and REST/Web Service APIs a must. Knowledge of embedded OS such as Linux with multicore multithread exposure Knowledge of Openstack, VMware, KVM and other virtualization technologies. Good understanding of networking and protocols such as TCP/IP. Familiarity with network security, video, voice and other application protocols is a big plus Strong verbal and written communication and presentation skills Good team player and capable of taking tasks from beginning to end independently"}