{"title":"Software Developer II #PowerBI","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKKgHXu1UzgxZOZu8YxmTlel54XvCb-7e8id1LN4RMxI3z9IsLzWcxy3jcRYCubVKnwDLsbDp_aOKXxvhNIk9T3fflgK0RCR31HvItCybWO4tyfCf4elsIoecELML5-3r-9nEoZA4YU0Ix0TVBYvi4Sx6vA7CI7NERxyq5gtmphH00rrHkC6W6AszSVpgET","source":"ziprecruiter","full_description":"Power BI is quite possibly the most exciting Microsoft service today. We have one of the fastest growing user bases, we are at the top of all the Busines Intelligence offerings in the industry with a big and passionate community around us.The PowerBI group is building micro-services infrastructure to service millions of users in massive data workloads and super-efficient processing time. Our challenges are around big data scale, distributed systems, real time and mission critical data. We work on the cutting edge of cloud technology, leveraging Azure capabilities such as Containers, Service Fabric, SQL Azure, REDIS cache, Service Bus, Cosmos DB, Kusto, etc. as well as many others. Rapid improvement in an agile environment is in the heart of our culture, and it gets faster and better every day. You will work with smart people who care deeply about creating a fun and supportive workplace, and you will have an incredible opportunity to learn and grow. Best of all, your work will impact millions of people, and you can be proud to see customers benefit from the work you do.Our challenges are around big data scale, distributed systems, real time and mission critical data.**Responsibilities**We are looking for passionate developers with well-rounded experiences working with all service aspects of high throughput and multi-tenant services, ability to design components carefully, properly handle errors, write clean and well-factored code with good tests and good maintainability.Familiarity with containers, big data, machine learning and data analytics would be a bonus. You should thrive on the services lifestyle.**Qualifications**+ Knowledge of C#, Java, or C++ with solid engineering practices. + Passion for building performant and scalable services. Experience with Azure/AWS or other cloud computing platforms is a plus. + Technical problem solving and debugging skills. + Passion for quality with experience designing and implementing automated tests, including unit tests and integration tests. + Effective communication skills. At least a Bachelor's Degree in Computer Science or related fieldsMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form (https://careers.microsoft.com/us/en/accommodationrequest) .Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}