{"title":"Android Developer - Partial Remote NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALuWKYLHIy8vAGVsbx7p_uENOwFGdxhYLkHOP7tRFDLGiWY_WJVlc96iutYt3UA4Ae8hyNUQuS7Iv8njeJk3ZQErKoaN5gGQ4fl15KYQwtEUgWdkErJubvomxkMnbU3RQKtv5ydw-EzlQR56g7Vz8tJqORcYiWqbh167bDXxmw_fWmh4f4dpel-P27zwks1","source":"ziprecruiter","full_description":"Android Developer - Partial Remote Android Developer - Partial Remote - Skills Required - Java, Android SDK, Android Development, Mobile Development, Android, iOS Development, Web DevelopmentIf you are a Android Developer with mobile engineering experience, please read on!Right down the street from the Watchung Reservation, in New Providence, NJ, we are a go-getter start up that is led by three proven, start up success stories. We are quickly growing and need strong Android Developers to join our team! We specialize in media content and mobile devices and communication. We operate in NJ, NY, and even South Korea and Belgium!THIS ROLE OFFERS PARTIAL REMOTE-What You Need for this Position BSCS or related - 3+ yrs of Android development exp - Java expertise - Strong knowledge of Android APIs - JUnit and Android studio experienceNice to have: - iOS Development exp - Web Development exp - Experience with video streaming technologiesWhat's In It for You Competitive Salary - Full Medical - Dental - Partial Remote - Gym - Snack and drinks!So, if you are a Android Developer with experience, please apply today!Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.*Android Developer - Partial RemoteNJ-New ProvidenceTR3-1462000*"}