{"title":"Junior Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJBcfBbr94vNCrz6Aym6vz1uWQxNdp5XrPMy2fUvpdHcSiUaRqrt7hO41qpJpSYAm_YmIPsZjurxi7_fxJX31FUmv1Q7gR-yPekPsgAnGOduP4T0l-ft26Kw4F_JU_R5h1St4Q1ajljWt0xyxCeXEOJjPzaRna4uJFr3rgRSE30LtubM21SgAPgx7Jq0QCz","source":"ziprecruiter","full_description":"Safari Solutions is currently looking for a high energy, motivated Junior Network Engineer with a competitive spirit, personal drive and track record of success. The successful candidate is expected to love technology and wow our clients. Candidates must be energetic, motivated, and self-driven. You must demonstrate the ability to multi-task, problem solve, and think creatively to address unforeseen obstacles.The Junior Network Engineer is expected to be well versed across the wide variety of technologies. It is an exciting opportunity in a high paced environment.Overview of Work Responsibilities:Design and implement a data network with routers, firewalls, and switchesEvaluation and optimization of Wireless LAN systems using RF prediction and Wireless LAN data collection tools.Diagnose and solve network performance/connectivity problemsIndependently maintain and troubleshoot LAN and WAN networksAssist with documentation updates and managementTravel to customer facilities to implement data network equipmentDevelopment of presentation material and reportsAct as underlying project lead for assigned projects, including but not limited to: Cloud VoIP programming, network programming, onsite implementation, and testing and verification of solutionsCollaborate to procure all client information necessary to document network topology, troubleshooting and operational processBack office strategic support for Enterprise clients which includes monitoring tickets and drawing attention to high profile client issuesProactive monitoring and maintenance of client network related services.Recommending, scheduling, planning, coordination and accountability of firmware updates, preventative maintenance, and reportingTier 2 Network Engineer Escalation Point for help desk inquiriesTraining and certification relating to networkingCandidates Skills/Requirements:At least 3 years in a technical / IT customer-support roleExperience with installing networks using devices including routers, switches, firewallsKnowledge in Cisco, Fortinet, and Ubiquiti network equipment is preferredGeneral understanding of voice, data, copper and fiber deployment/supportSupport of 802.11 a/b/g/n/ac wireless networksSolid understanding of TCP/IP, Subnetting, VLANs, DHCP, DNS, and QoS as well as a basic understanding of Metro Ethernet, FiOS, Cable Modems, and T1Excellent communication skills both written and verbal. Must be able to interface with all team members (technical and non-technical)CCNA certification preferredMust be able to form long term relationships with clientsAble to work in a fast pace and entrepreneurial environmentNaturally curious and eager to take on new challengesRemains flexible and be comfortable with change as our business continues to evolveAbility to manage multiple priorities, and meet deadlinesAbility to work under a dynamic/high pressure environment in dealing with concurrent issues effectively"}