{"title":"Mobile Engineer ( Android)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKAGG1JeEZFU9kHzj9tO53ahl8x1ydRIPhi8JyMotyHNXGnTNgGbj7TBxGpeZsJaHKraTWqWQ0WbzZQJsNkk7sc2OwN_IyOJKZzRMQye0M_kEQ-liEhY8sWh3spNocuPeVpQBNwQrWRSCef7k2O68Cs0ztkLf7EPDgtxa-vCEaoYOtr4JL0d_Z3WAfPhFcx","source":"ziprecruiter","full_description":"Overview At Mango Health, a Trialcard Company, we are motivated to help people lead healthier, happier lives. Our product is mobile only and our mobile engineers play a critical role in positively impacting health outcomes. Come help us make a meaningful difference in people's lives! 4/5 adults in the U.S. now take some combination of medication each week, and 3/4 people don't take their medicines properly. We're focused first on solving this problem as a critical first step towards better health for millions of people. With 12 months of real-world clinical results, unprecedented levels of patient engagement, a 4.5 star rating, and over 16,000 reviews across iOS and Android, we're at an exciting stage of product growth.  Responsibilities Execute on small features, enhancements, and bug fixes for the Mango Health Android app Adhering to design, coding and testing practices established by the teamMaintain a top-notch user experienceCollaborate with our product and design teams to delight our usersBecome familiar with the CI and build infrastructure (CircleCI / fastlane)Gain a broad understanding of the Mango Health technology stack (Android, iOS, backend, data pipeline) Qualifications  2+ years of software development experience, ideally focused on AndroidProficiency in Java and/or KotlinExperience building native iOS and/or Android appsDesire and ability to learn new things at a rapid paceDemonstrated maturity to accomplish a lot individually without compromising the success of the broader teamQualities We're Looking For You describe yourself as a problem solverYou have the communication skills to collaborate across teamsYou have a good \"product\" mindset and appreciate good designYou hold yourself to a high standard for clean, readable, modular codeYou challenge assumptions, but are willing to commit once a decision is madeYou have a desire to ship software both frequently and in iterationsYou have a thoughtful, adaptive, and positive mindsetBonus Points You prefer working with small teams of top-notch engineersYou value impact and think about the code you write in the context of how it improves the end-user experienceYou believe in our mission and find meaning in positively impacting people's livesYou notice the little things and take care of the details"}