{"title":"          Software Developer         ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAL8T8tlQDzxxwIAtHGLJef90Ji95tfhPYItEIHgWAan8Yi4vMv_Ip9FUyswLAmYSBF4gNfUU3oWvLNzqP-1q74HcDwGnqGbuLXbAxeZv7Q4hhAyvZ60DbZFNvKbZv1ofMXPRStFxkZFkrwgY8YTahdbpZcSKMAGL75XXaao7PHyCBxGsVaSyYM1MRn0KYs","source":"ziprecruiter","full_description":"\n        Software Developer If you are a JavaScript Engineer looking to join a leading deep learning solutions company, please read on!Founded in 1992, we are a global, value-added supplier of computing products and solutions. With a full range of engineering and logistics services, including consultancy, initial solution validation, manufacturing, implementation, and support, we enable our customers to solve complex computing challenges, meet product development deadlines, improve resource utilization, reduce energy consumption, and maintain a competitive edge.Top Reasons to Work with Us- Competitive compensation- Great work culture- Medical- Dental- Vision- 401k matching- PTO... and more!What You Will Be Doing- Responsible for building large scalable software infrastructure- Handle all internal and 3rd party applications, writing custom code, and building on top of 3rd party applications- Manage connections between applications through iPaaSWhat You Need for this PositionAt least 3 years experience with:- JavaScript- Node.js- Angular/React- CSS/HTML- RESTful API- MongoDB- AWS- 3rd party app / integrations - CRM, ERP, PIM, Marketing Automation, Chat, CMS, payment gateway, shipping - Netsuite, Stibo, Salesforce, Marketo, Drift, ContentStack, Easypost, Stripe, Celigo, Dell BoomiSo, if you are a Junior Front-end Engineer looking to join a leading deep learning solutions company, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n      "}