{"title":"Azure ETL Developer/Data Engineer (100% Remote)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJk337cUJazdXjIS0hSt_PtHE700cZL0sxfF4kzaXg2y31nBGTQtH6XjjhEBd8CGBXpcRY0lATqvSxShHLFJf2HrZnEErezxn9wiMPHi1M6-j7OPMrvHIeTLt_aQkkvPCFkmC4CMbOKm6vLUm7htLMD5GM7qy7mjc1pFdVReaHar6TjCNLquk34F-ia-H4","source":"ziprecruiter","full_description":"Our direct client is looking to hire a 100% Remote Senior ETL Developer to join their team on a full-time/direct-hire basis.MUST have exp with Azure*Only US Citizen and Green Card candidates will be considered*Under moderate supervision and guidance, the ETL Developer will provide data analysis, data modeling and data orchestration both on premise and in the Azure cloud.  ESSENTIAL DUTIES AND RESPONSIBILITIESApply solid design principals to create data flows, scheduling, mapping, and structuring of data for consumption.Execute data analysis to understand source and target systems.Execute multiple, concurrent projects in an agile environment.Analyze and identifies cloud architecture strategy and service deployment.Test, tune and support data pipelines and structures.Implement required data security.Maintain a data dictionary.Assist with ML and AI model deployment to the cloud.MINIMUM REQUIREMENTS6+ years working in ELT, ETL and data orchestration in an analytics environment.Two (2) or more years working in the Azure PAAS platform.Sound knowledge and adaptability to an agile environment.Ability to collaborate with non-technical and technical colleagues in project and support execution.Experience working with Azure Blob Storage, Data Lake, Synapse, and SQL Server.Solid understanding and aptitude working with cloud-based orchestration tools such as Azure Data FactoryAbility to model data for performance and accessibility whether creating fixed data schemas or schema on read models.PREFERRED QUALIFICATIONS (PLUS ONLY)Bachelor’s in Computer Science, Statistics, Mathematics, or related field.Azure CertificationMicrosoft PowerBI experienceSolid presentation skillsData and Infrastructure architectureFor immediate consideration please submit your resume in Word format, along with daytime contact information.  LOCAL CANDIDATES ONLY PLEASE unless you are willing to relocate yourself at your own expense.  Client is unable to provide H-1B Visa sponsorship at this time. All submittals will be treated confidentially.  Selected candidate may be asked to complete a comprehensive background, credit and/or drug screening.  Principals only, no third parties please.  Atrilogy Solutions Group, Inc. (est. 2000), in partnership with Peak17 Consulting (est. 2008), provides organizations of all sizes with high-quality, cost effective information technology (IT) staffing services.  Atrilogy has been recognized by Inc. magazine as one of the nation’s fastest-growing, privately held companies. Headquartered in Irvine, California, Atrilogy also has offices in Denver, Phoenix, & Atlanta with satellite offices in Boston, Jersey City, Las Vegas, and Delhi, India. Clients turn to Atrilogy for expertise in:IT staffing and placement such as Project Managers, Agile/Scrum Masters, Business Analysts, DBAs, Software Engineers, Mobile Developers (iOS, Android), DevOps, Automation, QA, Systems & Network Engineers, Cyber Security / Information Security Specialists, ERP, CRM, Business Intelligence, Data Warehousing, Big Data and Creative (UI/UX, Web Design) Clients turn to Peak17 for expertise in:Operational staffing and placement of Accounting/Finance, Human Resources, and Marketing professionals, as well as Information Technology resources.Atrilogy Solutions Group and Peak17 Consulting are Equal Opportunity Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, protected veteran status, or any other basis protected by applicable law, and will not be discriminated against on the basis of disability. In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.#PAB"}