{"title":"Vision Tools Software Engineer - IOS Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIGL5bm9GGxRsB4vHuCRaRGauywb8EJzE1O6plNudxOz69ZfPpKNDG23v9RFTjaS8xFzpYewl40gwgh9VJKcK5y8IhwONkOjKhaxPW_9Vw6VG_M1-Ihhsnzjf0ZW0RyTZQTnqqPtufnNpZYZ_xlWrOKkl1uZfNhRdLu2pYAi-dEqOwKCxK6yrcrQcLp5nF9","source":"ziprecruiter","full_description":"Vision Tools Software Engineer - IOS DeveloperBoulder,Colorado,United StatesSoftware and Services+ Experience with iOS or macOS development using Objective-C / Swift + Familiarity or experience with C++ or Metal is nice to have + Passionate - and holds strong opinions - on what it means to write great software + Experience with computer vision, image processing, or machine learning systems is a plus, but not required**Description**We work on tools, apps, and infrastructure in the area of computer vision that requires robust, efficient, well-tested, and clean solutions. You will develop software that has a broad impact for many algorithm and app teams in the augmented reality space. This is a wide-ranging role which can include: writing apps for technology demos; developing visualization code in support of various teams; communicating with and supporting cross-functional partners; participating in code reviews; and being a constant advocate within the team for high quality results.**Education & Experience**A bachelor's degree or higher in Computer Science or equivalent experience.**Additional Requirements**+ If you are a Colorado resident, this applies to you. + At Apple, we see the whole you. We carefully consider a wide range of compensation factors, including your background and experience. These considerations can cause your compensation to vary. The Software Development Engineer starts at a minimum annual salary of $105,000. The actual pay may be higher depending on your skills, qualifications, and experience. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Every Apple employee also has the opportunity to become an Apple shareholder, because all team members are eligible for stock grants and also a discount when purchasing Apple stock. + We offer all kinds of ways to experience well-being, confidence, and satisfaction. Learn more about Apple benefits. + https://www.apple.com/jobs/us/benefits.html + Note: Apple benefits programs are subject to eligibility requirements.**Apple Footer**Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant (Opens in a new window) .Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. United States Department of Labor. Learn more (Opens in a new window) .Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law. If you're applying for a position in San Francisco, review the San Francisco Fair Chance Ordinance guidelines (opens in a new window) applicable in your area.Apple participates in the E-Verify program in certain locations as required by law. Learn more about the E-Verify program (Opens in a new window) .Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace. Reasonable Accommodation and Drug Free Workplace policy Learn more (Opens in a new window) ."}