{"title":"Software Systems Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALbzz78PyRjqBlzL98-nGcASa2bSjmbAlhlIQiSy6SBoYBMwXqNbi0p4szQ-NWw1SCvK7T6p17GbfGSvQb_NL_CXaXt-0KiHvr0-kb09EOCcNkAbZU6SLl46g_4LuGrQdkFrQKE7kr0bk-tVjf7wiuVC0bDeznAlwUYBlnWab2YBAWjU5L6P2j-XpOXBw","source":"ziprecruiter","full_description":"Stellar Innovations & Solutions, Inc., (SIS), a registered ISO 9001:2008 corporation, is a Service-Disabled Veteran-Owned Small Disadvantaged Business. SIS provides Professional Services & Information Technology Support and is fast emerging as an innovator with a record of success transforming customers' business operations. Using a broad scope of quality management and industry best practices, SIS consistently meets service delivery with high levels of customer satisfaction.SIS is looking for several Software Systems Engineers for an upcoming contract based in the Ft. Belvoir, VA., area. This is a Remote position with occasion travel for meetings to Ft. Belvoir and/or locations in the DC area. RESPONSIBILITIES:Formulates/defines specifications for complex operating software programming applications or modifies/maintains complex existing applications using engineering releases and utilities from the manufacturer. Designs, codes, tests, debugs, and documents those programs. Provides overall operating system maintenance, such as sophisticated file maintenance routines, large telecommunications networks, computer accounting, and advanced mathematical/scientific software packages. Assists all phases of software systems programming applications. Evaluates new and existing software products.Minimum Experience:Five (5) years relevant experience.Required Skills:Must possess IT-II security clearance (Secret) or have a current National Agency Check with Local Agency Check and Credit Check (NACLC) at time of proposal submission.Must be available to travel to Ft. Belvoir, VA., and/or other locations in the DC area occasionally for meetings.Relevant certification from a nationally recognized technical authority.DoD Approved 8570 Baseline Certification: Category IAT Level I.***Position Contingent Upon Contract Award*** SIS, Inc. is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin. We are also an equal opportunity employer of individuals with disabilities and protected veterans."}