{"title":"Customer Service Sales (Restaurant & Food Service Experience Apply!)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALeOTa9D_xG4PGbZiJELP32anKWPNXw9tcBRgEqsq2eVN-RjMQx3zUKp0Ew25tK8FcgN40GMCdma0wDIvEePbFb7YnGkNQfyNzeiOY1oy2ccKpLKLiV9U833q3R5puPd8ojsVX6lb3J5tUpkp6XNo_2_stajfZ2KyFxJMJU34jhVyMwAF0YzGAeH0cPOog4","source":"ziprecruiter","full_description":"“Great way to grow yourself not only personally, but professionally as well. Many opportunities to get business skills and knowledge, in order to propel you in an upward direction. Very fun and interactive environment; feels like a second family.” – Glassdoor Review.Rainmasters, Inc. in Sacramento, CA. is now interviewing! Our sales team is energetic, fun, friendly and highly motivated to help our customers. We are seeking individuals from all backgrounds, especially people with experience in the restaurant, fast/food service, and bar industries, who enjoy working with people and can handle a fast-paced environment.Job ResponsibilitiesPromote our client's brands and increase awareness and salesEducate customers on our client's brands, products, and servicesHelp identify customer’s needs and offer product solutionsHelp drive client sales and impact customer retention and brand loyaltyMonitor campaign performance and developmentMaintaining a strong knowledge of all services, pricing, and competitive offersComplete training for career advancement to manage multiple offices and retail locationsQualificationsExperience in sales, customerservice, or other fields such as food service, restaurant, bar, fast food, hospitality, is a plus!Ability to thrive in a fast-paced environmentAbility to build rapport with customersExcellent written and verbal communication skillsStrong negotiation skillsFull-time availability (evenings and weekends)Reliable/personal transportationClean background/drug screening upon hirePerks of landing a job here:Competitive team environmentOne on one coaching with key business executivesPaid daily class style training in sales, leadership, and business managementPersonalized and tracked career advancement opportunitiesMerit-based opportunities to advance into managementOpportunity to travel across the nation to learn and networkFun team building retreats and outings like snowboarding, paintball, camping, etc.Full compensation package (hourly, uncapped commissions, competitive bonuses, and incentives).If you are seeking full or part-time opportunities in entry level, sales, retail, customer service, and management, we encourage you to apply today! Paid training is provided!---Important Information About Our Interviewing/Hiring Process and COVID-19:The health and safety of our team, our clients, and candidates is a top priority. Amidst the circumstances surrounding COVID-19, our commitment to hiring top talent and helping them thrive professionally is stronger than ever. At this moment in time, RainMasters, Inc. (RMI) will be conducting our hiring process virtually and conducting interviews via phone or video until further notice.All candidates selected for a remote interview will be provided with all the required instructions to aid in a smooth, professional yet personal experience. Individuals offered a career opportunity with RMI, will be required to follow cautionary health and hygiene guidelines. Our team has seamlessly transitioned to a hybrid-remote model for training and development but given the nature of the position itself (in-person retail sales), it is ever more important for us to ensure a clean, safe, and healthy environment for our employees, clients, and customers. Thank you for your interest in RainMasters, Inc."}