{"title":"Senior Technical Writer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKrJpFrZZnj2TdCnI6hahRen2pVNoZiui_2I7z5VECV6-n7pQgE0oD29hBoosXY8C3EHvSq6k9C3tM7wFmYTZveGphoQ5VvENfv3n9ZLpRq-en_B6_pCJDQ3npUbF12CfU5FE3hD-ZyfP2Y4wy_8QJLb4fFBSE4CoTlOHjShI9N_HDIZOQQqZ4OPp4QHq8i","source":"ziprecruiter","full_description":"Trident Consulting is seeking a  \"Senior Technical Writer \" for one of our clients in  \"Milpitas, CA (only local candidates) \", \"A global leader in business and technology servicesPosition:: Senior Technical WriterLocation:: Milpitas, CA (only local candidates)Job Description::Need Senior Technical Writer, with 8 to 10 years of experience for developing User Manual and Quick Start Guides for Protocol Analyzer productsProficiency with authoring tool, Adobe FrameMaker.Should be able to create and publish documents with the above toolsShould be proficient in creating line drawings / illustrations for user manuals with the help of 3D models or simple photographs.Require general familiarity with the hardware and software domains and terminology - Should be able to lead a small team of 2 -3 peopleIt would be nice to have some familiarity with specific protocol analysis domain (optional)Trident Consulting handles the staffing and management of part or all of the recruitment process for our customers wishing to outsource their staffing requirements. From job profiling, providing new staff, technology, to onboarding a new hire we support our customers in their future business needs.About ClientOur Client is one of the worlds leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., a member of the NASDAQ-100 is ranked 205 on the Fortune 500 and is consistently listed among the most admired companies in the world."}