{"title":"Software Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIa-gr-WqwvS8F4Cl5MsUfAHpFV_a_FmbOt0qTz_91yj-IucMS12SUtSup9-RSgdO7ZE_pFxnHeNWox8GZVa5hYTi7ejTe8QZ-k6WFV0uk7Irs1TEeH-n630BdhmyuCd7Fbe1rU-bHTkX9EXJTZiAZQJ-CxvzYnttx6hdIVYl6yE9DtgWEAn7DbjAwkXq8","source":"ziprecruiter","full_description":"TEKsystems is seeking a software developer with at least 5 years of experience developing software solutions utilizing C# starting from end user requirements description through the ultimate deployment of a product into the production environment. Successful candidates will be self-starters that can work on individual products as well as in small team environments with little oversight who also have the ability to troubleshoot and upgrade legacy solutions ranging from stand-alone applications; Web based solutions, as well as enterprise level solutions. TEKsystems' client is a certified DoD Contractor providing services and products to US/Allied governments and industry in the following main areas: (1) Cyber Security/Intelligence Programs Support (2) Command, Control, Communication, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) (3) Space Operations and Control (4) Warfighter Support and Logistics (5) Weapon System Analysis (6) Acquisition Support (7) Test and Evaluation (8) Audio/Visual Technology Applications. TEKsystems and our client pride ourselves on providing high quality support to the U.S. Government and our Nation's Warfighters. Responsibilities: Support as needed, US Army Space and Missile Defense Command Capability Development Integration Directorate (CDID) government personnel for efforts associated with innovations for Space, Near Space, Space Control, Missile Defense Capabilities and information operations to the Warfighter. As part of the development team, this position will support or execute the following activities: + Develop long range JFFT software architecture plans+ Execute software engineering processes within JFFT development process guidelines+ Develop software solutions based on validated problem reports and change requests+ Execute software coding to support division projects+ Perform unit testing of developed code+ Draft and maintain technical documentation for developed code+ Deliver all source code and documentation to the Government+ Develop Software solutions that can be easily tailored to COTS and GOTS systems.+ Support the development of user interfaces for handheld devices+ Support the development of web services solutions for JFFT tasks+ Develop net-centric data interfaces in accordance with evolving Joint C2 standards+ Plan, propose and implement upgrades to JFFT software to maintain compatibility with commercial off the shelf (COTS) upgrades and advances in technology+ Assist in software functional testing+ Participate in TIMs+ Support and participate in JFFT CCB proceedings to include providing advice and assistance with identifying Software related solutions to the Configuration Control Board+ Develop and provide support for unique FT testing tools+ Support the development of methods to test for early detection and correction of software anomalies+ Develop and maintain a software development plan. Education and Experience Requirements: Bachelor's degree in a related field. Successful candidates will be proficient in the following areas: + C#+ ASP.Net+ Design Patterns+ Object Oriented Programming+ Windows Communication Foundation (WCF)+ .Net Model View Controller (MVC) architecture+ JavaScript+ Relational Database Structures+ Transact SQL+ Microsoft Entity Framework+ System DebuggingSkills: 5+ years of experience with: + C# + .NET+ Web Based Solutions+ Object Oriented Programming+ T-SQL+ Entity FrameworkTop Skills Details: 1. 5+ years of experience developing software solutions utilizing C# starting from end user requirements description through the ultimate deployment of a product into the production environment. 2. Must have the ability to troubleshoot and upgrade legacy solutions ranging from stand-alone applications; Web based solutions, as well as enterprise level solutions. 3. Ability to obtain CompTIA Security+ certification within 60 days of starting Additional Skills & Qualifications: Candidates need to have a great aptitude for learning and be able to work independently as well as on a team. Contact Jason Sierra for more information - JSierra@TEKsystems.com About TEKsystems: We're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company. The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law."}