{"title":"          Quality Engineer Manufacturing Assistant NEW!        ","location":"","salary":"","term":"$18 to $21 HourlyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAJLYBqrRYO2JLl-s80jwNX7JlCFg3onpVz5gjJE9N9U7Xw8hSdiHF6A8zgsEXjog1OZPnktEOhMu4Lefto6lC3fExvib9vv1qI38ifcfvcKfcWTMbX9Of8nCPFM2c4DpB6tKcWV36c1lAT-avR1uwRUbLjzmgUy3YMfuAwY08TyHoUXAv__A8UvCnqhwQ","source":"ziprecruiter","full_description":"\n        Quality Engineer AssistantPosition Summary:Provide engineering and technical support to the Quality Assurance department and other departments as needed. Coordinate and execute product and process validations as appropriate. Evaluate the operation of Manufacturing and QA activities and recommend where corrections or improvements are crucial. Provide support to other departmental activities as necessary.Essential Functions:Perform product and process validations as required to ensure product quality and quality system requirements are met.Provide quality engineering to all departments as required.Review costs associated with quality requirements.Analyze compiled data from tests and inspection reports to identify problems.Oversee the process related to capturing data associated with product deviations, product Non conformances (NC) Corrective/ Preventive Actions (CPA), complaints, scrap and rework and analyze the data for quality improvement and create a report for upper management.Submit Deviation Requests (SRI, SIR, SNAR, etc.) to customer.Assist with training as required to all company employees.Assist on MRB process.Devises sampling procedures and designs and develops forms and instructions for recording, evaluating, and reporting quality reliability data.Monitor Key Performance Indicators [KPI] throughout the company, gathering relevant data and producing statistical reports. Advise on improvement plan.Bring staff together from different departments to plan, formulate comprehensive quality procedures and other areas such as Risk management review.Perform lean and process improvement projects in team environment.Evaluate supplier quality data to identify process improvement opportunities within the supply chain. Collect and maintains supplier performance metrics.Perform other tasks and/or projects as assigned.Cross Functions:Contract review: review all orders to ensure that all critical PO information is captured within the JobBOSS system and the traveler.Order entry: enter new orders into Shop Management System, create Job Traveler package.Communication/Feed-back: communicate escapes to sales or marketing.Prepare/create documentation for orders requiring source inspection or e-approval.Submit requests for source inspection & support the source inspection process.Investigate, resolve and document shipping and documentation related complaints.Scan and index POs, Certs, drawings, and closed jobs into the electronic filing system.Perform FAI, SPC, 100% and Final inspectionsSkills, Knowledge, and Experience:Minimum of 2 to 4 years in related field.Associate Degree or equivalent 2-4 years combined work experience and education.Bachelor BA in engineering or related field preferred.Thorough knowledge and understanding of the Inspection/Quality process.Proficient in quality tools such as 5Why’s, 8D, SPC, PFMEA, Pareto chart, PPAP, etc.Strong problem-solving skills with ability to teach basic problem-solving techniques.Strong data analysis and reporting skills.Proficient in MS Office (e.g., Word, Outlook, Excel) and Internet.Excellent written and verbal communication skills.Ability to adapt quickly to changing priorities and respond to unforeseen requests.Ability to interface with all levels of employees and management.Blackbelt or Greenbelt certification would be a plus.Proficient in Unipoint and/or Minitab software preferred.\n      "}