{"title":"Product Sales Executive - Chemistry/Immunoassay (Baltimore)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI6Nv6thu7Ga4TbFOwvLYloCxnluDA5STsa85wlXXbvZWN3feD8V5gbar3Kh7lNcO70FVm5p5iuJlyHCwvr8PqtmuX-V69vG10cMbF-dMhPtrvhcXJn2dDbDbfyM-E2jdqwU_8WBNvf9Raig3tZw6gHp4fHvGaQ_PHiakMipCqBh0iqQTr8V4_FrlJl5CA","source":"ziprecruiter","full_description":"Meet Your Next Favorite Place to Work!We are looking for a Product Sales Executive (PSE) who is success driven within a team-based sales strategyfor both new and existing customers. You will be responsible for positioning Chemistry and Immunoassay solutions into hospitals and reference laboratories.As our new PSE, your goal will be to accurately anticipate the needs of customers and execute on a sales strategy to help us become the technical vendor of choice. You will use your experience in laboratory workflow to effectively position our solutions (hardware, reagents, systems and applications).Your Regional Sales Manager will coach you in using funnel management to design and implement your sales plan; and achieve your sales and financial goals. Leaders at Beckman Coulter focus on the growth and development of our associates, so if youre looking to grow and take that next step in your career, we invite you to read on.Wondering whats within Beckman Coulter? Take a closer look.Join a team where you can be heard, be supported, and always be yourself. At Beckman Coulter, a Danaher company, were building a culture that celebrates backgrounds, experiences, and perspectives of all our associates.Our work helps improve millions of lives. We hope youll see yourself here, too!In this role, you will have the opportunity to: + Serve as Subject Matter Specialist with a product focus in Chemistry and Immunoassay+ Develop and execute creative strategies to influence the decision criteria and utilize winning tactics to close the sale+ Effectively link Beckman Coulters Chem/IA solutions to the customers technical, financial and business needs+ Strategically use internal and external resources including Service, Applications, Laboratory Automation and Clinical Information Technology Specialists, Leadership and Client Services to build and execute agreed upon strategy+ Manage a long-term sales cycle (often years to develop) with many different customer decision makers+ Follow through quickly and thoroughly on agreed upon actions with customer to advance the sale+ Predominantly call on customers who are in the active sales cycleSuccessful Candidates will have:+ Working knowledge of laboratory workflow, workload demands, and Chem/IA system needs+ Solid understanding of tactical sales skills (prospecting, qualifying, closing, and growing existing customers) strongly preferred in laboratory diagnostics+ Strong executive presence, communication and presentation skills; demonstrated ability to conduct a technical presentation and be able to articulate clearly, concisely and accurately to various customer partners+ Ability to effectively overcome customer objections and turn them into a competitive win+ Working experience of performing live instrument demonstrations+ Strong organizational skills and be highly motivated and success driven within a team environment+ Excellent time and territory management habits as well as follow up and follow through skills+ Experience working with distribution channels is a plus+ Experience working with personal computer, e-mail, and Microsoft Office programs, including CRM programsEssential Requirements:+ Bachelors degree preferably in a science field (preferably within Medical Technology)+ 2+ years capital sales experience in hospital or laboratory setting or 5+ years direct experience as a Medical Technologist+ Must be willing to travel 50% - 75%. In this position you will work remotely in your home office; and work with customers in the field, which will include traveling to customer locations where you may have to stay overnight, depending upon the location of the customer and your home office Beckman Coulter, a Danaher company, offers a broad array of comprehensive, competitive benefit programs that add value to associates' and their families' lives. Whether it's a health care program or paid time off, our programs contribute to life beyond the job.At Beckman Coulter, we're driven by a sense of wonder for what we can create-and what we can become. Here, you'll accelerate your career while driving innovation that improves lives. You'll work hard and try new things, with guidance from committed leaders, powerful DBS tools Danaher Business System (https://www.danaher.com/how-we-work/danaher-business-system) , and the support of a global organization. As part of the Danaher family of 67,000 associates across the globe, your possibilities for growth and development are unparalleled.We believe that creativity and innovation thrive when the most diverse set of voices are heard, and that's why we're taking concrete steps to ensure that we're fostering an inclusive and engaging workplace for our team. If you'd like to learn more, read stories from our associates on our Careers Blog (https://jobs.danaher.com/global/en/blog) or contact one of our recruiters.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Danaher Corporation and all Danaher Companies are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. The \"EEO is the Law\" poster is available here (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf) ."}