{"title":"Senior Android Mobile Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALzMOlQwCorpG8HXZ-4iTmRxQWo6vFRRGB4-my6EDJoNvNVnl3wlhVZxGWOERYn2yvZfMH688ocLIvm5PVbbn79Yp2pNtRfPjrw1DGsWfDxJRq1uccRYuH0wQWyT410ypp0OUg0ljU7MmqmapWRsOMu416pqwQ75dTZ78N-ES3DgFkgUTr6KFzFoWClgTtc","source":"ziprecruiter","full_description":"8x8 Inc. is looking for an experienced Android Mobile Applications Developer to help grow 8x8's mobile applications product portfolio. You'll be responsible for the design and development of business-critical applications on mobile platforms. Be part of a small group of mobile developers leading 8x8 into the future of enterprise communications! Responsibilities: + Architecture and implement big and feature-rich Android applications.+ Make sure the performance, quality, and responsiveness of the application are always running smoothly.+ Assure proper engineering methodologies and best practices are followed.+ Mentoring junior Android engineers.+ Keep updated with latest mobile-related technologies with a particular focus on Android. Qualifications: + Minimum 5 years of experience of developing core Android applications must.+ Familiarity with RESTful APIs to connect applications to back-end servers.+ Good knowledge of efficient design patterns.+ Experience with offline storage, threading and performance tuning.+ Experience with unit testing, UI testing, and test automation.+ Good troubleshooting and problem-solving skills+ Familiarity with continuous integration, benchmarking and optimization.+ Experience using distributed source code version control systems (Git/GitLab) Working knowledge in these areas: + NDK+ Reactive programming.+ Push notifications+ Dependency injection framework like Dagger.+ VOIP(SIP) - optional+ Media streaming technologies (RTP, RTMP, RTSP) - optional #LI- RM18x8 is proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. For 8x8 jobs located in the US: 8x8 participates in the E-Verify program. View the Participant Poster in English | Espanol. View the Right to Work Poster in English | Espanol. Requisition Number: 2018-4219 External Company Name: 8x8, Inc. External Company URL: www.8x8.com Street: 2125 O'Nel Drive"}