{"title":"          Sr. Developer NEW!        ","location":"","salary":"","term":"$95,000 to $110,000 AnnuallyContractor","jk":"","detail":"https://www.ziprecruiter.com/k/l/AALayqadMCwCC1oJU66T9YDizBHF08kEyDRm1-AfVrVaWvaEGzqfh1QZzT0yeTw0yhytx7U_q95GGMhOYd3ldxbyLC2kJ4eXdlWRfk7pug_uy-0AUlArZgrJPAh23cpBxltu9D8kmtpQGjPLB_vUObW_7cK_HCCA3UnbGc0HRTHQhJvxgLOzDOv5LrXJPWHa","source":"ziprecruiter","full_description":"\n        Sr. Developer - Remote Position, 6 to 12 Month Contract(Company located in Oklahoma City, OK)Purpose:Interpret customer requirements, responsively formulate action plans, and implement simple, sustainable, scalable, and secure solutions with high quality. Support the customer in all aspects, from managing incidents to improving operational efficiency.Key Responsibilities:Design and implement a robust .Net MVC front-end, server and database model that will be highly performant and intuitively obvious to the user.Consult with existing top 10% skill- rated teammates, providing guidance on application operability, manageability, security, performance, scalability, reliability and robustness.Support customer requirements for the team within established SLA’s.Provide technical expertise to resolve service impacting incidents and problems.Diagnose server and storage issues.Must have the ability to work as part of a team, be self-motivated, and work in a loosely defined environment as well as build relationships within the collaborative team.Qualifications and Requirements:Four (4) years of technology experience.Minimum four (4) years’ experience in coding C# / ASP.NET / ASP.NET MVCMinimum four (4) years’ experience with design patterns/best practices but know when to break from the mold.Minimum four (4) years’ HTML, CSS, JavaScript, emphasis on frameworks such as any of the JS frameworks, JQuery.Strong SQL skills, Stored Procs, functions, performanceAbility to realize and implement Design Comps into an aesthetically pleasing web experience.Proven past experience of the ASP.NET Web API stackMust be a team player, confident, independent and enthusiastic! Self-motivated, can work in a loosely defined environment and build relationships within the collaborative team.Strong critical thinking, problem solving and (written/oral) communication skillsSolid understanding of Microsoft products, software lifecycle methodology and information systems development and support.Ability to manage multiple priorities, commitments and projects.The ability to work with multiple projects at the same time, strong documentation skills, and a methodical approach to problem resolution are critical to succeed in this role.Physical Demands:Regularly required to sit, stand, walk, and occasionally bend and move about the facility.Infrequent light physical effort required.Occasional lifting up to 30 lbs.Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n      "}