{"title":"Software Development Engineer Internship - Notification Center","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJXDrJjFVp4uvNiTyHa0ZwOVKDM_0YpZsUUimE3BnkXrbl0r-7MM_kLyBFbMXAtJWXfc5ljdFzKzTpjj3nwW6vL6BotVVf9dIktQSQzrVnI59yznvRSr9QxAEs1-0ekT3JvWTqlNDEfWOdWgxcUFatPPZ8ym7KSKm0RYBx49YtmhiJHo2gBBcKlMhIbsZut","source":"ziprecruiter","full_description":"Software Development Engineer Internship - Notification CenterSoftware Development Engineer Internship - Notification CenterThe Smartsheet Notification Center service is the back-end service that supports both the in-app \"Notification Center\" (desktop and mobile app) and email notifications, mobile push for iOS and Android devices, and notifications in third-party messaging apps.You will integrate Smartsheet capabilities in an external platform integrating communications and collaboration services.You will be a remote employee who will report to an Engineering Leader, based out of our Bellevue, WA office. This is a full-time internship, that pays $35.00 an hour.You will:1. Develop an integrated user experience 2. Design services and integrations 3. Develop integrations between products 4. Work on Pacific Time (PST)You have:1. Service design and development skills 2. Java skills 3. React development skills 4. Develop services using a SDK from a 3rd party 5. Legally eligible to work in the U.S. on an ongoing basisEqual Opportunity Employer:Smartsheet is an Equal Opportunity Employer committed to fostering an inclusive environment with the best employees. We provide employment opportunities without regard to any legally protected status in accordance with applicable laws in the US, UK, and Australia. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.At Smartsheet, we strive to build an inclusive environment that encourages, supports and celebrates the diverse voices of our team members who also represent the diverse needs of our customers. We're looking for people who are driven, authentic, supportive, effective, and honest. You're encouraged to apply even if your experience doesn't precisely match our job description-if your career path has been nontraditional, that will set you apart. At Smartsheet, we welcome diverse perspectives and people who aren't afraid to be innovative-join us!DepartmentEngineering - Internships (Summer 2021)Job LocationBellevue, WA or Field"}