{"title":"Automotive Master Certified Diesel Mechanics","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK9CUet35h_R-BGBPOltIdonO3wT00rxHir63ocoD_YsZ2gW6h3XHS4N4rl4i0IB4AgPhUiUmmOc5zFxlZRJkb4_CS-nhU7Ssj2kyCGGa2uSqgJY3PPFT99MtZLq_VYvn722OC4l2IUctVKZyN1RnHX4apn_OobcAS8TcdFV6Rg4vYZ3E7ggtEq4ukGImV2","source":"ziprecruiter","full_description":"4901 29th Street, Greeley, CO 80634Come Join Our Spradley Barr FamilyHiring Master Certified Diesel Technicians as well as A, B, and C Level Main Line Gas Engine TechniciansUp To $5,000 in Relocation/Sign-on Bonus Available*Spradley Barr Ford of Greeley is expanding, opening a new state of the art Fleet Service facility in Greeley, CO February 2021, adding 7 bays to our existing 22 bays to serve our expanding business. One of the busiest service facilities in Northern Colorado, serving Weld and Larimer Counties since 2007. We are looking for bright, motivated, energetic professionals to join our world-class team.Our family-owned stores and culture make a difference, with three locations in Greeley, Fort Collins and Cheyenne, WY. Grow your career with Spradley Barr Greeley and discover the difference that builds lasting relationships with our community, customers, and employees alike. Upload your resume with pay history and complete the online assessment for immediate consideration.We offer an excellent benefit package, including: Up to $5,000 relocation/bonus for qualified applicants*Master Certified Diesel technicians, 100K+ income potentialPartially paid Medical, Dental and Vision coveragePartially funded 401(k) retirement planPaid vacation and sick leaveEmployee discounts on Sales, Service and Body ShopCareer advancement opportunitiesClosed on Sundays!Qualifications:Three to five years of verifiable experience is requiredFord Dealership experience is preferred, not requiredValid driver’s license with acceptable driving recordMust be current US resident, able to pass background check, drug testWe are an Equal Opportunity Employer"}