{"title":"Chemist (Senior Science Officer)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ0ZyHIYRRRHXJVKPVatY5KrhoGRfYPUttHmI-GbHJvt_N_weQBxmG8awt9oExeF4g1h4hlO4pnhFukhWmtMhrslxukESQtREDfK6bsljtWoKtnW7wsxRJ3g8owPZzQ7uvNw8WolI3u9sfma0Blz-d37X7moLKIjpC3_B0FgCEKZsF55h6wzHGsRRIZiBhN","source":"ziprecruiter","full_description":"DutiesHelp## Duties### SummaryOrganizational Location: This position is with the Department of Homeland Security, within U.S. Customs and Border Protection, Office of Laboratories and Scientific Services Directorate, Washington D.C.Learn more about this agency### ResponsibilitiesThis position starts at a salary of $117,191.00 (GS-14, Step 1) to $152,352.00 (GS-14, Step 10) with promotion potential to $152,352 (GS-14, Step 10).In this position, you will become a key member of the Laboratories and Scientific Services Directorate team performing the below typical work assignments: Reviewing, analyzing, and assessing proposed new or updated agency-wide policy to advise senior leadership on potential operational or administrative impact or opportunities and provide recommendations on the implementation of policy. Planning, developing, implementing, maintaining, and monitoring of programs, policies and systems designed to provide effective and efficient forensic, scientific, technical and administrative support to field laboratories and CBP operations offices. Leading comprehensive scientific reviews and analyzing programs, policies, and procedures for overall technical uniformity, field technical operability, and the development of scientific and technical decisions for tariff classifications.### Travel Required25% or less - You may be expected to travel for this position.##### Supervisory statusNo##### Promotion Potential14 #### Job family (Series)1320 Chemistry#### Similar jobs Chemists RequirementsHelp## Requirements### Conditions of Employment You must be a U.S. Citizen to apply for this position Males born after 12/31/1959 must be registered with Selective Service You may be required to pass a background investigation and/or polygraph Upon appointment, you may be required to undergo random drug testing### QualificationsIndividual Occupational Requirements:To be eligible for consideration, you must submit the required documentation with your application package showing that you meet the requirements such as college transcripts from an accredited institution (must show you meet the educational requirements outlined in this announcement), certifications, proof of training, statements of qualifications, etc.Basic Requirements:A. Degree: physical sciences, life sciences, or engineering that included 30 semesterhours in chemistry, supplemented by course work in mathematics through differentialand integral calculus, and at least 6 semester hours of physics.orB. Combination of education and experience -- course work equivalent to a major as shown in A above, including at least 30 semester hours in chemistry, supplemented by mathematics through differential and integral calculus, and at least 6 semester hours of physics, plus appropriate experience or additional education.Specialized Experience:You qualify for the GS-14 grade level (starting salary $117,191) if you possess one year of specialized experience, equivalent to the GS-13 grade level in the Federal government, performing duties such as: Reviewing, analyzing, and assessing proposed new or updated agency-wide policy to advise senior leadership on potential operational or administrative impact or opportunities and provide recommendations on the implementation of policy. Planning, developing, implementing, maintaining, and monitoring of programs, policies and systems designed to provide effective and efficient forensic, scientific, technical and administrative support to field laboratories and CBP operations offices.* Leading comprehensive scientific reviews and analyzing programs, policies, and procedures for overall technical uniformity, field technical operability, and the development of scientific and technical decisions for tariff classifications.TRANSCRIPTS ARE REQUIRED. FAILURE TO PROVIDE TRANSCRIPTS WILL RESULT IN LOSS OF CONSIDERATION.Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.**You must:*** Meet all qualification requirements, including education if applicable to this position, subject to verification at any stage of the application process; and* Meet all applicable Time in Grade requirements (current federal employees must have served 52 weeks at the next lower grade or equivalent grade band in the federal service) by 05/02/2019.The Office of Personnel Management (OPM) must authorize employment offers made to current or former political appointees. If you are currently, or have been within the last 5 years, a political Schedule A, Schedule C, Non-career SES or Presidential Appointee employee in the Executive Branch, you must disclose this information to the Human Resources Office.Background Investigation: U.S. Customs and Border Protection (CBP) is a federal law enforcement agency that requires all applicants to undergo a thorough background investigation prior to employment in order to promote the agency's core values of vigilance, service to country, and integrity. During the screening and/or background investigation process, you will be asked questions regarding any felony criminal convictions or current felony charges, the use of illegal drugs (e.g., marijuana, cocaine, heroin, LSD, methamphetamines, ecstasy), and the use of non-prescribed controlled substances including any experimentation, possession, sale, receipt, manufacture, cultivation, production, transfer, shipping, trafficking, or distribution of controlled substances. For more information visit this link.Probationary Period:Current and former federal employees may be required to serve or complete a probationary period.Agency Career Transition Assistance Program (CTAP) Eligibles: If you have never worked for the Federal Government, you are not CTAP eligible. Information about CTAP eligibility can be found here. You must submit the supporting documents listed in the \"Required Documents\" section of this announcement. In addition, to be considered well qualified under CTAP, you must possess the knowledge, skills and abilities and/or competencies clearly exceeding the minimum requirements of the position. This will be measured by a score of 85 or higher.### EducationPlease see the Qualifications and Required Documents sections for more information if education is applicable to this position.### Additional informationThis position is not covered under a bargaining unit.Telework may be available on a regular recurring or situational basis.CBP uses E-Verify, an internet-based system, to confirm the eligibility of all newly hired employees to work in the United States. Learn more about E-Verify including your rights and responsibilities.Every individual receives a fair opportunity throughout the federal recruitment and hiring process. Learn more here.Follow U.S. Customs and Border Protection on Twitter @CustomsBorderRead more### How You Will Be EvaluatedYou will be evaluated for this job based on how well you meet the qualifications above.Applicants will only be considered for the Eligibilities for which they claim (and provide supporting documentation) based on the responses provided in the job questionnaire: https://apply.usastaffing.gov/ViewQuestionnaire/10468306We will review your resume and supporting documentation to ensure you meet the basic qualification requirements. If you meet the minimum qualifications, your experience, education and training will be rated using an online self-assessment questionnaire based on the competencies and/or knowledge, skills, and abilities listed below. You will receive a score ranging from 70-100 based on your responses. Your entire application package will then be reviewed. The final determination will be based on all the information provided in your application package.If you are best qualified, you may be referred to the hiring manager for consideration and may be called for an interview. To preview the job questionnaire, see https://apply.usastaffing.gov/ViewQuestionnaire/10468306Knowledge, Skills, Abilities and Other Characteristics (KSAOs):Candidates who meet the minimum qualification requirements are required to possess certain Knowledge, Skills, Abilities, or Other Characteristics (KSAOs) to successfully perform the functions of this position. Candidates will be asked to demonstrate their attainment of these KSAOs in their resume. The KSAOs are: Knowledge of chemistry and its application on a wide variety of areas including chemical and physical analysis of illicit goods and merchandise, and requirements of admissibility of goods and merchandise related to the Tariff classification and Customs laws. Knowledge in the interpretation of CBP laws, policies and regulations, researching precedent decisions and requirements of other Federal agencies laws and regulations. Comprehensive and practical knowledge of CBP and government-wide operational administrative procedures, policies, laws and regulations. Ability to organize and coordinate thorough and systematic efforts to meet operational and programmatic needs.Read more### Background checks and security clearance##### Security clearanceTop Secret##### Drug test requiredYes Required DocumentsHelp## Required Documents Your resume: A resume describing your job-related qualifications is requ..."}