{"title":"Technical Support Coordinator-Data Analyst","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALZYe6UkXp3r5aPQN0erBaTRiN-ACdN3GCGCZ8xsZ7AIF1B0RUB1q-Xo4bROOa5k2XxUMJAoiHMPatiaARP6y2vUvuopFHmV6fXYk3FQWQIUN0BXqa3qRZKLKfNJi4nQur916UuUIlbN9aGmQMm1ZJQigc-4S0A-SQ10iujRJ15Fz1ATwhCAPcq1w6UxDWu","source":"ziprecruiter","full_description":"Position Type Permanent Staff (SHRA) Is this an internal only recruitment? No Position Title Technology Support Technician - Journey Working Title Technical Support Coordinator-Data Analyst Position Number 00055515 Vacancy ID P012444 Budgeted Hiring Range $47,771-$53,000 Pay Band Information To learn more about the pay band for this branch and role, please see the Career Banding rates spreadsheet. Salary Grade Equivalent IT01 Full-time/Part-time Permanent/Time-Limited Full-Time Permanent If time-limited, estimated duration of appointment Hours per week 40 Work Schedule Monday-Friday 8:00-5:00 Department Name and Number School of Nursing-IIT-440147 Date First Posted 03/05/2021 Closing Date 03/11/2021 Position Location Chapel Hill, NC Position Posting Category Information Technology  Department Description The School of Nursing strives to meet the teaching, research and public service missions of the University by: providing quality education for nurses in baccalaureate, master's, post-master's, pre-doctoral and post-doctoral programs and continuing education programs generating, integrating, disseminating, and using knowledge for practice and policy providing visible nursing leadership with state, community, and regional health care providers and policymakers participating in clinical practice and community endeavors in North Carolina as well as nationally and abroad.Information & Instructional Technologies in the School of Nursing provides informational, instructional and technological services that support the achievement of the educational, research, and service goals of the School. Services are delivered by five units: Classroom Technology & Teaching Support Database & Web Applications Services Educational & Design Services User Services & Networking  WebmasterOur client base is the full spectrum from provision of the technology/infrastructure to ensuring its most effective use in support of the comprised of the faculty, staff, administration and students of the School and our services span activities of each group. Equal Opportunity Employer The University of North Carolina at Chapel Hill is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender, gender expression, gender identity, genetic information, race, national origin, religion, sex, sexual orientation, or status as a protected veteran. Position Description The Data Analyst is responsible for providing technical support to SON faculty, staff, students, and visitors. Duties include: -Data Analyst role for desktop/laptop procurement, Installation, maintenance, troubleshooting and surplus tasks for SON software and hardware. Assist with SON software deployments and upgrades. Contribute to documentation and record keeping. Manage user support tickets/requests in ticketing system by responding within SLA. -Provide administrative and user support for standard SON applications including Qualtrics, Tableau, SharePoint, and CSS and HTML. Maintain expert level knowledge of standard applications and research new applications. Contribute to training documentation and recorded resources. -Backup for our Primary support staff for Sakai. Provide support for instructional and classroom technologies. Meet with faculty as requested to provide guidance for SON classroom technologies. Contribute to the development and maintenance of teaching and learning resources. Maintain expert knowledge of SON and Campus standard teaching and learning tools. Assist Instructional Designer and Technology Support Analyst roles with creating and supporting faculty-owned sites and resources. -Assess current SON enterprise reporting processes and provide process improvement recommendations for accessing data, creating reports and dashboards. Contribute to Team website content development and maintenance. Minimum Education and Experience Requirements Graduation from high school and one year in the field of technology related to the position's role.  - Computer coursework may be substituted year-for- year for the required experience; or an equivalent combination of education and experience.  - Journey level requires an additional six months experience  - Advanced level requires an additional one year of experience. Essential Skills, Knowledge and Abilities Advanced knowledge as demonstrated by an in-depth understanding and use of general principles, theories, and practices pertinent to the area of responsibility. Serves as a technical expert in a specialty area. Serves as technical resource for other technicians, inclusive of training.Exhibits knowledge of other work specialties and the ability to integrate this knowledge to develop and communicate solutions. Guides journey level technician with technical solutions. Resolves complex problem within a work area.Able to identify trends and make suggestions for technical modifications to prevent future problems. Able to make decisions based on weighing options and consequences. Knowledge of other work specialties and the ability to integrate this knowledge to develop and communicate solutions.Consults with clients and higher-level specialists and analysts to resolve advanced technical problems and ensure customer satisfaction.This position reports to the IIT Manager and provide technical support to UNC School of Nursing faculty, staff, students, visitors, and peers for a variety of hardware, software, operating systems and networks. Principal duties require expert-level technical knowledge and analytical skills in diagnosing and resolving customer problems in person, over the phone and remotely. Resolve complex technical problems will the collaboration of internal and external technical support groups. Problem escalation to Campus support teams when appropriate. Duties also include documenting work, contributing to technical projects, and training. Support the technical mission, goals, visions and priorities established by the leadership of the School of Nursing. Candidate must have excellent customer service skills and work well in a team environment. Preferred Qualifications 2 years of technical support. Experience providing technical support to users with various level of expertise. Required Licenses/Certifications Special Physical and Mental Requirements Position/Schedule Requirements Position Attributes Stimulus/ARRA Funded No Quick Link https://unc.peopleadmin.com/postings/189298  Office of Human Resources Contact Information If you experience any problems accessing the system or have questions about the application process, please contact the Office of Human Resources at (919) 843-2300 or send an email to employment@unc.eduPlease note: The Office of Human Resources will not be able to provide specific updates regarding position or application status."}