{"title":"Technical Specialist - Lev (Remote) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKzaIVqI_R-K3N_UJqA-csts8mSZBAeAQriUvxZoRcQmwRD9PuQLTlspTC2EEm72MDgo_qWRqeDsOa176fcIGYkxXlG6Ymd_KWPhCYmMyHO5qswyyIEqWwHTGYsJ2R7LbqvzlQWCV_5SFCxwXOcxKpGAEr3UgUbHR7r6uneGPeo2cyAkp5pTFMHtdrH8FAk","source":"ziprecruiter","full_description":"WHAT IS LEV?Lev is a digital consultancy that works with marketers to level up their customer experience using Salesforce products.We're a marketing-focused consultancy that's all about improving the customer experience. We weave strategy and expertise into every solution to level up customer engagement and drive marketing success. While Salesforce gives organizations the foundation and flexibility to power even the most complicated businesses, Lev helps you put plans into action so you can get the most out of your investment.As a Salesforce Platinum Partner, we're building a team of marketing strategy experts that helps brands leverage Salesforce products to better connect with their customers. We have offices in Indiana and Arizona, and remote workers across the country. We hire the best and brightest in the industry. Sound like you? Keep reading. This position is available for Remote Candidates across the United States. RESPONSIBILITIESDevelop foundational platform knowledge and related technical skills required to contribute value as a member of a project team.Participate in consultative engagements including workshops with customers on technical and business goals and challenges.Advise customers on the deployment or optimization of their Salesforce applications, which can include demonstration of key capabilities and features, project implementation guidance, deployment best practices, and answering questions on the latest Salesforce platform best practices.Proactively search for ways to positively impact your clients' success.Quickly build confidence with customers through demonstrated platform expertise and intense focus on their success.Using your business analysis skills, document comprehensive user stories, requirements, and conceptual or technical overviews of solutions.Define detailed solutions based on customers' business needs taking into consideration their current environment and limitations.Perform other duties as required and assigned.QUALIFICATIONSBachelor's degree or equivalent experienceStrong technical aptitude and an ability to learn new technologies quicklyPrevious internship or professional experience in a technical or consulting role preferredPrevious experience in marketing preferredBONUS POINTS IF...Candidates have experience with SQL, HTML, CSS, & JavascriptKNOWLEDGE, SKILLS, AND ABILITIESAbility to travel to locations throughout the U.S. and Canada (up to 25% based on client needs)Client engagement skillsStrong problem solving skillsEffective communication skills, both written and verbalSelf starter who is able to work independently and as part of a teamCognizant will not sponsor H-1B or other U.S. work authorization, or lawful permanent residence (otherwise known as a \"Green Card\") for this role."}