{"title":"Test Technical Writers (#1620721)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKKP5HHQkfa8Y8YH59VsQEcYc-BaKKUeFa2wTfeGi9bYmgWmpY1haVjDfS4QxJmxevafQxd72RBM_C-W5QdO2znJVFJcx-cdNt7_OG1BMMT9LJtPSYvv7ZH9ZPeyxqb7uRgsgJk5Cnl3395yIl1gLtrX5Q4bvM9WetUsAqK5pKLj0nV4cLQ_vUdiIVunfSq","source":"ziprecruiter","full_description":"Team PeopleTec is currently seeking multiple Test Technical Writers to support our efforts on MDA's TEAMS NEXT contract.Required Skills/Experience:Capable of gathering, analyzing, translating, and composing technical information into clear, readable documents to be used by technical and non-technical personnel, to produce high-quality technical documentation in collaboration with subject matter experts, primarily in engineering or program management disciplines. Capable of editing customer deliverables, reports and documents, quickly grasping complex technical concepts and making them easily understandable in text and pictures. Able to conduct research and ensure the use of proper technical terminology. Must be proficient in technical writing and Government reporting/documentation techniques. Must be proficient in writing test plans, test processes and procedures, and test reports. Must be able to address Congressional, Government Accountability Office (GAO), DTE&A)/DOT&E executive-level correspondence and reporting. Must be able to review and update Test Policy & Controls, Test Issuances, Test Procedures, and Test-specific plans and policies. Must be able to generate Standard Operation Procedures (SOPs), templates, and similar documents. Must possess excellent written skills in English and a strong working knowledge of Microsoft Office.Must be a U.S. CitizenAt minimum, an active DoD Secret clearance is required to perform this work. Candidates are required to possess and maintain this level of clearance during their employment.Education Requirements:A BA/BS degree in journalism, English, communications, engineering, or another related field with 5 years of relevant experience is required#cjpost #dpostEOE/Minorities/Females/Veterans/DisabledPeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address,HR@peopletec.comand/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc.All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.Job Posted by ApplicantPro"}