{"title":"Systems Engineer Aerospace NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIjTzA0krkF5ZE2zqX-LF8WjY2U9Dn4QLCPJ0GbQPa2IjBiZhsicOc09P_JsjenQHfKgPS0IUtwrWFnnryDwpPyaH0V8_OwKOP5_2itWfiM0j9mFgn0IDUlkBRnElSx533sQDMuJjiUaV0Ymaa5O7HMnodEdm-hPUTH-M6Cfeghp_c_eEQ3OQxS8g610qc","source":"ziprecruiter","full_description":"5-D Systems, a KRATOS Company, is seeking a highly motivated candidate who will provide systems engineering technical contribution and leadership. This position is full-time and requires the ability to successfully work in a team environment. The systems engineering focus is support to unmanned, manned, and optionally piloted aircraft platforms. The successful candidate must be able to develop requirements, create system design documentation, utilize and maintain existing analytical models, develop new models, and plan and conduct tests to validate requirements.This position will interface with internal and external project team members, company personnel, and the customerAnalyzing customer/stakeholder requirements, decomposing requirements, deriving requirements, and allocating requirements to system and subsystem elementsDeveloping system architecture for new and existing systemsConducting trade studies and performing design research of basic engineering concepts and explorations to determine optimal requirements and system architectureDevelop test plans and reportsDevelop test cases based on requirements documentationDeveloping system/subsystem interface definitions, system schematics, and system design documentationLead and conduct testing as applicableWorking in adherence to structured and defined development processesWorking in conjunction with Software Engineering team to develop software system requirements and test requirementsParticipating in planning, design, testing, and deployment of moderately complex, engineered systems and software to ensure conformance with functional specifications and customer requirements.Performing peer reviews of fellow team members’ workReporting project and task status to project tasking leadAssisting in preparation of proposals and presentation materialsTraveling to customer locations as needed (>25% travel may be expected at times)Experience & CapabilitiesExperience developing system requirements and architecture in conjunction with engineering teamSelf-directed, sharp analytical abilities, excellent communication skills, and capable of working effectively in a dynamic environment, technical leadership capabilitiesResults-oriented, sense of ownership, urgency, and driveExperience working within the Defense and/or Aerospace industry is a mustExperience in Aircraft is a must; experience in unmanned aircraft is a plusQualificationsBachelors or master’s degree in Aerospace or Electrical Engineering7-15 years of industry experienceMust be a U.S. Citizen or Permanent ResidentA U.S. DoD Secret Clearance or higher (or the ability to obtain such a clearance if needed)"}