{"title":"Manufacturing Quality Engineer- tt NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJyVwve8dZLRgWTQ8zowzgdGiyg1vEzG-jtXKzKG2TW7pW6-FlnNenwzVeOakBkl1ax69rOJRO0KLV6nNMET-4r0LRwazNbTZaHjuPBRyl_Iq4gcJO4kHttueas7qIp4w3qXpa5qy8Zojp-FbJHKEZnrPmzV1udIF9WEw6sdnaNSOUdOqQY8Vz4_GQ-EQ","source":"ziprecruiter","full_description":"This is a contract position for 6months with possible extension. Will work in Buena, NJJob Responsibilities:Develop and improve manufacturing processes by studying product and manufacturing methods supporting Quality improvement objectives. The end client is a Plastic Packaging, dispensing for medical deviceJob Duties:Evaluate manufacturing processes by designing and conducting research programs; applying knowledge of product design, fabrication, assembly, tooling, and materials; conferring with equipment vendors; soliciting observations from operators.Develop/improve manufacturing processes by studying product requirements; researching, designing, modifying, and testing manufacturing methods and equipmentImproves manufacturing efficiency by analyzing and planning workflow, space requirements, and equipment layout.Assures product and process quality by designing/improving testing methodsWriting and executing product and process Validation protocols (IQ/OQ/PQ)Provides quality-related manufacturing decision-making information by calculating production, labor, and material costsPrepares product and process reports by collecting, analyzing, and summarizing information and trends.Provides manufacturing engineering information by answering questions and requests.Maintains product and client reputation by complying with government regulations.Develop/improve SOP’s and Work Instructions per Clients standardsAuthor and finalize training contentSkills and Knowledge: A minimum of 5 years of relevant experience as a Manufacturing / Quality Engineer in the medical device industry with plastic molding experienceDemonstrated knowledge of regulations and standards that apply to the medical device industryIn-depth understanding of the application of quality systems to the medical device industryFamiliarity with Lean, 5s practices preferredExcellent communication skills at all levels both written and verbal.Ability to travel 10-15% (domestic)Equal Opportunity Employer/Veterans/DisabledTo read our Candidate Privacy Information Statement, which explains how we will use your information, please visit https://www.entegee.com/candidate-privacy-information-statement/The Company will consider qualified applicants with arrest and conviction records."}