{"title":"Director, Medicinal Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALKRd-XSutQEoW11EG_cp05dW-fRgMDpuEVmGHxsOj5ESPEqTXPnAK54g40hrQxThbiaMfw4X7WjgdPYUT3WE2Bbte4KRnxAezp7OyOxisKsYHsqwBpevVpkz22dHxidcSTc1Vr4w0MsIIozphvo6z4GxGJohQzgwMJ5v_Alz3pAJELalUtKxobE1tDGQ","source":"ziprecruiter","full_description":"Deerfield Discovery and Development, LLC (3DC) engages in drug discovery research in collaboration with faculty from top universities across the United States. 3DC is the drug discovery arm of Deerfield Management Company, L.P. (“Deerfield”), an investment firm dedicated to advancing healthcare. The goal of 3DC is to enable portfolio companies of Deerfield’s investment funds to create a pipeline of medically important and commercially viable projects at a scale sufficient to produce value for patients and investors. Project teams will consist of scientists from a wide variety of disciplines (chemistry, biology, computational science, software and automation engineering), working together in a highly collaborative environment to advance these goals.  Title: Director, Medicinal ChemistryWe seek an entrepreneurial Medicinal Chemist with strong technical and problem-solving skills in Organic and Medicinal Chemistry, to serve as a Director, Medicinal Chemistry for 3DC. The successful candidate will join an emerging company with a unique approach to discovering next-generation small molecule therapeutics.  The ideal candidate is well-versed and experienced in organic synthesis and medicinal chemistry; has experience managing outsourcing of medicinal chemistry-related activities; and has exceptional written and oral communication skills, interpersonal skills and critical thinking skills. The candidate will have experience applying (i) structure-based drug design, including optimization of potency, and selectivity and (ii) in vitro and in vivo ADMET data, including interpretation of PK/PD studies, to lead optimization.  Experience participating in and leading multiple programs from Hit Identification to Clinical Candidate is highly desirable.nical Candidate is highly desirable.Responsibilities:Working collaboratively with colleagues from Discovery Biology, Computational Chemistry, Translational Sciences, DMPK, Process Chemistry and Safety Assessment, provide functional expertise and leadership across a portfolio of small molecule projects resulting from our academic collaborationsProvide leadership in the design, synthesis and characterization of molecules as part of drug discovery efforts.Develop Structure Activity Relationships (SAR) and conduct multi-parameter optimization to identify high-quality drug candidatesProvide functional expertise and input in the development of work plans (from lead identification to drug candidate selection) for small molecule programsCoordinate and oversee outsourced synthesis and biological evaluation of lead compoundsContribute to development of novel chemical approaches to next-generation therapeutics.Contribute to intellectual property. Qualifications:Ph.D. in organic chemistry with hands-on Medicinal Chemistry experience and a track record of accomplishment in the (bio)pharmaceutical industryDeep knowledge and demonstrated problem-solving skills in Synthetic Organic and Medicinal ChemistrySignificant experience applying structural information and molecular modeling to the drug design processHave a deep understanding of organic chemical reactivity and complex molecule synthesis.Hands-on experience with modern analytical instrumentation to elucidate chemical structures.Excellent understanding of the drug discovery process and a proven track record of contributing to the identification of lead compounds and clinical candidates.Strong oral and written communication skills.Excellent team player.Have experience coordinating outsourced Synthetic Organic and Medicinal Chemistry programs. 3DC provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to religion, race, creed, color, sex, sexual orientation, alienage or citizenship status, national origin, age, marital status, pregnancy, disability, veteran or military status, predisposing genetic characteristics or any other characteristic protected by applicable federal, state or local law.PM18#LI-DNI"}