{"title":"Software Engineering Intern NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKvUpL3zhUrWsY5wSyeUSH5p0gTL3yYVblRMlNVel3h0xWEJUPvavue17trQYHBCApyK5MAaYyYJ1riyimkhQjVLfANGjP1jEUfRiN2YPPYrn_wMqKFCsmOC5C9_SZ8wNzPOqh58EFe1xGTkKpej0wGS81zwjyQiR2DSvUAHNbSG74Q79LV5RYFIE8-Pfs","source":"ziprecruiter","full_description":"Experian is very excited to share this internship opportunity with you. We are looking for someone who can start immediately, even if only part time while you are still in classes. Then in the summer you could work full-time hours.  About us, but we'll be brief Experian is the world's leading global information services company, unlocking the power of data to transform lives and create opportunities for consumers, businesses and society. We're investing in the future, through new technologies, talented people and innovation so we can help create a better tomorrow. We embrace our diversity yet share similar values and growth mindsets. We are thrilled to share that FORTUNE has named Experian one of the 100 Best Companies to Work For. In addition, for the last five years we've been named in the 100 \"World's Most Innovative Companies\" by Forbes Magazine. What you'll be doing Experian is seeking a Software Engineering intern that wants to develop their skills and have an opportunity to work with the latest technologies and data architectures. While this is a fairly general job description to start, we'll certainly have defined projects by the time you are ready to start with us. It's safe to say that you'll be exposed to microservices architecture, hybrid cloud environments, Big Data architecture, Java microservices, streaming services like Kafka, etc.  What your background looks like Currently enrolled or just completed Bachelor of Science degree in Computer Engineering, Computer Science, Software Engineering, or related field.Knowledge of one or more programming languages and operating environments.Knowledge of software development and project management methodologies.You have experience writing code in Java or Python You are curious and you can't wait to learn new technologies Experian is proud to be an Equal Opportunity and Affirmative Action employer. Our goal is to create a thriving, inclusive and diverse team where people love their work and love working together. We believe that diversity, equity and inclusion is essential to our purpose of creating a better tomorrow. We value the uniqueness of every individual and want you to bring your whole, authentic self to work. For us, this is  The Power of YOU and it ensures that we live what we believe."}