{"title":"Memory Software/Hardware Development Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL74tHiyuJTDJtwVdJwo51fwfDaNO-Htfxhq-IajqYqSDhauIPCUIzfzeFTFF-OI30eEFX-FHaIoukarfVEgkphc5Bt12a3mTdLRSR-ooV2g-kpcKAQa_OctOcuIsWLoJoRUKIAp7VLPMKOmJbx2Ud788poa7WNa0q1ux0EsxL_Mw8KrZtBerW0eERcttqc","source":"ziprecruiter","full_description":"Memory Software/Hardware Development Engineer Country:USState:TEXASCity:AustinCategory:Hardware Development & SupportRequired Education:Bachelor's DegreePosition Type:ProfessionalEmployment Type:Full-TimeContract Type:RegularCompany:(0147) International Business Machines CorporationReq ID:371360BRTravel Required:No TravelMin Salary:Max Salary:Currency:Location:Austin, TX US View Full Description  Introduction As a Hardware Developer at IBM, you'll get to work on the systems that are driving the quantum revolution and the AI era. Join an elite team of engineering professionals who enable IBM customers to make better decisions quicker on the most trusted hardware platform in today's market.  Your Role and Responsibilities Responsibilities:Develop Software/Firmware functions to Initialize IBM Power Server MemoryDebug and resolve Software/Firmware and Hardware interaction failuresDevelop Software tools to enable Memory Characterization activities using variousprogramming languages such as Perl, Python, C/C++Execute electrical, functional, and system tests of IBM Server Memory Sub-system test plans as part of a post-silicon Power-System Memory Engineering team.Verify system functionality to product specification using hardware and software validation tools, oscilloscopes, and logic analyzers.Develop technical test plans to support system level bring-up and the validation execution of IBM Server Memory Subsystem.Analyze & debug electrical and functional test data to drive into production risk-call decisions Required Technical and Professional Expertise BS-EE / BS-CE / BS-CS or Masters plus at least 3 years of directly related experience; an advanced degree will be considered a plus.Expertise in programming / scripting language (C/C++, Python, Perl, ...) Debugging skills at SoC and System levelDemonstrated technical expertise in the development and execution of system level memory interface electrical and functional test plans.Demonstrated experience with or knowledge using oscilloscopes, reading schematics and layout design files to characterize high-speed IOsMust be a self-starting team player with excellent communication skills who can work with minimal guidanceGood written and oral communication skills, with the ability to communicate with a variety of engineering disciplines and management.Passion and hunger to learn new technology every day and drive to getting things done Preferred Technical and Professional Expertise Knowledge of modern Server uArch (Power, Z, x86, ARM) and system technologies (DDR or other High-Speed IOs such as PCIe, SATA, USB)Knowledge of modern OS kernel (Linux, AIX)  About Business Unit IBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the world's most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio  designed for cognitive business and optimized for cloud computing.  Your Life @ IBM What matters to you when you're looking for your next career challenge? Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust - where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible. Impact. Inclusion. Infinite Experiences. Do your best work ever.  About IBM IBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.  Location Statement For additional information about location requirements, please discuss with the recruiter following submission of your application. IBM intends this job to be performed entirely outside of Colorado.  Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}