{"title":"Senior Network Engineer - Colorado Springs, CO NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKhi_hjzTzUydfovexhTUMZPZFIQscC7JVeDtUrofo5jYbO8xtG0KJ-WMkT00oLmB_N9VpvruN5BVdzoIYkTO2WKMkZSXHlwQZAoJz42EeaQ2FpGh4rEua4-k3dpZcsyOoSNe_mcNQ39Y7G3T_G6a-eIP9Kk1NH5mlpIEtN09xwpmT6_4thIPgMjnyC1kU","source":"ziprecruiter","full_description":"Overview https://www.GeeksAndNerds.com/Recruiter@GeeksAndNerds.comAbout GaN: The mission of Geeks and Nerds (GaN) Corporation is \"to deliver innovative and superior services and technology solutions for our customers, Nation and community.\" We are seeking an exceptional candidate for Senior Network Engineer for our government services division.  GaN is an employee-owned ESOP company.  We believe the success of our corporation is directly tied to the well-being and success of our employee-owners. We have been recognized as one of the Top 100 Companies in the United States by the US Chamber of Commerce, Technology Business of the Year by the Huntsville/Madison County Chamber of Commerce, and a BBB Ethics Award recipient. Our Founder, Dr. Kim, has been recognized as the Chamber of Commerce Executive of the Year, IEEE Professional of the year, and Entrepreneur of the year. In addition, our innovative culture has produced over 10 U.S. Patents. Our proven track record of success is only made possible by our extraordinarily talented and dedicated employees. Join us and become an owner of an exciting company with an important mission! Job Overview: GaN is hiring a Senior Network Engineer to join our team in Colorado Springs.   Responsibilities Assist the Chief Engineer and Network Operations Manager with the design, implementation, and support of LAN/WAN networks and systems.Assist the Chief Engineer and Network Operations Manager with the development and maintenance of network system and service configurations.Document and troubleshoot network and system issues.Create and maintain network diagrams and documentation.Test and evaluate network systems and services to reduce problems and make improvements.Assist with the configuration, implementation, and utilization of NetScout devices and other network monitoring toolsProvide network monitoring, troubleshooting, and report during Missile Defense Agency (MDA) test eventsProvide communications (Secure VoIP, Secure Chat) support during missile defense test eventsTravel to support various MDA test eventsWhile traveling, configure network endpoints to include workstations and audio/visual endpoints (IP addresses, EDID settings, audio adjustments, etc.) Qualifications Requirements (minimum): BS degree and five (5) years or more of experience, four (4) years of experience accepted in lieu of degree Experience with Cisco routing and switching design and configurationExperience deploying and managing TACLANEs or other cryptographic equipmentExperience with Microsoft Office applications, including VisioTravel for CONUS and OCONUS support (Up to 25% per year and up to 30 days at a time) Certifications: Must have CompTIA Security+ or CISSP CertificationMust have CCNA or higher Cisco professional certification  Special Requirements:  Must be a U.S. citizen.Must have an active Secret Security Clearance to start  Equal Opportunity Employer:Geeks and Nerds Corporation is an Equal Opportunity Employer. We are pleased to consider all qualified applicants for employment without regard to race, color, gender, sexual orientation, gender identity, religion, national origin, age, marital status, veteran status, disability, genetic information or any other legally protected classifications. Geeks and Nerds Corporation participates in E-Verify."}