{"title":"Principal Software Engineer, Engineering Productivity NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJgskKIPpOIc_wJajr1XFoRNLZ6EMOxPJijHtueeNCzMjqOuGWnkkGe-toDso-4xOWvfvAt9hJcorQeh2jPvPrdwlKwgXd1ViP6-mEvWJ6nHDwiGYba3reQ0TW5hccN3UnTdO3SBZXRWGbMupjN99MRoCyHCoAG_APD1XV01IyhbTmJ83Han9qtVxWy2J0","source":"ziprecruiter","full_description":"Principal Software Engineer, Engineering ProductivitySplunk is seeking an individual who is passionate about helping to create world class software engineering teams. At Splunk we are dramatically improving engineering productivity by continuous improvement of our processes, tools and technologies to measurably increase engineering productivity and job satisfaction levels. You will need to be intimately familiar with large-scale software development and all aspects of the SDLC. You have demonstrated outstanding verbal and written communication and collaboration skills across project and functional teams. Collaboration, creativity, friendliness and perseverance are important traits required to succeed in this role. If you have a passion for creating world-class software engineering teams that measurably outperform previous benchmarks please contact us.Engineering ProductivityWe make engineers more productive and engaged through training, tools, infrastructure and automation.Area Of Focus: Engage with engineering leaders and individual contributors to identify and implement common areas of improvements for their teams.Build tools to help shorten developer cycle time.Build tools and infrastructure to automate manual tasks as part of the software development life cycle to increase velocity.Optimize to improve long term productivity by measuring and driving down wasted time to reduce frustration.Actively engage in design and architectural reviews for infrastructure and tools that enhance engineering productivity and efficiencyConnect engineers to key information and to each other in order to discover useful shared projects and avoid duplicates.Onboard new hires and train existing engineers to be productive as quickly as possible to increase engagement.ResponsibilitiesYou will be contributing code to build tools and infrastructure, set an example for building scalable, testable code with as little future maintenance as possible to help other engineers get their work done faster, with better visibility and higher quality.You are expected to learn new technologies, languages and adapt to our changing business and products.You are expected to partner with our internal product manager to identify common solutions across engineering to shared problems both in Engineering Effectiveness and in engineering organizations and lead the team to solve these common challenges.You are expected to identify tech debt, duplicate products and projects and help the Engineering Effectiveness organization move to an engineering excellence culture.Write software, documentation and tests in order build tools to help engineering teams continue to improve productivityAnalyze and measure engineering processes, systems and tools to support continuous improvement initiatives.Engage with all internal engineering teams to identify areas of improvement.Provide recommendations to monitor, measure and improve all aspects of the SDLC at Splunk.Identify issues, collaborate with stakeholders on solutions and provide follow-up on the implementation.Learn various products at Splunk in order to deeply understand our products in order to engage with all engineering teams.Minimum qualifications10+ years of hands on software engineering experienceExperience in helping multiple teams improve their productivity, velocity and code qualityExperience with at least 2 programming languages in the following order - Javascript/Node.js, Python, Golang, C++, Java.Demonstrated history of learning new technologiesExtensive experience with CI/CD and infrastructure (Jenkins, GitLab or equivalent)Experience with Kubernetes or container orchestration technologiesExperience with delivering SaaS products and hands on with either AWS, GCP or AzureOutstanding written and verbal communication skillsA passion for helping other people generally, and developers specificallyExperience deploying, operating and debugging server software in distributed systemsExperience with leading agile teamsPreferred qualificationsHave used and managed Splunk productsHave conducted new hire or technical training sessionsExperience working on cross-functional teams (product management, customer success, legal, finance, marketing, etc.)Have created tools & automation for yourself and other engineersWritten engineering documentation to help other engineersJoin us as we pursue our disruptive new vision to make all data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our products and seek to deliver the best experience for our customers. At Splunk, we're committed to our work, customers, having fun and most meaningfully to each other's success. Learn more about Splunk careers and how you can become a part of our journey!We value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.Thank you for your interest in Splunk!"}