{"title":"Software Developer 5 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIQZZrlTODs2ps3gB8JXu2CdHeXpyuXg4mYb2XQ2l-wVadn-yVwit-xTO-9DeQ9eRcRkghPOKfy2PNfjQJvsax_Hjwyt9VI9m07tGC_1lvVvhPANkExbGAk_2ke41KYtXBChXDmCuINJK1sXPDMmKgg_l0RALW9RHNni6DAbww3287dQuiW3vSJ2oyQhx0","source":"ziprecruiter","full_description":"Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. Define specifications for significant new projects and specify, design and develop software according to those specifications. You will perform professional software development tasks associated with the developing, designing and debugging of software applications or operating systems.Provide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 or more years of software engineering or related experience.*This is a remote/office based position which may be performed anywhere in the United States except for within the state of Colorado.**Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.*The Oracle Database Tooling team is looking for additional team members. The team produces SQL Developer both a desktop and web version, ORDS , SQLcl, Data Modeler, Cloud Consoles, Cloud Control Plane, and more . We build applications used by millions of users which has impact on database developers in their day to day work.  Specifically we are looking for devops engineers with a strong Oracle DB and web background. This position will be to help steer the future directions of the base products based on real world production usage across many public cloud offerings and the COVID-19 related applications.*What You'll Do Every Day** Design and implement database-driven application features and unit tests. Participate in and drive the team's code review process in an active and timely fashion. Collaborate with fellow team members (Testers, Developers, and Product Managers) to deliver on a shared responsibility for quality. Contribute to product roadmap discussions and implementation. Help lead initiatives that make us stronger as a team (e.g. internal dashboarding, metrics for our success in production, improved build processes). Contribute ideas and effort for continuous improvement for the team, in its Agile process and in its general team effectiveness.Preferred Skills** 5 years of software development experience. Experience designing/implementing high performance Web services using REST Excellent knowledge of Java, Database , SQL ,and PLSQL. RDBMS schema design and development. Good communication skills and team player. Experience in building highly scalable systems. BS or MS degree in computer science or equivalent software development experience. Experience with Javascript, and Kotlin is a plus Exposure to Agile development methodologies.* Experience in building multi-tenant applications is a plus.Job: **Product Development***Organization:** **Oracle***Title:** *Software Developer 5***Location:** *United States***Requisition ID:** *20000QIA***Other Locations:** CA-CA,Canada-MONTREAL"}