{"title":"Electrical / Hardware Engineer NEW!","location":"","salary":"","description":"","term":"$80,000 to $90,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ4AtZFzo_zPnRJIG_59qNOFv393NGrB14D6ZUtGkmTkoOWIjGQswC39cZBtdvxFO3m1jIGkyZdb5sucUB53UUQvIPZcnfPPX5zqV1YMtyddtjzBjNt19GgBnhViNVXFpHXxbquy2aJOn-w2ocffDdEBG17sijkJeUg3QkkfSJaIe61KMa2tHNcOsYpkTU","source":"ziprecruiter","full_description":"You will be responsible for learning and working with seasoned senior hardware engineer that is designing embedded hardware sub-systems, specifying hardware components, system troubleshooting, collaborating with software engineers, and modifying existing hardware platforms to enhance functionality, and designing alternatives for any hard to source or end of life components in existing products. You will perform a variety of electrical engineering design assignments learning and working on multiple products at a time. Design responsibility includes but is not limited to schematic entry, PCB layout oversight for embedded ARM CPU, and measurement subsystems. Responsibility also includes FPGA programming VHDL design and support for high-speed packet processing, design of power supply and battery charging circuits, and high-speed interface design of IEEE 802.3/802.11 networking interfaces.ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned.· Designing and developing hardware systems that include circuit boards, processors, memory subsystems, LCDs, touch screens, and high-speed network interfaces using Cadence Allegro tools.· Designing and developing analog circuits for rechargeable batteries, low voltage power supplies, USB power delivery, and hardware systems for measuring resistance and power-over-ethernet parameters.· Developing and maintaining FPGA designs (VHDL) for custom high-speed Ethernet packet processing and analysis.· Creating hardware design specifications and documents for new products.· Collaborating with software developers to create low level drivers for hardware turn-on and SW support· Working with PCB layout resources for placement and routing of signals to meet signal integrity· Interacting with PC layout and manufacturing for PCB/A fabrication and testing.· Supporting currently shipping products when component or product issues arise by implementing design changes as needed.· Interfacing to our PLM system for specification and control of component parts and bill of materials· Working with component vendors for selection and preparation of detailed specifications for new components· Working with software, mechanical, manufacturing, and test engineers to design and release products into manufacturing.· Understanding and implementing thermal management solutions based on early thermal modeling, bench testing, and chamber testing to find cost-effective thermal solutions as needed.· Conducting EMI/ESD compliance pre-scans and testing and then using mitigating design techniques to ensure designs meet compliance criteria that are needed to ship world-wide.Knowledge And SkillsExperience with PCB/A design for high-speed networking interfaces and embedded CPU subsystems. Experience with Cadence Allegro schematic capture and PC layout tools. Experience with Altera and/or Xilinx VHDL and FPGA design. Experience in design of embedded CPU sub-systems. Knowledge of high-speed communication bus design and layout techniques such as USB, PCIe, XFI. Familiarity with DDR2/DDR3 memory design, and I2C and SPI busses. Knowledge of various hardware debugging equipment, oscilloscopes, logic analyzers, and spectrum analyzers. Experience with EMI and ESD compliance testing and design mitigation strategiesEDUCATION And/or EXPERIENCEBS or higher in Electrical or Computer Engineering, or related experience. Minimum 5 years of experience.Language And Interpersonal SkillsCommunication skills are paramount. The ability to interact with engineers and operations teams to develop new products is essential. Ability to effectively present information and respond to questions from groups of managers, peers, and customers"}