{"title":"Principal Android Engineer - Ballpark App","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALt1wrAdLH0ZG8fCgVp93y9vWfIW5xC3HDzO750XlKIjAu08PvVFvHjwiYHc73nVnC2W8nnM-Nw-1GJCPySxstPHhPPLx54EB9Zc0Bxs4z5zfddNA-GpzjyE8o_Ffx9lnCJ0tinmgPJVsB8TV_TyoUM0rFjsV43b_9-0_vmkyX5JBoptRWGX798h3bu9tl4","source":"ziprecruiter","full_description":"The Ballpark Experience & Ticketing Product team's mission is to merge the physical and digital worlds for fans attending baseball games by creating a magical experience that is easy, fun, and personalized and fosters lifelong memories. Achieving this goal involves mobile application development in areas such as digital ticketing, personalization, map wayfinding, and augmented reality. The Ballpark team is primarily responsible for ensuring that millions of fans have quick and easy access to their tickets on gameday.  What You'll Do: As a team lead for the Android Ballpark team, you will:Leverage backend services to display, manage, and store digital tickets.Build a contextual fan experience that is unique to each fan within the Ballpark application.Lead a team of engineers to architect, improve, and implement cutting edge features into the Ballpark application in order to enhance a fans experience while attending a ballgame.Work closely with the product management team to design new features that will be integrated into the application.Own the Android code base. You will be given the resources, support, and autonomy to drive solutions. Work closely with the Ballpark iOS and backend services teams to create technical solutions that work across both platforms. Work directly with our partners, who are world leaders in cloud and mobile software.Help shape the way fans interact with baseball.Receive amazing benefits - you get 100% employer-paid Medical, Dental, and Vision. QualificationsWho You Are:You have a strong desire to own the Android platform and provide tactical and strategic direction to the team.You're comfortable leading architectural discussions and building consensus.You clearly communicate expectations and provide mentorship to the engineers around you. You're willing to lead technical and architectural discussions and drive the execution of decisions.You're able to triage operational issues and conduct root cause analysis. Requirements:3+ years of software development experienceStrong software engineering practices (requirements gathering, designing, building, testing, and maintenance)Expertise using JVM languages (Java or Kotlin)Demonstrated ability to mentor other software engineers, providing code reviews, etc.Be able to clearly communicate complex technical ideas to a non-technical audience Nice to have:Expertise using the Android SDKAndroid Software Development Patterns and tools including JetPack, MockK and EspressoExperience designing, improving, and debugging Android applicationsFamiliarity with Google Cloud Platform and Firebase would be a plus  Why MLB?Major League Baseball (MLB) is the most historic of the major professional sports leagues in the United States and Canada. Employees love working at MLB because of the culture of growth, teamwork, and professionalism. Employees who are most successful at MLB take initiative, know how to identify problems and provide solutions, and always put the Team first. For those ready to step up to the plate and join the Major Leagues, MLB takes the same approach as teams do with their players: empowering our \"workforce athletes\" to be at their best by engineering experiences that put employees in the best position to succeed. Major League Baseball is looking for candidates who are passionate about growing America's pastime to best serve its fans for decades to come.MLB's vision is to be the global sport of choice for youth to play, fans of all backgrounds to enjoy and a desired destination for employment. With a belief that the journey to growth and greatness is ongoing, MLB gives employees the opportunity to continue learning and honing their skills with programs such as: tuition reimbursement; mentorship programs; lunch and learns; online course subscriptions; paid industry certifications; business resource groups; and more.MLB provides its employees with exceptional medical, dental, and vision coverage. Premiums are 100% employer covered to help employees focus on being their best!Are you ready to Step Up to the Plate? Apply below!"}