{"title":"Facilities Maintenance Supervisor","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKiP8_K4EJ3eeExyD-4jCo7C7VUB8AgN5S2AsY3VlaxqcasRhdfmnwttvsHeezYOOVxVm4BVvAuN9DnC4ru8fuqlH9TWXgD6zUbFPzfkh5p5iN7IKK5c8mthFj957HUOmcsqhpvdFQVY3Xi74--JsDIo4NcH562oR6zMsil1TGPidiF0iWqRhI4LURv3Us","source":"ziprecruiter","full_description":"Facilities Maintenance Supervisor(Pharmaceutical Manufacturing Industry Experience)New Brunswick, New JerseyJob ID:10722Are you looking to make a career change to a stable company? This exciting opportunity offers a competitive salary plus an excellent benefits package including medical insurance, dental insurance, vision insurance and paid PTO.Does this position match your future career goals? Then this opportunity could be the right fit for you.COMPENSATIONCompetitive Salary, Full time, Full BenefitsResponsibilitiesInspect facilities periodically to determine problems and necessary maintenancePrepare weekly maintenance schedules and allocate workRecruit, supervise and train maintenance techniciansHire and supervise tradesmen during installations, repairs or maintenance (electricians, plumbers etc.)Inspect and maintain building systems (heating, ventilation etc.)Contribute to the development of maintenance budget and ensure complianceMonitor inventory of materials and equipmentParticipate in coordinaton of projects (e.g. renovations)Ensure adherence to quality standards and health and safety regulationsRequirementsProven experience as maintenance supervisor or similar roleValid certification in Millwright or Electrician.Strong technical knowledge of all building systems (electrical, heating etc.)CMMS and ERPPharmaceutical Manufacturing Industry ExperienceMaintaining all manufacturing equipment and plant utility systems Boilers, Chillers and HVAC experience Knowledge of health & safety practices and regulationsUnderstanding of budgeting and performance managementExcellent planning and leadership abilitiesProfessional Certifications (e.g. CMRP or HVAC certified) are preferredPerform preventative maintenance on machineryhydraulic, pneumatic s and electrical work.Set up on production equipmentJasleen Kaurjasleen@ajuliaexecutivesearch.comAjulia Executive Search is a search firm specializing in Manufacturing, Finance, IT, Legal and Pharmaceutical positions. This is a confidential search for one of our preferred clients. It is a direct hire position that includes competitive compensation and full comprehensive benefit package.#ZR"}