{"title":"Production Support Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIoShxHpCw1gWOA1MmQsZJ3X4iFhTG24PU4Y5sgymcjL3NngGdiPk8A1TdgAURvEU-iAJ_1OUPGnT0dGdMdLx9SSqiece07C_9hdamIDNiNYfiXqvxLDwQd2naQwhpFHsYgPpANEXxFWA4Fe9KFwbMF0ExJNQDtGhJUYho6GOErBnJ_PSXXf9KTQ22yu4j9","source":"ziprecruiter","full_description":"We have an IMMEDIATE opening for the following:Production Support EngineerRemoteDirect HireAbout the Role:Our client is seeking a Software Production Support Engineer to help delight our borrower’s by providing top notch client support. The team is building our next-generation loan originations and servicing systems. The systems will be used by lenders and servicers in the consumer and mortgage lending markets in the United States. As an agile support engineer, you will be working on a delivery team using modern technologies, tools and frameworks to develop advanced, enterprise business components that can run on Microsoft platforms.Essential Job Responsibilities:• Associate will serve as a dedicated member of our Production Support Team• Troubleshoot and resolve software bugs and deployment issues, strong problem solving abilities• Must be an excellent verbal and written communicator• Must have a positive attitude and be a self-starter who is willing to work independently and learn• Creative problem-solving ability, allowing the individual to identify solid solutions to challenging business issues• A passion for success and willingness to go above and beyond to accomplish goals• Collaborate with managers, other developers, Quality Assurance, Business Analysts. Client Service Representatives and clients to understand requirements and demonstrate progress• Work on an agile team with both onshore and offshore team members to help plan, implement and support enterprise web applications• Design, develop and test new system capabilities, including: HTML, SQL Database skills, .NET Fullstack Development, Applications Development and expose to Cloud Technology and the willingness to learn Azure Applications, Web UI and related AJAX REST API• Document and communicate technical designs, standards and processes as needed• Perform unit and integration testing to ensure application quality• Continuously enhance skills by learning and applying relevant technologies and patternsCurrent experience with Client Facing RelationshipsRequired Qualifications:• Bachelor’s degree in Computer Science or equivalent education in a related discipline is required.Prior Development experience in .NET Technologies requiredJob Related Experience:• Minimum of 5-7 years’ experience in fast-paced software industry with an in-depth understanding web application development.• Agile development methodologyAdditional Skills/Knowledge:• Experience with the ASP.NET MVC stack.• Experience with Team Foundation Server (TFS) and Visual Studio is a plus• Experience with JavaScript, jQuery and AJAX• Experience with Angular and ReactJS• Experience with HTML5, CSS3 and responsive UI design.• Extensive experience with full-lifecycle development (i.e. design, coding, testing, debugging, etc.).• Experience with distributed systems, C#, ASP.NET, REST and SQL programming.• Experience developing or working with web services (REST and Web API preferred)• Experience with test driven development (TDD), dependency injection (DI) and mocking frameworks.Position is remote.For IMMEDIATE CONSIDERATION, please forward the following to my email - judi.baldini@northwestpartners.com:• Upcoming availability• Confirmation of time zone• Updated Word version of your resume• Confirmation of work authorizationUpon receipt, I will send a calendar invite."}