{"title":"Junior Field Service Technician","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKNSpRuM78d29wPciJj-_CK4zFT2L7ZWN3uNQaYSis6NWUgUKzrxwnW85VFxSkTJgoKavKK9NSdiMD9G-f-CAMa5URIzvgATZHfMpNpe-Opv3SLqrzE9pR5nv7O-7ZN3PeMhpoRq_AM3EbgMz0uKr1SW62qluYTZ5qwW9nlBAMKUN-l40CuC3dioEGNnpA","source":"ziprecruiter","full_description":"Junior Field Service Technician**About US**At Vyaire, we help the world breathe easier. As a global leader in respiratory care, we know what we do enables, improves and extends lives. We are a young company with a long history of revolutionary products. We devise extraordinary solutions that allow patients to lead ordinary lives. We believe the best way to create value for our customers, is to become invaluable. We know a dynamic culture with diversity of thought makes this possible. Our colleagues are people who specialize in exceeding expectations, building lasting relationships and making it a priority to listen. We are dedicated to anticipating what's next and get it done. We thrive on contributing and making a difference.To learn more, visit our website: www.vyaire.comWatch our video: https://www.youtube.com/watch?v=ZDrQoMbMRrI&feature=youtu.be**About this role**Vyaire teams are dedicated to connecting clinicians and patients with the highest quality respiratory healthcare solutions in the market. At Vyaire, you will find a company that puts the customer at the center of all we do. Our culture is one that rewards performance and each interaction we have with a customer furthers our mission to be the global leader in respiratory care.We are looking for an entry level Associate Field Service Representative to join our Field Service team. In this role you will provide service and support to select Vyaire respiratory customers and products with direct oversight support from Regional Service Manager and regional peers. In this role, your primary responsibilities include; device installations, repair, preventative maintenance and calibration through the assigned region, with supplemental support in other regions as necessary. You will demonstrate the ability to develop contingency and effective support plans for assigned demand from regional team members. Responsible for promoting and maintaining high customer satisfaction levels and consistently achieving results across all key areas of the business.Focused on growing the business, treating every service event as a growth or lead generation opportunity. Maintain a positive attitude and demeanor, embracing change and influencing peers and team to do the same.Join our team as we as we drive innovation and work together on our mission to save and sustain lives around the world and become the world leader in respiratory care.**Essential Functions:**+ Provide exceptional customer service; ensure customer satisfaction is achieved when resolving customer/product issues and complaints. + Regularly interact and build strong relationships with internal and external customers. + Provide prompt, effective and continuous communication with customers and internal stakeholders about service call status, eta's and resolution status. + Takes ownership of position and proactively engages in coordinating and scheduling servicing activities based on regional demands and priorities. + Promote and produce the sale of service contracts, upgrades, parts, and billable labor revenue to meet established goals and guidelines. + Maintain proper and accurate inventory for the purpose of service and follow approved policies and procedures for Inventory Controls. + Provide accurate and timely documentation that details field activity (FSR's), expenses, time distribution, and other information as required. + Continuous training and self-development to learn Vyaire's products and applications. + Maintain a strong desire to learn the Vyaire field service business with aspirations of developing into a full-line representative as national opportunities present themselves. + Maintain company assets (car, tools and inventories) securely and in working order. + Develop a working knowledge of Corporate and Service Department procedures and policies, including customer complaint handling and Medical Device Reporting. + Demonstrates behavior that cultivates operational excellence by continually challenging old methods or ways of thinking and taking responsible risks to improve results; serve as a positive role model in creative thinking and in focusing on quality work.**Essential Function Requirements:**Credentialing: Employee shall secure and maintain the credentials required by Vyaire Medical and its customers. Securing those credentials may require mandatory vaccinations and other tests. (If employee is unwilling or unable to comply with any credentialing requirement because of religious or health/medical/disability related restrictions, employee must immediately notify Vyaire Medical's Human Resources Department to discuss possible reasonable accommodations regarding those restrictions.)Travel:Up to 80% of the timeDriving: Valid driver's license and clean driving historyLocation: Refer to active requisitionPhysical Demand:Must be able to lift a minimum of 35 lbs. without limitations or constraints**Qualifications:**+ Effectively communicate with internal and external customers. + Provide an excellent customer experience. + Electronic or biomedical equipment repair experience. + IT or network experience. + Understanding and knowledge of respiratory care and/or ventilation principles. + Desired ability to drive operational improvements within a team and business. + Self-starter and motivated to perform effectively during times of high demand. + Ability to work from home with minimal supervision or guidance. + Must have a valid driver's license and maintain a safe driving record. + Must be able to lift 50lbs without limitations or constraints. + Be able to travel throughout the country. + Be able to perform in high pressure environments.**Education** :+ Associate Degree or 2+ years of equivalent work experience. + Certification in information technology, respiratory therapy or process improvement training preferred.**Some Logistics:**+ Home office with 90% daily travel and over 70% overnight travel to customer sites nationally. + Company vehicle provided. + Upon hire must provide proof of and maintain current immunizations and obtain additional immunizations appropriate for the facility which enables access to customer sites in order to perform essential job functions. Proofs include: Hepatitis B, Influenza (current year), MMR (mumps, measles, rubella), Varicella (chicken pox), Annual TB/PPD (skin test), Tetanus/Diphtheria/Pertussis. + To be eligible to be hired you must pass a Background and drug test.Chicago, IL, Cleveland, OH, Denver, CO, New York City, NY, Orlando, FL, Phoenix, AZ, Pittsburgh, PA, Rochester, NY, Tampa, FLFull time **We aspire to a \"higher calling\"** **, aligning ourselves with healthcare providers to improve the lives of those who are treated with our devices.**Across the Ventilation, Respiratory Diagnostics and Anesthesia Delivery & Patient Monitoring market segments, we represent the largest pure-play company of our kind, with an ambitious and innovative vision for growth. We hold each other mutually accountable for the quality and reliability of our products and work together toward setting a new market standard in these categories.**We are transforming the future of respiratory care; explore how you can be a part of it.**We are a unified \"breathing company\", with a global team that is unrivaled in the respiratory care continuum. Each of our 5,000 people worldwide is critical to achieving our shared purpose of improving the lives of those who are treated with our devices. Our people are empowered to \"do the right thing\" every day and always put patients first. Our market presence, breadth of product and technical expertise enable us to impact the lives of patients around the world every day.One of our unique strengths is the diversity of our community. We want to treat each teammate fairly and provide equal employment opportunities regardless of a person's race, color, religion, gender or gender identity, sexual orientation, age, marital status, national origin, veteran or disability status, or any other characteristic.To learn about our terms of use, please review Terms & Conditions (http://www.vyaire.com/terms-of-use) . Also, provided here is a link to our Privacy Policy (http://www.vyaire.com/privacy-policy)One of our unique strengths is the diversity of our community. We want to treat each teammate fairly and provide equal employment opportunities regardless of a person's race, color, religion, gender or gender identity, sexual orientation, age, marital status, national origin, veteran or disability status, or any other characteristic."}