{"title":"          Project Engineer NEW!        ","location":"","salary":"","term":"$60,000 to $65,000 AnnuallyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAI_i3uiWCAASYgCRrN9n3ewyrqIgpCaUs-m0bssf4YAmbmCJi9lbvp8IYdOEvS1iF9e7cstjbzJV5C7pJeNPfpktPgYGw0gpvT38f3CsHuRQNCQKa6Dch89YrF8R6pQojHb01I8yxgJOlE8--fgGILhME4yX1VAV_6r3aC8ybEKE8JixZPz3MWMEqwmo00","source":"ziprecruiter","full_description":"\n        Are you a highly organized and detail oriented professional? Do you have a background in Engineering technology? Do you have a passion to work in aerospace or the defense industry? Then QuEST may have the job for you. Who is QuEST?Our goal is to become the most recognized and trusted global engineering partner for our customers—Fortune 500 companies in the Aerospace, Medical Devices, Oil & Gas, Power, and Transportation industries. We know we can find solutions to their most important technical and business challenges they encounter. We aren’t consultants. We help them make their products the most competitive in the world and that’s how we’ve grown to over 13,000 problem solvers from 70 centers around the world. We aspire to be a 100-year company, which doesn’t mean staid and boring, but rather, we evolve and adapt to create the frontier of the engineering services industry.The TeamQuEST has a track record of scaling services for new customers. We are leveraging that expertise to build a new team in Southern California supporting one of the largest defense contractors in the country. As a member of this team, you will be on the front lines helping establish the next big account for QuEST. Experienced managers in Delivery will be supporting you and the new team as we launch our unique Engineering Process Services model to help our customers recapture some of their precious bandwidth and help them deliver top notch aerospace and defense products.The RoleThe successful candidate will possess a combination of technical and behavioral skills to thrive in an engineering environment. You will perform a critical support role in assisting overburdened Project Engineers. You will help understand the problem, gather necessary information, and prepare documents to obtain approvals for the changes to be implemented. But perhaps most importantly, you will help our customers deliver high quality products on time. How? By being proactive in overcoming obstacles, providing answers to questions, keeping the process moving, and always looking for ways to improve.Our CultureWe just crossed the 21-year mark, and despite remarkable growth, we have maintained a culture of empowerment at all levels—what we call intrapreneurial. You will be part of the decision making to drive continuous improvements so we can stay happy and healthy as a business in a challenging industry. Not everyone is a great fit. We will throw you into the deep end (with lots of support), but if you want to swim, you have much opportunity. We’re not a place where laziness, ego, or rigid thinking fit in, and that’s intentional. You can do more at this company than you can in twice the time anywhere else. We accelerate success; you control the throttle and hold the yoke.Job Functions· Location of assets: Conduct a physical inventory of all accountable property or material and reconcile accountable records.o For example, physical inspection of warehouses, tool cribs, and laboratories.· Documentation of found assets: Enter pertinent information into spreadsheets or material tracking databases to provide details of found assets.· Generation of Lost Reports for assets that cannot be found· Disposition of assets: reuse, retention, replacement or surplusQualificationsWe’re excited to talk to you if:· You hold a minimum AS degree and 2-3 years of relevant experience in engineering, inventory management or material management, preferably in aerospace· Proficiency in SAP with regard to inventory management and material cost· Have solid skills in Microsoft Office tools, especially PowerPoint and Excel· Work well in a team oriented environment· Want to build something that will last long after we have moved on beyond our working years.· Like to work in a fast paced, creative environment without a lot of management oversite. You are independent and forward facing.· Enjoy people and dynamic teams with diverse experiences. We have fun together!Physical Requirements & Work Environment· Mostly office environments, frequent shop floor involvement.· Substantial amount of telephone and computer work.· Heavily regulated industries with strict adherence to procedures.· Flexibility to meet business deadlines by staying late or arriving early.· Typical 9 hour days plus luncho Core (required) hours are 9 AM to 4 PM unless otherwise specified by the customero Customer works a 9 x 80 schedule, meaning every other Friday off· Due to the nature of the work, all candidates must be a U.S. CitizenThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Location: Redondo Beach, CATravel: None expectedCompensation type: Hourly (non-exempt) with a competitive package dependent on level of experienceReports to: Team Lead or Program ManagerContact: TAT_NA@quest-global.com\n      "}