{"title":"Staff Engineer, Android Development Team Lead","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJmtVd108syw-LJxpdrOou8i9PLSmmLG-wldsVIcEBVVrO7qlxbh_NS5IN95Xac4B0gGfH58ute6OX6_v00zvQFEC6MGgzkt3Wd4Qz2V0dGlsklKxngxlukbVgnSm44aAJORRDFzfpXL0ZhV-MZGE84y8FAZMWIENdySsSqycvCoftMILiPPOyKO9aBVJg","source":"ziprecruiter","full_description":"Job TitleStaff Engineer, Android Development Team LeadJob PurposeWhat does a Staff Engineer do?As an Staff Android Engineer, you will be a part of a team of people responsible for creating and maintaining a suite of Android client applications, point-of-sale APIs, and back-of-house web applications in a fast-paced result-oriented environment. The Android Engineer has extensive knowledge and experience related to Android application architecture and uses it daily to mentor others and develop high-quality Android client applications. They lead by example, treat everyone with respect, prioritize quality, maintain an understanding of the constraints and needs of the business, and help define the long-term architecture for the full suite of Android applications.As a Staff Engineer, you can look forward to: Development: perform software development in accordance with the technologies, guidelines, and standards prescribed by the company. Consult to understand Software Development Lifecycle. Design and develop complete features.Supervising Code Quality: identify and raise awareness of inconsistencies in specifications and implementation. Participate in code reviews to find opportunities to ensure compliance with corporate guidelines and improve the quality of the team's output.Problem Solving: identify the root cause of problems; identify and implement solutions to these. Demonstrate strong problem-solving ability for the team. Tackle problems in a manner which is re-usable and applicable across multiple projects.Managing Task and Completion: supervise small teams/individuals and assign tasks as required. Build tasks based on technical specifications and give accurate work and task estimates.Documenting and Knowledge Sharing: create high quality documentation (including technical design documents) that meets the needs and expectations of clients. Contribute to the continuous improvement of company reference material.Adding new payments features to our existing products (such as dynamic currency conversion, offline payment support, Android Pay, Apple Pay, mobile wallets etc.)Designing and implementing Android applications and services that provide best in class payment flow experience for customers.Troubleshooting issues that may span across a wide range of device types.Working with international certification teams and test organizationsWorking with product management to clarify and/or create specifications.Performing production support services as part of a regular on call rotationCollaborating with Product Development, UX Designers, and QA to build quality products; including resolving complex technical issues related to projects.Install, configure, customize, upgrade, support and troubleshoot all technical issues related to on premise and hosted environments for mobile platforms.Work directly with third party vendors to define technical requirements and customize, configure and implement solutions to interface with various external systems.Work with senior management to define and implement technical processes and procedures within department focusing on client satisfaction and efficiencyReviewing peer code, designs, and providing mentorship.Develop native mobile applications for Android.Work in an agile environment, participating in planning and Scrumban boards.Basic Qualifications: Bachelor's degree required. 10+ years of experience in Android application development10+ years of experience in Android Framework development10+ years programming experience in Java, Android SDK and AOSP codeUI development, optimal performance, adaptation to various screen sizes.Preferred Qualifications:Previous experience as Tech Lead or People Leader to include team mentoring and performance coaching.Kotlin ProgrammingExperience with a cloud platform: AWS or Google Cloud.Exposure to RESTful APIsKnowledge of Android framework/HAL/middleware, SE-Android and NDKGood working knowledge of revision control and code review tools like Git, or GerritExperience with CI/CD pipeline, Gradle/Kotlin DSL's for building Android applications/librariesRXJava, functional programming, MVP/MVC design patterns.Previous experience in payments industry, specifically working with EMVcoWorking experience in an Agile environmentLearn more about Clover: To support the total well-being of our associates, Fiserv takes a broad approach to our benefits. We offer a comprehensive benefits package that provides flexibility and affordability with a variety of medical, dental, vision, life insurance and disability options. Our commitment to wellness, wellness education, preventive services and fitness activities are designed to meet you where you are.Join the Fintech and SaaS revolution that is helping small businesses grow faster and get the technology and insights previously available only to the \"big guys.\" At Clover, you will be part of an entrepreneurial team working in a fast-paced and high growth environment, with the benefits of a parent company, Fiserv, a global leader in Fintech and payments enabling innovative financial services experiences that are in step with the way people live and work today.Clover delivers the leading Point of Sale system with an elegant end-to-end solution that incorporates beautiful devices, cloud-based POS software, payments processing, platform API's for third-party developers, and an ecosystem with over 220 apps. The Clover platform delivers solutions in a scalable and modular fashion that powers tiny merchants through large football stadiums, supporting millions of transactions daily. Our devices and platform form the backbone of millions of payment interactions between merchants and their customers daily. We are looking for self-starters with a passion for technology who want to help us impact millions of merchants' lives one transaction at a time.We welcome and encourage diversity in our workforce. Fiserv is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteranExplore the possibilities of a career with Fiserv and Find Your Forward with us.Thank you for considering employment with Fiserv.  Please:Apply using your legal nameComplete the step-by-step profile and attach your resume (either is acceptable, both are preferable).Fiserv is an Equal Employment Opportunity Employer, and it is the Company's policy to make all employment decisions without regard to race, color, religion, creed, age, sex, national origin, veteran status, disability (as long as the individual is able to perform the essential functions of the job with or without reasonable accommodation), and any other characteristic protected by Law."}