{"title":"Senior Software Engineer, NBC News Digital","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIoFOoN6rHg9eUbYMaBKNMkDN84mu7idmdWSdH2sW8bH4ex1O-Fd0zGKgvz-gAkZ5Kf7GOdgu7IzEA7W0r34myeROLhIBB7s3rDs_tktDhExslc3WmWIQHdBbk0a_3--hUqBdoPxnkLULHX8NsjVWeg9pZlCRotwQhW1lh7vRoMEMAwcQpXb9ocjutnlt1a","source":"ziprecruiter","full_description":"Job Title: Senior Software Engineer, NBC News Digital Business Segment: NBC News and MSNBC Responsibilities: Part of NBC News Digital, the Devices Development Team is based in Downtown Seattle. Our key collaborators are based at NBC HQ in New York. Our team's core goal is to deliver the news to our users via mobile, TV and other media platforms, including iOS, Android, Roku, Apple TV, and Amazon Fire TV.As a Senior Software Engineer, you will be expected to:Write code and tests that are understandable and maintainableDebug effectively within their primary area to help find root causeProvide helpful, timely code reviewsCollaborate professionally with teammates and peersCommunicate with engineering precision, escalating blockers quickly, clarifying requirements and sharing assumptionsSeek understanding of how users interact with product/serviceExhibit a growth mindset and make investments in your growth and teammates' growthJob Number: 59332BR Posting Category: Technology & Engineering Country: United States Sub-Business: News Digital About Us: At NBCUniversal, we believe in the talent of our people. It's our passion and commitment to excellence that drives NBCU's vast portfolio of brands to succeed. From broadcast and cable networks, news and sports platforms, to film, world-renowned theme parks and a diverse suite of digital properties, we take pride in all that we do and all that we represent. It's what makes us uniquely NBCU. Here you can create the extraordinary. Join us. State/Province: Washington Career Level: Experienced Qualifications/Requirements: A bachelor's degree in computer science or equivalent  understanding of computer science fundamentals and  development best practices 4+ years of professional experience working with and  staying current in the latest advances in web and mobile  technologies, highly preferred Be willing to work in downtown Seattle Have significant software development experience on  one or more native app platforms, such as iOS, Android,  Roku or Fire TV Understand best practices for integrating native app  clients with cloud services Comfortable with a variety of languages and frameworks,  and willing to learn new ones. Successful track record of on time delivery of projects. Excellent debugger and problem solver. Strong communication skills. City: Seattle Notices: NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable."}