{"title":"Technical Operations Specialist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJRb3RlAwq-_p2Rytb2wd34GMZfsnfsUQHrz8ErCNRDv2CxlT7ud7RVE_lyNeoQ2kE5vI9DzMVK6FGyx0Ou6JhP2pbzmONB2nwPUjeyjDO1HyWEGxCpRscgHO9UrIW-QjbjZifjcn0040MZYLS2_KqSYcZi5uDYb4ZiEUB7h5kwrI0SNbZPJxAgMlOAoF8M","source":"ziprecruiter","full_description":"FAR Government, Inc. (FARGOV) headquartered in Stafford, VA., is a premier, economically disadvantaged woman-owned Small Business that provides federal professional services, primarily engaged in providing advanced information technology, cyber security, management systems support, as well as business and infrastructure management services.We are among the most innovative, respected and ethical providers of technology solutions to the United States government. Our mission is to provide superior-quality, innovative, information technology solutions that help federal agencies best aid, serve and protect the American people.Requirements: Bachelor's degree from an accredited college or university minimum of ten years of subject matter related work experience (i.e., law enforcement and military, with a major portion of this experience in the explosives and investigative operations arena) -preferred. A high school education with a diploma or a GED equivalency certificate and 15 years of general law enforcement or field related experience.A Graduate degree.minimum of 5 years working, instructing, or conducting research in the subject area at a level exceeding the students to be taught.Duties:Intermediate to advanced knowledge of Information Technologies.Provide technical support for clients and customers.Provide real-time network system support to internal and if needed external customers.Evaluate technical specifications for business requirements to develop and implement efficient, cost-effective solutions.Serve as a liaison between the business and technical support staff when and as needed.Document and track technical support issues through databases.Setup, Configuration, and troubleshooting of hardware and software.Deliver exceptional customer service with an understanding of the organization's products and services.Training new employees as they start working with us.Familiarity with network security best practices and standards.Why FAR Government?You can take pride in working for a company dedicated to serving our government by providing the best, most cost-effective solutions for the US Government. Our work helps the US Government secure our nation, support the efforts of our military and intelligence communities, and provide lifesaving medical services to our soldiers, vets, and their families.Please submit your most up-to-date resume. Please be sure to highlight your relevant experience.FAR Government is an equal opportunity employer and encourages all qualified candidates to apply. Read More Apply for Position Apply for this position Required * Apply with Indeed First Name* Last Name* Email Address* Phone* Address Resume* We've received your resume. Click here to update it. Attach resume or Paste resume Attach resume as .pdf, .doc, .docx, .odt, .txt, or .rtf (limit 5MB) or Paste resume  Paste your resume here or Attach resume file  The following questions are entirely optional. To comply with government Equal Employment Opportunity and/or Affirmative Action reporting regulations, we are requesting (but NOT requiring) that you enter this personal data. This information will not be used in connection with any employment decisions, and will be used solely as permitted by state and federal law. Your voluntary cooperation would be appreciated. Learn more. Gender Decline to answerFemaleMale Race/Ethnicity Decline to answerHispanic or LatinoWhite, not Hispanic or LatinoBlack or African-American, not Hispanic or LatinoAsian, not Hispanic or LatinoNative Hawaiian or Other Pacific Islander, not Hispanic or LatinoAmerican Indian or Alaskan Native, not Hispanic or LatinoTwo or More Races, not Hispanic or Latino Invitation for Job Applicants to Self-Identify as a U.S. VeteranA \"disabled veteran\" is one of the following: a veteran of the U.S. military, ground, naval or air service who is entitled to compensation (or who but for the receipt of military retired pay would be entitled to compensation) under laws administered by the Secretary of Veterans Affairs; ora person who was discharged or released from active duty because of a service-connected disability.A \"recently separated veteran\" means any veteran during the three-year period beginning on the date of such veteran's discharge or release from active duty in the U.S. military, ground, naval, or air service.An \"active duty wartime or campaign badge veteran\" means a veteran who served on active duty in the U.S. military, ground, naval or air service during a war, or in a campaign or expedition for which a campaign badge has been authorized under the laws administered by the Department of Defense.An \"Armed forces service medal veteran\" means a veteran who, while serving on active duty in the U.S. military, ground, naval or air service, participated in a United States military operation for which an Armed Forces service medal was awarded pursuant to Executive Order 12985.Veteran status I IDENTIFY AS ONE OR MORE OF THE CLASSIFICATIONS OF PROTECTED VETERAN LISTED ABOVE  I AM NOT A PROTECTED VETERAN  I DON'T WISH TO ANSWER Voluntary Self-Identification of Disability Voluntary Self-Identification of Disability Form CC-305  OMB Control Number 1250-0005  Expires 5/31/2023 Why are you being asked to complete this form? We are a federal contractor or subcontractor required by law to provide equal employment opportunity to qualified people with disabilities. We are also required to measure our progress toward having at least 7% of our workforce be individuals with disabilities. To do this, we must ask applicants and employees if they have a disability or have ever had a disability. Because a person may become disabled at any time, we ask all of our employees to update their information at least every five years.Identifying yourself as an individual with a disability is voluntary, and we hope that you will choose to do so. Your answer will be maintained confidentially and not be seen by selecting officials or anyone else involved in making personnel decisions. Completing the form will not negatively impact you in any way, regardless of whether you have self-identified in the past. For more information about this form or the equal employment obligations of federal contractors under Section 503 of the Rehabilitation Act, visit the U.S. Department of Labor's Office of Federal Contract Compliance Programs (OFCCP) website at www.dol.gov/ofccp. How do you know if you have a disability? You are considered to have a disability if you have a physical or mental impairment or medical condition that substantially limits a major life activity, or if you have a history or record of such an impairment or medical condition. Disabilities include, but are not limited to:AutismAutoimmune disorder, for example, lupus, fibromyalgia, rheumatoid arthritis, or HIV/AIDSBlind or low visionCancerCardiovascular or heart diseaseCeliac diseaseCerebral palsyDeaf or hard of hearingDepression or anxietyDiabetesEpilepsyGastrointestinal disorders, for example, Crohn's Disease, or irritable bowel syndromeIntellectual disabilityMissing limbs or partially missing limbsNervous system condition for example, migraine headaches, Parkinson's disease, or Multiple sclerosis (MS)Psychiatric condition, for example, bipolar disorder, schizophrenia, PTSD, or major depression Please check one of the boxes below: YES, I HAVE A DISABILITY, OR HAVE A HISTORY/RECORD OF HAVING A DISABILITY NO, I DON'T HAVE A DISABILITY, OR A HISTORY/RECORD OF HAVING A DISABILITY I DON'T WISH TO ANSWER PUBLIC BURDEN STATEMENT: According to the Paperwork Reduction Act of 1995 no persons are required to respond to a collection of information unless such collection displays a valid OMB control number. This survey should take about 5 minutes to complete. You must enter your name and date Your Name Today's Date Submit Application"}