{"title":"          Automation Security Engineer w IasS exp 29877-1 NEW!        ","location":"","salary":"","term":"$70 to $75 HourlyContractor","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAIQoz_H3pcI_NqxXTUO6gm4vAoM-iXrKJmWxWlPsM9kiS9xOTppUnowXZxE_3gooa0gvxKloJ9k6mnePUn3og4RVr2FuxJzBy6kHzg0OBOF13sf3qM7_QSaH4w8T65esnmNSzWV6bwD5nUEAAVSqcj_dphBEFiOT415TMNVgyXLcyP8lov2ZyvVbnxpXQ","source":"ziprecruiter","full_description":"\n        Automation Security Engineer with IaaS exp for a 12 mos. contract role. This position is a remote position through the balance of this year. The client is based in Dallas, TXAt a high level, the focus of this role is to use modern tools including Ansible, Terraform, Python, and Groovy, along with enterprise ITSM Tooling (ServiceNOW), to enable end to end secure server delivery. The legacy infrastructure we’re seeking to modernize includes value delivered via tools such as eDirectory, Active Directory, CyberArk, MicroFocus IDM and SecureAuth.• Experience in Infrastructure as a Service (IaaS) modeling including infrastructure as code development (Terraform or similar) or infrastructure engineering at enterprise scale , automated configuration management (Chef, Puppet, Ansible)• Experience with any cloud computing technology and its concepts ( AWS)• Working Knowledge on (Docker, OpenShift Enterprise, GKE, ECS) and orchestration (Docker Swarm, Kubernetes)• Experience with Continuous Integration and Continuous Delivery pipeline tools and implementation for immutability• Scripting experience with Python, Groovy• Experience implementing DevOps practices at scale• Design cloud-based technical architectures to meet application functional and non-functional requirements across public and private cloud sites in accordance with Enterprise Architecture• Leverage Terraform or Jenkins to develop infrastructure as code for repeatable environment provisioning via automated blueprints and solutions• Create parameterized build jobs via Jenkins for Continuous Integration of Security and environmental variables• Own container and OS base images, plus libraries for individual apps/services• Build container artifacts and storage in Artifactory/Docker Trusted Registry for deployment to multiple sites• Constructing CI/CD deployment pipelines to Red Hat OpenShift Enterprise Kubernetes orchestration platform• Existing or quick understanding of existing elements in value pipeline, including: eDirectory, Active Directory, CyberArk, MicroFocus IDM and SecureAuth\n      "}