{"title":"iOS Engineer, Retail NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJBoq5yZSb5ljJCfZPINdG51H1KzXb1SLK7YHW2k98L_ne7YPFkkyEyrDvee8liCNPOBwSk2big33iFDtkaI_Bkt8mzJGdKhfmEZODcfj9NW-wJjO8XPpw6unoNDJc-3gbjRWPVMk0TFe09Xbbzg3gmfzBwe1IIqMLeTPgwioy-R4liIhk8MQ513bgaR9M","source":"ziprecruiter","full_description":"Company Description  Square builds common business tools in unconventional ways so more people can start, run, and grow their businesses. When Square started, it was difficult and expensive (or just plain impossible) for some businesses to take credit cards. Square made credit card payments possible for all by turning a mobile phone into a credit card reader. Since then Square has been building an entire business toolkit of both hardware and software products including Square Capital, Square Terminal, Square Payroll, and more. We're working to find new and better ways to help businesses succeed on their own terms-and we're looking for people like you to help shape tomorrow at Square.  Job Description Retailers have struggled too long with clunky, outdated and disconnected tools. Even as mammoth Retail and e-commerce forces threaten to disrupt smaller merchants, we are empowering those merchants with simple and elegant solutions to complex problems - like predictive analytics and fluid, omni-channel capabilities to meet customers wherever they are - to always make the sale. Square for Retail is a growing product team based out of New York, San Francisco, Toronto, and Atlanta. We benefit from (and contribute to) the resources of the larger organization while staying focused on solving Retail-specific challenges. We are relentlessly customer focused, and iterate quickly using a build-measure-learn approach. You will:Build and test iOS software with complex server, network and hardware interactions;Craft pixel-perfect, intuitive UI that delights our sellers with its ease of use;Work with a world-class team of experienced and dedicated engineers and designers;Deliver features to our growing base of subscribers, shipped at a rapid cadence;Be a part of creating an innovative product that brings superpowers to sellers. Qualifications You have:4+ years of iOS development experience, and an excellent command of engineering fundamentalsAn academic attitude towards software development practicesUnwavering commitment to customer experience and product qualityEagerness to share your own ideas, and openness to those of othersA record of self-directed side projects, research, or open source contributions are a plus!  Additional Information  At Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible. PerksAt Square, we want you to be well and thrive. Our global benefits package includes: Healthcare coverageRetirement PlansEmployee Stock Purchase ProgramWellness perksPaid parental leavePaid time offLearning and Development resourcesQualifications: You have: 4+ years of iOS development experience, and an excellent command of engineering fundamentals An academic attitude towards software development practices Unwavering commitment to customer experience and product quality Eagerness to share your own ideas, and openness to those of others A record of self-directed side projects, research, or open source contributions are a plus!Responsibilities: Retailers have struggled too long with clunky, outdated and disconnected tools. Even as mammoth Retail and e-commerce forces threaten to disrupt smaller merchants, we are empowering those merchants with simple and elegant solutions to complex problems - like predictive analytics and fluid, omni-channel capabilities to meet customers wherever they are - to always make the sale. Square for Retail is a growing product team based out of New York, San Francisco, Toronto, and Atlanta. We benefit from (and contribute to) the resources of the larger organization while staying focused on solving Retail-specific challenges. We are relentlessly customer focused, and iterate quickly using a build-measure-learn approach. You will: Build and test iOS software with complex server, network and hardware interactions; Craft pixel-perfect, intuitive UI that delights our sellers with its ease of use; Work with a world-class team of experienced and dedicated engineers and designers; Deliver features to our growing base of subscribers, shipped at a rapid cadence; Be a part of creating an innovative product that brings superpowers to sellers."}