{"title":"Chemist (EODTEU-ONE)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKhmzwNCIUN5dueMQtb-7LaxqAoueu8vM-xHN4lcGiRO6dWWIZhwo7u8zwVbnOjRii4O48O6abinXJ19s3IxsEGluawJTJ16yIvYMC3S5HR5yPImCGvp7rfzggRBfJaTfaYiL6P96VfLi8feInzY4RBT5U8sELghHPp5ommt8fC4Ye6-LYsWhgS3dPEAdsk","source":"ziprecruiter","full_description":"Crossroads Talent Solutions, LLC (Crossroads) is a Small Business Administration (SBA) 8a Business Development participant, Department of Veterans Affairs Certified Veteran Owned Small Business (VOSB), and State of Maryland Department of Transportation Minority and Disadvantaged Owned Small Business, with over 20 years of professional experience in the military, government, and the private sectors.We are currently seeking exceptional, highly qualified candidates to support EODTUE-ONE.This position is contingent upon contract award. Location: Naval Base Point Loma, San Diego, CAPeriod of Performance: 2021 - 2024Travel: < 25%Overview:The mission of EODTEU-ONE is to educate students from the United States Naval Expeditionary Force and other government agencies in high-risk environments to meet the Fleet Response Training Plan (FRTP) and support combatant commander and Navy requirements. Prepare them morally, mentally, and physically to succeed across the full range of military operations. The Chemist will support training services for Explosive Ordnance Disposal Training and Evaluation Unit One (EODTEU-ONE) courses of instruction at Naval Base Point Loma, San Diego, CA. These services will include instruction of military and civilian personnel, related instructional support, and curriculum maintenance for courses/segments in the areas of Explosive Ordnance Disposal (EOD), Unmanned Maritime Systems (UMS), and Chemistry. Duties and Responsibilities: Prepare and maintain a personalized lesson plan for each subject matter area assigned using the lesson plans furnished by EODTEU-ONE. Prepare quizzes and remedial homework assignments as needed.Review all Instructor Lesson Plans for technical accuracy.Review all test items, quizzes, homework, and other instructional materials for completeness and conformity with the curriculum, submitting written recommendations for change to the Division leadership.Serve as a subject matter expert for assigned courses. Submit written recommendations for curriculum updates to the Division leadership.Support curriculum maintenance and interim changes.Maintain proficiency in instructional techniques.Support classroom / Laboratory administrationQualifications/RequirementsBachelor's Degree in Chemistry or Bio/ChemistryPossess valid CPR certificationPossess a Security Clearance of SECRETAbility to aid in developing new drill sets and scenarios based on real world intelligence reportsStrong communication skills; ability to communicate with military personnel in a military environmentPrior to employment- successful completion of physical, mental and drug screeningCrossroads Talent Solutions, LLC is a Veteran friendly employer and provides equal employment opportunity (EEO) to all employees and applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability status, genetic information, marital status, ancestry, protected veteran status, or any other characteristic protected by applicable federal, state, and local laws.Equal Opportunity Employer/Veteran/Disable"}