{"title":"CHEMIST I","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKlQYVf_C228spklCXfG63YyYt7NPbLx1lLpDaEUjnOHzHqmMX4stLVwmoj6iZLNSKHf28iaAhSaleDmb6r1PrxF_Nd-B3Mgk4YcqrM3qSF_pxigaDEY0vXl1J82Uw51MAIJ2f-VEbLk7RuLZCNqV009q1yg6HuOwxkakg5ojBP-prsJW-_9SAihqDMMsIF","source":"ziprecruiter","full_description":"Formulated Solutions Innovates, Formulates and Creates consumer brands. We put together a broadly talented team of experts in manufacturing, production, laboratory, regulatory, distribution and marketing, that possesses an unparalleled drive to deliver market-ready products of the highest quality. Our in-house technologies in Aerosol, Biochemistry, Cosmetic, Pharmaceutical and Polymer Chemistry, coupled with innovative package design and strategic marketing services, provides clients with one of the fastest design-to-market solutions in the world. We serve companies in pharmaceutical, cosmetic, personal care and specialty chemical applications. We also support small and large companies in generating and producing unique products for the retail market.Formulated Solutions offers a wide range of benefit options for our full-time employees. We also offer 401k with a company match and much more! If you are hard-working, self-motivated and looking for a new and exciting career opportunity, apply today!PRIMARY PURPOSE:Perform analytical duties to ensure continuity of laboratory testing.MAJOR DUTIES AND RESPONSIBILITIES:    Testing of incoming materials, in process samples and finished product testing.    Accurately records raw data and analyzes, as well as calculates and interprets the results.    Assists in out of specification (OOS) test results and investigation.    Ensure testing is performed accurately and in compliance with GLP, GMP, USP, SOP and other approved test methods    Maintain analytical reagents in laboratory including but not limited to: inventory, current MSDS, PPE required for handling, waste generation and disposal.    Promote GMP and safety throughout the facility.    Promote continuous improvement and customer satisfaction.    Assists to follow-up on OOS's and CAPAs to verify compliance    Potential exists for exposure to potentially harmful chemicals.    Participate in other activities as assigned by the Director of Quality.QUALIFICATIONS:Required    Ability to use a personal computer and peripheral equipment to accurately enter an analyze data and produce reports.    Knowledge of chemical safety and protective equipment.    Knowledge of various analytical equipment and techniques utilized in an analytical laboratory including but not limited to pH, viscosity, specific gravity and infrared spectrum.    Ability to establish follow established priorities, work independently and productively.    Communicate with others clearly and concisely.    Ability to work in a dynamic fast paced environment-sometimes rapidly shifting priorities. Ability to concentrate in such an environment and perform quality work.    Must be able to lift up to 15 pounds. EDUCATION AND TRAINING:    Bachelor's degree in Chemistry or appropriate discipline."}