{"title":"Sr. Android Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIIkAEa5GW4GM_nF0M8lkJLuyTWulcoKuJ4p1NImle-fMuEVpgPmku098vJX9zGEoNhVRlIQXHwx0-H-sxO8Qsag7_9a80xVElv99JlPrAYRmQuntnHkfBuIX_-3WhwKG4q91D_u7aQCLxgRSFQJJcnZEYzpOS6opyHLrkYHyhE_kXsL0PV-0T5qyaVhAP7","source":"ziprecruiter","full_description":"Android DeveloperCognizant is looking for an experienced top-notch Android developer to grow with our dev team! As an Android Developer, you will be involved from conception to completion with projects that are technologically sound and aesthetically impressive. An ideal candidate is someone who enjoys working in a fast paced, collaborative team. Someone that values the \"team\" and maximizes the opinions and expertise of their teammates to deliver quality.You must be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future.About Cognizant Interactive: Cognizant Interactive helps clients reinvent products, experiences and business models to create new value, differentiation and drive revenue in the digital economy. We take an Experience centered approach which uses human insights to take ideas from vision to outcome and building experience led solutions that enables brands to transform their customer and employee experiences using design, marketing and commerce capabilities Position Responsibilities: Design and development projects for existing android app. Build prototypes at tech scoping stage of projects depending on the project.Create compelling device specific user interfaces and experiences and UI prototypesOptimizing performance for the appCommunicate effectively with teams and managementUnderstanding requirements and coordinating with offshore teamsBe up to date on the latest industry trends in mobile technologiesAbility to integrate any backend system for web service integrationAbility to handle production issues in timely manner Position Qualifications: You must be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the futureBachelor's degree in Computer Science (or equivalent experience)5-7 years of software development experience3-5 years Android experience (preferably client side)Proficient in Android, Kotlin & Java Must have implemented end to end application and have gone through market place release process. Well versed with building UI using XML and custom UI components Comfortable and should have used on Unit test framework Experience in consuming web services using JSON/ XML Experience in leading a small group of team members Knowledge and understanding of software design and various patterns like - MVM, MVVM, MVP, MVC, Delegation, Singleton, Factory, Adapter Familiarity with agile development/waterfall processes and methodologies Expertise in app memory management, multithreading, networking & Security Excellent debugging and optimization skillsSource code control understanding (experience with Git preferred)Experience with Java Collections and ThreadingExperience working with functional languagesCompany DescriptionCognizant is one of the world's leading professional services companies, redefining clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant, a member of the NASDAQ-100, is ranked 205 on the Fortune 500 and is consistently listed among the most admired companies in the world.Cognizant is an Equal Opportunity Employer M/F/D/V. Cognizant is committed to ensuring that all current and prospective associates are afforded equal opportunities and treatment and a work environment free of harassment.Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.#LI-KK1ind123#CB"}