{"title":"          Technical Recruiter         ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAIwiSRniqMxncZLceOYfD1HhJEcfyzaSzNQqn_-gL2i-bGXBgmBx2drGlyR9ntcbLb1TBhXf1cBpWwfLceBdVSlX87l0oFajwv_g-53zSJ4FJjEGU3qEhSipLeeHe784iQbJ-M5iIDFhOvrrejs_2NA7UNKzm07M5BetT5igdnNe12Qcxcf8EN8GP3L-xw","source":"ziprecruiter","full_description":"\n        We are looking to add a Technical Recruiter to our Redwood Credit Union Team. You would partner with leaders and hiring managers to provide consultation and recruiting strategies to ensure a timely and effective hiring process that exceeds internal partner expectations and elevates the candidate experience for higher level, techical focused roles. With a strong focus on providing outstanding service, you would coordinate the talent acquisition activities for both internal and external candidate high-level sourcing. The Job (the big stuff): Responsible for hard-to-fill, sometimes unique to our organization positions to include creation of job specific sourcing strategy and effective recruiting plan that would consist of no less that 75% of all hires coming from self-sourced candidates Successfully source for passive, top-tier talent via LinkedIn Recruiter, Indeed Resume Database, RCU Applicant Tracking System, and other means. Researches and recommends new sources for active and passive candidate recruiting. Owns the entire recruitment process for high-level, confidential, niche, and executive recruiting roles. Using a variety of recruiting techniques and sources (including social media), generate qualified and diverse pools of high caliber candidates for open positions, and develop a pipeline of talent for future workforce planning. Builds and maintains partnerships with hiring managers, applicants, community organizations, placement agencies, and other recruiting resources in a manner that supports RCU's mission, vision, values, and culture, and yields success, predictable results, and credibility. Work full-cycle recruitments taking candidates from initial sourcing and outreach through the entirety of the candidate experience including closing and successful onboarding.\n      "}