{"title":"Native Android Developer Level 3","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIhUamrMcUhiEJNTpba_EKJZ3jddg5heFXCYg12W84aWL22siVJPUS1cWtaTzmDhGWz4f7VCPGcTVoh26KinvDeDxU82AZDg1FhrTY530G6lu1kYxdZjhzD98uZT9AJrlmD_ihkRtDg0M2uC5OE6P3SjDl0sgfk7y4WP0n7hlSAoPFT3bz_J8gIPJCUd-I-","source":"ziprecruiter","full_description":"Android Developer Cincinnati OHRemote to startC2H-W2 5+ years developing Android Apps (using Android and 3rd party libraries/frameworks) 5+ years Java experience Prior Android Developer Lead experience a plus Prior experience with project planning with large size or highly complex projects A solid understanding of mobile application development processes, from the layout/user interface to backend systems and API integrations A solid understanding and appreciation for Agile tools, processes, and methodology Ability to interact well in a team environment Strong organization skills to manage multiple timelines and complete tasks quickly within the constraints of clients' timelines and budgetsKey Responsibilities Lead and participate in the design and implementation of large and architecturally significant applications. Champion company standards and best practices. Work to continuously improve software delivery processes and practices. Develop programming specifications. Design, code and unit test application code using Software Development Life Cycle (SDLC) best practices. Work with Product team to plan new features, gather requirements and propose solutions. Acquire and interpret business requirements, creates a functional specification, and determines the most efficient/appropriate technologies. Research and implement new interface development techniques. Support the entire application lifecycle (concept, design, test, release and support) Ability to work with new technologies while showing drive, adaptability, and creative thinking. Establish development best practices and growth of mobile applications standards. Help foster a culture of innovation and out-of-the box thinking.Note to VendorsJob Description:Role: Identify and uphold Android engineering best practices Collaborate with designers & product managers to iterate on the design & implementation of our product Work with Backend Engineers to build and ship features Design a framework for creating user apps that grows with the needs of the company Monitor app performance, watch for traffic drops related to site usability problems & rectify the issues Review app and feature code, and plan future app upgrades with the development team Assist in the development of features that will be put on the mobile app & in internal applications Implement responsible design principles to ensure that our app renders well on most devices and is accessible Stay up-to-date on emerging technologiesRequirements: Strong experience using Kotlin Strong analytical problem-solving skills Experience with modern Android libraries and tooling including Jetpack Detail oriented, works well in a team and individually Self-starter with strong initiative and ability to work under pressure Understanding of the entire mobile development process (design, development, testing and releases) Excellent written and verbal communication skills Ability to prioritize work and complete tasks with quick turnaround times A solid understanding of best practices and techniques regarding scalability, performance, and security Design and UX sensibilities is a plus.Thanks and RegardsG Gopi Krishna,Sourcer,XTGlobal, Inc. 2701 Dallas Parkway, Suite 550 Plano TX, 75093Email: gopi@xtglobal.comDirect:469-925-1101 extension 101LinkedIn: https://www.linkedin.com/in/gopikrsihna/"}