{"title":"          Front End Developer         ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AALOR9HFssm4DO6HvcxHfAyD1bRlAYEMMcI3ukqa0Vg3x2ok1ftl1g5lIB-Id1i-MD-b-KE2apXRFhD6pY2KWb6t7OG0MfQvDYvAsoYwXu5b01GQTQtOLIDRt_-9dU_OSbJJCqrTC3NWhb4gyVFPTaLXlNmwberg4wxFzGE4UlSoNT9CFIRQ7HOXMmlRCTE","source":"ziprecruiter","full_description":"\n        Overview & ResponsibilitiesAt Republic Finance, we are building a leading consumer lending company. In business for over 60 years, we are proud to be a trusted lender in over 200 communities across the Southeastern United States! We specialize in providing flexible lending solutions and outstanding customer service. Driven by our shared mission to pursue excellence for our team, our customers, and our performance, Republic Finance is transforming into a modern, fast-growing business. We thrive on teamwork, collaboration, and accountability. We hold dear the trust our customers place in us, and we strive to strengthen those relationships by building a deep understanding of our customers’ needs.We are looking for a Front End Web Developer to join our Digital Online Customer application team who has a passion for delivering high quality products while adhering to industry standard methodologies. This individual will possess characteristics that drive self-motivation and team collaboration. They will have the required knowledge and skills to demonstrate accurate SDLC in an Agile/Scrum environment while aiding the team in delivering the highest valuable product possible. As part of the Agile/Scrum mindset this person will be open to multifunctional opportunities to help facilitate the delivery of a done product each sprint. The role will work with the Software Development Manager in the Digital Technologies Department. Key job responsibilities are as follows:Develop new features and provide ongoing maintenance for our online customer portal.Work with deployment teams, resolve level issues for systems, coordinate on product design.Interact closely with other developers and support in a team environment to resolve defects and clarify business needs.Contribute analytical skills and sharp attention to detail in evaluating test plans and testing methodology to mitigate risks and to ensure the systems met functional and performance requirements.Requirements3-8 years of experience as a Front-End Software Developer.Previous or current experience as a ReactJS and/or NodeJS developer.Previous or current experience with administering and developing in a Content Management System/CMS (Wordpress, Magento, Kentico, etc).Experience in a full SDLC environment.Knowledge of Continuous Integration/Continuous Delivery (CI/CD) pipeline within the NodeJS toolset based environment.Must be a self-motivated, collaborative teammate that thrives in a fast-paced, dynamic environment.BenefitsWe offer a comprehensive benefits package including: Health/Dental/VisionPaid Time Off (PTO)401 (K) and employer matchCompany provided Life Insurance & Long Term DisabilityAdditional benefits with Republic include:Regular drawings for sports ticketsEmployee of the Month ProgramPhilanthropic support for charities such as Juvenile Diabetes Research Foundation and the American Cancer SocietyProfessional offices with a friendly team environmentRepublic Finance, LLC is an Equal Opportunity Employer and does not discriminate on the basis of race, sex, color, religion, national origin, age disability or veteran status in employment opportunities and benefits. Republic Finance, LLC maintains a Drug-Free Workplace. #zr2\n      "}