{"title":"Sr. Android Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKjPjexKuecpn1faEAfDocZ8Mnry6QPdPylwnAcYvBF9wBIKviYC1UDZ3Tt3RDnSchBQDG8yX0EjOe9BlI37Om3GTOkoN_UBRxY9ekUurkuWtXgOD6HXL4GSsGQAQjPF4GvWNLW8zS3Oq1U6F-vpFZG8FBc1X7mLo6MV3xJlFu41iXO_xvkY_-N6bO9BFE","source":"ziprecruiter","full_description":"Sr. Android Engineer Sr. Android Engineer - Skills Required - Android, Android SDK, Java, Version Control, Mobile UI Design, Computer Science, Kotlin, Android Studio, RxJava, TDDJob Title:Sr. Android EngineerJob Location:Seattle, WAKey Skills:Android, Java, high level software development conceptsSalary:$130K to $160KWe are an up and coming culinary start up doing amazing things in the kitchen! We are looking for an experienced Software Development Engineer to build our Android application. You are looking for a small, smart and fast-moving company where everyone makes a difference every day! If that's you, please read on.Top Reasons to Work with Us Competitive Base Salary ($130-$160k) - Play a major role that will impact company growth - Full Health Benefits - Generous Vacation / PTO - Established and Growing - Dynamic and exciting work environmentWhat You Will Be DoingAs an Android Software Development Engineer, you should be passionate about building intuitive, visually engaging Android experiences for a diverse user base. You should have experience writing production-quality Java code and be able to point to examples of apps that you have worked on. If there is a new technology out there that could make our product better, you are eager to learn it and figure out how to apply it. Champion best practices in engineering: design, testing, version control, documentation, build, deployment, and operations. - Write high quality, maintainable, and robust Java code. - Build flexible systems without over-engineering and choose straightforward solutions. - Solve problems at their root, stepping back to understand the broader context. - Develop pragmatic solutions. - Thoroughly understand a broad range of data structures and algorithms. - Recognize and use design patterns to solve business problems.So, if you are a Senior Android Engineer with experience, please apply today!Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.*Sr. Android EngineerWA-SeattleMM18-1566131*"}