{"title":"Software Engineer, Digital Video & Audio NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJRxqZhFC04AhusTNggZWrhZwuZBogsmpjj9zMoyys1HPmVWwz8Ke2jn44JgNAi24Vj5jTD_2oW1QQNO9KOYN-x82FY5pgwFQpJyu45foTZG3OcQGkbYSvdoA2HhUlcCCX7Hk_UGcCL0hO0HEGbYqrbUiaKudZhK9wCVpa07sJKYyqX7rIRkhQYLW5LvP8i","source":"ziprecruiter","full_description":"Our CompanyChanging the world through digital experiences is what Adobe's all about. We give everyone-from emerging artists to global brands-everything they need to design and deliver exceptional digital experiences! We're passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.We're on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!The OpportunityWe are investing strategically to enable the creation and delivery of exceptional digital experiences. It's an exciting time to be here, especially if you're an innovator and a leader. In Adobe's Digital Video and Audio group, you will experience the energy of a start-up company backed by the resources of one of the greatest software companies in the world. It's a perfect place to grow your career and unleash your potential. Come to enjoy the thrill of crafting a phenomenal product and developing it with people who share your passion!We are looking for a Software Engineer to help architect, design and implement our internal cross-platform UI framework, codenamed Drover. Drover is an advanced best-of-class cross-platform GUI framework, used by many of our flagship applications -- Premiere Pro, After Effects, Audition, and Premiere Rush. Drover has it all -- HW accelerated graphics, advanced layout containers, styling, common controls, UI widgets, and data-binding. You will be a part of a small, very high-powered team, to help design and implement the next version of the framework.Your work will be very visible, and will have a direct impact on $1B+ of company revenue!What you'll doHelp to Architect, design and implement high quality software subsystems, components, and GUI widgets enabling rapid cross-platform application development.Define quality, performance, scalability, extensibility, manageability, and testability requirements. Ensuring the software you develop meets these requirements.Implement reusable high-level user experience workflows and Integrate them into host applications.Monitor and continuously improve released software.Collaborate with other teams, who depend on the tech stack.What you need to succeedYou are a fast and pragmatic engineer and can get things accomplished in a gradual and incremental fashion. You are an agile practitioner.You are proficient in cross-platform C / C++.You are passionate about GUI development, and about building and utilizing a best-of-class GUI framework.Familiarity with modern GUI design and development patterns -- declarative UI, MVVM, MVP, data-binding, commanding.You are passionate about performance - enabling fluid UX.You have knowledge of / expertise in Metal (MacOS) and/or D2D / DX (Windows)You are not afraid to dig deep. You know how to unblock yourself.You embrace continuous learning.3+ years of software development experience.BS in Computer Science or related field of study or equivalent practical experienceKnowledge or experience developing media (audio/video/image) applications a plus."}