{"title":"          Project Engineer NEW!        ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAIz2dwJrI_FpZFEPpyz8blk_eTI9dCHF3MFuClqkqz5hkyreoUOz1Tu1UBXw0VVPojeM3KmXlTX-YQkxmQ7TPIdQh4DT2FQWnv_KUvoBaj93_wh4xW-GatsGX8Fw-LD94rxioM290iK3izRBClWW1nEZUKzApw16s52w9CkwLl7U5GvyGCC6AOSL_H4Iw","source":"ziprecruiter","full_description":"\n        Primary Objectives of Position:Provide support to construction team and field staff. The focus of this role is on organizing and preparing documentation required to support and ensure successful projects. Will be expected to manage several timelines and contracts on different construction projects. The Project Engineer will be communicating and coordinating with project managers, clients, consultants, public officials, field personal, subcontractors, and design team professionals.Major Areas of Accountability:Review, understand and interpret project contractsCommunicate and coordinate with subcontractorsProvide permit procurement assistanceManage the distribution of both plans and documentsProcess RFIs, ASI, SKsPrepare and process meeting agenda and minutes and attend weekly meetingsProcess shop drawings and submittals in conjunction with project specificationsObserve, monitor, track LEED requirements and complianceCoordinate site logisticsContribute to Team effort by accomplishing tasks identified and/or assignedTrack permitsPrepare project log and draw packages for weekly meeting and bank drawsMaintain library and data base of industry cost-influencing activity and methodologyAssist construction management in maintaining project production on budget and on schedulePerform take-off to quantify bids or change ordersExpedite closure of the project by securing loose ends, finishing paper work, getting equipment manual and warranties as built turned over to ownersCoordinate subcontractors as neededProvide assistance in implementing processes and procedures, and general administration as neededOther duties as assignedLevel of Education, Experience and Skill Set:Ability to assume responsibility interface and communicate effectively with others is essentialPreferred 2 or more years of experience in the construction fieldKnowledge of residential multi-family and/or affordable housing design and constructionKnowledge of construction terminologies, sequences, blue prints, and project specificationsKnowledge of section 3, local hire, and prevailing wage processes preferredStrong verbal, written, and interpersonal communication skillsExcellent problem solving skillsProficiency in Word, Excel, and Project; knowledge in Timberline a plusStrong organizational abilities with the ability of performing multiple tasks simultaneouslyUnderstanding of timeliness and attention to detailMust be a team player with a strong sense of urgencyHigh school degreeValid California driver’s license and availability of an insured vehicle to travel within the California service area.Position may require some evening and weekend hours.Physical Demands:The Project Engineer is required to talk and hear. The employee is often required to sit and use their hands and fingers to handle, feel, and implement. The employee is also required to stand, walk, reach with arms and hands, climb stairs, climb ladders, balance, twist, lean, move from one location to another and to stoop, kneel, crouch or crawl. Vision abilities required by this position include close and far vision, with exposure to glare from a computer and outside site observations. Employee shall have the ability to operate a computer keyboard and traverse construction jobsites. Must be able to lift up to 25 lbs. and travel via automobile or airplane up to 25% of the time. Ability to work outdoors on uneven terrain and in the heat and cold. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Work Environment:The work environment will usually be in a professional office setting, with possible shared workspace. The noise level is usually quiet to moderate. When traveling or on-site, the environment may change dependent upon potential construction activity taking place and can often be moderately loud.\n      "}