{"title":"Software Engineer, RenderMan NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJzCi-gBs1a-BO8Sfx_LcanGhatCpRQWL0sYSQe40R8soPu2isuBXDxD_9co4hGGr3_YBojiXcU9yq_UM8USau-ZtoFH_NtLDQlXoUDtBBXJbmj1ZKDCFvzLr8I4VZzHjJQ_rJfpy9v-7F6ZuKpg7wn71yC7IbFkWLtb8bOYTKY75KnmhAH1o9b2lyzpRRR","source":"ziprecruiter","full_description":"As a member of the RenderMan team, you'll be part of a team of people contributing to the development, maintenance and support of Pixar's industry-leading rendering software.As a software engineer in RenderMan, you'll collaborate with the team to solve problems and develop new techniques. An eye for performance and an interest in making efficient use of the available hardware will help you in this role. You will also appreciate the importance of writing clear, well-documented and maintainable code. If in addition you are passionate about crafting technology to help creative people push the boundaries of what's possible, then we would love to hear from you!RESPONSIBILITIES:Develop new or enhanced technical solutions to improve performanceCollaborate with the team to maintain and improve the core rendering systemsRefactor and rewrite existing code to improve quality, reliability and maintainabilityProactively add and maintain tests to ensure the highest levels of qualityProvide hands-on support to key customers, as well as our colleagues in production at the studioDiagnose and fix bugs in legacy codeAuthor high-quality internal and end-user documentationActively participate in design discussions, sharing engineering responsibilities and encouraging adoption of standardsREQUIREMENTS:Proficient in C++ with proven software engineering experiencePractical knowledge of multi-threaded, SIMD, SIMT or GpGPU development, especially CUDAExtensive analytic, debugging, and problem-solving skillsExperience working in a Linux, macOS or Windows environmentDegree in Computer Science or equivalent work experiencePREFERRED SKILLS:The ideal candidate has a customer-centric mentality and a collaborative approach to solving problems. They have good attention to detail, paired with curiosity and a desire to continue learning. They can work independently and are able to self-organize and prioritize their own tasks for the greatest impact.Familiarity with programmable shading or the OpenGL shading languageExperience of the full commercial software life cycleExperience in film or video game productionFamiliarity with tools such as Valgrind, Vtune, Nsight etc.Pixar is an Equal Opportunity Employer. We know our storytelling is at its best when we include, celebrate and embrace difference. We strive to be a diverse workforce that is representative of our audiences, and where all can thrive and belong. We are committed to building a team that includes and respects a variety of voices, identities, backgrounds, experiences and perspectives. | Follow us on Twitter @PixarRecruiting."}