{"title":"1st Shift Automation Engineer NEW!","location":"","salary":"","description":"","term":"$60,000 to $90,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALo6uF-GkRws8KbHLZrQtzTZqhXoqmT2EWVPP4oKPKKjJ4ELg5S40OpRyanGDw8B79-Uy63L3gpKDJU8k7vlp72hu9EfTEnEODGzOQkAp93qXFxwrKKMU6_fjXM6t_YK1p3eEu1d3z9-Tp6xeV6jLwjCPtBqARD8UG6DRrG18AHR_IjuAloXDsKbDZP1Pts","source":"ziprecruiter","full_description":"We have an opportunity for an Automation Engineer position located just west of Charlotte, NC. The job requires experience in automation and hydraulics in the plastics mold industry. Additionally, the candidate must have PLC & robotics knowledge.  This is a full-time, direct-hire position with a well-established and growing plastics manufacturing company that offers very competitive wages and full benefits.Please read below for job details. An innovative and growing plastics manufacturing company is looking for an experienced Automation Engineer.  This Automation Engineer applies technical skills used in all phases of the automation of production equipment.  Troubleshoot and repair all robots, PLCs, conveyors, and control systems.  Assists in the design and build of End of Arm tools and other equipment used to increase plant-wide productivity.ResponsibilitiesWorks efficiently and with urgency to troubleshoot, install, upgrade, and design all electrical, mechanical, and controls on all automation equipment. Designs and manufactures enhancements on all equipment to further efficient operation of equipment.    Must be able to program and troubleshoot all types of robots and automation controls.Orders, maintains and systematically upgrades all spare parts, inventory. Maintains records to track equipment problems.Performs evaluations to enhance machine efficiency rates and control parameters.Works to provide a safe and clean work environment.Provides a safe and clean work environment.Orders, maintains, and upgrades stock needed to perform job functions.Experience5 years of experience with the following equipment is strongly preferred –Injection molding machines above 1000 tons.ABB robots - Both programming and maintenance.Wittman and Ranger Robots – Both programming and maintenance.Keyence Vision Systems.Allen Bradley PLC’sAllen Bradley Panel View’sEDUCATION and/or EXPERIENCEHigh school diploma or general education degree (GED) and formal industrial trade school or equivalent; five (5) to seven (7) years technical experience in automation, electrical, mechanical, hydrologic, and PLC controls. Requires a basic proficiency in electricity, electronics, and hydraulic."}