{"title":"Software Engineer, Networking NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIEoaUfUeQeyU1WikWhHt_0wEjcP13G7CRxgb9xHnVqT3iHnaJDvlM1FKCKZw2k1W4wp3zDxlhprjGvSBGL9wDYVlYHF--WLsDuUIZagPLCInWXD8YTGKnuCAnEswgfw-ijVPH_xNUT64M2fFBZMJMxseOqXis3NmP8uHo5O43FbWtxbgvelPDQfGq0JA","source":"ziprecruiter","full_description":"Software Engineer, Networking If you are a Software Engineer with network experience, please read on!Top Reasons to Work with Us- Create exciting title that revitalize classic \"retro\" style for next generation gaming- Opportunity to experience Japan! - Work with great talent!What You Will Be Doing- Develop and maintain the online systems- Work closely with designers and gameplay programmers to help implement and maintain the systems for syncing fast paced online combat- Keep the physics simulation in sync between clients- Develop test code to validate service reliabilityWhat You Need for this Position ---Must be located in West Coast or Japan - 2+ years experience in a Network programmer role- Bachelor's degree or 7+ years experience in lieu of degree- Fluency in C++- Strong data structures and algorithm skills- Broad general understanding of game systems such as combat, physics, and pathfinding- Knowledge of network programming considerations- Capable of working proactively in a small team with minimal supervisionPluses:- 2+ Years experience developing with Unreal Engine 4- Avid and thoughtful gamer, especially of MMORPGsSo, if you are a Software Engineer, Networking with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}