{"title":"Software Engineer - iOS","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJzPM6F9LbUbGX3C0So369UTJrNIGERt-WfnB2k-KD8ZMr-v5ONiTqv3ucag2pD1rpFPv5PI1SLvq3ve-LaXAxQPfaEZ1aKdcgzb2gjzLo9g4mqsevNMfBfdN7cBNADpkVwso8k3ofKkOwZZMInHQqAaNUvDsWnSmzqhLTvYgokIKOZUUyXGxOHwge_Ogw9","source":"ziprecruiter","full_description":"Req ID: R0030795Specific information related to the position is outlined below. To apply, click on the button above. You will be required to create an account (or sign in with an existing account). Your account will provide you access to your application information.Need Help?Should you have a disability and need assistance with the application process, please request a reasonable accommodation by emailing Accessibilityor by calling 877-891-2510. This email inbox is monitored for reasonable accommodation requests only. Any other correspondence will not receive a response.Regular or Temporary:RegularLanguage Fluency: English (Required)Work Shift:1st shift (United States of America)Please review the following job description:Take a key role in the development of best-in-breed financial applications aimed at providing consumers leading-edge tools to maintain their financial life. Candidate will perform Mobile App Development on iOS using Swift, Objective-C and experience in mobile application development frameworks.Required Skills and Competencies:The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.* 3 + years of Experience in developing iOS applications;* Knowledge of the financial services or banking industry* Experience in Xcode, Objective-C, Swift, iOS, and Cocoa Touch;* Experience with SOAP and Rest based Web Service;* Experience with git or other distributed source code control systems;* Knowledge of Agile software processes including Scrum and Kanban;* Good to have if any experience on Continuous Integration and Delivery (CI / CD) and test driven development.* Past experience working in financial industry is a plus.* Bachelors of Engineering* Excellent communication skillsEssential Duties and Responsibilities:* Work as a technical expert with product, analysts, programmers and other team members to develop technical solutions to complex business problems.* Responsible for complex program design, coding, testing, debugging and documentation.* Recommend improvements to existing software programs.* Publishing builds through pipeline and app store submission process.* Instruct, direct and quality assure the work of other developers and analysts.* Gather client requirements, analyze, design and create complex application solutions.* Prepare detailed specifications from which complex programs will be written.* Adhere to Apple guidelines for development.* Brainstorming new features and ability to train the team on the same.* Provide application support including complex problem research, analysis, resolution and on-call support.Truist supports a diverse workforce and is an Equal Opportunity Employer who does not discriminate against individuals on the basis of race, gender, color, religion, national origin, age, sexual orientation, gender identity, disability, veteran status or other classification protected by law. Drug Free Workplace.Thank you for your interest in Truist! BB&T and SunTrust have come together in a transformational merger of equals to create Truist, the premier financial organization in the country. You may notice references to our legacy company names, BB&T and SunTrust, in places throughout this site. All such references should be understood to refer to Truist moving forward while we continue to transition to the Truist name.EEO is the Law Pay Transparency Nondiscrimination Provision E-VerifyThank you for your interest in Truist! BB&T and SunTrust have come together in a transformational merger of equals to create Truist, the premier financial organization in the country. You may notice references to our legacy company names, BB&T and SunTrust, in places throughout this site. All such references should be understood to refer to Truist moving forward while we continue to transition to the Truist name. 2017 SunTrust Banks, Inc. All rights reserved.SunTrust is federally registered service marks of SunTrust Banks, Inc."}