{"title":"Cashier - Retail Garden Center NEW!","location":"","salary":"","description":"","term":"Temporary","detail":"https://www.ziprecruiter.com/k/l/AAI3gurZmIXgfA0mBZ8rXCOz9jj4neV9TDg8A9PbnyD-lsLKxd8znn7ZvekEHObA9AmaQhg435tMhsyXd1BJQtCrR0lWwmo1XJLSeh5jeVVKBhCgRJr9kg37xUWT0FzteXZhh3ZM7Xvo2iOUcIBEwetaBOD6arjYmChxwpLaRDfH1qY1dIZdezAdk60tLQ","source":"ziprecruiter","full_description":"Retail CashierJob Title: Cashier Associate Locations: Metro Atlanta and CharlotteStatus: Part Time / HourlyReporting Relationships: Manager on DutyWork Schedule: Hours may vary and weekend availability is required“Come Have Fun and Enjoy the Great Outdoors!”Do you enjoy working in an open or outdoor environment? Do you enjoy interacting with customers and associates with a common interest? Need a little physical activity in your life? Like having a flexible schedule?If you answered “YES” to any of the above, this may be the perfect job for you!Pike Nursery has been serving Atlanta residents for over 60 years and Charlotte residents for over 12 years. Pike is recognized as a leader in the Garden Center Industry for its commitment to providing the best selection, quality, service and horticultural expertise. Pikes parent brand, Armstrong Garden Centers, in California, makes it the largest independent garden center company in the U.S. with career opportunities and growth from coast to coast.If you answered “YES” to any of the above, this may be the perfect job for you!Summary Duties and Responsibilities:This position is a key part of the overall success of the nursery and helps maintain plants quality and store cleanliness. This person will be working a varied schedule and weekend availability is required during our peak seasons.Primary Duties and Responsibilities:· Provide exceptional customer service· Register functions· Strong computer skills are helpful· Effective communication skills· Assist in customer carry-outs· Read and learn about product lines carried in the Garden Center· Follow safe work practices and report any unsafe working conditions to management· Perform other related duties and assignments as requestedEducation, Prior Work Experience and Specialized Skills and Knowledge:Personable, outgoing, enthusiastic, self-motivated individual, charismatic are the skills needed to be successful at this positionCompensation – We have great benefits! (Benefits available to full-time associates)· Major medical, dental, and group benefits· Paid holidays and paid time off· Participation in the Employee Stock Ownership Plan (ESOP)· 401K· Salary will commensurate with experiencePhysical Environment/Working Conditions- Safety First!This position requires some physical activity such as lifting, squatting, bending, twisting, pushing, pulling and walking. Unassisted lifting limits between 30 and 50 lbs. Individuals may be required to do any or all of these situations throughout the work day, with an emphasis on walking and standing for a major portion of the day. The outside environment will comprise most of the day with some inside building activity."}