{"title":"Software Engineer II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALtbcvPHjbJPgMpdDNxAfw9aEzSCY-BkdK4G0__ySgR6ZiRvt6NUUUuNUntpo3ymXEyxNUxNbp90deFiACQaGpMd4POI2ZU5VXZiF1qfxuXyG7AS2qIczjLBz_a7lQWDBka935829jvnuQLFbaoeAZM2zmLqanAQh5a_baSFvwU4ErXbcjEpVP3sG0sJUSk","source":"ziprecruiter","full_description":"Position Title: Application Developer-Connectivity Software Can also be called Software Application Developers.Level II: Minimum 3-5 years' experience being sought for this opening.*** We have approval from the manager to submit candidates up to ***/hour. As always, if youre submitting candidates at a higher hourly bill rate*** please submit the profile with the .01 rate and in the comments section list the bill rate needed to secure that candidate. The rate needed to sure your candidate needs to be clear in your submission of that profile.Assignment Details:This position pertains to the development of embedded applications for *** supported connectivity devices.Primary responsibilities include:* Work in tandem with software / system architect(s) to develop application platform for connectivity applications to support different business units.Desired technical skillset:* Minimum of a Bachelors Degree is required manager would prefer to see degrees in Computer Science or related. This manager has specifically said he is not looking for candidates whom are fresh out of college. Candidates need to have actually working experience in the same or similar role(s).* Manager is seeking candidates with 3-5 years applicable experience.* Candidate shall have work experience with Linux application development in IOT or related domains such as car multimedia, connectivity devices, android/ios apps etc.* Expert at object-oriented application development in C++.* Experience with Linux operating systems.* Experience with API driven microservices architectures.* Familiarity with integrating applications with OS drivers, socket programming and networking fundamentals.* Operational knowledge of cybersecurity aspects of application development.* Develop systems and processes to support consistent and module application architecture.* Support cross functional initiatives with different engineering groups within ***.* Related certifications are nice to haves Agile Development, Systems Administration, Object-Oriented Programming, etc.Additional information from the manager:* This manager shared that his group is a new group the need for this opening is to fill openings within this new team.* This is a Monday Friday position with core working hours being 7:00 AM 4:00 PM. It is possible that overtime may need to be worked on occasion.* This team is currently working remotely due to offices being closed. When business operations return to normal, it is expected that this hire be on-site working with the rest of the team. 100% all the time remote work is not an option for this role.* When the manager is ready to interview he will be requesting Zoom interviews. Other members of his team will be joining him on those scheduled appointments...."}