{"title":"          Structural Engineer (ID# 47299)         ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AALD96oQraMHuYkV1xX7hNv8uGvPnONDPVq3aFkPSg4GGnHa_aaSvyDqRv37IVTqpRdu76i2zzJLWcK52xKvjcqQ1np2Xh1Ty4sj4y_cD3UarznzMaOuk_1-cdo-l97C3vNAjrRCvhxAHffbE84gV7w0Vpxovb_tcayasAJf3SWUUGolmue2CXsgbLbPMf8","source":"ziprecruiter","full_description":"\n        > # Structural Engineer (ID# 47299) _Los Angeles, CA_ > > # Category: _Structural Engineering_ > > # Job Type: _Full Time_ > **Minimum Experience:** 10 **Required Education:** Bachelor's Degree > # Job Description > Be involved in projects with our Construction Services Team and be a part of a growing organization that meets our client's objectives and solves their challenges. At WSP, we are driven by inspiring the right people to be part of our future-focused business objectives. Our devotion to teamwork has allowed us to build communities and expand our skylines. Here at WSP, anything is within our reach and yours as a WSP employee. Come join us and help shape the future! WSP is currently initiating a search for a Structural Engineer for our Los Angeles, California office.  **Duties and Responsibilities:** + Make recommendations, consults with and gives techical direction to commissioned architects or structural engineers + Provide technical direction to lower-level staff in the Structural Engineering Unit + Evaluate plans and specificatons submitted by commissioned or consulting structural engineers + Submit provisions for commissioning by including structural recommendations + Support in the planning and maintenance of structural engineering guidelines + Assist in developing District structural engineering policies + Investigate and create reports for structural engineering systems, structural components and installation to advise contractors, commissioned architects and engineers and District Construction Inspectors + Assign structural testing materials and inspection to laboratories and review test reports + Examine soil tests' information and make appropriate recommendations regarding structural foundations and structures to be constructed + Perform other duties as assigned Talent is the essence of meeting our client's objectives, goals and challenges. If this sounds like a fit for you, we'd love to have that first discussion of you joining our team. > # Job Requirements > **Minimum Qualifications:** + Ten (10) years of experience with a mininum of five (5) years of experience in similar or equivalent roles involved in managing the structural aspects in commercial and/or public or educational facility constrution projects + Bachelors degree, preferrably Structures Engineering and courses in Management + Valid Certificate of Registration as a Professional Mechanical Engineer issued by the California State Board of Registratio of Civil and Professional Engineers + Exercise responsible and ethical decision-making regarding company funds, resources and conduct and adhere to WSP's Code of Conduct and related policies and procedures + Proven track record of upholding workplace safety and ability to abide by WSP's health, safety and drug/alcohol and harassment policies **About WSP USA** WSP USA is the U.S. operating company of one of the world's leading engineering and professional services firms. Dedicated to serving local communities, we are engineers, planners, technical experts, strategic advisors and construction management professionals. WSP USA designs lasting solutions in the transportation, buildings, energy, water and environment sectors. With nearly 9,500 people in 150 offices across the U.S., we partner with our clients to help communities prosper.www.wsp.com/usa WSP provides a comprehensive suite of benefits including medical, dental, vision, disability, life, and retirement savings focused on a providing health and financial stability throughout the employee's career. At WSP, we want to give our employees the challenges they seek to grow their careers and knowledge base. Your daily contributions to your team will be a key piece in our meeting client objectives, goals and challenges.  Are you ready to get started? WSP USA Inc., WSP USA Buildings Inc., and WSP USA Services Inc. (collectively \"WSP USA\") is an Equal Opportunity Employer Race/Age/Color/Religion/Sex/Sexual Orientation/Gender Identity/National Origin/Disability or Protected Veteran Status The selected candidate must be authorized to work in the United States.  This position is subject to and contingent upon client approval of candidates put forth for consideration by WSP. WSP USA Inc., WSP USA Buildings Inc., and WSP USA Services Inc. (collectively \"WSP USA\") is an Equal Opportunity Employer Race/Age/Color/Religion/Sex/Sexual Orientation/Gender Identity/National Origin/Disability or Protected Veteran Status\n      "}