{"title":"Field Construction Supervisor Austin, Texas","location":"","salary":"","description":"","term":"$80,000 to $95,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIBsj9DrVa8133fSIYHfrAxuSSGZDAqQr5g_5KjdmhtHaI2BKhcWUZ4ufhV3dnbbgL6dFT6MAsCto700LfMIBELtiIkYdgSsM7dgVyNtRGtsLa0Zfey1lxsWj5zYnfIXfhXSd-vhFZyrAiw0JNkKR28MAgYQ503Ye-bBzw6HQLiPQHtcbAvxSnZkhG4I1E-","source":"ziprecruiter","full_description":"Our growing national construction firm seeks Austin based Field Construction Supervisors for interior/exterior multi-family renovation projects. Our services spread throughout the Multi-family, Senior Housing, Student Housing and Low Income Tax Credit Housing Industries. We offer a competitive salary; vehicle allowance; medical, vision, dental insurance; a multi-faceted 401K plan; and bonus opportunities. If you feel you possess quality supervisory skills and a keen eye for detail, please consider applying to this position.General Position Description:Initial responsibilities include, but are not limited to, ensuring high-quality results through the supervision of subcontractors and suppliers related to field construction. Responsibilities include: maintaining a safe work environment; presenting safety meetings; conducting safety inspections; ensuring quality workmanship in accordance to project documents; executing work according to project schedule; preparing daily logs; and providing timely/accurate reports from the field. In addition, you may be asked to assist with: negotiating and preparing subcontract agreements; managing and securing materials; preparing purchase orders; preparing and tracking project schedules; preparing production budgets; tracking costs vs budgets; approving vendor invoices; and serving as liaison between our customer and Whitestone. Significant travel may be required.Qualifications/Basic Job Requirements:Customer-focused mentalityStrong time management and organization skillsAble to work independently and remotely5-8 years of construction experienceAdvanced knowledge with an eye for quality workmanship in the construction industryBudgeting/forecasting experience, and general accounting knowledge strongly preferredSuperior verbal and written communication skillsProficient in Microsoft Word, Outlook and ExcelValid driver license with dependable transportation requiredBackground check will be requiredTravel may be required.Flexibility to work an ever-changing schedule (evenings, holidays, weekends may be required)Proficiency in Microsoft Project is strongly preferredCertification in OSHA (10 Hours) Safety Training strongly preferredBachelor’s Degree strongly preferredConstruction Management Degree a plusMultifamily experience a plusReconstruction experiences a plusBased in the Austin, Texas area a plus"}