{"title":"Test Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAItbkYe19PeMeHM1EzbRRf8Y86-Sp0n0iOqnrmY470lrI6mUr0oqASWUykYut0vAN3doah_esR_yu3ElKHrEXHaJZRXEdLGa2V4tDZCqzEatYgujHRinJx_WSkMwcr0pnIFpqrWpwu9BRzAhRQI5ZBP8e5pLDzrAKlA4XMVZmIjByq12TS01F1XQw_21MA","source":"ziprecruiter","full_description":"Test Engineer - Raymond, OHBS Degree in ME/EE. 6 years of related experience may be substituted for required degree. Test Engineer with 2 years of test engineering experience in the areas of vehicle electrical system validation testing. Preferred areas include exterior lighting, wiper & mirror systems including system networking experience such as LIN or CAN. Applies engineering principles, experiences and various analysis tools in following established test plans/procedures to test design parts/components in area of specialty to determine design feasibility and ensure parts/components meet design acceptance criteria, performance level targets and any applicable regulatory/internal standards. Creates data settings, prepares/setups test equipment, conducts standard/basic tests and documents/summarizes test results/conclusions, verifying testing accuracy/thoroughness and determining if additional testing is needed. Analyzes/interprets test results, predicting performance/failure and providing required product/design data, communicating test results clearly in written reports/formal presentations and making general recommendations based on analysis of testing results. Able to troubleshoot hardware and software issues, including the actual retrofitting of parts to the vehicle. Perform lighting distribution analyses, lighting output calculations, dynamic vehicle testing and subjective lighting evaluations on the vehicle.Send resumes to: sarah.szagesh@advantageresourcing.comAbout Advantage Resourcing Advantage Resourcing is committed to providing equal employment opportunity for all persons regardless of race, color, religion (including religious dress and grooming practices), sex, sexual orientation, gender, gender identity, gender expression, age, marital status, national origin, ancestry, citizenship status, pregnancy, medical condition, genetic information, mental and physical disability, political affiliation, union membership, status as a parent, military or veteran status or other non-merit based factors. We will provide reasonable accommodations throughout the application, interviewing and employment process. If you require a reasonable accommodation, contact us. Advantage Resourcing is an E-Verify employer. This policy is applicable to all phases of the employment relationship, including hiring, transfers, promotions, training, terminations, working conditions, compensation, benefits, and other terms and conditions of employment. All employees are directed to familiarize themselves with this policy and to act in accordance with it. All decisions with respect to employment matters and other phases of employer-temporary employee relationships will be in keeping with this policy and in accordance with all applicable laws and regulations."}