{"title":"Digital Marketing & Social Media Assistant NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJefGXl8O0FbuDWVli3ANRDsouq7oAHPGsrBdwIcrxHMZN8SBunvWK63kq3efgZG511eTpPSZbthqGB9HYB792QJzSdZWtGQEpGHl8XA6gjJwhApB9DN-bEOUMwt11FF9t6IWc16V1CJh3J3P67-WVf_tFeRsroL3kfRL8IEYOFnPGmfvLA3faurtsLwEA","source":"ziprecruiter","full_description":"We are looking for a creatively driven Greater Washington DC-based Digital Marketing & Social Media Assistant, who is passionate about fashion, culture, art, and the storytelling of our brand’s projects across all our social media platforms to support our CEO and team. S/he will work broadly across content production, press relations, seasonal campaigns, and management of editorial calendars.Must have proven track record of demonstrating exceptional knowledge and understanding of the Social Media landscape – including content optimization and publishing algorithms, building and engaging communities, social listening and reporting, planning and execution of socially-led campaigns, and an understanding of the latest technologies impacting key global platforms; Bachelor's Degree in Marketing, Communications, or related field. 3+ years' experience in marketing or social media/fashion industry, and culture content with most recent experience in Social Media; Management for a fashion brand. Passion for storytelling and branding, commercial product and content-driven; Skilled in photography; Must have sensibility towards fashion and the luxury sector and the arts landscape; Experience in fashion shoot production. A good level of proficiency in Dreamweaver, InDesign, and Photoshop; Proven experience writing content for a fashion or lifestyle brand; understanding of social media and website traffic, and online customer engagement metrics; Highly organized and driven with meticulous attention to detail; Excellent communication skills – written and oral; ability to multitask; solutions-focused approach; results orientated; Ability to work independently and across a team; Experience working in a fast-moving entrepreneurial environment with competing deadlines and priorities.You will be reporting to our CEO and based in our Bethesda, MD Head Office.Please send your resume to mmesina@yesshemay.com"}