{"title":"Principle Engineer (Materials & Chemistry) - Bellevue, WA","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIkRaIv0F6YPyhE1XtLqw9J3s8gdox5sL1FCEmNWsu7UyR_5CJXaFH6QLF-9h-Es-VE7rap-5Sliki7luvmcGZuco1bIK8Y3ik60JxZcNFSQ2uym0qEadltbgQPtME8PLkLsuNZZ4o3ZDi2XsOe21bbAa5_N9DEK9SOscA6_s2qf93U_xf5a6KVRnrX1HMU","source":"ziprecruiter","full_description":"RCS Corporation has an immediate need for a Principle Engineer (Materials & Chemistry) for our client in the Bellevue, WA area. This is a 1-year contract opportunity with the potential of extension. Who We AreRCS Corporation is a certified Women-Owned Small Business (WOSB) specializing in the recruitment of professionals for best-of-class companies throughout the United States. Since 1994, RCS recruits top talent for direct hire, temp-to-perm and contract staffing positions and provides customized payroll services. Our Recruiting Specialties consist of all Engineering Disciplines, Project Management, Project Controls, Information Technology, Energy Efficiency and Business Professionals. AboutWe are seeking to contract a highly motivated Materials Engineer to support the engineering efforts of the Materials and Chemistry Discipline team. This role will work as part of a high functioning team of engineers focused on qualification of next generation materials for reactor projects. In this position, you will characterize and analyze the irradiation behavior of nuclear materials. You will participate in planning, developing, and implementing neutron irradiation test programs and post-irradiation characterization of samples. You will coordinate with national labs and other test facilities to perform post-irradiation examination (PIE) including FIB, SEM, TEM, profilometry, and immersion density. You will also work with other engineers to develop and execute test plans for mechanical testing of neutron-irradiated materials. You will be responsible for developing correlations to describe the resulting material performance data for design and licensing of reactor projects.ResponsibilitiesInterface with various project teams to ensure materials development and testing efforts meet programmatic objectives.Plan, execute, and oversee neutron irradiation and post-irradiation test programs designed to develop an understanding of complex nuclear material phenomena (e.g. irradiation creep, swelling, and mechanical property performance changes) in sodium cooled fast reactor core materials.Work closely with vendors and quality assurance to ensure the necessary test data are obtained for qualification and licensing of nuclear reactor core materials.Perform scientific analysis on test data and?generate technical reports to document new knowledge related to reactor design and qualificationDevelop material property correlations and advanced material performance models as input for reactor design and licensing.Offer material selection guidance for our client's reactor development programsKey Qualifications and Skills BS degree in Materials Science/Engineering, Mechanical Engineering, Nuclear Engineering or relative degree and a minimum of 12 years of experience with nuclear materials.Knowledge of materials science principles, characterization methods, and testing techniques for nuclear materials is required.Experience developing and applying material performance models, particularly for irradiation creep and swelling is desired.Experience qualifying materials for service in high-performance and/or highly regulated applications is highly desirable.A thorough understanding of metallurgy including fabrication and thermomechanical processing of ferrous (e.g., ferritic-martensitic steels) alloys is preferred.Ability to work with minimum direction to solve challenging problems.The successful candidate will possess a high degree of trust and integrity, communicate openly and display respect and a desire to foster teamworkJob FunctionsJob Functions are physical actions and/or working conditions associated with the position. These functions may also constitute essential functions for the job which the employee must be able to fulfill, with or without accommodation. Information provided below is to help describe the job so that the applicant has a reasonable understanding of the job duties/expectations. An applicant's ability to perform and/or tolerate these actions and conditions will be discussed and workplace accommodations may be made on a case-by-case basis following an individualized assessment of the applicant and other considerations, including but not limited to any governing safety standards.Motor Abilities: Sitting and/or standing for extended periods, bending/stooping, grasping/gripping, fine motor control (hands)Physical exertion and/or requirements: Minimal, with ability to safely lift up to 25 poundsAbility to work in a laboratory setting with fluctuating temperaturesRepetitive work: ProlongedSpecial Senses: Visual and audio focused workWork Conditions: Stairs, typing/keyboard, standard and/or sitting working environment of >8 hrs./dayTravel required: 0-5%RCS is an equal opportunity employer that prohibits discrimination and harassment of any type. RCS recruits, hires, and promotes for all positions without regard to race, color, religion, creed, national origin, citizenship status, disability, military status, veteran status, marital status, sexual orientation, gender identity, sex, genetic information or age. All terms and conditions of employment such as compensation, benefits, work assignment, availability of facilities and privileges of employment are administered on the same basis of equality."}