{"title":"Network Architect - GPON Broadband - Direct Hire NEW!","location":"","salary":"","description":"","term":"$80,000 to $120,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKFmdruCrJEOZuknGA2YtHJJHMb6jpwqKt-nSVJTQi_N9dQKLsZG84FoADz1k6OCgJCQmU7WaFcMkMdnPkYvSN72iG1W_uma0qSxBCZHoHdhzTBsyGrDluCSAinKd97-UPST3En7srW3kheIP28Tpjqa38FcdUcpcTC_1U2f7-_FZ9Mo6x_ePvuysfZHvMO","source":"ziprecruiter","full_description":"Keystaff is hiring for a Network Engineer with expertise in broadband networks.Key Responsibilities:The Engineer will lead all solution design activity with the internal resources and Construction teams as well as. This organization is responsible for all products, design, engineering, construction and deployments. This role will lead the organization to success by ensuring a high level of quality and stability. Furthermore, the Network Engineer will work closely with the sales and marketing teams to provide strategic input on individual opportunities and ensure the optimal use of the organization's broadband resources. Additionally, this role will partner with project management resources to ensure timely delivery on all projects.Job Description:Responsible to design, install and maintain Broadband networks.Provide direction to contractors to effectively determine timelines and resources that ensure value added solutions in each target market.Mitigate risk through effective use of internal and external resources.Partner with Sales and Marketing Leadership to foster the effectiveness of the Broadband Implementation team through open communication and standardization.Develop and validate the deployment approach for a technology solution, including plans for adoption, training, and communication.Develop risk mitigation strategies, identify and resolve deployment risk in support of quality and risk management processes.Collaborate, develop and implement new processes and continually improve communication and quality of delivered solutions and services.As needed, prepare and execute fiber deployment designs for the sales team using KMZ and similar file types to produce detailed designs of deployments.Lower overall cost of operations through solid Broadband Implementation practices.Coordination with support operations and engineering teams to improve monitoring solution and customer communication.Understand and abide by all security and operational policies.All other duties as assigned.Qualifications:Bachelor's degree in electrical engineering or related field.2-5 years in design and engineering experience and implementing complex IT environments.Network, Security awareness, network / route technologies and solutions.VAR or solution provider experience a must for this role.PON Implementation- general knowledge.Knowledge of CAD / GIS and similar file types/programs.Knowledge of materials and labor costs for broadband components.Middle and Last mile design and/or deployment experience.Working Knowledge (high level) of network topology and systems.EOE: KeyStaff, Inc. is an Equal Opportunity Employer, Keystaff, Inc. provides equal employment opportunities without regards to race, color, religion, gender, national origin, age and disability unrelated to an individual’s ability to perform adequately, sexual orientation, marital status, or any other characteristic protected by law.Keywords: Direct Hire, Engineer, electrical engineer, network engineer, broadband, broadband technician, broadband engineer, broadband instillation GPON Applications, New-graduates."}