{"title":"Technical Service Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK8Fwry3yRE34th1dvdaPyEAlrpWcKp_s2V0YT614C_Pi2aF-PFpARvTT1qSxzLTLJBbH_6ujIyGBQGZ4IcTUJbhJLAK3s0vMor8pSnAPWtHcKsdPvKfslbH6Mzw6M84A_1hptdB1aHPWNRSIQNsd68OleF0MuKfGuMNlccK8X8Z8Eub_AnbgTxlVpAjBUi","source":"ziprecruiter","full_description":"Technical Service ChemistJOB DESCRIPTIONPURPOSE AND SCOPEThe purpose of this procedure is to provide a means of establishing the functions and relationship of this position at RICCA Chemical Company. This applies to all employees having earned this position through their educational background or work experience.WORKPLACE VALUESThe position will be expected to operate in line with Ricca Chemical Company’s workplace values which include:Right  High Standards – Always Produce the Best, Never Settle for AverageTrust – Confidence in Our CommitmentsRaise the Bar - Do More than ExpectedReady  Bias for Action/Initiative – Take Action, Do itAccountability – Responsible for your Actions, Dependable, Own ItInnovative – Creative, Look for a Better WayRicca  Teamwork – Everyone Doing their Part to Help each other to be Great!Customer Obsession – Going the extra step for Internal & External Customers, Delight the CustomerGrow and Learn – Develop Your Skills, Desire to do MoreREQUIREMENTSEducation: The Technical Services Chemist should have a B.A. or B.S. degree in Chemistry or closely allied field.Experience: Previous word processing experience is required. Previous experience in manufacturing or testing chemical solutions is desirable.Physical Requirements:  This position requires a person to be able to speak, read, write, and conduct business in English. This person shall also have sufficient eyesight (natural or corrected) to read business documents and properly fill out appropriate forms and documents.Mental Requirements: This position requires the ability to understand and then follow both written and verbal work instructions and procedures without direct supervision after the initial training period is successfully completed and documented. This position should have sufficient mental capacity to understand and successfully implement changes in work tasks as required. This position should have both the intelligence to understand what is expected and the initiative to perform all relevant tasks with a minimum of supervision.Working Conditions: This position will be working predominantly in an office environment. Occasionally it may be necessary to work in other areas, such as the Production and Shipping areas. When working in these areas, all necessary safety precautions must be followed, and appropriate safety equipment worn.TASKS AND DUTIESFunction as a team player to ensure the health, safety, and well-being of self, co-workers, visitors, neighbors, and property. This includes compliance with all RICCA CHEMICAL COMPANY safety policies and procedures.Will be accountable to arrive to work on-time and ready to work at the start of the workday.·This position is will set the standard by writing, entering, and maintaining data and instructions pertaining to purchased goods and finished products in Chempax to assist in the success of purchasing.Technical Services will write, enter, and maintain Master Product, Product-Packaging, and Product-Pkg- Warehouse information understanding the impact of correct information to all internal customers.This position will write, enter, and maintain Formulation/Routing instructions for finished goods to ensure the success of Chem Techs, Quality Control and the Production Teams.Maintain customer change notification working with appropriate team members to ensure compliance.Answer customer technical questions via phone, email, etc., in a timely, accurate, and professional manner with the goal of earning the customers trust with Ricca, Technical Service, and products.Demonstrates a bias for action and initiative to make decisions and act, to better serve both internal and external customers.Present innovative ideas when solving customer issues.This position will receive, investigate, and document technical complaints. Investigations will require working with other departments to resolve the issue as quickly and accurately as possible.Be creative when investigating customer complaints and bring ideas for continuous process improvement.Coordinate or perform testing when deemed necessary by you and your team for non-conformance investigation or product development activities.Arrange for testing of products or raw materials by outside testing laboratories (including customer testing of private labeled products as required).Maintain testing records for required periodic High Purity Deionized Water system testing.Manage and document stability studies as required.Will handle all customer issues by going the extra mile to enhance the customer experience.Compose and revise product labels, all internal and external requirements that must be met, product Certificates of Analysis, and Technical Reference Documents to ensure customer satisfaction and Ricca success.Must have a strong desire to grow and learn and share knowledge within Ricca Chemical.Will perform learning opportunities, as a professional chemist, for all interested personnel.Assist the Sales/Marketing team in developing new products, performing literature searches, and process capability analysis as needed.Exhibit customer obsession and teamwork by completing other duties as assigned."}