{"title":"Cyber Hardware Engineer 5 (Sky) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJqJjE38oijmEjCoJF6AolIQrQy3g1ATL9Ec7vQ6G56UmG3vcoGohSn4p_9ai3Wnf1XHym9xfhbJk39gdtin9jcHr50cwXui7TaLrMsmfYAD2eA8gk9Fw4SCIscXW7gj4VDH94KfLpi3pStjBHxE7Hwkczyi416SWIcSvOmbs8a46LfAK6WZZ_O7o9Bi2sy","source":"ziprecruiter","full_description":"Battelle's founding mission \"to translate scientific discovery and technology advances into societal benefit\" is as relevant today as when we opened our doors over 90 years ago. Our science and technology enhance society's well-being and create critical innovations that drive scientific advances for the future. We conduct groundbreaking research and development, design and manufacture leading-edge products, and deliver critical services for commercial and government customers. Our work meets the needs of the nation when it matters most, and Battelle is committed to driving innovation today and for generations to come.**ABOUT US** Do you like solving the hardest computing problems in the world, working on research projects you are passionate about, and competitive mini basketball, and bumper pool? Battelle may be the company for you.Battelle Cyber Engineers solve the hardest Computer Science problems in the world. We work in small agile teams to push the bounds of computing technology. Our high-powered computer labs include specialized software and hardware, so our engineers are unencumbered to push Cyber to new heights. Battelle offers opportunities to recent graduates to learn the skills required to move to the next level.Our team is casual. We usually wear t-shirts and jeans. We are a close-knit group and enjoy participating in social activities outside of work. Whether it is visiting local restaurants, bowling, Korean BBQ, or paintball we always have a good time. Battelle is committed to its employee's professional growth. We encourage new ideas with our large Internal Research and Development (IRAD) program where engineers work on projects they are passionate about. Employees partake in multiple paid professional trainings per year.We are seeking mid and senior level **Cyber Hardware Engineers** in our **Columbus, OH office** .**MAJOR RESPONSIBILITIES** + Collaborates with the Cyber Trust and Analytics Team to improve engineering and embedded system development capabilities, integrating hardware, software, and reverse engineering tasks. + Identifies and articulates strengths and weaknesses of solutions, conclusions and problem approaches during technical discussions. + Provide direction, establishing objectives, and leading a project work of a team of scientists and engineers + Providing direction and coaching to staff around strengths and weaknesses of solutions, conclusions and problem approaches + Supporting the technical baseline and technical processes for the program and positioning Battelle Cyber and our clients as technical leaders within the MINSEC community + Develop and maintain a comprehensive technical roadmap and deliver technical accomplishments within schedule and budgets + Deliver quality technical and research reports + Interface with senior technical and programmatic customers + Serve as a technical solution author for major capture and proposal efforts**THE FOLLOWING IS REQUIRED** + Bachelor's degree in Electrical Engineering, Computer Engineering or related field of study with at least 10 years of experience or master's degree in related field with 8 years of experience or PhD with 5 years of experience; or an equivalent combination of education and or experience in a related field. + Experience with software coding/debugging or experience developing and debugging software for embedded systems. + Experience developing embedded microprocessor-based systems including digital and analog circuit design. + Familiarity with assembly language programming for at least one family of microprocessors (x86, x64, ARM, MIPS, PowerPC, etc.). + Knowledge of integrated circuit design and fabrication processes and firm understanding of FPGA and/or ASIC design flows. + Ability to develop and work with Register Transfer Level (RTL) design and netlists. + Solid understanding and experience with FPGA/ASIC synthesis tools such as Xilinx Vivado/ISE, Altera Quartus, Cadence, Synopsys, etc. + Familiarity with networking protocols and architecture. + Demonstrates good organization, communication, problem-solving and teamwork skills. + Must be a US Citizen with the ability to obtain and maintain a US government security clearance.**THE FOLLOWING IS DESIRED** + Proficient in microcontroller-based design and analysis. + Familiarity with Python, MATLAB, C/C++, or C#. + Project experience in timing analysis and closure, verification, and system integration with 3rd Party IP. + Ability to generate verification test benches for simulating and validating designs. + Experience in data mining and machine learning + Experience in reverse engineering integrated circuits. + Firm understanding of VHDL and/or Verilog hardware description languages. + Experience in data visualization, signal processing, statistical techniques, and technical writing. + FPGA design expertise using either Verilog or VHDL. + Experience developing or analyzing networking protocols and bus architectures (CAN, I2C, etc.). + Active Secret or Top Secret clearance.**LEGAL DISCLAIMER** The above statements are intended to describe the nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, activities and skills required of staff members. No statement herein is intended to imply any authorities to commit Battelle unless special written permission is granted by Battelle's Legal Department.**BENEFITS**Battelle's competitive benefits program includes comprehensive medical and dental care, matching 401K, paid time off, flexible spending accounts, disability coverage, and other benefits that help provide financial protection for you and your family._Battelle provides employment and opportunities for advancement, compensation, training, and growth according to individual merit, without regard to race, color, religion, sex (including pregnancy), national origin, sexual orientation, gender identity or expression, marital status, age, genetic information, disability, veteran-status, or any other characteristic protected under applicable Federal, state, or local law. Our goal is for each staff member to have the opportunity to grow to the limits of their abilities and to achieve personal and organizational objectives. We will support positive programs for equal treatment of all staff and full utilization of all qualified employees at all levels within Battelle._For more information about our other openings, please visit www.battelle.org/careers"}