{"title":"SENIOR NETWORK ENGINEER","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIfubuo9lNLOTE8zOnoM9wZ6ujUMLBS4TOrZ142GzVOmm854zClCS0ooQ6TyB5m207BTEIpYcpDlIHsNm3En-evDPbQ4YUoWEL9yt0E6wp035Z2MHNwc4V_mMcU2FviFLUqxlWOLONw4peazj8c0eGLDL2HZY7b_rpCuFHyJLkhYf7BlOnHK_krpE_GK-Q","source":"ziprecruiter","full_description":": Senior Network EngineerJoin the Transcendent Team!At Transcendent, we work hard to create an environment that employees love to be a part of with high professional standards, team atmosphere, casual dress, flexible hours, variety of work, and fun people.What we do:We work with some of the best companies in the area from helping them re-architecting their environment to completely absorbing them into our environmentWe offer Hosting/Colocation/Backup/Disaster Recovery solutions as well as Cloud/Managed Services in our own local data center.We provide cloud solutionsWe provide solutions for Storage, Servers, Virtualization, Networking, Email, and Security expertise.Reasons to work here: There are many reasons you should work here. Our people say they like it here because we all work together and support one another, put the best interest of our clients first and have a family-like atmosphere. Others say it’s because we have fun, have frequent team/company outings, and engage in spirited debates. But, I think they like it here because our work is always interesting. Read the job description that follows, and if you think this is for you, send us your resume, we'd love to talk to you.Your Background and Values:You enjoy the opportunity and challenge of being introduced to different technologies and businesses frequentlyYou tend to learn new stuff on your own, often before everyone elseYou’re not afraid to go into the boss’s office, and share your ideas for improvements. But, you’re also pragmatic enough to not share every far-fetched scheme that pops into your head. (That’s the boss’s prerogative.)You believe multi-tasking and balancing multiple projects at the same time is a “no-brainer”Your ongoing duties: We are in rapid growth mode and currently looking for a Senior Network Engineer. The position is responsible for providing hands-on support for VMware, Storage, Networking and Microsoft Stack. Activities include monitoring, maintaining and troubleshooting systems.Additionally, direct support to the user involves analyzing the technical needs of the lines of business, evaluating the available technology, recommending a technology that ensures corporate wide integration and implementing the technology of choice. Decisions affect the success of smaller projects or significant portions of larger projects and have impact on image, schedules, customer satisfaction, and financial performance.The qualified Senior Network Engineer has significant independent decision making responsibility and accountability, and will have leadership responsibilities including:Minimum of 7 to 10 years in network engineering and architectureMonitoring, maintaining and troubleshooting our Data Center including VMware, Storage and Networking.Design networking solutions based on business, data, application and technology requirementsExperience with VMware, enterprise storage, switching, routing or Microsoft applications requiredThe ability to analyze requirements and work with team to implement necessary changes to improve performanceStrong communication skills to align cross functional teams around the delivery of the committed objectives and outcomesStrong attention to detail, ability to manage multiple deadlines, clients, projects and adapt to changing prioritiesExcellent analytical, problem solving, organizational, time and project management skillsMentor 1st and 2nd level EngineersProvide deep, subject matter expertise for a broad portfolio of networking and storage technologies and services.Communicate industry trends, best practices and opportunities for technology and process optimizationsProvide requirements analysis and develop system specifications as a result of the needs assessment. In addition, ensure hardware/software compatibility.Defines, recommends, and implements related hardware/software projects which could involve major enhancements and/or new technologiesUnderstands and efficiently executes and improves department processes and procedures.Responsible for accurate and thorough documentation of procedures and practices in the networking areaThe Benefits: We offer great benefits including matching 401(k).If you have a passion for technology and are motived by using your skills to make a difference, please apply!"}