{"title":"Sr. Software Engineer, Full-Stack - Map Infra/Platform NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI4rcmNqlORM3GyyqVWEjrKfhp7n-FKEIVIceaLnF61qJnuEaeS3smQlKGPqEBDF5EtKk2wkmMNZqpSR6rnIX_W-dN6gkwKcZZVXs1XJ6Y9_JZmoa9_zLEDkyOm4w8yAG02WoIJqYbo5sJ9g5JK6gEyL40087GgHeQMtttkFEwU43GrzNzzqVh92tPNHv8","source":"ziprecruiter","full_description":"This opportunity is located in San Diego, CA.  Remote friendly during COVID-19  You can apply to the job with this email address: sw_eng__sr__software_engineer__full_stack_08c8bd432us@ivy.greenhouse.ioCompany OverviewCome join a higher calling and find a deeper purpose! As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking. While inventing the framework of Autonomous Driving, our current fleet of autonomous Trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy. TuSimple was founded half a decade ago with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable Autonomous Freight Network. Opportunity Overview:As a Senior Full Stack Engineer at TuSimple, you will work on both the back-end infrastructure and front-end Web UIs of various projects, from our offboard infrastructure services to the onboard system, to bring automation and visualization to the company. Your work will greatly improve the efficiency of the research of our algorithm scientists, and expedite the development of engineering infrastructure projects.Role Responsibilities:Building pipeline scheduling and execution platform, as well as the corresponding frontend to manage and interact with the platform, to do analysis of our simulations and datasets;Developing on-premises cluster projects as well as utilizing public cloud computing infrastructure services;Building front-end Web Interface for engineers and testops to control and monitor the onboard system, that visualize in real time, the perceived surroundings and decided routes of our autonomous driving system;Building web-based tools to optimize the labelling of our datasets to greatly increase the efficiency and correctness; Develop vehicle oversight service software to monitor vehicles remotelyProvide vehicle monitor and management API service to customersProactively identify problems and make technical suggestion on requirementsExperience & Skills Required:Experience in building highly scalable enterprise web applications3+ years experience in developing microservices using AWS or other equivalent cloud frameworkExperience in developing secured API and publishing user documentExcellent knowledge of different API mechanism such as REST, RPC/gRPC, HTTP, GraphQLExperience in developing extensible APIs and highly maintainable services.Experience in deploying, monitoring and maintaining services and systems.Excellent knowledge of databases like Dynamodb, Mongodb, SQLFluent in JavaScript & PythonUnderstanding of SOA, SAAS, and REST/OAuth/JSON architectures and services.Preferred Skills and Experience:Familiar with front-end Vue.js frameworkFamiliar with back-end Flask or Django frameworkFamiliar with iOS/Android mobile application developmentTuSimple Benefits100% employer-paid healthcare premiums for you and your familyWork visa sponsorship availableRelocation assistance availableBreakfast, lunch, and dinner served every dayFull kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and moreStock options / equityGym membership reimbursementMonthly team building budgetLearning/education budget Employer-paid life insuranceEmployer-paid long and short disabilityTuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.This opportunity is located in San Diego, CA.  Remote friendly during COVID-19  You can apply to the job with this email address: sw_eng__sr__software_engineer__full_stack_08c8bd432us@ivy.greenhouse.ioBrown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,"}