{"title":"IMA / Staff Hardware Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKSe1UXhJrdqHFRZjXck7ceazChC8W2YMcUUZI4dbmg3ZS_OEBmhuCV0S5iJyTPXBXGfX1cwf4mPEYFYBft9AXDcMlFesIerEfEYbYoI_xidRCkZokVMEOZc9qwOf8M2vuX9O9a8-a1-9xIBGPujIHOQUqCF-VNMuQLUqlpHWMcPyU5B99CoCtb0kzjLgU","source":"ziprecruiter","full_description":"Our client has an immediate opening for a Staff Hardware Engineer. About the company:Technology is reshaping the way we live, learn and thrive. In this \"always-on\" world, we believe it's essential to have a genuine connection with the work you do. The epicenter of this transformation is powered by the world's most advanced networks - the connectivity we create. Our expert employees are rethinking the purpose, role and use of our networks across the globe; to increase bandwidth, expand capacity, improve efficiency, speed deployment and simplify migration. From sports arenas to state-of-the-art data centers - we provide opportunities where you can innovate and create, while growing and developing your career. Come connect to your future. Do you have a passion for developing cutting edge technology? We are building RF/Optics prototypes end to end...does this sound exciting? Position Description:We have a current opening for an RF Circuit Design Engineer in our Horsham, PA office, as part of the AT Engineering organization within the Broadband Networks Segment you will be responsible for end to end development of all Hybrid Fiber Coax (HFC) infrastructure products, including Optical Headend, Optical Notes, RF active/passive, RF over Glass (RFoG), Optical Network Units (ONU) and Multi Dwelling Units (MDU) products. To be successful in this role you must have experience in RF and Optical circuit design engineering as you will simulate, model, breadboard and prototype digital circuitry used in RF amplifiers and fiber optic transmitters and receivers. Having experience and a breadth of knowledge in circuit design for both 50 ohm and 75 ohm systems in the range of 1MHz to 1.5GHz, you will be responsible for generating schematics, Bill of Materials (BOM) and Design Verification (DVT) test plans and results. This position is instrumental in supporting Research and Development (R&D) projects leading the way towards developing cutting-edge technology meeting company goals and achievements. You will be a part of a team of engineers working daily in the lab with network and spectrum analyzers, measuring frequency response, return loss, noise figure, non-linear distortion, signal to noise ratio, bit error rate, modulation error ratio, optical modulation index, and thermal analysis. Additional Skills and Responsibilities:Strong understanding of broadband RF components commercially available and its usage as well as familiarity with industry and government standards such as Telcordia, ANSI, FCC and UL.Experience with analog and digital fiber optic 1310 and 1550 nm systems including CWDM and DWDM networks.Knowledge of impedance matching, filter design and low noise amplifier designsKnowledge of digital communications IC's and micro's preferred.Provide insights, recommendations and feedback to peers as well as develop new tools to aid in the analysis and solving of problems.Solid understanding with Hybrid-Fiber-Coax networks, electrical design theory, circuit analysis, schematic and PCB modeling tools.Experience using tools: Keysight Genesys, Office, Agile, Oracle, SharePoint, EasyEDA, Eagle, etc.Basic Qualification:4-year Bachelor of Science degree in an appropriate engineering field6 + years' experience in RF/Optics EngineeringDemonstrated experience with end to end product development lifecycle"}