{"title":"Network Engineer, Google Enterprise Network Operations","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKs557FCn-NQKcxGFV6WA_WBUYwZ7VrDCzF5h-wN-pMhqPlagzuKlCc8NBUyIDV0r_qzlchpVZy1B_BSDNFvwZa_5VEbeLXkJraoOY0YUU4k53Op19v3Wo5N2m5uRS9L9-uBq5uDr4W4vYXJZGX_UDrssCxgeUYPLoc__xM43l38gVuVzQLio2gUoZEnGzQ","source":"ziprecruiter","full_description":"Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google's complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services.Googlers' experience has always been core to all we do in Corporate Network. We aspire to provide a predictable experience for Googlers with connectivity, mobility, security, privacy, and performance everywhere. At the same time, we strive to support Partner Technical Infrastructure teams' objectives and policies as well as serve products and Alphabet requests. We also want to make our Corporate Network a platform to enable new services/experiences for Googlers. Software Engineering and Network Engineering work together to write code automating the corporate network, writing networking software, and design the network.Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible."}