{"title":"Diesel Mechanics New Competitive Wages - Military and Veteran Friendly","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL6RkHYIt6fokaXtVExQXnoZoKbGovHFf17jGtNPlMzBfK5pK19R1igCVP53xJekDDIAphq0Y9KX5REgRJlH0Qgp-01tGuJCwr0ufJP4R9Tot2vvMmpsTWX54rJxPr2-9tTi9zkWVW0tp1TCsCafkFiwSfMcxTUA7xPa-KhbGB9LQEsulvUjBiun0fyIqvT","source":"ziprecruiter","full_description":"D iesel Mechanics New Competitive Wages - Military and Veteran Friendly Do you want to be recognized as a high performer? Tired of not getting the respect you deserve? Do you want to work for a company that prefers to promote its own people? Do you want to work for a stable employer? Are you tired of a work environment that doesn’t promote a team effort? Come and experience the difference with R+L Carriers. Earn 1 week of vacation after 90 days of employment Full-Time, 3rd shift, Monday - Friday 9:00 PM - 7:30 AM and 3rd shift Sunday - Thursday 9:00 PM - 7:30 AM R+L Carriers has an immediate opportunity for Diesel Tractor Mechanics . Responsible for day-to-day equipment maintenance on the fleet equipment consisting of preventative maintenance and minor to major repairs to Class A Trucks, trailers, and forklifts. Diesel engine experience is required. Experience in maintaining trailers, overhead doors, lift gates, dollies, welding, and working on forklifts is preferred. Requirements / Qualifications: 2+ Years of Diesel Mechanic experience preferred Experience in preventive maintenance of Cummins & Detroit engines Experience with AC and Electrical Must be able to handle major repairs Experience in both Tractor and Trailer PMs and repairs Have the ability to lift 50lbs Must have own tools Company Culture R+L Carriers is a family owned, privately held transportation company founded in 1965. Our business caters to the transportation and distribution industry and is designed to provide customers with superior service through efficient administration and innovative thinking. The Company prides itself in treating our employees and customers with respect and honesty. We believe each employee contributes directly to the Company’s growth and success. There are many other transportation companies capable of picking up and delivering freight. However, we believed our customers select us because of the efforts of our employees. Excellent Pay with Experience R+L Carriers offers an excellent compensation and comprehensive benefits package that includes Medical/Dental/Vision Insurance, 401(k) Retirement Plan with company matching contributions, Paid Vacation & Holidays, and free vacation lodging at our exclusive employee resorts in Daytona Beach, FL, Big Bear Lake, CA, Pigeon Forge, TN, and Ocean Isle Beach, NC. Employment Type: Full Time Bonus/Commission: No"}