{"title":"Software Development Engineer in Test, Internal NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJpPHpDixJCCZbQ09VHoAxhPBBBnyhwWJALt8w4nfb2dAcIgVAGBnUfbJ1SD1DBDhs7yaQWnBNHGwFGJoCgo-RLb-BRv8VD-zaaDc-zRFXxqhx0XAaQWhuMf45frt8i2VA-aMOCRlhgTzQppOg-fvchYXxh0WpdQI_EIhfC62l_yHUL8oDkEhDSInRQaGzY","source":"ziprecruiter","full_description":"OverviewOur Internal team is looking for a Software Development Engineer in Test to work on improving test automation and coverage for our software as a service platform. In this role you'll be responsible for test automation and framework development. The ideal candidate will have a strong automation testing background in addition to experience in feature development.Our stack includes: Python, Flask, PyTest, ES6, Vue.js, Sass, Webpack, Redis, Docker, GCP, Cloud Functions, Terraform, Ansible, Nginx, Snowflake, Looker, MatillionWhat You'll DoLive by and champion our values: #day-one, #ownership, #empathy, #humility.Be part of a team working closely with other engineers and product managers in rolling out enhancements and new features across ReCharge.Build out automation frameworks and observability features to help integrate automated tests seamlessly into current development processes.Measure and enhance reliability, availability, and throughput of core platform services serving millions of customers.Drive quality across the team by constantly building easy-to-use test frameworks and empowering developers to move towards test driven development (TDD).Work with real world problems faced in scaling the business, suggest innovations, enhancements and work with the team in implementing and rolling them out.Collaborate with product and engineering teams across the company to build new features or update existing ones at scale.Champion good habits (development techniques, security, tech debt balance, TDD, and agile habits) within your team; improve testing standards, tooling, and processes.Debug production and test environment issues across multiple levels of the stack.What You'll BringTypically, 4-6 years of relevant systems testing and feature development experience in fast paced environmentsKnowledge of one or more languages like: Python, Ruby, Go, NodejsIdeally proficient with Python, Flask and collaborative tools like GitSome experience with automation frameworksExperience with build tools like: Jenkins, CircleCI, or GitLabExperience with messaging systems like: RabbitMQ or KafkaSelf driven; a passion for taking ownership of your work and delivering outcomesAbility to work remotely and desire to make an impact at a start-upExcellent communication skills, a team player with a 'winning as a team' attitudeStrong computer science fundamentals - data structures and algorithmsBachelor's degree or equivalent experience desiredWho We AreSince 2014, ReCharge has helped over 15,000 merchants launch and scale their subscription business. Be it a curated monthly box, recurring necessities or access to exclusive perks, ReCharge powers billions of dollars in annual processing for nearly 30 million consumers. Our remote-first team of 250+ is building the future of subscription commerce. Come join us on our mission to connect and empower the world through payments. ReCharge | Instagram | Twitter | FacebookReCharge Payments is an equal opportunity employer. In addition to EEO being the law, it is a policy that is fully consistent with our principles. All qualified applicants will receive consideration for employment without regard to status as a protected veteran or a qualified individual with a disability, or other protected status such as race, religion, color, national origin, sex, sexual orientation, gender identity, genetic information, pregnancy or age. ReCharge Payments prohibits any form of workplace harassment.#LI-Remote"}