{"title":"Sr. Software Android Engineer, Quality","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKr9PHb4ir65phUemr3cWHKQ6hXRiBYOuf_dw0uqtFuz_qWtc0Tw4Rm891jH91qP2qNTguUaAtO3wkEaBgPNQWpXrdEwaD41p9J3BMS3L6lm5hsiHZCKgBsdPaB-Apb50AFXZ-QU8-61a1LhtplDd_Nl5ZwQ9sXqtHnSWmTdc7PRkxtAGgj-PrTigm1AW15","source":"ziprecruiter","full_description":"At eBay, you will be part of a purpose driven community dedicated to creating an ambitious and versatile work environment. In eBay Payments, you will be an integral member of a growing organization that inspires passion, courage and inventiveness - creating the future of global commerce and making an important, positive impact on millions of eBay sellers and shoppers around the world. If you are looking for a special place to take your Payments career to the next level, we want to talk with you.eBay is looking for a Software Quality Engineer who is passionate about creating apps consumers love. This is an amazing opportunity to join the mobile Payments engineering team of a world leader in commerce and directly impact the lives of a global population.Join our tightly-knit team of engineers who enjoy working on large-scale challenging and interesting problems. We work in small, focused, collaborative project teams following an agile methodology.Cross functional teams including product management, product development, and UXD work on a daily basis to create a successful product that delights our customers.ResponsibilitiesLead test automation efforts on Android Payments featuresWork with product managers, page owners and other team members to develop and implement Payments features.Collaborate with colleagues in San Jose (Occasional travel required).Participate in sprint meetings, code reviews, UI design reviews and other feature related meetings.Communicate and work optimally with team members and across functional teams.Maintain existing automation code and test suitesProvide QE scope on proposed features and bug fixes. This includes estimation of effort, risk identification and mitigation, possible alternate solutions.Desired Experience5+ Years of Android testing experience1+ Years of Android test automation experience (Espresso)Experience testing and integrating with web services, TCP/IP and databasesBenefits are an essential part of your total compensation for the work you do every day. Whether you're single, in a growing family, or nearing retirement, eBay offers a variety of comprehensive and competitive benefit programs to meet your needs. Including maternal & paternal leave, paid sabbatical, and plans to help ensure your financial security today and in the years ahead because we know feeling financially secure during your working years and through retirement is important.Here at eBay, we love creating opportunities for others by connecting people from widely diverse backgrounds, perspectives, and geographies. So, being diverse and inclusive isn't just something we strive for, it is who we are, and part of what we do each and every single day. We want to ensure that as an employee, you feel eBay is a place where, no matter who you are, you feel safe, included, and that you have the opportunity to bring your unique self to work. To learn about eBay's Diversity & Inclusion click here: https://www.ebayinc.com/company/diversity-inclusion/eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us attalent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible.For more information see: EEO is the Law Poster and EEO is the Law Poster SupplementThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to ouruse of cookiesView ourprivacy policy and accessibility info"}