{"title":"Technical Support NEW!","location":"","salary":"","description":"","term":"Temporary","detail":"https://www.ziprecruiter.com/k/l/AAIKH3w_GZwqycIxIHgQvaJYpLNHNN2jsun7iSVxRYGe_1VX9VNpDoccR6ARHqOuhAEgwlChCy7_eWQQBcpP80FjuGWnhR0w6bqc_vng6OkpJ7tHm7n3WI_rA-YqacCgCZucejAaDpDW5oQKLtGL-ebefqWlL7YC0p8fuPHMlhYs6TiWfC_i8ugzVSPp5cdi","source":"ziprecruiter","full_description":"Job DescriptionSummary:If you are customer service driven with outstanding Excel skills, we may have the perfect opportunity for you! The QTI Group is assisting our client, located in Madison, in recruiting to fill two full-time (30 to 40 hours per week) Technical Support positions! This is a medical imaging software company that integrates with the electronic health record and existing archive systems to connect enterprise imaging across an organization. This is a remote, temporary opportunity and the schedule is Monday through Friday, 3:00 pm to 11:00 pm. On Saturdays and Sundays, 7:00 am to 3:00 pm or 3:00 pm to 11:00 pm. Candidates must live in the Madison area due to a possible return to in-office work. This position offers a competitive pay rate and is expected to last for 3 months. If this opportunity appeals to you, please apply online today for consideration! Be sure to ask a Recruiter about our March Back to Work promotion!Responsibilities:Respond to emails and calls to adjust settings in company software and manipulate data in ExcelMonitor and maintain Excel spreadsheetsPerform customer service via phoneAssist QA team with testing of the company appOther duties as business needs requireQualifications:HS diploma or equivalent requiredExperience in healthcare or finance working with protected data is a plusStrong computer skills and must be proficient with Excel spreadsheetsMust be tech savvyAbility to learn new skills quicklyExcellent written communication skillsMust be detail oriented#MMAS Qualifications: * HS diploma or equivalent required * Experience in healthcare or finance working with protected data is a plus * Strong computer skills and must be proficient with Excel spreadsheets * Must be tech savvy * Ability to learn new skills quickly * Excellent written communication skills * Must be detail orientedEducation: High SchoolEmployment Type: [\"TEMPORARY\"]"}