{"title":"Deployment Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI2MnaIdIFKT2RAa9qFGQ1RJ1TbQ25okuJTTaBL8mbrSsOmF6LxE5QFp6EnqugiZXXbxeM7KW-X48u0kQP1hrC8xidghSAgfyDoD_3aPZpwCiVdtM-JtJRrd8fBK-zantZe8AQdS3vqpyfIEBPxfc5nbFn0dCTVLLePjm5HzOzsMZvw3M6GKtczMOFDkHs","source":"ziprecruiter","full_description":"At RightHand Robotics, we have a rapidly growing and highly capable team building robotic piece-picking solutions and deploying them around the globe. Our product has to be reliable enough to run non-stop on production fleets of robots in the world’s largest warehouses. If you’re simultaneously excited and a bit terrified about what this could mean for you, good! If working hands-on with robots on a daily basis intrigues you, read on!We are seeking a self-motivated individual to join our Deployment team. Your primary responsibility will be to lead the implementation of our robots in warehouses. The expectation is that you are fast-learning, independent, and can work with our engineering and go-to-market teams to make our customers successful.You Will:Deploy automation solutions including robots, software, and auxiliary hardware in customer warehouses Conduct on-site integration and test activities (or support these activities remotely) . Evaluate post-go-live performance metricsBe the primary point of contact for customers in the fieldExecute field retrofits (or support these remotely); work with our mechanical, electrical, and software engineers on troubleshooting field issuesSupport engineering development and business development projects at RHR HQYou Have:BS in EE/ME/CS or equivalent. Experience in services or deployment engineering positions is a plusFundamental knowledge of basic programming (Linux and/or Python experience is a plus)Strong interpersonal skills to learn about local operations and to identify and build relationships with on-the-ground stakeholders such as warehouse managers and IT operatorsStrong organization and time management skills; ability to cope with fluctuating workloads and high-stress situationsMechanical and electrical repair skills. Are you a “tinkerer?\"Excellent written and oral communication skillsBe comfortable standing for up to 10 hours in one day testing our robotsTravel can fluctuate between 70-100% each month (can sometimes be lower, and includes international visits to customer sites)Bonus Skills:General understanding of network topologies such as VPNs, firewalls, and routersAbility to write tools and scripts to automate repetitive tasksExperience recording logs and documenting software bugsWe offer:Passionate and fun teammatesFlexible vacation and work schedule401(k)Generous premium coverage for medical and dental plansRobots, galore!RightHand Robotics (RHR) is an Equal Opportunity Employer. We have an ongoing commitment to the creation of a workplace free of discrimination and harassment. RHR recruits, hires, trains, and promotes individuals in all job titles without regard to race, color, sex, religion, ancestry, sexual orientation, gender identity, national origin, age, physical or mental disability, pregnancy, veteran status, marital status, genetic information, height, weight, or any other status protected by federal, state or local law. At RHR, we are committed to a fair and equitable workplace where everyone is a respected and a valued member of the team."}