{"title":"Accountant (Virtual Remote PART-TIME Accounting) Seattle, Washington","location":"","salary":"","description":"","term":"Part-Time","detail":"https://www.ziprecruiter.com/k/l/AALYvsC4gNDsfTyEKJp5Ap19sJh_IOHbyYGKKjEPZTuBtpFak5Ft9Ghh1UWAK4CE_Ig_zamrmwnSm2tRhW1HIivH40KBZZ2lLEkVphW8u-kIDomBAsrHNiaBrYuEMpW4YZSKhCFL2wxLZ0r5gBpOvQ0N75u7L_HBzKaa-3AEexsL7LBzrNjBe4Y_uyWe6SI","source":"ziprecruiter","full_description":"Are you an experienced accounting professional who would love a part-time, virtual position that would allow you to achieve the optimal work/life balance that you have always dreamed of? Would you enjoy using your bookkeeping expertise to remotely help small businesses thrive, all from the comfort of your own home office? Tired of commuting through nightmarish weather compounded with 50+ hour work weeks? If you’re interested in working between 20-30 hours a week during traditional daytime business hours for an award-winning organization leveraging cutting edge technology to pioneer the work-from-home revolution, then we may have the perfect opportunity for you! About Supporting Strategies Since 2004, we have been empowering business owners by taking bookkeeping and operational support functions off their plates allowing them to focus on their core business. Supporting Strategies’ experienced professionals use our cutting-edge cloud-based platform, virtual infrastructure and proven process to deliver a full suite of outsourced services, including accounts payable, accounts receivable, bookkeeping, financial reporting, controller level services and payroll administration.   Supporting Strategies has over 100 offices throughout the U.S. and is continuing to grow rapidly! This momentum has created fantastic opportunities for accountants who thrive on providing exceptional client service while seeking optimal work-life balance as well as the strength of a network community of over 400 employees nationwide. Why Work for Supporting Strategies?SOUGHT AFTER FLEXIBILITY!MEANINGFUL WORK/LIFE BALANCE – Our unique, virtual, work-from-home opportunities allow you to harmoniously balance your family obligations, passions, and love of ‘getting into the numbers.’ DISTINGUISHED REPUTATION – Supporting Strategies has received the distinction of being a Top 50 Franchisee Satisfaction Award winner by Franchise Business Review for the past 4 years running. Franchise Business Review has also named Supporting Strategies as one of the Best Franchises for Women consecutively over the past 3 years.LEADING EDGE TECHNOLOGY – Opportunity to advance your technical skills using the latest and most innovative cloud-based platforms.The responsibilities associated with this role are organized into areas that are very important to Supporting Strategies as an organization. We have purposely chosen the word “delight” when defining these responsibilities because it appropriately captures how passionate we are about these initiatives and we naturally hope you will share in our sentiment. Client Delight – Building Great Client RelationshipsProvide exceptional accounting and operational service to our clients.Demonstrate thorough understanding of professional accounting and bookkeeping practices.Keep abreast of the latest developments in technologies to deliver outstanding quality service.Support client onboarding process for all assigned client engagements in accordance with defined process.Execute, as applicable, processes related to accounts payable and accounts receivable management, bookkeeping entries, closing the books monthly as well as preparing financial reporting and analysis. May also include payroll, HR administration and special projects as assigned.Collaborate with your manager and other Associates on your team to ensure all clients are delighted with our services through timely and effective communication, delivery on deadlines and stellar accounting support.Manage day-to-day relationships with clients while performing within established processes and budget parameters.Identify and recommend to your manager areas where Supporting Strategies may be able to provide additional services or tools to drive additional client value and efficiency.Team Delight – Creating a Satisfying & Collaborative Virtual EnvironmentComplete virtual training with guidance from your manager in accordance with established Supporting Strategies procedures.Communicate with your manager regarding your established schedule, desired hours and any potential capacity issues.Participate in recurring team and one-on-one check-in meetings to ensure you are aligned for success.Embrace coaching and feedback provided by your manager and implement changes as needed to help meet team and client goals.Does everything you have read so far sound appealing? We hope so! If you meet the qualifications below, we would absolutely love for you to apply!A minimum of a Bachelor’s degree in Accounting, Finance or related field.5+ years of demonstrated ability to provide detailed level bookkeeping support – accounts payable, accounts receivable, closing books on a monthly basis and preparing financial reporting and analysis for small businesses.1+ years of transactional accounting experience using QuickBooks for/in a professional organization.Capacity and commitment to work 20-30 hours a week during traditional daytime business hours supporting clients.Ability to communicate clearly and professionally, both orally and in writing.Willingness to consistently and accurately follow established policies and procedures.A passion for and sense of personal satisfaction in delighting clients and helping small businesses succeed.Confidence in learning and embracing new technology to solve client issues.Experience in developing strong remote team relationships based on trust, accountability, integrity, and sharing of best practices.Commitment to maintain the highest level of confidentiality while working with client data.A dedicated office space that has a reliable, high-speed internet connection.  Is this opportunity not for you?  Would you be more interested in owning your own Supporting Strategies franchise?  In that case, please visit our webpage, scroll to the bottom and select the \"Franchise Opportunities\" link to learn more!"}