{"title":"Lead iOS Software Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJLOHc7KSKZHE3vh2ny8nhuyopDsuT3BqC3aw0d3DjMN-0fw6LIoLX2bPVjlA6Uq75MejETOC8TpOfp9-iSknjO0Lc3-9gfNkTJTeqHhIaX31eK8i5R5-fIbhUE_nZcsSGUlzyjWmDVfOOIg90_8R4ejgByDieDWu390M7uc78I349IIzAmuUkdCyZkMFPo","source":"ziprecruiter","full_description":"Description Hillrom seeks a Lead iOS Engineer to join our Care Communications business in Cary, NC. Hillrom Care Communications produces medical solutions to empower clinical communication and collaboration and promote patient safety and satisfaction in the acute care hospital environment. The Lead iOS Engineer is responsible for the development and maintenance of one of our mobile applications.  They provide guidance to other engineers, conduct design reviews, and assist with complex problem resolution. They provide strong technical leadership across all layers of the application to ensure the product is successful as a whole. A commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential. Key Responsibilities + Leads requirement decomposition, detailed technical design, and development activities for an iOS mobile application + Ensures the performance, quality, and responsiveness of the application + Works with the quality engineering team to help determine effective test and regression strategies for the application based on change impact assessment + Assists with the troubleshooting of difficult customer issues that cannot be resolved by the technical support team + Helps to ensure that development activities are in line with a medical process - inclusive of required technical documentation such as software design documents and technical interface specifications + The lead role is responsible for individual development activities while also directly contributing to the overall application architecture and providing technical guidance to others on the team Qualifications Skills and Experience Required + 8 years experience in software development with at least 5 years of direct iOS application development experience + BS Degree in a technical discipline (Computer Science, Computer Engineering, etc.) + Proficient with Swift; Familiarity with Cocoa Touch + Experience with threading, performance, and memory tuning + Experience with RESTful APIs to connect iOS applications to back-end services + Knowledge of other web technologies and UI/UX standards + Understanding of Apple's design principles and interface guidelines + Familiarity with cloud message APIs and push notifications + Knack for benchmarking and optimization + Proficient understanding of Git + Comfortable being involved in customer or 3rd party partner calls as a technical subject matter expert for the application Preferred + Experience in the medical device industry or any other regulated product line + Experience working on an application that was part of a larger product portfolio including hardware, embedded systems, network communications, web services, and 3rd party integrations + Knowledge of low-level C-based libraries + Familiarity with Kubernetes and containerized applications Job: Research & Development Primary Location: United States-North Carolina-Cary Schedule Full-time Travel Yes, 10 % of the Time Posting Entity Hillrom Req ID: 20124628"}