{"title":"Machine Repair Mechanic","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI-uwVcEP_Qfw9bUZtb-FNeOOeDV7aEi1iCJiwV0rGJvIsL1hlJu-FVocatU_fnDOB8v_OtL-IrplM4umMRajne93ZAUDpt9ThDgGzUktl2OTfvU2c_2wqc55YAXfFmaRmeUhGkxE9gmkzfcnh2eRI3UA3UdjobsHC4j0hL572Ci2s0GWaNV0Ti03bAPBXw","source":"ziprecruiter","full_description":"Machine Repair MechanicCompany:Job ID:00000237876Date Posted:2021-03-03-08:00Location:USA - Auburn, WA, USA - Kent, WA, USA - Puyallup, WA, USA - Renton, WA, USA - Seattle, WA, USA - Tukwila, WAJob Description Summary:Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Relocation:Relocation is available for eligible candidates, if authorizedExport Control Requirement:Safety Sensitive:This is not a safety sensitive positionContingent Upon Award ProgramThis position is not contingent upon program awardJob Description Qualifications:Boeing has an exciting opportunity for Machine Repair Mechanics in the Puget Sound region in Washington State!Machine Repair Mechanics repair critical equipment, perform preventive and predictive maintenance and complete projects such as mechanical hardware upgrades. Along with this, they communicate accurately, concisely, and professionally with customers on important repair steps taken, parts ordered and time estimated until completion. Plus, they repair/replace defective equipment, overhaul/rebuild and assemble a wide variety of plant equipment to include Numerically Controlled (NC) machines, robotics & end effectors, modular assembly equipment, precision-built machines, material handling equipment, stationary generator sets and process equipment.Position Responsibilities: Troubleshoot and diagnose malfunctions on all types of factory machinery including, Numerically Controlled (NC) and Computer Numerically Controlled (CNC) machine tools and controllers, gearboxes, stationary generator sets and machine accessories using various types of test equipment.Develop maintenance procedures when documentation is not available and devise and make tools to facilitate work.Obtain job assignments from data systems, from management or from engineers.Ability to review and interpret work orders, tie-ins, technical manuals, machine operations and are able to communicate with production employees to determine appropriate crafts skills and repairs needed to return machines back to production readiness.Obtain and analyze drawings, sketches, hydraulic schematics and specifications needed to perform assigned work in order to perform preventive and predictive maintenance inspections.This position will require the following on a daily basis:Frequent (3-6 hours) exposure to noise.Frequent (3-6 hours): Sit, Walk, Stand, Climb/Balance, Rotation of Head/neck, Flexion (head bent down, head bent back), Twisting at the waist, Handling/Grasping, Keyboarding/Mouse, Repetitive motion, Fine finger manipulation.Occasional (1-3 hours) Fine motor skills, lifting less than 10 pounds and sitting.Occasional (1-3 hours) use of face, eye and head protection.The position must meet Export Control compliance requirements, therefore a \"US Person\" as defined by 22 C.F.R. 120.15 is required. \"US Person\" includes US Citizen, lawful permanent resident, refugee, or asylee.Basic Qualifications (Required Skills/Experience): Experience repairing and troubleshooting manufacturing equipment.Ability to work any shift.Ability to work at heights up to 125 feet above ground level and pass Fall Protection Training.Ability to work overtime.Ability to work around electromagnetic fields as a result of various types of production equipment.Relocation:This position offers relocation based on candidate eligibility.UnionThis is an hourly position governed by the International Association of Machinist (IAM-751) Collective Bargaining agreement.Drug Free WorkplaceBoeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies.Resumes of current Puget Sound Boeing employees submitted via Careers at Boeing will be considered as this job is not installed in QTTP.Successful applicant will be required to pass an on-line assessment.Experience Level:HourlyJob Type:RegularJob Code:89509-029Equal Employment Opportunity:Stay safe from recruitment fraud! The only way to apply for a position at Boeing is via our Careers website.Learn how to protect yourself from recruitment fraud - Recruitment Fraud WarningBoeing is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military/veteran status or other characteristics protected by law.Request an Accommodation - Requesting Interview Accommodations Applicant Privacy - Applicant Privacy EEO is the law Poster - EEO is the lawBoeing Policy on EEO - Boeing EEO Policy Affirmative Action and Harassment - Boeing Affirmative Action and Harassment Boeing Participates in E - VerifyEnglish -  E-Verify (English) Spanish - E-Verify (Spanish) Right to Work Statement English - Right to Work (English) Spanish - Right to Work (Spanish)"}