{"title":"          Bilingual Mandarin Accountant NEW!        ","location":"","salary":"","term":"$27 to $38 HourlyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAK9G4slPkjKYRrdEBOoSJV7PVU73CJpHTDNsOgYNlgef41wFnUqlWHSZHdJZ4vuRB8LZpGpkyVfTPuINCsDHKUPgtmg-aU61GXAgX54ACfwATTBjRzCXiLpX0DzBWZmh77B2vXPDpKi-YdXNebIddC6LxuLN2xlAWz2_O7XoWnrHzi1ldQs6B06gcYruMM","source":"ziprecruiter","full_description":"\n        ur client in City of Industry is looking for a bilingual mandarin Accountant to join their growing team. The ideal candidate would have a solid background with reconciliation, maintaining the general ledger, and journal entries adjustments. Job Duties:Coordinating with various departments to gather support and prepare monthly/quarterly entriesCommunicating with outside vendors to obtain corroborating informationCompiling and analyzing financial information to prepare financial statements including monthly and annual accounts in accordance with GAAPAP/AR dutiesEnsuring financial records are maintained in compliance with company policies and proceduresChecking that all financial reporting is completed on timePreparing monthly reconciliations of assigned accountsMaking sure that monthly, quarterly, and year end close activities in assigned work areas are accurateIdentifying and resolving accounting discrepancies and irregularitiesParticipating in the financial statement audit and preparation of required audit support schedulesQualifications:B.S/B.A. in Accounting, Business, Finance or Economics2+ years of experience in an accounting environmentStrong Excel skills (Pivot tables and VLOOKUP)Proven success performing or auditing the responsibilities of a month-end close processHighly detail oriented, and strong organizational skillsAbility to work cooperatively and collaboratively with all levels of employees, management, and external customers to maximize performance, creativity, and problem solvingExcellent written and verbal communicationCapability to work independently with minimal daily direction Proven success in meeting assigned deadlinesA willingness to be mentored and learn all aspects of the business will be essential for success in the role.\n      "}