{"title":"Software Developer Lead","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJDaJO5nOfPQkED4y_ijPEsG2YYceC5bXTlLshpfKu6vXda_j9IMWFozV8sx8ZjHP1_IIc1R1Jpm42eeXBtxQsk_IhEnzQuLMyiYo3CFvyDP9dJ2UaUkcq-RLLjfVIaui8dM3BAeI8X0JbRpgHpalAXUACdo1ltmIlQHPh-FNRW1Shp654JAxa9SgwyCheT","source":"ziprecruiter","full_description":"SOFTWARE DEVELOPER LEADThe PNC Financial Services Group, Inc. seeks a Software Developer Lead in Cincinnati, OH. Position allows for the ability to work from home one day per week, with appropriate telecommuting systems. Participate in all aspects of PNC's Corporate & Institutional Banking activities. Specific duties include: (i) participate in all phases of software development lifecycle including business requirements collection, analysis, sizing, design, development, testing, deployment and production support; (ii) asp .net development and working closely with the onsite and off-shore teams on daily basis to develop solutions for financial banking; (iii) provide technical leadership for senior developers and assist in mentoring junior developers; (iv) work with onsite/offshore team in writing detailed Functional and Technical Design documents; (v) perform unit, integration, and system testing using Microsoft tools; (vi) work under tight deadlines to deliver high quality software for Web and API components to support commercial banking; (vii) work with various testing teams in close collaboration to learn and validate the business user scenarios for functional, systems integrated and user acceptance testing; (viii) work with the performance testing team to ensure all aspects, user interfaces, integrations and user scenarios of the developed applications can be performance and load tested before actual implementation; (ix) prepare development related artifacts to support the application development for future use; (x) collaborate with process architects to document and create test plans; and (xi) work on Devops process to achieve the Continuous Integration/ Continuous Development model.Bachelor’s degree in Electronics Engineering, Computer Engineering or Computer Science plus 3 years of experience in software development for the financial services industry using Microsoft technical stack for architecting solutions is required. Experience required with the following: (i) development of Microsoft solutions across all major components (including process, services, UIs, and integrations), hands-on debugging of asp .net c# components, and issue resolution and performance optimization; (ii) JavaScript UI frameworks, including Angular JS, React Js, and Node JS; (iii) API development; (iv) development of applications using Asp .net, MVC; (v) WCF, REST, Web services and Web API; (vi) database development including SQL, IBM DB2, and Oracle; (vii) building packages and reports using SSIS and SSRS; (viii) setting up CI/CD model using Devops tools including Microsoft Azure, GitHub and Jenkins; (ix) writing detailed Functional and Technical Design documents, integration, and systems testing using Microsoft tools; (x) SQL Database query design and optimization; (xi) use of Jquery and JavaScript development; (xii) Agile development methodology; and (xiii) Microsoft Web Server, Nuget, .Net Core, Resharper, SONAR, ELMAH, Owin, OAuth authentication, Powershell, microservices and Web Pack. 40 hours/week, 8:00 a.m.–5:00 p.m. Interested individuals apply online at link on this site using keyword R048763. PNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law."}