{"title":"Accounting Manager NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKNrbuUHvdGUDt8ySf8GNVcgWokQo_KPn7wreatCBqxm65Hw0jOSDO0w0G4euyB1Io7e5iaalUWzkSr2g1hb1A-UscB4-UtT1ERvjpSXNcmvI9M10fnUKqz1HMFXNG_XeEBv1kc6I3dv3xnkpkhDUrFxjqFt59aSVmPkbsEvfLZwb5wbSjEBZgPiOJVXX8","source":"ziprecruiter","full_description":"Job Code: #484059Title: Accounting ManagerJob Type: ContractJob Location: Philadelphia PA Job Description:One of our clients is looking for an experience Accounting Manager to come onto their team.Here is what they are looking for:Leadership experience - this person will have a staff of 5 underneath them (Senior Accountant, General Accountant, A/P Specialist, Payroll Administrator, Office Manager)Experience in a complex organization - they are only a $45M nonprofit, but they have over 100 cost centers, including health centers that deal with medicare/medicaid billing. They will need someone used to dealing with a high level of complexity. Nonprofit experience is not necessarily required.Payroll experience - they will be overseeing the Payroll Administrator, who has been experiencing some issues since they switched over to Ceridian. Someone who has a familiarity with payroll is necessary. They don't have to have been a processor themselves, but should have at least reviewed/overseen. Strong Excel skillsSelling Points:Potential growth to Controller - Marianne will be retiring within 3-4 years5% dollar-for-dollar 401(k) match1-month sabbatical awarded every seven years of employmentEssential Duties and Responsibilities Financial ReportingOversee the monthly closing process by distributing the monthly closing calendar and monitoring progress daily to ensure deadlines are met and all tasks are completed.  Review and approve monthly journal entries, bank reconciliations and account analysis schedules. Review and approve use of donor restricted monies. Oversee the invoicing of contracts in accordance with contract terms to ensure timely billing and collection of receivables. Review and approve monthly investment activity reconciliations.  Perform monthly expense review in accordance with the closing calendar. Prepare monthly financial statements and all supporting schedules for review by the Controller.Other Reporting: Coordinate the preparation of monthly Indicator Reports and ensure accuracy of information presented Complete and file financial reports for New Market Tax Credit investors Complete monthly cash management report in accordance with the closing calendar Complete annual census forms as required Credit Cards Review credit card expense reports and follow-up on open items Petty Cash Review petty cash reconciliations and sign–off Coordinate calendar for petty cash audits and ensure that they are completed Payroll Review payroll register each pay period and verify changes to payroll change forms submitted Review expense and credit card reimbursements report to ensure that only approved reimbursements were processed Audit Coordinate preparation of client schedules requested by auditors Provide auditors with all requested documents for testing during field work TaxesReview and approve entry for sales tax remittance. Oversee the timely and accurate completion of 1098 C/1099 forms  AdministrationEnsure Accounting Department staff are operating effectively and efficiently Supervise a staff of  6 employees.Prepare staff evaluations, monitor progress on goals and submit annual salary adjustments for above staff Complete credit applications as requested Write policies and procedures for various accounting functions Conduct training on accounting policies  Minimum QualificationsBachelor’s Degree in AccountingSeven plus years of progressive experience in financial reporting, including supervisory experience.  Strong financial reporting skillsSupervisory experienceThe ability to coordinate workload of staff to meet deadlines. Preferred Qualifications Non-profit experienceCPA/MBA#zr3"}