{"title":"Proposal Support/Technical Writer -2021-25","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJQu7Q5AcYCnaMAxuyuycQ3ICqNb_CsOh1oEgwJKr5qf6Zb7PF2r6ITZF9GJ0Uc4R1VnFQuSlHAya19ILPfbyMMofzptxkJ-7WkfC7RwcBZ6Stn1tIu4NFMyzQbb1bPoJKSuX9q2EzlMzEZtYEdqMaq2x5Fu-CwiR_hj9qks9igPBaWh4iZLupncP4x9RzD","source":"ziprecruiter","full_description":"Infinity is a small business with extensive experience supporting aerospace and defense systems. Founded in 1996, with corporate headquarters in Colorado Springs, CO, Infinity provides Advisory, Engineering, Intelligence, Information Technology (IT), Operations & Maintenance (O&M), Testing, and Training services for the Government sector. We are an Inc. 5000 company (10 consecutive years) with solid growth for the past 24 years. As evidence of our superior performance and program success, Infinity has expanded to support multiple locations throughout the United States and around the world.Infinity Systems Engineering is seeking a Proposal Support/Technical Writer to join our team in Colorado Springs, Colorado. The candidate will manage responses to RFPs, RFQs, RFIs, oral presentations, and marketing efforts. Proposal support will include technical volumes and sections, technical and management approaches, personnel and staffing approaches, past performance and corporate experiencePrimary Responsibilities:• Maintains a status record and master file for all text and graphics; provides guidance and status reports on proposal and production matters to senior management staff; enforces editorial guidelines specified for the proposal; manages the virtual proposal development environment.• Serves as Volume lead; proposal writer; color team or peer reviewer; or other proposal roles as required. May write and/or edit proposal content (acting as writer and editor). Reviews, or facilitates review, of final proposal and all deliverable documents.• Conduct milestone readiness reviews to assess proposal readiness for color team reviews; adjusts proposal development schedule accordingly to accommodate corrective actions• Sets color team review goals and objectives; trains color team reviewers to participate in reviews; deconflicts color team reviewer feedback; determines disposition of color team reviewer comments; develops the color team recovery plan; and executes the color team recovery plan on-time to meet established recovery plan and proposal timelines• Coordinates all production aspects (word processing, graphics, editing, proofreading, reproduction, printing, collation, and binding) services in support of proposal activities.Required Skills:• Demonstrated ability to multi-task, effectively manage time, and keep pace in a dynamic environment, while staying organized and providing follow-up on critical items for multiple, often simultaneous proposals• Must be a proficient writer with experience creating and managing proposal related documents; i.e. proposal directives, executive summary, compliance matrix, proposal outline, proposal related customer questions, storyboards, color review documents, finalized proposal documents, oral presentations, and lessons learned• Will use independent judgment and creativity, as it applies to the resolution of contract issues• Organizational skills and ability to prioritize multiple tasks in order to develop and meet schedule requirements• Excellent internal and external communications skills• Creative thinker and problem solver with the ability to focus on details• Proficiency in the complete suite of Microsoft® Office products• Ability to write and edit proposal content as appropriate to meet proposal development requirements• Must show initiative and flexibility to work in a changing environment with high stress and tight deadlinesRequirements:Bachelor’s Degree in a Business or Technical discipline7 years directly relevant experience supporting Government proposal development.  Preferred:Experience with proposal efforts in support of the Department of Defense's Space enterprise is highly desired.Secret clearance, or higher, is preferred.U.S. Citizenship is required. An Equal Opportunity Employer. Please visit the Equal Employment Opportunity link below for further information. https://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf"}