{"title":"Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIMrgoIV046CbRhRKuFzY9Quc7KOz2Adsk-VDGU1P542EOodPALa-Arm2A1JWaA_f8O59yFtePRT6ypRKeH7pw3YJ9ZqH8cWkSTcRBqZ3OTkiPFx8dQmT1L_b9znwfLU64o2jTY-xSH2acdaFCc9y0V58hjMNUuPDUZ2DWz6IK7a52dmaH1_K9IhWC6ZWkx","source":"ziprecruiter","full_description":"AlsoEnergy is a leading provider of renewable energy monitoring systems. The Software Engineer works within the project engineering team to buildout AlsoEnergy’s onsite platforms for onsite data aggregation, HMI, historian, and reporting with a primary emphasis on development within and around Inductive Automation’s Ignition platform. The role is responsible for providing high-quality design and implementation support with a primary focus on databases and reporting and a secondary emphasis on developing integration, configuration, and onboarding tools.Responsibilities:Supports the continued development of AlsoEnergy’s Ignition and PowerManager framework for Utility Solar HMI, MES, & SCADA applications.Primary responsibility will be building MYSQL/SQL database and management tools for large datasets including redundancy and data aggregation/long-term storage techniques.Develops, integrates, and updates custom Python libraries for data management and reporting for standard and custom customer applications.Supports building dynamic, easily configurable HMI screens for integration by Project Engineering team.Building alarm roll-up module in-line with PowerTrack alarming methodology.Builds custom modules as necessary to accomplish product specifications and to support project engineering on integration and commissioning (easy-config tools and practices)Works with internal teams in the following:Product Management to identify critical paths and develop product roadmaps.Software Development teams to align on development efforts and standard practices.Project Engineering to support project integration, testing and maintenance.Support to provide timely technical advice on matters relating to SCADA and Ignition.Ensures products comply with internal cybersecurity procedures and policies dictated by CSOs.Owns, maintains, and documents testing hardware, software, and practices.· Provide detailed documentation to clients on system design and programming.SCADA project work and other duties as assigned up to and including integration of DAS, HMI, and historian applications within Ignition and AlsoEnergy’s PowerTrack and PowerManager platforms.Technical Knowledge:Must be able to ground up design, architect, and implement SCADA systems, including SQL database pipelines, primarily within Ignition 8.0.Must have advanced knowledge of MYSQL databases including redundant architectures and handling large data sets.Knowledge of the following protocols a plus: Modbus, DNP3, OPC COM/UA, IEC-60870/61850, (s)FTP(s).Competency in the following programming languages: Python and SQL, HTML, Java, C#Basic knowledge of cybersecurity best-practices and requirements (NERC-CIP)Understanding Power Plant Controllers and electrical grid stability conditions and variables.PLC experience including SEL RTAC, Wago, and Allen Bradley/Rockwell.Qualifications:Bachelor's degree in Computer Science, Engineering, Statistics, Applied Math, Operations Research, or a related quantitative field.5 years’ experience in MYSQL or equivalent databases with large databases.2 years’ experience in Ignition 8.0.Gold certification in Ignition a plus.Ability to communicate technical information clearly and concisely to non-SMEs.Must be a team player, a good listener and can understand and solve customer problems.Ability to work with minimal supervision.Work Environment:Office Setting, primarily in cubiclesTravel by car, air, train periodicallyModerate to high noise levels (i.e. business office with computers, phone, printers, moderate traffic)Ability to sit or stand (standing desk provide upon request) at a computer terminal for an extended periodPhysical Demands:While performing the duties of this job, the employee is regularly required to communicate (talk/sign/type/write) and operate a computer, telephone (or alternative), keyboard (or typing device), etc.Regular, predictable attendance is required.Specific vision abilities required by this job include close vision requirements due to computer work.Other Details:AlsoEnergy offers a competitive salary and a full list of benefits. The benefit offerings include full health benefits on the first on the month following employment (5 medical plan options-HDHP and PPO, 2 dental plans, FSA/HSA-with employer contribution, employer paid vision/LTD/STD/Life, variety of voluntary coverage), 401k (pre- or post-tax) with match after 90 days of employment, 9 paid calendar holidays per year, 2 floating holidays per year, and 3 weeks of PTO per year that begins accruing day one. Our bonus structure is designed to encourage collaboration across the company by creating common goals. We set revenue targets per quarter and as the team achieves those targets, employees receive a percent of their salary paid out the month after quarter close. The revenue targets are ratcheted so for partial achievement, there is partial payment.You will work in a growing, profitable company with a fun and creative environment with a talented group of individuals that have a passion for building renewable energy systems.This is a salaried exempt position, M-F, with additional weekend work as required.Travel: 0%This position is based in Boulder, CO. Principals Only.We're an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status."}