{"title":"Sales/Territory Manager- New Business NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJv9JTWOtHFIhJOgTDbYqQj9m1kHtxNcGAj7ceXDhKfzcnNauVZpPSVmwa-Umk72U2rRYINgzkZCnxIO4F34H9p55an3XzAjhtjZJ8PuOs-JBXvJiUp4WEXng1uFiBb3pSo-H3yWdf8GLVVtXW23IVHSslrwSXSY6ugDVqIc5WGUAuotxsKwn3gtnntK7V_","source":"ziprecruiter","full_description":"Heartland Payment SystemsTerritory-Relationship ManagerAre You A Territory/Relationship Manager?Are you a seasoned sales professional?Are you Entrepreneurial in spirited?Are you self motivated?Are you a problem solver?Are you results driven professional?Do you have a \"Get it done\" Attitude?If yes, continue reading below....Integrity. Honesty. Advocacy. Tenacity. These are the core values of Heartland. If you possess these attributes and are determined to be a high-income earner, personal and financial fulfillment can be earned selling the truth for a company known for its integrity and merchant advocacy. Heartland employs nearly 3,000 dedicated employees throughout the country and provides payments technology services to more than 350,000 merchants nationwide. Exceptional people find an exceptional home here at Heartland. We believe in empowering the sales professional and are the founders of the Sales Professional Bill of Rights (www.spbor.com). Learn more at www.HeartlandPaymentSystems.com/sales-portal.Job DescriptionWe are seeking honest, competitive and ethical Outside Sales Professionals to close sales of our business solutions with businesses throughout the area. As a Territory-Relationship Manager with Heartland, you will work closely with your local Territory / Division Manager to set appointments with business owners using phone prospecting, face-to-face prospecting, networking, and referral partner relationships. You will then run scheduled appointments, uncover needs and present Heartland solutions to close sales in our target vertical markets (restaurants, retail, medical, lodging, auto repair, salons, etc.). During the training / ramp up period, your local manager will accompany you on your initial appointments to demonstrate our short-cycle sales process using atlas, our groundbreaking iPad CRM platform for lead generation, sales presentations, on the spot client financial analyses and paperless contract processing. You will then have the freedom to set your own work schedule and work primarily from a home office as you enjoy the best compensation and benefits plan in the payments processing industry.Responsibilities of the Relationship/Territory Manager include:Prospecting for and running dynamic sales presentations that highlight the benefits of working with HeartlandExplaining our value proposition to clients via atlas CRM on your iPadClosing sales of our payment processing services (Card Processing, Payroll / HR Outsourcing, Loyalty Marketing)Educating merchants and business owners on the payment processing industryUpselling current clients on our gift marketing, payroll and other products and servicesBuilding and leading a team of sales professionalsMaintaining regular communication with your Territory / Division ManagerCompensation - Profit-Share/Monthly Residuals/Earned Equity/Weekly Pay/BenefitsThis is a W2, full benefits position working primarily from a home office with a majority of time spent in the field. First year relationship managers can expect average earnings of $65,000 - $95,000+ in the form of profit share and earned equity. Typically Income incrases on an annual basis from 10% -25% YOY, Top performers are in the $200,000+ range. Compensation includes up front true profit share on every account, paid each Friday, monthly profit share on entire portfolio in the form of, residual income that pays starting the first month, and portfolio equity once vested. Once our Relationship/Territory Managers hit a designated sales production requirement they are what we call \"vested\" and now \"own\" the monthly residual. This means the sales manager is paid the monthly residuals as long as their clients are processing with Heartland, whether or not the sales manager is still employed with Heartland. In addition, they have the option to cash out some or all of their monthly residual for 30 times its value as a portfolio buyout (i.e. $2,000 in monthly residuals can be sold back to the company for a $60,000 equity buyout).Selling Power magazine named us the #1 service company to sell for over three consecutive years thanks to our compensation, comprehensive 90-day ramp-up period, ongoing training with the Sales Technology Team, and guidance from a designated Sales Mentor and support from our local management team. We offer career advancement opportunities that lead to long-term success and growth within our company and tend to promote hard workers quickly. Best of all, you have the freedom to decide when and where you work!Additional benefits include:Semi Annual Incentive Trips for top performersStock optionsMedical, dental and vision insurance401(k) retirement plan with company match/instant vestingVoluntary life and AD&D insuranceEmployee Referral ProgramHealthcare savings accountFlexible spending, limited purpose spending and dependent care accountsTuition reimbursementVoluntary accident, hospital and serious illness insurance24/7 technical and customer supportExclusive endorsements for card, payroll, and loyalty processing from over 250 local and national associations such as the NRA (National Restaurant Association), New Jersey Restaurant Association, Independent Pharmacy Alliance and American Hotel and Lodging Association.Job RequirementsQualified candidates must possess excellent prospecting, communication, presentation and networking skills and be able to work well independently and as part of a team. Our ideal Outside Sales Representative is an incentive-driven sales “hunter” with a professional demeanor, impeccable integrity, a high sense of urgency and innate sales talent and aptitude. You must also enjoy cold calling and speaking with people face to face and be eager to develop your consultative sales skills.Desired Skills & ExperienceIntegrity, Honesty, Advocacy, Tenacity, Passion - 5 Traits that all Successful Heartland Sales Pros possess.The following experience / history is suggestedHunter type sales mentality / Excellent ProspectorExperience dealing directly with small to mid-sized, local business owners and decision makersExperience closing in a fast sales cycle: 5 - 10 sales per monthExperience in solution-based salesExperience in a performance based compensation modelAdditional requirements for the Outside Sales Representative include:Previous Top Performer status in an outside sales positionProven track record of pipeline development and closing salesAbility to pass a background checkValid driver’s license and auto insuranceComputer literacyPerformance based sales background including B2B services, short-cycle sales, outside sales, cold-calling, selling solutions and/or selling to restaurants, retail stores and hospitality businesses preferredMembership in a business or merchant association or a networking group a plusBilingual skills a plusCompany DescriptionHeartland Payment Systems, Inc. (NYSE: HPY), the sixth largest payments processor in the United States, delivers credit/debit/prepaid card processing, gift marketing and loyalty programs, payroll and related business solutions to more than 250,000 business locations nationwide.A FORTUNE 1000 company, Heartland is the founding supporter of The Merchant Bill of Rights, a public advocacy initiative that educates merchants about fair credit and debit card processing practices. The company is also a leader in the development of end-to-end encryption technology designed to protect cardholder data, rendering it useless to cybercriminals. For more information, please visit HeartlandPaymentSystems.com, MerchantBillOfRights.org."}