{"title":"Software Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALpGvV9iJNgVu7VBaGv8nCljX-YsWy9Ftttu7UFGVBZBgSBSzP-L8iqeMt5mRwI5lHkEnPZlT2AMOkCuRAlspuujSsTqr7dUVh-DyQr5XPXmg8gbI4Adk2p_j1IRaGsQrGhIRoMZ_FG6O7-3txBGAnnDvtHVGkLFKHI9RKXWVyGFSotVCvR45B49FVDIZpF","source":"ziprecruiter","full_description":"Software Engineer Valparaiso, IN 169411BR Job Description THE COMPANYContiTech, a division of Continental, is one of the world's leading suppliers of technical elastomer products and is a specialist in plastics technology. ContiTech develops and produces functional parts, components, and systems for machine and plant engineering, mining, the automotive industry, and other important industries. Our Valparaiso, IN location is seeking a Software Engineer to join our team. The ideal candidate would be willing to learn, is dependable and would work well on a team. Are you ready to shape the future with us?THE POSITIONIn this role, you will collaborate with the software engineering team to build software that works in tandem with Continental electrical systems, for CrimpIQ and CrimpCloud projects, working in a variety of programming languages: Ruby, Java, Python, etc. in order to develop new features and improve existing software systems.RESPONSIBILITIES Develop, test, deploy, and continually improve new and existing software solutions for CrimpIQ, CrimpCloud, and MyCrimp products. Manage project priorities and deliverables, ensuring on time delivery Interact with customers and occasionally provide technical support on software products Provide technical assistance to production associates and engineering staff Promote and maintain a safe and healthy working environment by complying with corporate and governmental regulations as well as lean principles Become a technical expert/leader in hydraulic and industrial equipment software systems designWHY YOU SHOULD APPLY Immediate Benefits Paid Time Off Tuition & Employee Discounts Annual Bonus Employer 401(k) Match And more benefits that come with working for a global industry leader! Job Requirements BASIC QUALIFICATIONS Bachelor's degree in Software, Electrical or Computer Engineering or Computer Science or related field Programming experience with a modern programming language Experience with modern software product management tools such as git, GitHub, Jira, etc Familiarity with mobile software development (Android or iOS) Legal authorization to work in the U.S. is required. We will not sponsor individuals for employment visas, now or in the future, for this job opening. Continental is not able to pay relocation expenses for this opportunity.PREFERRED QUALIFICATIONS Experience with modern software development practices and modern programming languages such as Java, Ruby, Python, or C+ Experience developing and shipping a mobile application into the Google Play or iOS App Store Familiarity with embedded systems Job Type Professional Division Footer Text Ready to drive with Continental? Take the first step and fill in the online application. About Continental The Business Area ContiTech develops, produces and markets products, systems and intelligent components made from rubber, plastic, metal and textiles. These products are used in mining, the agricultural industry, railway engineering mechanical and plant engineering, the automotive industry and other important sectors of the future. Job Category Engineering Country United States Division ContiTech EEO Statement EEO / AA / Disabled / Protected Veteran Employer. Continental offers equal employment opportunities to all qualified individuals, without regard to unlawful consideration to race, color, sex, sexual orientation, gender identity, age, religion, national origin, disability, veteran status, or any other status protected by applicable law. In addition, as a federal contractor, Continental complies with government regulations, including affirmative action responsibilities, where they apply. To be considered, you must apply for a specific position for which Continental has a current posted job opening. Qualifying applications will be considered only for the specific opening(s) to which you apply. If you would like to be considered for additional or future job openings, we encourage you to reapply for other opportunities as they become available. Further, Continental provides reasonable accommodations to qualified individuals with a disability. If you need assistance in the application process, please reply to Careers@conti-na.com or contact US Recruiting at 248.393.5566. This telephone line and email address are reserved solely for job seekers with disabilities requesting accessibility assistance or an accommodation in the job application process. Please do not call about the status of your job application, if you do not require accessibility assistance or an accommodation. Messages left for other purposes, such as following up on an application or non-disability related technical issues, will not receive a call back."}