{"title":"Senior Diesel Truck Mechanic - SIGN ON BONUS + MONTHLY BONUS POTENTIAL NEW!","location":"","salary":"","description":"","term":"$25 to $32 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKziIWkrReimrRdBJAbl1DwAZnZP6J_RtQGMsHtk56C8SuwW_wpGoaryo3oo7QD6R8zzlHUViEvw5jGjpVsl8rdCXHvL11ZVVJEp6fEUWXgELeg4DAOefUqSl-8IpobnwnyApOorAQNduKkZd4wXhOcSq0--yFRT1cT7-migIPhpoibRIwBMVBrDBKBlWYC","source":"ziprecruiter","full_description":"Experienced Diesel/Fleet Mechanic Needed ASAPSIGN-ON/RETENTION BONUS!AFS is hiring for a top notch mechanic to grow with our new business! We are a mobile and in-shop fleet maintenance and repair company establishing roots in central Texas. If you are ready for a lead role where your voice counts, we are looking for you!Applicant must possess the highest level of honesty and integrity, diagnose and repair all makes and models class 1 to 8 trucks to include Freightliner Kenworth, International, Volvo, Hino, Ford, Dodge & GMC at shop or customer’s location to include automotive gas trucks and cars. A minimum of 5 years’ experience working on heavy equipment or equivalent required. Must have excellent communication skills, maintain good customer relationships, possess a valid driver’s license (ability to obtain Class A CDL) must be self-motivated and able to work without direct supervision. Applicant must have own tools, very clean driving record, no DWI or DUI’s and pass full back ground check and drug screen prior to employment.What you will do:Diagnose and repair truck and trailer maintenance problems as necessaryRebuild & overhaul Class 1 to 8 engines and transmissionsPerform preventative maintenance inspections on all equipment, including but not limited to, inspections of all tractors and trailersEnsure that all parts and labor are accurately charged. Install heavy components (starters, clutches, brake drums, etc.) of CMVs’ using hydraulics jacks or hoistMaintain a clean and safe work environment in accordance to OSHA & client standardsPossess a do whatever it takes attitudeThe job also requires being on-call 24/7, 365 days a year on a rotational basis in the near futurePerforms work by traveling independently to various locations as scheduled.Required Skills & Education:A minimum of 5 years’ experience working on heavy equipment or equivalent required.HS DiplomaTechnical College a plusClean driving record Strong Electrical and Hydraulic back ground required. Ability to read electrical schematicsPossess a valid driver’s license (able to obtain class A CDL)Must be self-motivated and able to work without direct supervision.Applicant must have own tools related to work requirementsMust be able to multi-task, be very organized and able to work with minimal supervisionMust have good written and verbal communication skillsWilling to attend workshops and continuing education classes/programsProvide ReferencesWhat we offer you:Sign-on/Retention BonusCompetitive pay plus monthly bonus potentialHealth InsuranceLife & short-term disability401(k)Paid time offM-F 8am to 5pm normal business hoursCareer GrowthEmployee DiscountsIncentivized professional developmentRelated keywords: diesel mechanic, mechanic, fleet mechanic"}