{"title":"Hemolytic Anemia Sales Specialist, Rare Genetic Diseases (Seattle, Washington)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJBbZ8ZIbfAYzU1Rja89crw20ckpXQ8h5Ab77KpgT52Fi9wTahtkNLbBg-br1K53WJT7OGzU4uDUmQYC7mQQuO6DB6bDYX1SXXbMmSJB40asNlJ8Ot5bymuqhzs_MlGgyShlJUoCvEOE_nphD4Qm5p_dgMnDsMYofsDlVPYykY9BE3ucfF0UHyVVHKRP0o","source":"ziprecruiter","full_description":"Hemolytic Anemia Sales Specialist, Rare Genetic Diseases (Seattle)Agios (agios.com) is a biopharmaceutical company committed to applying our scientific leadership in cellular metabolism to transform the lives of patients with cancer and rare genetic diseases. We are growing rapidly with an active research and discovery pipeline across both therapeutic areas. Agios has two approved oncology precision medicines and multiple first-in-class investigational therapies in clinical and/or preclinical development.Our lead rare genetic disease program, Mitapivat, is in Phase 3 clinical development for the treatment of pyruvate kinase (PK) deficiency with positive topline results announced in early December and late January that the two registration-enabling trials met their primary endpoints. Mitapivat is a first-in-class, investigational, oral, small molecule allosteric activator of wild-type and a variety of mutated PKR enzymes. Mutations in PKR cause deficiencies in red blood cell glycolysis, which lead to a disease known as PK deficiency. PK deficiency is an inherited disease that causes lifelong hemolytic anemia as well as other serious complications. Activation of wild-type PKR has potential utility in other hemolytic anemias such as thalassemia and sickle cell disease; Agios is currently evaluating Mitapivat in both disease areas and expects to initiate pivotal trials this year.The Hemolytic Anemia Specialist will report to a Regional Business Director, Rare Genetic Diseases, and will be a founding member of a new, best-in-class rare disease sales team.  Each Hemolytic Anemia Specialist will be responsible for raising awareness of PKD across their respective geographies in anticipation of the initial US approval of Mitapivat for Pyruvate Kinase Deficiency (PKD). We are seeking individuals with a demonstrated track record of success in launching rare diseases medicines and who are skilled at understanding the unique business drivers within their geography.  The Hemolytic Anemia Specialists should possess a scrappy \"start-up\" mentality and values consistent with the patient and science focused Agios culture.  They will be motivated by the opportunity to bring a rare disease commercialization mindset and to build their markets which will lay the foundation for the success of Mitapivat and Agios' pipeline of transformative rare genetic disease treatments.Territory to include these major markets: PortlandKey ResponsibilitiesAs a Hemolytic Anemia Specialist, you are the territory business owner with a focus on increasing HCPs awareness of Pyruvate Kinase Deficiency and PKD patient diagnoses across your geographyDevelop an integrated launch plan for your geography reflecting deep analysis and clear prioritizationCollaborate with all field teams and marketing to ensure alignment on objectives, strategies, and communication Develop relationships with key customers and continue to build knowledge of the hemolytic anemia marketplaceCollaborate with Regional Medical Affairs and Market Access colleagues to ensure seamless field coordination and customer/patient supportUpon launch, drive commercial team performance to get treatment to patients and deliver on revenue objectives while continuously assessing performance metrics and adjusting strategies and plans to achieveDevelop strong internal and external relationships to enable appropriate, compliant business partnershipsEnsure appropriate and compliant utilization of approved corporate, promotional and other resources to facilitate customer engagements Represent Agios positively and professionally at company meetings and conferences, ensuring your activities are compliant with laws, regulations, policies and guidelinesAchieve or exceed sales forecasts and targets, within budgetLead ad-hoc initiatives to support the business as requestedMinimum Qualifications:Bachelor's degree required, Scientific degree a plusProven track record of success in Rare Disease sales; minimum 5 years' experience in rare disease. Hematology sales experience preferredDemonstrated understanding of the payer and clinical landscape, especially in specialty & rare diseasesDemonstrated business acumen and clinical knowledge expertisePrevious cross functional collaboration with internal stakeholders including: marketing, medical affairs, market access, patient services, and sales operationsResults-oriented with ability to thrive in a fast-paced, entrepreneurial environmentAbility to navigate ambiguity and drive resultsStrong, resourceful, self-starter with an innovative mindset and ability to develop and execute new business solutionsExtraordinary commitment to customer experience and standards of excellenceWillingness to travel extensively across large geographiesPreferred Qualifications:Established relationships with Hematology HCPs within designated geographyPrior experience launching rare disease products Experience leading regional and/or national initiativesTravel RequirementsCurrent travel requirements are limited due to COVID. Both virtual or in-person meetings are facilitated as needed and appropriate. As travel opens back up and restrictions are lifted, travel requirement will be an average of 50-60% within the territory focusing on the major market areas of Seattle."}