{"title":"Senior Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKqUQvuKrDuyOW5JIbkJCvJ-zf-RrMFQ6E2sK_DYNsKHSCUcW8BhvKxOnVPsMOYTkpTDlstwRO0l3giXU8f7rt-g3_r7JAN9V9hh4oag61mY5BAV5t4i05Zmb7MVG5RwP8ottf4-ycxh6J9aDy48wD1CYsWlqXzg-P7zNeoJX0gSEXCmVm5iaDGXP3fmQ","source":"ziprecruiter","full_description":"LER TechForce, an LHP affiliate, previously LHP Engineering Resources, is looking for an Electrical Design Engineer to join our team specializing in PCB layout and component engineering for our Electrical Design need in Minneapolis, MN. This role is a hands-on designer role.Role ResponsibilitiesDesigning Electronic hardware for Power Electronics applications and leading the detailed design for Power Electronics for Power Converters and Genset ControllersCreating PCB layout to develop hardware. Using circuit simulation, analysis and DFMEA/PFMEA to ensure robust design.Understanding and implementing appropriate rules and strategies for high-frequency signalsCoordinating the development of design verification and system validation plans from a variety of inputs to identify failure modes while managing risk and relative priorityEvaluating analytical and experimental test results following engineering principles to verify that products meet technical requirements and validating that the design solutions meet customer needsProducing recommendations with technical documentation to support product decisionsSkill Set and ExperienceBachelor's degree and 7 to10 years of relevant experience, including assessing system requirements and contributing in developing the Electronic System ArchitectureDeep experience with digital and analog circuit design, including filter selection/design/and analysis, and working in electrical design software (Zuken, Mentor, etc. )The ability to perform electrical circuit analysis, for both analog and digital circuits, use critical thinking and troubleshooting capabilities. Experience with Pspice and MatlabExperience working with different microcontroller architectures and understands the various communication links like MODBUS, CAN, Ethernet and their impact on Hardware design"}