{"title":"Field Supervisor for Office of Field Experience - Secondary Education - Greater Seattle Area (Eve...","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALJFossW_gKMEO6c_dGqkzIeGA6s7-DUiQr6FJag-gw-kL76ueZJjL2oDpn44splgok9_Rs0y363K4Ah-9gVG3ss6tSjkigKUOr1Nb4KNty7d7htDvbVnJS0pUo5958L98LMsHGCwrNTyi2FS6P-LYCK0FHqUhanCHz2IItw92SnTK8y4S3fiaLLpPgwpU","source":"ziprecruiter","full_description":"Field Supervisor for Office of Field Experience - Secondary Education - Greater Seattle Area (Everett to Tacoma) Apply now (https://secure.dc4.pageuppeople.com/apply/793/gateway/default.aspx?c=apply&lJobID=497931&lJobSourceTypeID=796&sLanguage=en-us) Work type:NTT Faculty Location:Bellingham, WA Categories:Woodring College of Education Position TitleField Supervisor for Office of Field Experience - Secondary Education - Greater Seattle Area (Everett to Tacoma)About the UniversityWestern Washington University, with over 16,000 students in seven colleges and the graduate school, is nationally recognized for its educational programs, students and faculty. The campus is located in Bellingham, Washington, a coastal community of 83,000 overlooking Bellingham Bay, the San Juan Islands and the North Cascades Mountain range. The city lies 90 miles north of Seattle and 60 miles south of Vancouver, British Columbia. Western is the highest-ranking public, master's-granting university in the Pacific Northwest, according to the 2019 U.S. News & World Report rankings.About the DepartmentThe Woodring College of Education and the Office of Field Experience support Western's mission, which states that together with our students, staff, and faculty, we are committed to making a positive impact in the state and the world with a shared focus on academic excellence and inclusive achievement. We encourage applications from women, people of color, people with disabilities, veterans, and other candidates from underrepresented backgrounds and with diverse experiences interested in this opportunity.About the Position The Woodring College of Education offers a variety of undergraduate and graduate teacher certification programs in Bellingham, Bremerton, and Everett. The Office of Field Experience (OFE) oversees all student teaching placements and supervision and maintains an active vacancy pool for qualified Field Supervisors to supervise the student teaching candidates. The Field Supervisor positions are temporary, part-time and based upon the needs of the unit for supervision.OFE coordinates and provides oversight for the student teaching experiences for all Woodring College of Education teacher education programs and the assignment, training, and supervision of all Field Supervisors. Under the leadership of its Dean, the faculty, staff and students of Woodring College of Education are pursuing a shared vision to foster \"community relationships and a culture of learning that advance knowledge, honor diversities, and promote social justice.\" The College is committed to cultivating student competence through extensive field experiences with exemplary practicing professionals, and to integrating diversity issues in all curriculum and field experiences. To learn more about the Office of Field Experience, visit the website at:https://wce.wwu.edu/ofe/office-field-experiences and for more information about the Woodring College of Education, visit the website:https://wce.wwu.edu/ Position Responsibilities: Field Supervisors supervise teacher education candidates and collaborate with school personnel in the evaluation, support, and mentoring of each candidate. Field Supervisors must meet all OFE requirements including a minimum number of hours of observation, mentoring, collaboration, completion of internship evaluations, and submission of all required documents and evaluations to OFE.Academic Emphasis: We are seeking applicants qualified to supervise any of the following areas: mathematics, history, social studies, english language arts, physical education, music education, visual arts, science (all areas), and world language.Job Location: Snohomish, King, and Pierce counties; possible need in other counties within the State of Washington Required Qualifications+ Bachelor's degree + Teacher or administrator certification+ Experience in the appropriate educational field (teaching and/or administrative)+ Evidence of accomplished pre K-12 teaching+ Demonstrated experience working with diverse populations+ Formal or informal mentoring/coaching training received or provided, with demonstrated ability to provide such training+ Knowledge of current best practices+ Demonstrated excellent communication skills, both written, verbal and interpersonal+ Strong organizational skills and attention to detail+ Demonstrated ability to work independently, prioritize and multi-task while managing time effectively and meeting deadlinesPreferred Qualifications+ Evidence of successful intern supervision experience+ Successful experience working with adult learners SalarySalary is on a per student basis. Current amounts available upon request.Bargaining Unit United Faculty of Western WashingtonApplication InstructionsA cover letter and curriculum vitae are required and should address your experience related to the position responsibilities and the required and preferred qualifications.You will be asked to provide contact information of three references. Closing Date NotesOpen continuously Western Washington University (WWU) is an equal opportunity and affirmative action employer committed to assembling a diverse, broadly trained faculty and staff. Women, minorities, people with disabilities and veterans are strongly encouraged to apply. In compliance with applicable laws and in furtherance of its commitment to fostering an environment that welcomes and embraces diversity, WWU does not discriminate on the basis of race, color, creed, religion, national origin, sex (including pregnancy and parenting status), disability, age, veteran status, sexual orientation, gender identity or expression, marital status or genetic information in its programs or activities, including employment, admissions, and educational programs. See WWU's Policy on Ensuring Equal Opportunity and Prohibiting Discrimination and Retaliation. Inquiries may be directed to the Vice Provost for Equal Opportunity and Employment Diversity, Title IX and ADA Coordinator, Equal Opportunity Office, Western Washington University, Old Main 345 (MS 9021), 516 High Street, Bellingham, WA 98225; 360.650.3307 (voice) or 711 (Washington Relay); eoo@wwu.eduAnnual Security and Fire Safety Report: This report is provided pursuant to the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act (\"The Clery Act\"). It includes statistics for the previous three calendar years concerning reported crimes that occurred on Western's campus; in certain off-campus buildings or property owned or controlled by Western; and on public property within, or immediately adjacent to and accessible from, the campus. The report also includes institutional policies concerning campus security, such as policies concerning alcohol and drug use, crime prevention, the reporting of crimes, sexual assault, and other matters. You can obtain a copy of this report in printed or alternate formats by contacting the office of the Vice President for enrollment and Student Services. The report can be found athttp://www.wwu.edu/vpess/annualsafetyreport.shtml.WWU is committed to providing reasonable accommodations to qualified individuals with disabilities upon request. To request this document in an alternate format or to request an accommodation, please contact Human Resources Disability Services (https://wp.wwu.edu/hr/2015/09/02/i-need-a-workplace-accommodation/) , 360.650.3774 or 711 (Washington Relay).All new employees must comply with the immunization policy and show employment eligibility verification as required by the U.S. Citizen and Immigration Service before beginning work at WWU. A thorough background check will be conducted on all new hires. Job no:497931 Advertised:May 27 2020 09:00Pacific Daylight Time Applications close:"}