{"title":"Industrial Maintenance Mechanic NEW!","location":"","salary":"","description":"","term":"$85,000 to $100,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIsWbU1x264UddBHb5sCOEn8hHO0rgMUa0DHrE8pA0JC1lElnG1f01zSJFP8aagzH9II1TRCFnejYhaN_yAbuhfypyYaQLtozjw2zFkIcA0kF_657sqmb3hSoVKKH1mz3HQOvGBWkagbwHLvMThe3harZuUmpcOeniEkA_B5b5MuXM11VCwy5VxfqRzaXLg","source":"ziprecruiter","full_description":"We represent one of the most stable and fastest growing Fortune 200 manufacturing companies in the U.S. In this lean manufacturing environment, hard work is rewarded with above average compensation and benefits. Our client believes that teamwork and safety are critical to their work environment. This company is looking for people who desire to build a long-term career. The company has never had a layoff in their 40-plus year history and advancement opportunities are abundant for solid performers. We are searching for an Industrial Mechanic to join our client’s growing team.Basic duties of the Industrial Mechanic include performing corrective, preventive and predictive maintenance on industrial production equipment. You will be required to troubleshoot complex mechanical and electrical systems while working individually or as a part of a team with other maintenance and production personnel.QualificationsA strong emphasis on safety and good safety practices2+ years industrial maintenance experienceExperience with mechanical power transmission components including couplings, bearings and gearingExperience with machine assemblyWelding experienceKnowledge of lubrication techniques and applicationsKnowledge of hydraulic and pneumatic systemsBasic knowledge of electrical principlesAbility to repair, install and maintain manufacturing equipmentPreferred qualifications include:Bachelor’s or Associates degree in Mechanical Engineering, Mechanical Engineering Technology or a related fieldNavy Nuclear Machinist's MateMillwright and machining experienceMillwright, Machine Repair, Welder or related journeyman license"}