{"title":"Chemist II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL4yzznCWnwjsehabX-31ZGWA5GnGCO-byBVxGSG_Hsdig3Rko3TOIMopNiTJ3JluLzFoVahrD8W3CDcH4wHZhBdaAwJdSIgc806lra6fwtt1DE4f0PKcMpLcti0OauV73jpyfI87vvuCLiz54GIH-oZaF2si7eWwZfByrwUaVOFpKvI2DzPN3JIsVozc8","source":"ziprecruiter","full_description":"Requisition/Vacancy No.: 243228BR Job Category: Sciences Job Summary: AECOM has a position for a Chemist available in Austin, TX.The responsibilities of this position include, but are not limited to:Source and emissions samplingReview laboratory dataPrepare test plans and reports About AECOMAt AECOM, we believe infrastructure creates opportunity for everyone. Whether it's improving your commute, keeping the lights on, providing access to clean water or transforming skylines, our work helps people and communities thrive.We take on the most complex challenges and pioneer innovative, iconic solutions that push the limits of what's possible - the world's longest cable-stayed bridge, record-breaking sports events, the largest greenfield port development mega project, life-sustaining and disaster recovery programs, and the tallest tower in the Western Hemisphere.On projects spanning transportation, buildings, water, governments, energy and the environment, we deliver professional services throughout the project lifecycle.We are proud to be recognized for excellence:Fortune's World's Most Admired Companies - 2014-2020#1 in Transportation and General Building in Engineering-News Record's 2019 \"Top 500 Design Firms\" and #1 2019 \"Top 200 Environmental Firms\"VIQTORY 2020 Military Friendly Gold EmployerPerfect score on the Human Rights Campaign Foundation's Corporate Equality Index for 2017-2019 DCSA-EnvironmentWith world class technical expertise, leading edge technology and innovative project delivery capability around the world, AECOM's global environmental practice helps industry and government meet their business goals - to achieve compliance, reduce or eliminate risks and manage impacts. We provide advisory and technical services to help clients cleanup and close contaminated sites and surplus operational facilities and restore them for reuse, plan and permit new facilities, address critical climate change issues, restore habitats and water quality, protect natural and cultural resources, maintain compliance, and cost effectively manage residuals and wastes.Business Line: Environment Position Title: Chemist II Position Status: Full-Time What We Offer: When you join AECOM, you become part of a company that is pioneering the future. Our teams around the world are involved in some of the most cutting-edge and innovative projects and programs of our time, addressing the big challenges of today and shaping the built environment for generations to come. We ensure a workplace that encourages growth, flexibility and creativity, as well as a company culture that champions inclusion, diversity and overall employee well-being through programs supported by company leadership. Our core values define who we are, how we act and what we aspire to, which comes down to not only delivering a better world, but working to \"make amazing happen\" in each neighborhood, community and city we touch. As an Equal Opportunity Employer, we believe in each person's potential, and we'll help you reach yours. Minimum Requirements: Bachelor's degree2+ years of relevant experience; prefer environmental testing or analytical laboratory experienceSponsorship is not available for this positionPreferred Qualifications: Bachelors degree in Chemistry, or related science is preferred4+ years of relevant experience that includes environmental testing or analytical laboratory experienceKnowledge in the practices required to generate valid scientific dataAble to work both independently and in a project team environmentAbility to record test data legibly, completely, and accuratelyAptitude for operation and maintenance of mechanical and electrical equipmentAbility to recognize hazards and work safely in an industrial settingShow initiative and interest in professional developmentPossess good written and verbal communication skills.  Additional DetailsMust be willing and able to work outdoors year-round, climb ladders and stairs, and work at elevated heights."}