{"title":"Java Software Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKftFOpCqABq_bfagpuDjKdg6IAIm27gJ7AEBOeNGF7Kq8x29Ovk1bmzAiH4p9HppM9lQsKby4mVekpsXQKu4_JrqmZ1986rPQHK4F2YbTx24Z0BhM-paePVw9tbhnBkuCuAIkEyTEuUpL2y1RieA3F7pzzkv-oVFMPwxfd_CmtyFQMiQv6tM94Y4EW6wc","source":"ziprecruiter","full_description":"AmeriSave Mortgage Corporation is a well-respected retail mortgage lender, leading the industry in technological innovation. We are currently seeking qualified candidates to join the engineering team.Are you a high energy, motivated, smart individual who thrives in a dynamic, agile development environment? As a member of a talented and highly cohesive development team, your contributions will immediately impact the success of the organization. We offer competitive salaries, great benefits and a fun, casual and entrepreneurial-spirited work environment.In this role, you will help build and enhance the next generation of AmeriSave’s proprietary, industry-leading mortgage origination technology.At AmeriSave, we're one team with one shared dream - to be the best. We’re dedicated to building an inclusive culture where employees are empowered and supported to do their best work - whether from home or in the office.Why AmeriSave?What you'll find at AmeriSave is that we don’t just set you up for success, we set you up to WIN. Team members are provided with cutting edge origination software, CRM, marketing automation, data reporting / analytic software, and leading mortgage application technologies to help make more deals happen. Our culture at AmeriSave is casual and fun, and we offer competitive compensation and benefits.AmeriSave is the company you’ve been waiting to work for! Requirements:5+ years of professional experience as a software developerBachelor's degree in Computer Science, CIS or a related fieldMortgage or Financial services experience preferredHigh level of Proficiency in:Implementation of RESTful web servicesJava, Spring Web, Spring Data, Spring Boot,JPL/HibernateMicrosoft SQL, with stored proceduresCI/CD processes, Maven, DockerGitLab/MercurialAzure Cloud, Cloud native functionsAmeriSave is an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}