{"title":"Chemistry Teacher - High School 2021 - 2022 General Posting","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALEmTgivzBlWiqNQLoQMvkPyuuWQR8-4gm0N0rSMcT8kAnkRBa30ShdP4CnIjvSCVf_m3PRl-BQAwZXnzIKmXX46dyaEks-PGQg8mUXne2WJ783p6b4S7_pn97KQF6qJcJU_iHF0qEXlljElPXtV94RKzP1r51PLHiPyCXFV6ErBfgMX3MwgPL3pCbjFdg9","source":"ziprecruiter","full_description":"Lake Washington School District is looking for qualifiedhigh school Chemistry Teachercandidates for the 2021-2022 school year. This general posting will be used to generate an applicant pool for these positions. As specific openings are identified, building administrators will contact you if you are selected for an interview.If you wish to be considered for one of these positions, please apply to this general posting. We will continue to use this posting through summer of 2021.Qualifications:Washington State teaching certificate with Chemistry endorsement.Salary: Paid per teacher salary schedule with Base contract plus additional contracts for LEAP days, and Responsibility. Additional Technology stipend and Professional Fund. SeeLWEA salary scheduleposted on website. Full benefit package available for employees working a minimum of 630 hours during the school year. For more information please visitCareers in Lake Washington School DistrictFLSA Status: Exempt Immigration Reform and Control Act Requirement:All new employees are required by law to submit documentation to Human Resources proving eligibility to work in the USA by completing an employment eligibility form within three days of employment. Applicant Disclosure Statement: Pursuant to Chapter 486, Laws of 1987, all applicants must complete the disclosure form provided by Human Resources at the time of application. Background Check on Recommended Candidate: A reference check inquiry will also be made by Human Resources on recommended candidates. According to 1992 legislation ESHB 2518, all school employees with regularly scheduled unsupervised access to children are required to have a criminal background check, which includes fingerprints. The Lake Washington School District does not discriminate on the basis of race, color, national origin, sex, disability, age, gender, marital status, creed, religion, honorably discharged veteran, military status, sexual orientation, gender expression, gender identity, the presence of any sensory, mental or physical disability, or the use of a trained guide dog or service animal by a person with a disability, in its programs and activities and provides equal access to the Boy Scouts and other designated youth groups. The following person has been designated to handle inquiries regarding the nondiscrimination policies: Assistant Superintendent of Human Resources 16250 NE 74th Street Redmond Washington, 98052 (425) 936-1266 LAKE WASHINGTON SCHOOL DISTRICT IS A SMOKE-FREE WORKPLACE"}