{"title":"Network Engineer III - FT - Day - IS Technical Services @ MV","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALTcnzOMj1RAq3k_90jXcSAhcjRV6tmqXWAYf_oOn-2v0fdYSSzL_wLv2ODxkcLmAOrSpo6m53mvc1deOr7vbaZ3nyAyrxa9OOfRt7N-SyLBxB-4xZddbEm0MYq_B1yS2wop2Ybco-2D3wMbch1KFvgChCAmU5MXUJRo2ejf3vDNBzRbjg9eRFNxzRui-aP","source":"ziprecruiter","full_description":"El Camino Health is committed to hiring, retaining and growing the best and brightest professionals who will carry our mission and vision forward. We are proud of our reputation in the community: One built on compassion, innovation, collaboration and delivering high-quality care. Come join the team that makes this happen.FTE1Scheduled Bi-Weekly Hours80Work ShiftDay: 8 hoursJob DescriptionThe Network Engineer III is a member of the Network Group within Technical Services. Responsible for planning, engineering, installing, monitoring, troubleshooting, diagnosing, and resolving complex problems associated with the business critical network infrastructure within a 24x7x365 high-availability healthcare environment. Consults with the Infrastructure Supervisor on complex network related issues. Responsibilities include planning, design, forecasting, deployment, documentation, capacity management, updates, and other ongoing daily management of the network infrastructure. Plans, designs, implements, and supports scalable local and wide-area network solutions between multiple platforms and protocols (including IP and VoIP). Conducts tests of network redundancy, resilience, and failover of network elements to ensure up-time standards are fully achieved. Daily interaction with Server Engineers, Telecom Engineers, Applications Analysts, Security Analysts, and other members of Technical Services on the day-to-day operations and projects that depend on network connectivity. Mentoring, project management, excellent troubleshooting and communication skills are required for success. Will be required to provide 24x7 on-call rotation with some evening and weekend work required as necessary. QualificationsMinimum Qualifications ? 1.Bachelor's degree in Information Technology, Computer Science, or related field AND six years relevant network work experience in Information Technology within healthcare or other 24/7 high-availability environment.ORTen years relevant network work experience in Information Technology with at least two years experience being within healthcare or other 24/7 high-availability environment.2.Demonstrated experience in handling network device (i.e. switch, router) moves, adds and changes.3.Demonstrated data cabling experience. Strong data center and data closet cable management skills and experience.4.Demonstrated knowledge of internetworking systems and architectures, protocols and carrier services.5.Demonstrable documentation experience. Proficiency in Microsoft Excel and Visio.6.Experience with Cisco Catalyst switches (3560s, 3750s, 4500s, 6500s) & routers (2800s, 3900s, etc.).7.Experience with Cisco Wireless LAN controllers.8.Thorough knowledge of spanning tree, vlans, trunks.9.Working knowledge of routing and dynamic routing protocols ? OSPF, EIGRP.10.Working comprehension of the OSI reference model.11.Must demonstrate excellent written/verbal interpersonal communication and problem solving skills.12.Ability to build organizational partnerships with others, and be able to negotiate and build consensus.13.Ability to manage own time and schedule own tasks. Must take the initiative to work efficiently without constant supervision and direction.14.Demonstrated resourcefulness, initiative, and analytical abilities.15.Must be able to work varied shifts and/or additional hours.16.Ability to read, write, hear, and verbally communicate in English to the degree required to perform the job. Preferred Qualifications ? 1.Successful completion of additional related certification such as CCIE, MCSE, etc.2.Knowledge of VPN & firewall configurations on PIX/ASA.3.Knowledge of AAA configurations and Cisco ACS.4.Knowledge of FCOE, Nexus, MDS/SAN.5.Experience with Solarwinds Network Performance Monitor and other Solarwinds applications (NCM, IPAM, NTA). License/Certification/Registration Requirements1.Successful completion of Cisco CCNA, CCNP, or other comparable certification. Must present evidence of certification.2.Valid California driver's license.The Physical Requirements and Working Conditions of this job are available. El Camino Health will provide reasonable accommodations to qualified individuals with a disability if that will allow them to perform the essential functions of a job unless doing so creates an undue hardship for the hospital, or causes a direct threat to these individuals or others in the workplace which cannot be eliminated by reasonable accommodation.Light Work - Walking or standing up to 49% of shift, duties require standard movement, may occasionally lift up to 20 lbs. - (Physical Requirements-United States of America)An Equal Opportunity Employer:El Camino Health seeks and values a diverse workforce. The organization is an equal opportunity employer and makes employment decisions on the basis of qualifications and competencies. El Camino Health prohibits discrimination in employment based on race, ancestry, national origin, color, sex, sexual orientation, gender identity, religion, disability, marital status, age, medical condition or any other status protected by law. In addition to state and federal law, El Camino Health also follows all applicable fair and equitable employment policies from the County of Santa Clara."}