{"title":"Software Developer 5","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ43B0t3I7DR3wzPSPsugYGvuj9c4ymVhq7mWVboOJeTlMNJSS5E0MVy8ipjM5oPo62Zfq-7WPFS0-uLsmCEzUDZwt_7mQ4Ie9KrAvW0xfrRE1ALF_nZfvRPAuh6e4pgdGS-6VxD-uGTTz73H560hUxSmXQG1oBsrBlqn5KBSBK5DFKbzpnb_2KbmqgTREy","source":"ziprecruiter","full_description":"Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. Define specifications for significant new projects and specify, design and develop software according to those specifications. You will perform professional software development tasks associated with the developing, designing and debugging of software applications or operating systems.Provide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 or more years of software engineering or related experience.*This is a remote/office based position which may be performed anywhere in the United States except for within the state of Colorado.**Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.**Who are we?Oracle Analytics organization plays a critical role in delivering and supporting best-of-breed cloud solutions to Oracle customers.The Service Excellence team at Oracle Analytics Cloud (OAC) is on the verge of transforming the development paradigms at the 42 year old software giant. With the world moving towards the Cloud, Oracle is at the forefront with tremendous portfolio of Cloud offerings.However, this transformation happens not just at the product level, but also the process of developing, deploying, and operating these products in the Cloud. Using a combination of cutting-edge technologies, continuous process improvements and innovative business transformation methodologies, a small group of us are blazing the trail on the Service Excellence philosophy.Who are we looking for?*We have a global team spanning different geographical sites. We are looking foran experienced Consulting Engineer to plan, development, and drive the delivery and support of complex software solutions to drive the operational architectures of the services operated by the BI org. The team isseeking an energetic engineer to plan, development, and drive the delivery and support of complex software solutions to improve the overall reliability of the services operated for the BI org.As a DevOps engineer, you will solve interesting technical challenges by defining, designing deploying and troubleshooting key Oracle Cloud services, platforms, and infrastructure, always thinking about reliability, scalability, resilience, security, and performance.*What You'll Do** Service Ownership -You will be part a team, whose mission is the shared full stack ownership of a collection of services and/or technology areas, with our Development partners.* Ownership Scope - As an Engineer, you will understand the end-to-end configuration, technical dependencies, and overall behavioral characteristics of the production services you own. In partnership with your Development partners, you will have the responsibility to ensure that services are designed and delivered to be mission critical with focus on security, resiliency, scale, and performance. You are the ultimate authority and are accountable for the end-to-end performance and operability of the services they own. Service Design - As the Oracle Cloud evolves; you will partner with development teams in defining and implementing improvements in service architecture, both current and future. You will be an expert at articulating technical characteristics of your services and the dependencies between services, and guide Development teams to engineer and add premier capabilities to the Oracle Cloud service portfolio. Operations Engineering - You will understand and be able to communicate the scale, capacity, security, Compliance, performance attributes and requirements of the services you own. They are Subject Matter Experts, able to understand and communicate every characteristic of their service stack, such as:o degradation and behavior under load of the services and their dependencieso end-to-end tuning needs, optimizing resource utilization, as load patterns fluctuateo Instrumentation and metrics that clearly describe the service behaviorso scaling requirements and patternso resiliency and recoverability, ensuring that backup / restore and disaster recovery capabilities are implemented, tested and maintained* Automation - You will have a clear understanding of automation and orchestration principles, and will be eager to automate, wherever and whenever the possibility arises, while simultaneously eliminating technical debt. Automation must be part of your DNA. Technical Experts - As service owner, you are the ultimate escalation point for complex or critical issues that have not yet been documented as SOPs for Level1 staff. You will usually get called in during major incidents as an SME, when the source of a problem is unclear. You will have the deep understanding of service topology and their dependencies required to troubleshoot issues and define mitigations. Broad Interests - SREs are a rare mix of sysadmins and development Engineers, and as such have the ability to understand and explain the effect of product architecture decisions on the ability to run as distributed systems. They are driven by professional curiosity and a desire to a develop deep understanding of their services and the technologies they depend upon.What You Need to HaveA BS or MS in Computer Science, or equivalentGeneral QualificationsThe candidate must have knowledge and experience with: Oracle Cloud Infrastructure (OCI) and/or AWS, Azure, or GCP compute, storage, and network operational experience. Methodical approaches to troubleshooting and solving complex technical problems Issue tracking and collaboration (Jira and Confluence). Producing documentation in support of developed work (KBs, run books, help guides). Linux/Unix system administration including system level knowledge of Linux on OCI Gen 2, creating and executing scripts. Networking and TCP/IP fundamentals. Utilizing agile methodologies. Working with remote, global teams as well as individuals. Ability to effectively assess and communicate risks and appropriate levels of urgency to management and engineering staff as we as team environment Working independently and in a self-directed manner. Most importantly, the aptitude to be a good team player and the willingness to learn and implement new Methodical approach to troubleshooting complex problems*Preferred Qualifications** Strong application/product/software background Understand internet networking services, such as DNS, HTTP, etc. Programming and scripting languages (Python, Java, bash are our preferred) Using Ci/CD scripting tools such as Ansible, Puppet, or Chef. Containers and orchestration (Docker, Kubernetes). Oracle Database, MySQL or other RDBMS. Development in languages, such as C, C , Java, Bash, Python, Go Databases and big data stores Defining and documenting technical architecture of complex and highly scalable productsLocationThis job is open for remote work anywhere in the Lower 48 US.Job: **Product Development***Organization:** **Oracle***Title:** *Software Developer 5***Location:** *WA,Washington-Bellevue***Requisition ID:** *21000359***Other Locations:** United States"}