{"title":"Core Camera Hardware Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI-t7ROQ490lCPSwSaAqe_dIYEQ21vJLLyj7ukmCDbMG-YCmEvc1-9i6ODAEmZnM39PfH2aSchdvWFqUepjuPQ7LrjEGE-IXjNG5ELYY26W0rlysp3FBdiUbFz5XRmQ0okNI-uD0KTgjQidwa32qn4SQdUdDJh2f2GiPWzVoyoUuC29aVVxa9EXmNQzLIk","source":"ziprecruiter","full_description":"Job Title: Core Camera Hardware Engineer Job Description & Qualifications: At Ford Motor Company, we believe freedom of movement drives human progress. We also believe in providing you with the freedom to define and realize your dreams. With our incredible plans for the future of mobility, we have a wide variety of opportunities for you to accelerate your career potential as you help us define tomorrow's transportation.Do you have what it takes to make smart vehicles for a smart world? Join the Ford Product Development team. Utilizing Design Thinking and User Experience methods, you will work to deliver breakthrough products and services that delight our customers. We are seeking forward-thinking, laser-focused professionals with a passion for bringing innovative, exciting and sustainable ideas to life. We have opportunities around the world for you to contribute to such advancements as autonomy, electrification, smart mobility technologies and more!What you will be able to doJoin us and help bring advanced engineering concepts to life. You will be a key member of the team that is designing and developing hardware and functional models that deliver best-in-class behavior for features like adaptive cruise control, automatic emergency braking, cross traffic alert, active park assist, 360 camera systems, and interior camera system. You will be responsible for the creation of new sensor and ECU hardware, which may include LIDAR, a driver-monitoring camera, an infrared camera or a central active safety ECU. You will:Develop technologies and specifications for new interior and exterior camera hardwareDevelop and oversee test methods and plansComply with Robustness Engineering Disciplines (e.g. Functional Safety, Quality History, P - Diagram, FMEA, etc.)Apply six sigma and 8D issue resolution processesConduct validation testing on components and subsystems on bench and at the breadboard and vehicle levelSupport the Sourcing Process (e.g. investment, piece price, tooling cost reviews, etc.)Release parts through the product life cycleSupport Change Control meetingsIdentify validation, durability and functional testsDefine and verify engineering prototype requirements at part levelReview/manage program design change requestsSupport prototype and vehicle launchesProvide suppliers with technical assistanceThe minimum requirements we seekBachelor's Degree in Electrical Engineering, Mechanical Engineering, Aerospace Engineering or Control Systems Engineering3+ years of combined experience developing complex hardware and cameras 1+ years of combined experience with engineering specifications, design validation and problem solving (e.g. failure mode analysis, 8D and/or six sigma) for the automotive industryOur preferred requirementsMaster's Degree or PhD in EngineeringExperience in safety systemsCAD packaging experienceExperience in CATIA and Team CenterOperational knowledge of desktop productivity and CAD softwareUnderstanding of production processesExceptional communication and interpersonal skillsAbility to champion issue resolutionKnowledgeable about camera functionalityUnderstanding/experience with the design and development of automotive electrical featuresKnowledgeable about signal transfer and mechanical-electrical interfacesUnderstanding of vehicle electrical systems and electrical design/development process"}