{"title":"          Development Quality Engineer NEW!        ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAJqLT5o_vGsxobbIMDrlqWZcVMaJmL1n5YUxAe7Imk01XWIau8u6iYfuS2SZaFmurC5_LD3JXJKRowyjuBC6QiIMEK72KcTeQHdOVALx6IeT6NXKypao0ubq_Fd23CzXrgMMPC7phZ9lsCQgChXBE3kL9FgHnLBwiP_QACUW1cnwC_1zK4wAvLTcn39yHg","source":"ziprecruiter","full_description":"\n        Hello,My name is Kevin, and I am a Recruiter with The Fountain Group. We are a national staffing firm and are currently seeking a Development Quality Engineer for a prominent client of ours. This position is in Menlo Park, CA. Details for the position are as follows:Job Description:The Development Quality Engineer will work directly with a cross functional design and development engineering team to provide Design Controls support for the next generation of Structural Heart devices and therapies. Development Quality Engineers supporting new product development have the opportunity to influence product quality and program success through execution proof of concept testing, support and execution Verification and Validation, performing Risk Management, and execution of Test Method Development and Validation activities. Duties:· Initiate, execute, and track role appropriate Design Controls quality deliverables· Plan and execute Product Quality Risk Management activities with the cross functional development team (Failure Modes Effects Analysis, Risk Controls/Mitigations, Verification and Validation, etc)· Develop and Validate test methods for evaluation of product requirements· Develop and implement product and process inspection and monitoring requirements· Collaborate and provide guidance to cross functional R&D and Manufacturing teams to establish verification and validation strategy· Author and execute Design Verification, Shelf Life, and Process Validation studies protocols and reports· Investigate and provide guidance and input in resolving deviations and non-conformances associated with Design Verification, Shelf Life, and Process Validation studies· Perform and interpret appropriate data and statistical analysis of test results· Execute work in compliance to applicable Standards and Regulations (e.g. CFR 820, EU MDR 2017 / 745, ISO 13485, ISO 14971, etc)Qualifications:· Bachelor's degree plus 2-5 years of related work experience or Master's degree with 0-2 years of related work experience· Experience in Design Controls and Risk Management activitiesIf you are interested in hearing more about the position please respond to this posting with your resume attached or contact me at kevin.hayes@thefountaingroup.com.Please forward this email to any friends or colleagues as we do offer a Referral Bonus for any candidate hired.Regards,Kevin\n      "}