{"title":"Customer Service Repair Specialist, Seattle, Washington","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALgqApfuIBdJg8xhePFHHka6T9D47B-djvoxhfJAJtonZ4YeB3PWrNeGL3XFAtacd26F17BoYiyWP9PYxXwlD-LyemyOIJPgzUoXp0C63RBhrVziKYt3_K4ayOZmHoeG0_SzpD3V9U7RrGp1lLMSUcXs4qCphwc5hMnct8jpoMAmkJGzaDgfhaMJ0ilaQ","source":"ziprecruiter","full_description":"Customer Service Repair Specialist, Seattle, WashingtonApplyShareCreated03/18/2020Reference68913CategorySalesJob typeSalesCountryUnited StatesStateWashingtonCitySeattlePOSITION SUMMARY:This Customer Service Repair Specialist will be responsible for customer service contacts with international and domestic companies to ensure delivery of excellent customer service. The focus of this position is on remanufactured and repaired products. The position exists to assist our customers with prompt and accurate support and information that they need in order to purchase from our company. This position is responsible for driving increased sales by developing strong relationships with global customers through conducting outbound communications (phone calls, e-mail, etc.). The position will work closely with Production, Supply Chain, and Field Sales to develop effective communication tools highlighting the value of H-E Parts Mining product offering. When required, Inside Sales will provide after-hour coverage of customer service calls to ensure H-E Parts International maintains excellence in service levels. It is the responsibility of every H-E Parts International, employee to insure a safe work environment. All H-E Parts International, employees share the responsibility to insure at the end of the day we return home safely to our families. Our safe work environment value surpasses all other responsibilities. ESSENTIAL FUNCTIONS AND RESPONSIBILITIES: + Safety - conduct all activities in a safe manner, utilizing PPE and adhering to company policy and alerting others regarding potential concerns. Safety is # 1. Safety + Responsible to ensure a safe work environment.+ Attend and in some cases spearhead some Shop Safety activities+ Support and champion some Safety initiatives brought forth by HEPI as it impacts the shop and its employees+ Assist Shop Supervisor to conduct daily startup & toolbox safety meetings.+ Provide leadership for safety, loss prevention and cost reduction activities. Shop Production Floor Functions + Assist Shop Supervisor to inspect product to verify production specifications and expectations of quality are met.+ Oversees the orderly scheduling of projects and work orders through the shop. Assists in ensuring production schedules are as efficiently processed as possible. Manages the production board.+ Works cooperatively with technicians to ensure completion of component reports are completed fully and accurately.+ Consult with parts desk (buyer/planner) to make certain parts are ordered properly for production orders.+ Inspect torn-down components to identify defects and flaws. + List and identify action items that need to be taken.+ Inspect incoming repaired components for accuracy and quality workmanship.+ Collaborate with engineering and technicians to evaluate warranty claims, formulate failure analysis and produce warranty reports for the customer and sales.+ Recommend new/alternative repair processes to the shop and engineering based on previous repair shop experience+ Create shop work orders for remanufactured and repair products. Review shop work order repair evaluations for accuracy, thoroughness and to ensure that best practices are utilized in the repair process.+ Provide support to the Shop Supervisor when required to do so (vacation times, sick time, etc.) Customer and Sales Responsibilities + Conduct outbound communications with global customers offering and educating customers on product value and functionality.+ Provides support to customers and representatives via telephone, fax, or e-mail daily+ Provide customer and billing reports as needed for accounting and management+ Provide Sales force technical backing and expertise for customer communications+ Provide customer and billing reports as needed for accounting and management+ Assume responsibility for establishing and maintaining effective, professional business relationships with customers+ Communicate with Field Sales, Production, and Supply Chain departments to enhance our effectiveness of achieving sales goals+ Synthesize costed repair shop work order evaluations into a repair quote that explains the condition of the customer's component, the proposed repair process, the parts used and the final cost of the repair. Provide itemized parts and labor price, photographic documentation and expected lead times as required by the customer.+ Assists customers and Sales Representatives with product information including part numbers, pricing, and availability+ Formulates repair and rebuild estimates ensuring a professional delivery of quotations to Sales Representatives and Customers. Review Build of Materials for accuracy+ Processes customer orders through the order entry system verifying pricing, quantities, part numbers, and routing.+ Assists customers with product information including part numbers, pricing, and availabilityAdministration and Time Management + Participate in product reviews to effectively execute new product introductions, conversions and rationalization efforts+ Act independently and routinely perform moderately complex planning and problem solving+ Prepare Excel and Word documents as required+ Use Outlook fort time management and effective communications+ From time to time - Assist with other duties as required when other team members are away from the Seattle Office QUALIFICATIONS: EDUCATION and/or EXPERIENCE: + 3-5 years' professional customer service and inside sales experience+ 3-5 years' experience as shop repair mechanic, estimator, planner or service writer. + Excellent written, verbal, and interpersonal communication skills+ Ability to maintain accurate and detailed records+ Must have intermediate/advanced computer skills in MS Office Suite (*MS Word, Excel, Access, Outlook, PowerPoint), and Internet+ The ideal candidate will have experience in the mining and/or industrial sector.+ Mechanical background is necessary to effectively communicate with shop personnel on customer's repair needs, review work order repair evaluations, evaluate warranty claims and recommend alternative repair processes. Preferred Qualifications + Working knowledge of the mechanical functions of heavy mining equipment with an emphasis on Wheel Groups, Suspensions, and Cylinders.+ Journeymen Red Seal Technician accreditation preferred, will consider apprentice depending on experience+ Selling into the International market is preferred, but not essential.+ Operate office equipment including, but not limited to, computer, copy machine, fax machine, and multi- line telephone.+ Communicate effectively, both orally and in writing, with customers, co-workers, and various business contacts in a courteous and professional manner including the use of effective conflict resolution.+ Work independently and be a team player within the department and the organization.+ Exhibit exceptional organizational skills and be a problem solver.+ Work completely and accurately under time constraints and deadlines.+ Work in a fast pace environment and prioritize multiple work assignments"}