{"title":"Cloud Services Network Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ8H3_3429FfEA1jKA3sudei-5bhOl_-IxOW_iEhXydyu0eh32StDta_0uDmTOiXoPL-rs_iV-T5m_nhhC7HhZDz8GGPB6D6_gEv5QoCef75HOPWmw8MkEqyL4Vhn7q9zEUmSw4kpexaJM2TBCHcuTU37dqmWamJgs5QEphaioZt3FptR6kE4PqyN-8AC6H","source":"ziprecruiter","full_description":"Expedient is a provider of multi-cloud platforms, hosting and security and data center infrastructure as a service (IaaS) solutions. We are a CRN Top 100 Data Center and Solutions Provider, a Top Workplace winner for the past 6 years and ranked among the Top 3 Managed Service Providers globally. This is a high-growth industry offering layers of opportunity to grow your career. We're hiring a Cloud Services Network Engineer to join our Service Delivery & Implementation team. Successful candidates will have significant depth and technical knowledge on multi-site network design with a variety of technologies. They will embrace technical challenges with creativity and the ability to interact with clients at many different technical levels. We are open to hiring this role in one of the following Expedient markets: Phoenix, AZ; Cleveland, OH; Columbus, OH; Pittsburgh, PA; or Indianapolis, IN.Sponsorship is not provided.The Network Engineer will deliver managed services and product solutions for our clients. This position will design and configure network virtual and cloud services connecting clients to their public, private, multi-site cloud and traditional colocation datacenters. The engineer will be working with latest in Software-Defined Networking (SDN), firewalls, content security and threat prevention, remote access, and network automation as they facilitate the deployment of new and/or migration of the client?s workload to Expedient platforms. REQUIRED: + Demonstrated level of competency with the following technologies:+ Software-defined networking such as VMware NSX or another major technology provider+ Virtual private networks+ Network routing protocols (BGP, OSPF, and MPLS)+ Firewalls and security products+ Enterprise/carrier-class routers and switches+ The ideal candidate would possess one or multiple technical or vendor certifications+ Ability to prioritize and be productive in a fast-paced environment+ Strong troubleshooting skills including the ability to identify and resolve challenging situations+ Passion for learning technologies and curiosity for new ideas+ Excellent written and verbal communication skills+ Outstanding service and response time working with clients+ Flexibility to be available for occasional night and weekend implementation projects when required+ Ability to pass pre-employment drug screen PREFERRED: + Experience with Juniper JunOS is a plus+ Experience with DevOps and automation is a plus RESPONSIBILITIES: + Review the solution and requirements from the client and sales team to construct a successful design, implementation, and migration plan+ Ensure delivery of standard network services during project implementations for clients per contract+ Provisioning VLANs, VxLANs, and IP routing connectivity inter/intra datacenter and to/from client premise+ EVPN, BGP, MPLS, dedicated private circuits, and spine-leaf architecture+ Deploy and configure network appliances+ Security Firewalls (including content filtering, log management, intrusion detection and prevention)+ Load Balancers, Remote access, and VPNs+ NSX Distributed Routers and Edge Gateways+ Implement and document network disaster recovery services and actively participate in client testing+ Trusted advisor for clients during configuration of content security, logging and threat management services+ Follow implementation guidelines, processes, and procedures to ensure standards and quality are met+ Communicate with project managers, clients, and internal staff at regular intervals to ensure expectations are set and that appropriate attention is being paid to client projects+ Ensure appropriate documentation of the implementation is generated, maintained during the project for effective transition to our Operations Support Center BENEFITS TO WORKING FOR EXPEDIENT We place an extremely high value on learning and staying agile in the technology arena. Therefore, we make education and training available to all employees through a very robust, employee-driven training and tuition reimbursement program. Additional benefits include 3 weeks of paid time off, top-tier, extremely affordable medical, dental, vision insurance, 401(k) with a generous match and a paid day off to celebrate your birthday each year. Expedient is committed to providing its employees with an environment that promotes collaboration with both team and individual success. Employees enjoy a relaxed dresscode, and we stock our kitchens with free snacks and beverages for all employees. To apply, please submit your resume and a cover letter explaining your interest. If this isn?t the job for you, perhaps you have a friend who would be a perfect fit! Please share the following link so they can view/apply for this or any of our other current job opportunities: expedient.com/careers.Expedient is an equal opportunity employer, providing a safe, drug-free work environment. Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, protected veteran status, disability, or any other characteristic protected by law.Expedient does not work with third-party recruiting or staffing firms."}