{"title":"Senior Principal Scientist, Process Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALZw0aqVE6kk1ywGSNXmb_ai1ZnQqR0oWSOn9LaeNlI1Squfdo4vT_ogGH4vK9WQnTcwi5JxIgQc7LQ23SJ3ks_HzkaM69OUehJG3eHRm4lqeDfB7Elt9CQ4JJ-lrj82YbuUHtiqOW4wH8YP79DTAzFtAgGxnaPn4vrCn0bDXhjYAzpXogePILGROWKSrRJ","source":"ziprecruiter","full_description":"Description Summary:The Senior Principal Scientist is responsible for ensuring that the development of chemical processes for all active projects within Process Chemistry, from incipient stage to pre-commercial validation, is executed with the appropriate technical rigor and CMC strategic scope at each development stage.  In collaboration with leadership, the Senior Principal Scientist assists in developing and implementing business practices to enable process chemistry teams to efficiently meet development milestones and timelines. The Senior Principal Scientist is expected to leverage their chemical development expertise in evaluating chemical transformations under development for suitability as potential processes and their ultimate readiness for technology transfer to external CMO/CDMOs.   This position would contribute to the expansion of external development and manufacturing partnerships to ensure that state of the art technologies are employed in the development and manufacturing of novel ADC drug linkers.  The Senior Principal Scientist would be expected to leverage their industrial and academic professional network to enable the continuing improvement of the capabilities and expertise within Seagen's Process Chemistry department.Responsibilities: Define process chemistry development strategies, scope of experimental work, and technical expertise necessary to meet CMC program strategies, timelines, and deliverables.  Provide timely communication of progress and business impact to TOPS senior leadershipIdentify and create internal business alliances and strategic alignment with key stakeholders and senior leadership to facilitate coordinated CMC efforts across development groups. Contribute to overall ADC development activities and development strategiesServe as the technical lead of Process Chemistry project teams in the development and transfer of complex chemotypes to third party contract manufacturers and provide continuing technical oversight to ensure successful execution of processes at scale. Execute lab experimentation in a supporting roleContribute to the career advancement of process chemistry staff by providing technical guidance and mentorshipBuild and leverage an external academic/consulting network and identify opportunities for their contributions to process chemistry development challengesContribute to organizational knowledge capture.  Serve as author and reviewer of departmental technical documents to ensure appropriate capture of process knowledge in support of CMC team development and regulatory strategyIdentify new principles and concepts from other fields to promote progress in synthesis and process chemistryContribute to Seagen's position as an industry leader in the development of ADC technologies through external publications and presentationsQualifications:Minimum of 15 years relevant industrial experience (PhD) or 20 years (BS/MS) in developing synthetic routes and optimizing chemical processes for active pharmaceutical ingredientsPossess a high level of expertise in organic chemistry, reaction mechanisms, and knowledgeable of current advances in the fieldIn-depth knowledge of ICH/FDA regulations and current industry GMP guidelines for pharmaceutical manufacturingProven track record in resolving cross-functional CMC issues in small molecule developmentExperienced in the transfer chemical processes to external CMO and CROs and oversight of external GMP manufacturingExcellent written and oral communication skills; enthusiasm, integrity, self-motivation, and ability to interact across research and development organizationsPrior project leadership experience in oncology / high potency APIs is preferableAs the leading employer in our industry in the Pacific Northwest, Seagen is proud to offer a competitive total compensation package as well as a comprehensive benefits program designed to support the whole lives of our employees and their families. Benefits include medical, vision and dental coverage, group and supplemental life insurance, 401(k) with company match, tuition reimbursement, relocation assistance and much more. To learn more about Seagen, please visit www.seagen.com. Seagen is an equal opportunity employer. All qualified applications will receive consideration for employment without regard to race, age, gender identity, sexual orientation, color, religion, sex, marital status, national origin, protected veteran status, disability status, or any other status protected by federal, state, or local law. #LI-DD1"}