{"title":"Senior Grants & Contracts Analyst NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJZUJLL4d4R-y2gGXDhipQP1hxO0W3R_WC_aIn_cjXEAN1rsUqhezW4A0NhqaDB1C4CDiRD4WlGTDdRyp47IbxwlZX2BP9C6W9iN6asEqO243F3YysxnUXIn45YUhOMnQklGf2s9DtEo0mqWwb-6inIGkz7cEipu6aFjmeWi5CTrWq-QFIEvNGhXZ2QUA","source":"ziprecruiter","full_description":"Job Category: NSF AdministrationRequisition Number: SENIO03771The Central Administrative Services (CAS) unit of AURA is seeking a Senior Grants & Contracts Analyst to provide dedicated professional level sponsored funds management with specific responsibility for pre-award and post-award functions that includes, but may not be limited to: proposal preparation, submission, budget development, account maintenance and oversight, billing/invoicing, reporting, compliance, and closeout. Works independently on a variety of grants/contracts that range from simple to highly complex. The primary goal of this position is to ensure timely, effective and efficient functioning of sponsored funding. This position can be based in Baltimore, MD, Washington, DC, or Tucson, AZ.Essential Functions:Reviews budget for completeness and accuracy before submitting request to set up project in Deltek’s Costpoint. Verifies that funds awarded are setup properly in accordance with AURA guidelines, funding agency guidelines, including personnel costs, merit adjustments, supplies, materials, services, etc.Understand and utilize institutional policies for pre-award grant process and sponsor guidelines.Review all sponsored project proposals for prior to them being forwarded to the Sponsored Programs and Grants manager or Contracts Officer for signature. Review involves accuracy, content, adherence to all relevant guidelines.Responsible for the timely preparation of proposal budget for Principle Investigator Review.Provide instruction, preparation assistance and support related to grant application procedures. Serve as liaison between CAS, Centers and funding agencies.Monitors grants and contracts expenditures on a monthly basis to ensure labor costs are matched appropriately within budget requirements. Report any spending anomalies.Reviews billing associated with grants and contracts on a monthly basis to ensure accuracy of spending allowability.Maintain grants and contracts electronic files and database of all active grants and contracts on a monthly, quarterly, and annual basis. Alert programs of pending period of performance end-dates.Ensure compliance in all other areas related to grant and contract management, including sponsoring organization guidelines, internal protocols, accurate protocol information within grant documents, conflicts of interest, etc.Manage all assigned grant submissions to ensure timeliness and accuracy.Maintain ongoing updates and communications related to current grants and contracts, this includes regular auditing and reporting to principal investigators on financial status of grants, contracts and discretionary accounts. Also provide relevant updates and reports to departmental leadership, as needed.Manage related post-award processes, including award setup, review, account setup verification, and ensuring that staff is setup appropriately. Ensure that post-award responsibilities are completed, including budget distribution, account reconciliation, e-form setup, effort reporting, cost transfers, paying invoices and paperwork finalization related to subcontract setup.Provide information and direct assistance required to complete contract and grant closeouts, as needed.Know and advise the teams on federal travel regulations; review expense reports and airfare for compliance and accuracy.Required Education/Experience/Skills/Abilities:Bachelor’s Degree in Business Management, Business Administration, Finance, or related field.Minimum of 5 years’ experience in contract administration in federally funded environment to include considerable experience in complex contract and grant functions such as: proposal preparation, award negotiations, contract/grant administration, and closeout with government agencies.Working knowledge with OMB Circular A-21, A-110, A-133, and FAR polices and procedures regarding contracts and grants management.Demonstrated knowledge of accounting concepts to perceive and define cause and effect relationships between expenditure rates and budgetary projections.Some knowledge of Uniform Administrative Requirements, Cost Principles, and Audit Requirements for Federal Awards (2 CFR 200), Federal Acquisition Regulations (FAR), and other applicable regulations covering contract and grant administration, closeout procedures and requirements, and proposal preparation and review.Working knowledge of the basic and complex concepts, theories, principles and practices that govern legal and financial transactions.Working knowledge of government contract law, commercial contract law, procurement regulations and practices and International Traffic in Arms Regulations (ITAR).Must possess the ability to anticipate and resolve complex problems, exercise sound judgment, and plan, organize, and prioritize multiple demands efficiently and effectively.Ability to analyze, interpret and evaluate requests for proposals and contractual agreements.Excellent customer service skills to both internal and external customers.Excellent written and oral communication skills. Demonstrated ability to meet deadlines and multi-task.Physical Demands:The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.The work is mostly carried out in an office environment. Long periods of sitting and usage of computers may be required. Given the international nature of AURA’s work, you may need to travel to the various observatory sites (Arizona, Chile and Hawai’i) and other locations for business purposes.AURA offers an excellent benefits package, competitive salary commensurate with experience, and a stimulating work environment.Please list 3 professional references in your application (references will only be contacted later in the recruitment process) and attach a cover letter and CV or resume (PDF files preferred) to your application. Please name any attachments with the following format: LastnameDocname. Application documents that are not uploaded as part of the application may be sent to employment@aura-astronomy.org.Preference will be given to qualified internal candidates and to qualified Native Americans living on or near the Tohono O'odham reservation. Veterans, disabled individuals or wounded warriors needing assistance with the employment process should request assistance at employment@aura-astronomy.org.The Association of Universities for Research in Astronomy (AURA) is a consortium of over 40 US institutions and three international affiliates that operates world-class astronomical observatories. AURA’s role is to establish, nurture, and promote public observatories and facilities that advance innovative astronomical research. AURA is responsible for managing the operations of the NSF’s National Optical-Infrared Astronomy Research Laboratory, the National Solar Observatory, and the construction of the Vera C. Rubin Observatory and the Daniel K. Inouye Solar Telescope under cooperative agreements with the National Science Foundation and operations of the Space Telescope Science Institute under contracts with NASA.As a recipient of U.S. Government funding, AURA is considered a government contractor and is subject to Equal Employment Opportunity and Affirmative Action regulations. As an Equal Opportunity and Affirmative Action Employer, AURA does not discriminate based on race, sex, color, age, religion, national origin, sexual orientation, gender identity/gender identity expression, lawful political affiliations, veteran status, disability, and/or any other legally protected status under applicable federal, state, and local equal opportunity laws. The statements below as well as the requests for self-identification are required pursuant to these regulations. We encourage your participation in meeting these federal reporting requirements which are included for protection and to assist us in our recordkeeping and reporting. Your responses are kept strictly confidential.Equal Opportunity Employer/Protected Veterans/Individuals with DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)"}