{"title":"Field/Base Communications Network Engineer - Mid Level","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALpZQy3OnJeBNCJoRamlMHIDrxaCRwOOPqs32oDJy3Cus49xM-NUrXZlZL3u72ej8SO2G56il_jmDMjUo0NQroJZTu_jehthxauKgscZtBNZci3g5eXjUyhaBBJXhnos3vQ5raRKLYigAMtdENptcCLkCZu9zChM26b9R8FH47UWhfQhDxgsxCkTNLlo8ck","source":"ziprecruiter","full_description":"Job Description:More About the Role:NGEN at Leidos currently has an opening for a Field/Base Communications Network Engineer position. This is an exciting opportunity to use your experience helping the NGEN mission. NGEN-R is the largest IT services program for the Navy. Under the Service Management, Integration, and Transport portion of NGEN-R, the Leidos team will deliver the core backbone of the Navy-Marine Corps Intranet, including cybersecurity services, network operations, service desk, and data transport. Ultimately, Leidos will support the Navy in unifying its shore-based networks and data management to improve capability and service while also saving significant dollars by focusing efforts under one enterprise network. The Position involves extensive knowledge of network communications, architecture, security controls and configuration.Candidates for this position are highly motivated and have working knowledge of network operations, fault diagnosis, repair, installation, configuration, cabling, passive infrastructure, troubleshooting, project execution, and COMSEC Operations, as well as the ability to follow detailed policies and procedures. The ability to work in a dynamic, team-oriented, fast-paced and mission-focused environment is a must.What You'll Get to Do:-Provide Engineering and Implementation support to Projects as required.-Evaluating the communications hardware and software as we evolve the service to a DevOps construct.-Making recommendations to management on fixing the system and follow through with implementing proposed solutions.-Diagnosing and performing corrective actions to resolve problems in an operational scenario; performing research on vendor support sites, contacting OEM vendors to diagnose and resolve issues.Works as an Operations-focused Network Engineer on a team responsible for BAN/LAN/WAN Network Operations, troubleshooting, repair, installation, cabling, configuration, implementation, and integration of current and future NGEN-R network architectures as per approved processes and procedures.Provides COMSEC Local Element support to assigned locations, which includes managing COMSEC hardware/software assets and key inventories, loading keys into Encryption devices, installing, configuring, troubleshooting, upgrading, removing/replacing faulty equipment, interacting with the Government KOAMs and following prescribed procedures and processes related to COMSEC.Documents work activities/details per established tools and processes; maintains accurate site documentation.Initiates software upgrades and changes to the NGEN-R system and communications infrastructure as prescribed by Domain Architects, Design and Configuration Teams.Performs maintenance, troubleshooting, repair, and removal/replacement of faulty hardware using SOPs, TTPs, work instructions, vendor guidance, and other documented processes and procedures.Interfaces with the Network Operations Center (NOC) as required in support of incident troubleshooting and restoral.Supports network configuration/asset management activities, manages configuration drift, and accurately creates or modifies network documentation to reflect the as-is and/or to-be environment.Supports Cybersecurity requirements and implementation of security controls (STIG compliance).Coordinates network upgrades and planned maintenance activities with NGEN-R Program and customer stakeholders.Performs monitoring (health and status) of network systems and proactively identifies potential issues before they impact users; recommends and/or applies corrective actions to mitigate network issues.Position may require local area and/or overnight travel by car or air to assigned locations to conduct operations focused activities i.e. break/fix, COMSEC support, etc...You'll Bring These Qualifications:Requires B.S. Degree and 4-8 years of prior relevant experience or Masters with 2-6 years of prior relevant experience (relevant experience may be considered in lieu of Bachelor's degree.Must currently possess an active Secret clearance.Ability to travel up to 50% including possible OCONUS travel.Must have current IAT Level II Certification: Comp TIA Security+, Cisco Certified Network Associate-Security.Must have current Network Vendor Associate Level Certification is required (i.e. Cisco CCNA, Juniper JNCIA, etc...).Ability to be scheduled to work, or be called in to work during off hours and weekends to meet customer mission support requirements.5+ years' experience troubleshooting complex routing and switching issues.5+ years' experience configuring switches, routers, network appliances, WAN acceleration devices.Experience with multiple vendor routing, switching or wireless product lines.Strong understanding and in-depth knowledge of TCP/IP network/subnet addressingAbility to work independently or in a team environment to resolve technical issues in a dynamic environment.Customer service experience.These Qualifications Would be Nice to Have:Top Secret Security Clearance.MPLS experience.DevOps, CI/CD experience.Scripting experience (i.e. Python, etc...).Automation experience (i.e. Ansible, Puppet, Chef, etc...).SDN/SD WAN experience.Professional or Expert level vendor certifications.ITIL certifications.External Referral Bonus:IneligiblePotential for Telework:Yes, 75%Clearance Level Required:SecretTravel:Yes, 25% of the timeScheduled Weekly Hours:40Shift:DayRequisition Category:ProfessionalJob Family:Network Administration and OpsPay Range:"}