{"title":"Senior Software Engineer - Machine Learning (Expanse) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALssbn5QEbwJQBREleG7ODlN4vNQxAs56ZDoMFA2W7xkMd_jmeN4JB-woFB_IpgIrxEynW9whp-3T3XJgEu57LL9XbGXoYFT_Pq6cseZe7xUeMsqGKan-Xfiv4ypJAtUVW1FFsAUebkql9Gx2dB7Ea82pPR9adSO_8YfapHPgoCWWO91PqSIc3nocumULz-","source":"ziprecruiter","full_description":"Company Description Our MissionAt Palo Alto Networks everything starts and ends with our mission: Being the cybersecurity partner of choice, protecting our digital way of life. We have the vision of a world where each day is safer and more secure than the one before. These aren't easy goals to accomplish - but we're not here for easy. We're here for better. We are a company built on the foundation of challenging and disrupting the way things are done, and we're looking for innovators who are as committed to shaping the future of cybersecurity as we are.  Job Description Your CareerWe're looking for a Senior Software Engineer to join the Machine Learning team at Expanse, the latest addition to Palo Alto Networks Cortex. The Expanse Internet intelligence platform continuously surveys petabytes of data to find risks online and protect the world's largest organizations from malicious software and hackers. In this role, you will directly contribute to our mission by building AI/ML systems, models, and infrastructure that increases the quality, performance, accuracy, and effectiveness of our security products. You'll leverage your data and software engineering knowledge to build new features, deploy data-driven automations, and ultimately augment our teams with ML-assisted workflows.Your ImpactIncorporate feature engineering, data pipelines, and transforms to deliver data for ML model training and run-time inference servicesImprove ML scaling infrastructure for data ETL, model training and lifecycle, MLOps, batch and run-time processing, and inferenceCreatively analyze effectiveness of existing models to iterate and improveShip, support, debug, and secure systems in productionInteract directly with security professionals who use your software and AI systems on a daily basis to increase their effectiveness and the quality of their work Qualifications Your ExperienceA high level of comfort in at least one programming language (we use Python and Java), including delivering production-quality code and debugging in a production environmentExperience with delivery and maintenance of software in production environments (we use Kubernetes, AWS, and GCP)Conceptual thinking and creativity; you demonstrate an ability to consider various techniques to solve different modeling problems we faceAbility to collaborate and to convey complex technical concepts to both technical and non-technical stakeholdersDesigning and building data-driven applications backed by artificial intelligence (for example: recommendation systems, malware detection, behavior modeling, natural language processing, search, knowledge graphs, computer vision) is preferred but not required Additional Information Our CommitmentWe're trailblazers that dream big, take risks, and challenge cybersecurity's status quo. It's simple: we can't accomplish our mission without diverse teams innovating, together.We are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at [email protected]Palo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.Qualifications: Your Experience A high level of comfort in at least one programming language (we use Python and Java), including delivering production-quality code and debugging in a production environment Experience with delivery and maintenance of software in production environments (we use Kubernetes, AWS, and GCP) Conceptual thinking and creativity; you demonstrate an ability to consider various techniques to solve different modeling problems we face Ability to collaborate and to convey complex technical concepts to both technical and non-technical stakeholders Designing and building data-driven applications backed by artificial intelligence (for example: recommendation systems, malware detection, behavior modeling, natural language processing, search, knowledge graphs, computer vision) is preferred but not requiredResponsibilities: Your Career We're looking for a Senior Software Engineer to join the Machine Learning team at Expanse, the latest addition to Palo Alto Networks Cortex. The Expanse Internet intelligence platform continuously surveys petabytes of data to find risks online and protect the world's largest organizations from malicious software and hackers. In this role, you will directly contribute to our mission by building AI/ML systems, models, and infrastructure that increases the quality, performance, accuracy, and effectiveness of our security products. You'll leverage your data and software engineering knowledge to build new features, deploy data-driven automations, and ultimately augment our teams with ML-assisted workflows. Your Impact Incorporate feature engineering, data pipelines, and transforms to deliver data for ML model training and run-time inference services Improve ML scaling infrastructure for data ETL, model training and lifecycle, MLOps, batch and run-time processing, and inference Creatively analyze effectiveness of existing models to iterate and improve Ship, support, debug, and secure systems in production Interact directly with security professionals who use your software and AI systems on a daily basis to increase their effectiveness and the quality of their work"}