{"title":"Senior Software Engineer - Android","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI39QBu6-0cZ2FG8OniCsyy-m_QssU3zR5gKOKa1pz7pTrlQACZdM2wp875u2QujyqE-sOa1IR8WQdW9P3RpcRszYAz2y5FniADMiY41Gf_Jotxhf65GUUTqXTtF45Wk2dnnCI0FcVR9hKlxQ4k4mP5BTpRxYd_x-rqtnsX6Lt3IoOopWo0OKpdiH2VjiU","source":"ziprecruiter","full_description":"At Coretex we believe that technology should be used to create a safer, greener and more productive world. The world’s resources are under increasing pressure - to keep growing, we have got to figure out how to do more with less. We all have a role to play. Coretex is an industry-leading technology company that creates innovative mobile asset, supply chain and IOT (in our world we like to call it the ‘Internet of Transport’) solutions for organizations that operate in mission-critical environments.We are on a journey to grow our teams so this is an exciting time to join Coretex. Our company gives you the opportunity to make a difference and be on a path of continuous learning.The opportunity:We’re looking for an experienced Senior Engineer who is energised by our fast growing, innovative environment and has as much appetite for success and great customer outcomes as we do.As our Senior Software Engineer you will be bringing to the table your expertise and team mentoring as a ‘go to’ person and a source of inspiration to our intermediates and juniors. Reporting through to our Technical Lead this role, will see you maintaining and enhancing the core software platforms on our flagship products. You will be continually challenged to be the ‘best version’ of you and in return you will be joining a well-respected, collaborative and solutions-focused team.Curious to find out more …. we want you to figure out how to make a complex idea work- and you’ll thrive on the challenge of it. We only hire those that value team work and know how to take their work to the next level and push the boundaries.About you:You will be a highly skilled engineer with previous experience in Android development.You have strong proven experience in these technologies: Kotlin and Java, MVP, Rx Java, DaggerAPI Development experience or interest in technologies below would be beneficial.JavaScript ES8, node.js, TypescriptYou have an interest / experience in cloud architecture.Such as Azure, Kubernetes, and MongoDBGood understanding of Git source control.You thrive in a multiple technology environment and aim to learn, take ownership, simplify, and drive the Coretex technologies forwardYou are creative and will help drive continued excellence in your team by embracing a growth-mindset.You are driven to see our customers succeed as your iterations go liveHighly motivated and driven to excel, you will thrive in our fast growing, quickly changing environment. If this sounds like you, we are keen to hear from you.Coretex thrives on diversity and is committed to providing an inclusive environment for all our employees"}