{"title":"Plumbing Service Coordinator NEW!","location":"","salary":"","description":"","term":"$45,000 to $55,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIV5_zkIFCQFd4YuvE2vVx2SMscKEy89aKU0EVHwq7tisVetWwMlR2IIKgRM4VT1PpxQr4y7bLrL6etTPB6ZkjeDHtCpCMUQkNGDxvViJ2FCJYzVlqZsnTHcV3K8CCUs-xIQIc8oxbaXdxZjhA5JKYchemyEHKaQsojE6j0WW2RnH0ZyxAP6BLHD0LfMPMj","source":"ziprecruiter","full_description":"Plumbing Service CoordinatorJob SummaryStandard Fire Suppression Corp is looking for a professional individual to join our plumbing company in the pursuit of growth and future development within the organization. Time management as well as strong communication skills to effectively communicate with technicians in the field, office personnel, suppliers, and customers is required. As Plumbing Service Coordinator, you will oversee the scheduling and dispatching of all service requests; ensure regular and detailed communication to our clients regarding scheduling and ETAs, and debrief all service calls, ensuring proper protocols have been followed, follow-up work scheduled, and any issues communicated to management.Salary: $45,000 - $55,000+Benefits: Medical, Dental, Vision, Matching 401KLocation: 425 Grand St. New York, NY 10002.Job Duties and Responsibilities· Excellent communication skills· Scheduling, coordinating and dispatching technicians to work assignments· Prioritizing service requests, determining needs of customers and strategically matching the appropriate technician based on skillset and workload· Relaying accurate information to technicians, ensuing proficient, quality customer experiences· Creating awareness of opportunities wherever possible· Monitoring and reporting technician performance including time and attendance, call-back/non-chargeable visits frequency, and customer complaints to management· Reviewing completed service work orders for accuracy and completion before sending to the billing department· Providing superb customer service and managing customer communication regarding scheduling, status updates, ETAs, and parts availability· Maintaining accurate and up-to-date customer records including equipment data, contact data, memberships, opportunity status, recurring services, and job details· Managing customer concerns and working to resolve them efficiently and effectivelyJob Requirements· Positive, get-it-done attitude· Organized & detail-oriented· Ability to think strategically and look for opportunities· Flexible and adaptable at managing multiple priorities· Excellent time management skills· Motivated and able to work independently· Able to work under time constraints, budgetary limits, and pressures· Relentless and committed to providing a 5-star customer experience· Superb verbal and written communication skills· Tech savvy; able to utilize phone, text, email and software programs at a high level of expertise"}