{"title":"Technical Writer II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKHQjgNtfUybXUINlcSPa3dWtSX9_vWQMSsrVdH8oXedeDeQ2SClnSPWQu2DJMYfpPHegAeGoItuu7UJChfj_4eMZJYA4X6OkUQjoj85P3pKAEjlcC1OLlcV32JLLjjWb8MPLTeXaimhiO5iTyUlsCLF0MeVdf-ohjBQqcDOatE_cS2-NtJUfCDs7r9lakc","source":"ziprecruiter","full_description":"Job DescriptionPosition Overview: Catalent hires people with a passion to make a difference to the health of millions of people globally. Your expertise, coupled with Catalent's advanced technologies and collaboration with thousands of innovative pharmaceutical, biotech and healthcare companies, will help bring life-enhancing products to the people you know and love. Your talents, ideas and passion are essential to our mission; to develop, manufacture and supply products that help people live better, healthier lives. Interested in learning more about life at Catalent? Start hereTechnical Writer II (1st shift, M-F)This position requires the coordination and writing of batch reports or cGMP manufacturing batch records for clients. In addition, the responsibilities will include addressing client comments and revisions to the documents, supported by subject matter experts. The position is expected to possess a scientific background preferably in biologics, strong organizational skills, and a high attention to detail.This is a permanent, full time position. It is an hourly role. The shift is Monday-Friday, 1st shift. Our new, state of the art Madison, WI facility, with expanded mammalian cell line engineering and biomanufacturing capabilities utilizing single-use systems, offers increased flexibility and manufacturing scale to support our customers' growth. We offer a broad range of integrated formulation and analytical services to solve your most difficult development challenges in Biologics.Catalent is committed to a Patient First culture through excellence in quality and compliance, and to the safety of every patient, consumer and Catalent employee.The Role:Authors non-process batch production records (solution, column, bulk fill) to support cGMP manufacturing with basic technical understanding.Generates batch production records in order to meet financial and project milestones in accordance with applicable regulator guidance and site SOPs.Respond to internal and proactively work with SMEs to ensure comments are incorporated.Executed procedures of moderate complexity independently and with high quality.Work with different groups to optimize documents as required; helps to identify gaps from template.Support other activities within the Technical Writing Group as assigned.The Candidate:Education:Associate's degree in a STEM discipline and > 6 years related experienceBachelor's degree in a STEM discipline and 3 - 6 years related experienceMaster's degree in a STEM discipline and 0 - 2 years related experienceExperience:Applied knowledge of Word, Excel, PowerPoint, and other and applies technical knowledge to assist and train the site with Microsoft troubleshooting.Has basic knowledge of the principles, theories, and concepts applicable to a wide range of work in a discipline.Executes work plan/schedule developed with input from senior team member; can mentor or train junior team members.Ability to understand and write assigned SOPs and batch production records independently and with high quality.Excellent written communications skills with internal customers in a timely manner.Ability to identify aberrant/out of normal processes.Ability to address work issues at both an individual level and team level.Catalent Benefits:Defined career path and annual performance review and feedback processDiverse, inclusive culturePotential for career growth on an expanding team within an organization dedicated to preserving and bettering lives19 days of paid time off annually + 8 paid holidaysCompetitive salary with yearly bonus potentialCommunity engagement and green initiativesGenerous 401K match and Paid Time Off accrualMedical, dental and vision benefits effective day one of employmentTuition ReimbursementOn-site fitness center and wellness programsCatalent's standard leadership competencies that are used to interview and for Performance & Development: Leads with Integrity and RespectDelivers ResultsDemonstrates Business AcumenFosters Collaboration and TeamworkChampions ChangeEngages and InspiresCoaches and DevelopsCatalent offers rewarding opportunities to further your career! Join the global drug development and delivery leader and help us bring over 7,000 life-saving and life-enhancing products to patients around the world. Catalent is an exciting and growing international company where employees work directly with pharma, biopharma and consumer health companies of all sizes to advance new medicines from early development to clinical trials and to the market. Catalent produces more than 70 billion doses per year, and each one will be used by someone who is counting on us. Join us in making a difference. Catalent is committed to the health and safety of its employees, visitors and the customersand patients we serve. As a result of the global pandemic, we have modified many of our recruitment and on-boarding processes to maintain everyone's safety. The Human Resources teams will communicate all necessary safety processes and procedures throughout each stage.personal initiative. dynamic pace. meaningful work.Visit www.catalent.com/careers to explore career opportunities.Catalent is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation or gender identity. If you require reasonable accommodation for any part of the application or hiring process due to a disability, you may submit your request by sending an email, and confirming your request for an accommodation and include the job number, title and location to DisabilityAccommodations@catalent.com. This option is reserved for individuals who require accommodation due to a disability. Information received will be processed by a U.S. Catalent employee and then routed to a local recruiter who will provide assistance to ensure appropriate consideration in the application or hiring process.Notice to Agency and Search Firm Representatives:Catalent Pharma Solutions (Catalent) is not accepting unsolicited resumes from agencies and/or search firms for this job posting. Resumes submitted to any Catalent employee by a third party agency and/or search firm without a valid written & signed search agreement, will become the sole property of Catalent. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral. Thank you."}