{"title":"          Accounting Manager         ","location":"","salary":"","term":"Full-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAJ8kW8uTf9hU5oaFnXbrcFeRodzgL6imU1aVqHl16Qni6CHknWT9V-JScqah9xoYLFhGpNwJtqvgNXjUncp59PgxNsMv2NIBWgicaDq0ysjHDitrh4tf0RywUNwXcm2vAvs0tpXYMqaemjA_XMSySCKYft6K0tcTWxoPEIIlMpooq5vcP5X1RS9_RYKIOwk","source":"ziprecruiter","full_description":"\n        We are looking for a hands-on accounting manager/finance manager. To be accountable for the following tasks:Weekly Cash Flow, GL preparation & review, financial statement preparation and reporting, financial consolidation, weekly eStaff reporting, royalty & commission reporting, working with our 3rd party accountants to prepare state, federal and international tax preparations, prepare sales quota plans and break even modeling, maintain product pricing models, maintain price list file, assign sales allowance control numbers & reconcile, credit checks, month end, quarter end and year end finance processes. There are two others in our accounting department at the moment.Ensure that all the balance sheet accounts are fully reconciled and also take responsibility for our global consolidation.Special requirements for this project:- Proficiency in English both spoken and in writing- Expertise in accounting area such as general ledger, accounts receivable, accounts payable, financial statement preparation- Knowledge of accounting specialization such as federal and state tax codes for withholding, sales tax, etc.- Experience with SAP R/3, highly proficient with Excel & Microsoft productivity tools.- B.S. Degree in Accounting/Finance; preferably a CPAIn your proposal, please provide a short description of your accounting experience and why we should consider you. Also tell us about another client and how your skills made an impact on that business.About Visioneer:We are small medium size global business where you could make a huge difference in what we do daily to transform the lives of our customers. We provide intelligent, secure technology to transform content from physical world into digital content shared over cloud, mobile and across the enterprise. Our global customers utilizes our technology to simplify and transform their business by unlocking information trapped in paper to onboard to workflows to address their own digital transformation. Customers banking/finance, healthcare, government, insurance, transportation and high tech all benefits from our experience which spans over 25 years in digitizing business processes for document recognition, data capture, and classification. Come join us on this journey to continue to make a difference in the lives of our global customers.We're headquartered in Fremont, CA, San Francisco Bay Area.\n      "}