{"title":"Cisco Network Engineer CCNP Collaboration NEW!","location":"","salary":"","description":"","term":"$48 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAJqZqn8pnYB6NEPX0uX-lmchY__JU_oeWsZqsVAlGvyDkAppk9yhDLj4t_s6rT6_5u3lga2VvQx61zy3cuIJBBYxrLnvdb8S8aOyDbLoJyqqf5m-T6EJ29Cq7iwpufKtlV4k7LIVhyXdZViFt2hyhekai7mEj7uQExwzfnk2w2fitwN1ANR92BeR953g5fF","source":"ziprecruiter","full_description":"AristaHire is seeking a Cisco Network Engineer CCNP Collaboration Certification a must.Description - Looking for a Cisco CCNP Engineer for a Federal Contract in the San Diego, CA area. CCNP Collaboration Certification and HCS-D Experience a must also must be a US Citizen. Certification that can be verified a must.Responsobilities:Provide all user configuration/programming necessary to onboard new users to Cisco’s HCS-D platform/serviceAssist with the transition of 320 users from existing CM and legacy VTC to HCS-D, breakdown is 20 HCS-D & D-3 licenses from the Video project, plus 100 D-1, 100 D-2, & 100 D-3 licenses for a customer Existing HCS- D-3 Licenses from Cisco Video project to be transitioned to SIP/IPExisting CM users licenses on existing Call Manager to be transitioned to SIP/IPExisting CM users licenses on existing Call Manager to be transitioned to SIP/IPSupport the transition of Video user off the existing RDT&E Network that currently supports HCS-D video users to the Private SIP/IP NetworkProvide Tier 1 helpdesk training support to Navy staff to ensure they have the skill and knowledge needed to support Tier 1/First call activities in support of UCProvide End User Training support to users with 4 one-hour classes over 3 days (a total of 12 one-hour courses for users to choose from)Support Helpdesk for 1 week after the transition to assist staff with transition questions/issuesSupport the porting of DID numbers by helping the customer obtain existing network information (trunks, routing, etc.) and documentationQualifications:Familiarity with researching communication networksFamiliarity with architectural specificationsPrevious experience with HCS-D preferredStrong troubleshooting and critical thinking skillsStrong attention to detailCisco CCNP Collaboration Certifications that can be validatedJob Type: Full-time contractSalary: $48.00 to $54.00 /hour"}