{"title":"Associate Technical Writer - Packaging","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL9TJt9_gvWbEEfT6aRDkKuNwcovaGEIpQr7NsjC8GUOZE7PeUrhPPdOydNwHwnZuL3qBTrUkaGg0IORoqa2qkge7zMbqGY-4NVUWvsdUrg5G1jC6XyxzIHzmm4_oJ3pmE3PzF2ZzxQ6YbH3blXoniI7ePj6m0C892RMeMhtYmEm39q4TgLpMcpTHJK7-3J","source":"ziprecruiter","full_description":"Job Description Position Overview: Catalent hires people with a passion to make a difference to the health of millions of people globally. Your expertise, coupled with Catalent's advanced technologies and collaboration with thousands of innovative pharmaceutical, biotech and healthcare companies, will help bring life-enhancing products to the people you know and love. Your talents, ideas and passion are essential to our mission; to develop, manufacture and supply products that help people live better, healthier lives. Interested in learning more about life at Catalent? Start here (http://www.catalent.com/index.php/about-us/Catalent-Careers2) The Associate Technical Writer will be based at our Bloomington, IN site and will be responsible for assisting specialist and engineers with specific duties usually associated with client projects and processes through documentation.As a Technical Writer with Catalent you will initiate and prepare batch records as well as prepare material and product specifications based on project requirements to ensure the patients are delivered the appropriate drug at or above regulation standards.Catalent Pharma Solutions in Bloomington, Indiana is a state of the art, GMP manufacturing facility, providing one million sq/ft of a drug substance manufacturing, drug product manufacturing, and related pharmaceutical services. This award-winning facility helps customers accelerate biologic drug development programs and bring better treatments to help patients live better, healthier lives. This is a fulltime role, working Monday - Friday 8AM-5PM Catalent is committed to a Patient First culture through excellence in quality and compliance, and to the safety of every patient, consumer and Catalent employee. The Role + Write, revise, and review documents including batch records, Forms, Standard Operating Procedures+ Maintain standardized templates and modules used in the generation of technical documents+ Ensure documents are reviewed and approved through electronic document system+ Follow up with reviewers and approvers (subject matter experts) as necessary+ Create and manage Change Control documentation and batch related deviations+ Supports writing technical documents+ Researches information and acts as mediator when information is missing in documents The Candidate + Associate's Degree - Required+ Bachelor's Degree in Communication or related field - Preferred+ 0-2 years technical writing experience+ GMP Preferred+ Excellent grammar and writing skills - Required+ Proficient computer skills+ Advanced/expert knowledge of Microsoft Word - Required+ Customer service experience Catalent's standard leadership competencies that are used to interview and for Performance & Development: + Leads with Integrity and Respect+ Delivers Results+ Demonstrates Business Acumen+ Fosters Collaboration and Teamwork+ Champions Change+ Engages and Inspires+ Coaches and Develops Catalent's facility in Bloomington provides a fully integrated and unique model for process development, clinical and commercial mammalian cell culture manufacturing, formulation, parenteral drug manufacturing and packaging under one roof. The award-winning facility provides clinical and commercial bulk drug substance and drug product manufacturing, including liquid and lyophilized vials, and prefilled syringes, along with an array of support services. The Bloomington site is proud to offer the following: + Defined career path and annual performance review and feedback process + Diverse, inclusive culture + Potential for career growth on an expanding team within an organization dedicated to preserving and bettering lives + Competitive salary with quarterly bonus potential + Community engagement and green initiatives + Generous 401K match and Paid Time Off accrual + Medical, dental and vision benefits effective day one of employment + Tuition Reimbursement + On-site fitness center and wellness programs Catalent offers rewarding opportunities to further your career! Join the global drug development and delivery leader and help us bring over 7,000 life-saving and life-enhancing products to patients around the world. Catalent is an exciting and growing international company where employees work directly with pharma, biopharma and consumer health companies of all sizes to advance new medicines from early development to clinical trials and to the market. Catalent produces more than 70 billion doses per year, and each one will be used by someone who is counting on us. Join us in making a difference. Catalent is committed to the health and safety of its employees, visitors and the customers and patients we serve. As a result of the global pandemic, we have modified many of our recruitment and on-boarding processes to maintain everyone's safety. The Human Resources teams will communicate all necessary safety processes and procedures throughout each stage. personal initiative. dynamic pace. meaningful work.Visit www.catalent.com/careers to explore career opportunities. Catalent is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation or gender identity. If you require reasonable accommodation for any part of the application or hiring process due to a disability, you may submit your request by sending an email, and confirming your request for an accommodation and include the job number, title and location to DisabilityAccommodations@catalent.com. This option is reserved for individuals who require accommodation due to a disability. Information received will be processed by a U.S. Catalent employee and then routed to a local recruiter who will provide assistance to ensure appropriate consideration in the application or hiring process. Notice to Agency and Search Firm Representatives: Catalent Pharma Solutions (Catalent) is not accepting unsolicited resumes from agencies and/or search firms for this job posting. Resumes submitted to any Catalent employee by a third party agency and/or search firm without a valid written & signed search agreement, will become the sole property of Catalent. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral. Thank you. Catalent = Catalyst + Talent Your talents, ideas, and passion are essential to our mission: to develop, manufacture, and supply products that help people live better, healthier lives. Join us!personal initiative. dynamic pace. meaningful work.Catalent is the perfect place to grow your career if... + You enjoy the fast pace of a start-up, but want the opportunities and stability of a growing, publicly traded company (Listed on NYSE: CTLT).+ You want meaningful work. From cough treatments to cancer-fighting drugs, biologics, and vitamins, we help develop, launch, and supply over 200 new products each year - more than any branded drug maker in the world!+ You want to plant your career in a growing company. Over the last five years, Catalent has re-invested more than $2 billion back into the company and its people.+ You are excited about learning, collaborating, and growing alongside a global diverse team. Our team of more than 11,000 comes to work every day ready to overcome new challenges with teamwork, advanced technologies, and a passion to deliver by putting patients first.+ You want to make a global impact! From North America to Europe, Asia to Latin America, we have innovative science and manufacturing teams who are looking (https://catalent.wd1.myworkdayjobs.com/External) for YOU!+ See how our teams are making a difference, while growing their careers and fulfilling our mission by putting patients first every day here (https://www.youtube.com/playlist?list=PLuUGqEwwnH7hBwFlrsfSOH\\_raQHu4hOBK) ."}