{"title":"Senior Infrastructure Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKEACPwnVhvRKm25xwLSDWqp1pPPwsMROTfQFq1fFJLaFA1cE__HXHknmDNVA_B3yPUP_FRyDP0ObCmKd2EakNvd8THH4lnO978gt1mAz9yRPcl3sYkcAGBl9YfaRQXJMIz__zTuZ_xfD9SUW2qGQa37dUL1HDlESlCR_x1HIz18b1axHsaYxj_5QLL1_uO","source":"ziprecruiter","full_description":"We Have A Spot Just For YOU: TSI Healthcare® is a Value-Added Support Organization for NextGen® Healthcare focused on delivering products and services designed to improve patient care through technology. Our family of system experts helps empower physicians of all specialties to improve care, increase efficiency, and maximize profitability. We take pride in delivering “concierge-style” support and service.You’ll love working at TSI Healthcare because:We like to Go and Do. We encourage you to take time to recharge outside of the office. You’ll have PTO to explore new places, and each year you earn additional PTO to use.We’re not just employees. We’re people. We offer insurance coverage (health, vision, and dental), 401K/tax savings plans for retirement with EMPLOYER MATCH, and there’s no shortage of snacks, and coffee in our kitchen, along with birthday celebrations and team lunches.We’re creating an environment where you thrive. Our customers are diverse, and from all over the world, we’re building a team that is, too. Through initiatives like our Company Culture events, we establish a cultural environment that gives people the emotional and physical space to bring their best selves to work.We offer competitive compensation packages. We deeply value the talent our team brings to the table and believe that fair and equitable total compensation packages are part of our commitment to everyone who works here.General Job DescriptionThe Network Services Group provides customized hardware and operating environment solutions for customers. The Network Services Group also detects and responds to customer issues and requests to ensure efficient and effective workflow for our customers, ultimately insuring overall client satisfaction with TSI Healthcare. All members of the Network Services Group must be able to act independently and effectively to analyze, determine, implement, solve, and follow up on all customer requests and issues.Senior Infrastructure Engineer (Chapel Hill, NC) As one of the fastest growing companies in the healthcare industry we are excited to be recruiting for an energetic, enthusiastic person to join our team and be a part of our success.The Senior Infrastructure Engineer will be responsible for the administration, monitoring, and maintenance of: • system servers • switches and routers • virtual environment • SANCandidate should be able to: • build, configure, and troubleshoot new and existing servers, applications and network infrastructure • recommend software and hardware enhancements • test and monitor company DR/BCP plan.Qualifications/ResponsibilitiesProficiencyMicrosoft Windows Server and Active Directory AdministrationCISCO ASA Administration: NAT Rules, Access lists, VPN tunnelsVMware Enterprise Products: VMware View/Horizon, vSphere 5.0+NetApp Administration: managing aggregates, volumes/datastores,​Standard/Recommended Performance Metrics for NetApp and VMwareCandidate should be able to: • build, configure, and troubleshoot new and existing servers, applications and network infrastructure • recommend software and hardware enhancements • test and monitor company DR/BCP plan.Required Skills: • 6+ years experience in Network Engineer role • Strong knowledge of VMWare vSphere • Solid Experience with Netapp SAN/NAS • Experience managing Cisco routers, switches, wireless devices and ASA's • Familiar with Windows Server 2008 and Active Directory • Performance Monitoring on both Netapp and Vmware platforms • Ability to solve highly complex problems and work independently • CCNA, VCP a plusDesired skills: • Cisco Phone Systems • Cisco: BGP,VPN's • Netapp: Snapmirror, NFS • Vmware: Vsphere 5, DRSEducation and TrainingBachelor’s Degree in Computer Science or equivalentExperience7-10 years experience At TSI Healthcare, we are confident that our people are the reason behind our success.  We truly value you as an employee and part of our professional family. Our goal is to offer the very best healthcare possible to you and your loved ones. With this in mind, we have developed a comprehensive employee benefits package designed to protect you and your family. Medical, Dental, Vision, Life, AD&D, LTD, 401(k), and Allstate voluntary supplemental options."}