{"title":"Network Engineer L3- DOD NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIHzOhIVm8D62_gF-uqM0B0Sx3HM_BOmUeH0L4A8ifpoipbY3k9wb8wwFGmRUAm0IgRDp-nBdgqWun8E5WtEGtdmyAfcO-D7Bv8sdsiKSII0gzFzC7MvyG78FCnDHGstJsgoC5pV1dmwz3vv02wvhNr77gNgy_dNWgU9izDiweCSZywqTBwDuI5GKLaLYtA","source":"ziprecruiter","full_description":"Network core technologies experience in Operations and deployment, Design.The candidate will: Have the ability to understand and interpret complex business and IT requirements, -6Years of relevant experience in networking technologies. (depending on their experience level the engineer would be placed in various streams) Willingness to work in 24X7 shifts. (for US resources the 24x7 should be informed as ability to work on-call as needed) In-depth experience with TCP/IP and packet sniffers Sound understanding of L2 switching L3 traffic forwarding Strong working experience on Cisco / Juniper / F5 / Arista platforms Understanding of MPLS, L3 VPNs and VRFs, STP, HSRP, CDP, UDLD Working knowledge of BGP, OSPF Working knowledge of tools like TFS / VSO Ability to debug protocol issues. IPSEC VPN experience Ability to work independently and as part of a team. Excellent verbal and written communication skills Respond to high priority incidents, troubleshoot with engineers from various groups, gather and provide forensic data for security-based incidents, and create post-mortem documentation as needed. Configuring Routers / Switches / Firewalls / Load balancers Azure networking concepts Identify incident patterns and drive for problem resolution CCNP,CCIE certifications are preferableCisco Routing and Switching at CCNP/CCIE Level Cisco ,Juniper,F5,Citrix hardware and implementation Knowledge Excellent inter-personal skills including the ability to influence peer group good negotiation skills. Proven ability to prioritize competing demands for time and resources Have the ability to understand and interpret complex business and IT requirements and assess future Managing Enterprise Network project implementations."}