{"title":"REMOTE Senior Software Engineer - Ruby on Rails","location":"","salary":"","description":"","term":"$120,000 to $140,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKDQEHSF1GH-sA_KbipuqkQR7dCs7Q8rl-V-GSrT7tT0cYsK2CklyhQSW1RLPm6KyBVSrwNLLK3lbsgvkKHLWwIu4X7lUCX6nWXjr02O4kBdUM_JUQgNja9-rZGzJp7h3PA22zKFptHrvfDabmgjTgzDN7d406acQLZEKzRfeVTcIdaVqfnymcPgcl0wb7U","source":"ziprecruiter","full_description":"REMOTE Senior Software Engineer - Ruby on Rails If you are a Senior Software Engineer with Ruby on Rails experience, please read on!Headquartered in Salt Lake City, we are a booming SaaS start-up focusing on fintech solutions! Due to growth and demand for our services, we are urgently looking to add a Senior Software Engineer to our diverse and growing team!Top Reasons to Work with Us- HUGE opportunity for growth!- Competitive base salary!- Cutting-edge tech!- Amazing company culture!What You Will Be Doing- Architecting new features on SaaS products- Building out automated systems with large datasets- Maintaining automated tests- Working with a small product-driven team of engineersWhat You Need for this Position- BSCS or equivalent technical degree preferred- 5+ years of professional experience in backend software development - Strong experience with complex Rails applications- Experience with automated testing using Rspec- Experience with large datasets using PostgreSQL, Redis, AMQP, etc.- Experience with AWSWhat's In It for You- 100% remote work- Competitive base salary- Comprehensive benefits package (Medical, Dental, Vision)- Unlimited PTO- Stock/Equity options- Cutting-edge tech- Join booming start-up at critical stage of growth- Fun and innovative company cultureSo, if you are a Senior Software Engineer with Ruby on Rails experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}