{"title":"Lead Mobile Developer - iOS/Android Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJF2X_FnnJ4ojVG9aFn4nPCCKjNGh6p2XZAa12Nb3qhvwvqzjAouzueAt9R5iV04QoTwAUeOFExoQdsMoDF3jzRCjFgF2M5Toh0g7mVkdb8hstEDrm0FPuH3lJAWGQiHG8kVWxUmBIk6C48iWZyQpgt_gOPG7KpcsaDUxLCwf5rTRQJyMJyrCVqTFP_wB6r","source":"ziprecruiter","full_description":"At Myia we are building a platform that will fundamentally change US healthcare and prolong the lives of those with chronic disease. As we expand our functional and technical teams, we're looking for passionate individuals to impact how we achieve this momentous task.   Our intelligent remote health monitoring platform is designed with the support of patients and clinicians to address serious chronic conditions such as heart failure, hypertension, and diabetes. We transform streams of personal, vital health data into actionable insights on patient conditions in real time, empowering care teams to take better and more timely action, prevent costly medical events, and ultimately set new standards of care.   Founded in June 2017, we've raised over $15 million from Mercy, the American College of Cardiology, and Silicon Valley VC's.   We embrace open and frank problem-solving, collaborative design thinking throughout the company and practice agile development.   We offer a flexible working schedule, fantastic health benefits, office perks, and health and wellness programs. We are  looking to hire a Lead Mobile Developer to play a key role in the design and architecture, development and delivery of a range of native app solutions and oversee the development of new applications. You will manage the development from initial design to release, managing third party engineering vendors, and growing and leading a small, highly-skilled technical team. Requirements and Skills: Strong background in native mobile development for Android and iOSDelivering apps through the full Software Development lifecycle; from technical appraisal of requirements, through to delivery and testing.Mobile design patterns and SOLID principles.Strong experience with refactoring of existing codebaseTDD / BDD Architecture Patterns Continuous Integration and continuous delivery.Strong use of Design Patterns is a must.Comfortable implementing unit/performance/integration TestingKotlin, Android SDK, Swift, Objective-C and other mobile frameworksExperience with cross-platform frameworks such as native script, react native and flutter.JSON formats and integrating with other systems and services.RESTful APIs.Use of a project management tool such as Atlassian suite Qualifications: 8 + years of experience in direct mobile developmentCloud based development through AWS or equivalent Experience of approaches to mobile testingExperience managing off-shore and remote teamsMedical /Health technology and bluetooth device connection a mustExpectations The ability to think through problems and experiment to arrive at elegant solutions. Adept ability to switch modes between collaborative big picture problem solving and independently focussing on the details. Communication that is clear and open, providing helpful and actionable feedback."}