{"title":"Field Service Engineer IC/LC/CAD - Central NJ NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKeewb7vS4BIBrvjronkjRpm0iYK_m3O8L-lWwP5bEKzu6-9QSxf2o3HG1IODwVJiLOvkbUDOgXjGTXddaAn1vxFzDihs5UFAXE_MnCG7ardWcoykE3cVEkxx2wz66RQXe7eYg4gCdjF3_9Md624TMMCGKDObVNSM6jySmSGKr72By6DvZnuQQ6elNfD2M_","source":"ziprecruiter","full_description":"Job Title: Field Service Engineer II Location: This position will remote and based out of the central NJ area and will be expected to travel to NJ/PA/NY.AboutWhen you're part of the team at Thermo Fisher Scientific, you'll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and you'll be supported in achieving your career goals.DivisionUnity Lab Services provides a single source for integrated lab service, support and supply management. Our customized service offerings and world-class service experts have the flexibility and experience to uniquely address your business needs. Whether you are looking to arrange for service on one instrument or are seeking resources to manage service and support for all your labs, there is a Unity Lab Services solution to meet your business needs.To deliver service solutions without boundaries, programs are offered for all instruments, equipment and laboratory supplies, regardless of vendor. As a laboratory partner, Unity Lab Services provides researchers what they need, when they need it, to maximize their ability to focus on science and drive innovation. Let our expertise complement yours. Unity Lab Services Provides:Simple Access to Integrated Service Delivery: Unity Lab Services provides complete solution design and implementation for seamless laboratory service and support management with one partner.One Solution, Regardless of Vendor: Service and support programs for all instruments and supplies, regardless of manufacturer.How will you make an impact?As a Field Service Engineer, you are responsible for managing all aspects of field service support, customer relationship management and providing detailed reports to the customer. The successful candidate will provide complete services on chromatography equipment systems(Ion Chromatography/HPLC/CAD), including installation, repairs, preventative maintenance, and instrument qualifications. You will also coordinate resources and work with the Service Team to deliver technical expertise to customers with high-quality results to ensure high-customer satisfaction.This position will remote and based out of the central NJ area and will be expected to travel to NJ/PA/N.What will you do? Perform on-site installation, repair, preventative maintenance, qualification, and validation of chromatography equipment systems(Ion Chromatography/HPLC/CAD) at various customer labs across the region. Provide phone, augmented reality, and live support to resolve customer service requests. Maintain schedule, track service calls, manage personal parts inventories, and create accurate service reports. Responsible for troubleshooting and diagnosing customer's chromatography issues by utilizing instrument performance reports, field representative documents and diagnostic reports. Perform repair, replacement, or other corrective action. Coordinates problem resolution with factory engineering, customer service, and other personnel to expedite repairs. Report technical problems and trends affecting future design, production, service, and maintenance processes, and recommends modifications to eliminate future problems. Provides a communication link between the customer and the company to help ensure that effective service is provided to the customer. Regularly attend factory provided technical and service training on newest and latest chromatography products developed by Thermo Fisher Scientific. Provide accurate and timely completion of quality training, service reports, expense reports, company provided car maintenance and mileage reporting, as well as other various administrative tasks. Other duties may be assignedHow will you get here?Education Minimum educational requirement BS and/or graduate degree in Sciences, Engineering, Electronics or equivalent experience.Experience Hands on experience operating analytical equipment, i.e. chromatography and mass spectrometry Experience with method development and analytical chemistry preferredKnowledge, Skills, Abilities Must have valid driver license Ability to travel 20-50% overnight domestic travel Ability to work overtime and/or outside regular business hours, and/or on-call work Regularly lift and/or move up to 50 pounds; and occasionally lift and/or move 100+ pounds with lifting teamAt Thermo Fisher Scientific, each one of our 75,000 extraordinary minds have a unique story to tell. Join us and contribute to our singular mission-enabling our customers to make the world healthier, cleaner and safer.Apply today! http://jobs.thermofisher.comThis position has not been approved for relocation.Thermo Fisher Scientific is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, creed, religion, color, national or ethnic origin, citizenship, sex, sexual orientation, gender identity and expression, genetic information, veteran status, age or disability status."}