{"title":"Entry Level Field Service/Customer Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL4K8dt9txzB4EtvbIZRGklJscztKpfEVY6SJNAVCh3ZL4S4VkkupqmaXq4NfheGLHLfCZctlLq2alLw5vrvK_qV8PHkpsPWlpE8Shp93wxTMZRITRSf2Sxr2-sNfHKBJOiz4vV-mYXJtKEOLsyZEcmqMg3n2eZEba2YCWyNgyoBI5LlYXHBYAvMdlVRqez","source":"ziprecruiter","full_description":"Applied Materials is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality, and our field service engineers are positioned in the frontline - Installing, supporting and optimizing complex systems and machinery in our customer sites around the globe. Our machines combine advanced electronics, lasers and optics, robotics, mechanics, chemistry, controls, computing and software, and our field service engineers master these fields together with customer facing skills, and grow throughout their careers as they advance in rank and knowledge.As an Applied Materials Customer Engineer you will work side-by-side with our customer inside their factory. You will Install, Maintain, and Repair the most advanced Semiconductor Manufacturing systems in the world.During a routine work day, you may be working on systems that incorporate:RoboticsHydraulicsThermal SystemsLasersAdvanced Control SoftwarePneumatic ControlsGas &Chemical Delivery SystemsComputers and NetworkingHigh/Low Pressure SystemsScanning Electron MicroscopesPrecision OpticsHigh VacuumAll of this within an ultra-clean environment that is much cleaner than an operating room in your local hospital! TYPICAL JOB DUTIES:• Installation and integration of multi-million dollar precision wafer fabrication systems thru customer handoff• Utilize advanced tools (Oscilloscopes, DVM’s, Advanced Software Diagnostic’s, etc.) to ensure that maintenance and calibration are perfect• Review equipment engineering specs and provide feedback to the factory for improvements• Build and maintain customer satisfaction through clear, consistent communication and the sharing of collective \u0003knowledge.• Consistently demonstrates safety as a value• Opportunities for global travel to support our customers, manufacturing and/or R&D engineering labsWORKING CONDITIONS:• May be exposed to cramped work space, mechanical, electrical, and/or chemical hazards. Requires attentiveness to \u0003safety precautions at all times.• Occasionally required to work rapidly for prolonged periods of time. Will routinely bend, stoop, reach, or walk.• Will be required to work overtime and/or travel on short notice, including unscheduled call-in from home and work other shifts as needed.• Opportunity to work compressed shiftsSKILLS:• Capable of operating in high pressure and/or ambiguous situation• Ability to solve complex electro-mechanical problems• Demonstrate creative problem solving to generate abstract solutions• Ability to routinely lift, pull, or push objects weighing up to 50 lbs. with or without accommodation.• Ability to effectively use hand tools, meters, scopes, and other pertinent specialized equipment.MINIMUM REQUIREMENTS:• ASEET and 3-5 years of electro-mechanical experience, or equivalent, or BSEET and 2-4 years of electro-mechanical experience, or equivalent.• Requires current driver’s license and passport. Must be willing and able to travel, including internationally.• Flexibility to work on shifts/overtime/stand-by/on-call/holidays when required.Applied Materials is committed to diversity in its workforce including Equal Employment Opportunity for Minorities, Females, Protected Veterans and Individuals with Disabilities."}