{"title":"          Software Engineer NEW!        ","location":"","salary":"","term":"$40 to $50 HourlyContractor","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAKG6FXdPWLv3Yaizyyzq2cSme0DHiC0Ee_3ZEbthfoiAxrdKZdcy9eFHG4Uh6C2grfm47pdQzsUmcbaSmGlRb265ysgodEyj2hnHp231JQ23FV3bBtwmcp-xTTHXWCP6JuYRCL80R38qGoR8zFnTu5KM7Nx6UZIGZWRuX9NMZMzKoiEMuSJ9eELr9Lew9bW","source":"ziprecruiter","full_description":"\n        Jr. Software Engineer- Will be working remotely and onsite in Santa Clarita, CA.Looking for an Junior software engineer to support the data analytics group to gain advantages on the race track with improved performance and efficiency. We work with internal customers on applying data analysis processes to get results quickly and consistently from engineering data.As we move more of our applications to distributed systems, we have a need for a full-stack engineer with a front end focus. Experience with any modern web development stack is required.ResponsibilitiesParticipate in the redesign of monolithic applications to distributed systems focusing on the front end. Developing single page UI’s that are robust, scalable and performance minded. Connecting UI to preexisting process intensive remote backend services. Responsible for testing and documentation.Qualifications + BS in STEM preferred or 4 years of relevant work experience.REQUIRED:  + Strong in a front end framework. JS (Angular, React, and/or Vue), .NET Core, etc. + Working knowledge of C++, C#, or Python + Working knowledge of software version control (Git/GitHub)+ Experience with software development including implementing designs and validating implementations against the original requirements + Working computer science knowledge, including object-oriented software design patterns + Strong verbal, interpersonal, and written communication skills PREFERRED: + Basic understanding of SQL / NoSQL+ Familiarity with both Windows and Linux/Unix/MacOS+ Experience with setup and networking of resources in Azure / AWS etc.+ Experiences connecting / creating API’s+ Experience with VB and MATLAB+ Some understanding of COM/DCOMMust have the ability to work in team environment with minimal supervision, be self-directed, detailed oriented who can effectively work well under pressure in a diverse environment.Proprietary - US CITIZENSHIP REQUIRED\n      "}