{"title":"Experienced Diesel Mechanic","location":"","salary":"","description":"","term":"$25 to $30 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIa9s0lHEdohc0Sgz95xj7J27caedKsiblp40_G6lmaAIB2RUucH_rARp_x7oUHwpuXf8JxFabR_xJP1ju6Ztx0CJPxAEtDbKzQJSO8jasZHh5mz9PWK9yIDNtMGuXBa9oy7r3q9E-X_zx0YdutibuePSVFAQmbc0ETL-tmOUl9iPUxw0CyGjoPoLdd2DM","source":"ziprecruiter","full_description":"Job DescriptionPartners in Trucking, Inc is looking for a hard working dependable, experienced diesel mechanic to add to our team. As a teammate you will be maintaining and repairing over the road tractor and occasionally trailers.ResponsibilitiesPerform assigned tasksDependabilityThe ability to be on-call for break downs and or needed repairs in the shop. This is a shared responsibility and is weekly depending on the number of mechanics currently on staff.Clearly and accurately fill out paperwork such as work orders, time sheets and vehicle inspections.Notify supervisor if shop equipment is not serviceable or presents a safety hazardReturn shop tools before the end of the shift in a clean condition ready for next useShop Sanitation / Maintenance; complete cleaning and organizing of shop utilizing all cleaning equipment available. Scrubber, Hotsy, Cleaning bay.Must have own hand tools up to one inch and keep an inventory of such to perform repairs on Class 8 tractors/ hostlers and trailers.The ability to drive our service truck to a designated location to repair a broken down vehicle in any type of weather conditions.The ability to run to a vendor to procure needed partsProfessional conduct at all timesTake advantage of all opportunities to attend schools and training sessions in order to upgrade technical competence.Cooperation with othersKnowledge, Skill, and abilitiesUnderstanding the safe and efficient use of hand and power toolsUnderstanding of common shop hazardsUnderstanding the hazards of chemicals such as oils, antifreeze, solvents, and battery acidsmusts be able to speak, read, and write in EnglishThe ability to accurately troubleshoot and repair: tires, suspensions, frames, differentials, drive lines, transmissions, clutches, engines, accessory electrical and pneumatic systems, HVAC systems, pneumatic and hydraulic brakes and lighting systems of tractors and trailers.Basic fabricationMust be able to pass pre employment drug and background screen.Must be able to effectively operate computer systems to complete essential job duty functions. Troubleshoot and perform failure analysis of the component parts on company vehicles.Education/ ExperienceHigh school diploma or equivalentDOT inspection Certified or at least one year verifiable experience performing truck and trailer annual inspections.Brake Inspection and repair certified or at least one-year verifiable experience performing truck and trailer brake inspections and repair.Certificate or diploma in diesel power mechanics preferred.Prefer 5 yrs experience preferredDrivers LicenseHave no conviction for driving while intoxicated or under the influence in the past 5 yrsHave no more than 4 moving violations in the past 36 months, and no more than 2 moving violations in the past 12 monthsHave no preventable accidents involving a fatality with the last 3 yearsHave no excessive speeding, involving any single offence for any speed of 15 mph or moreHave no reckless drivingHave no hit and runShift available: 8am-4:30PM - Monday through Friday. Alternating on call week with other mechanics.Pay based on experience. $25 to $30 an hour if all criteria is met.Additional $250 a month King soopers card based on performance and attendance.Employee health benefits, dental and vision available after 30 days.Employer pays percentage of health insurance for employee only, however family coverage is available at expense of employee.Job Type: Full-timePay: $25.00 - $30.00 per hour"}