{"title":"Mobility Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKeEJKTrvpj-h7gaW4wDBjsJHPxjRIViVTaRWFXiyiup8XBiI1EsR8eNxsHHaAaOvNu7jc6qz6XPxq8YasERLpD1CQydJMimeOVBFuqQFfrL0wg23C6EHdgUNMcgtSTZETmqj2cXwlLbeIJsXDhZdC0ySb_iQfH3RRNITmJGUHikcybYCe9Ax2eZ8QpcW8","source":"ziprecruiter","full_description":"Job Title: IT Specialist – Moblity Engineer Job Location: REMOTE / Fort Belvoir Security Clearance: SECRET Certifications: Security+ IndraSoft, Inc. is seeking a highly qualified Mobility Engineer – IT Specialist. The candidate will be responsible for the life cycle management of mobile applications and devices, provide sustainment service to provide hardware and software modification to systems to include troubleshooting, modifying, and upgrading the current system baseline to sustain operational functionality and capability of the system. The candidate must be willing to multitask and work independently on projects and work part as a team. Qualifications: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Qualifications Required: • Five years of progressive experience working in a medium to large IT environment. • Three years of above experience in the integration and management of Windows application servers and the installation, configuration, and support of applications and devices. • Two or more years of experience with technical troubleshooting and hands-on experience with iOS, Android, Windows, and mobile devices in an enterprise setting. • Two years of experience with a MDM tool. Qualifications Desired: • Documented two years of experience supporting Microsoft Office 365 Essential Functions and Responsibilities: • Responsible for establishing and maintaining enterprise mobile computing standards, policies, and implementation practices • Responsible for mobility infrastructure design and controls • Responsible for evaluation research related to future mobile computing strategies"}