{"title":"Senior Technical Writer (Expanse) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJzuWseKnecZXZ-R_3yfIR9JA6ZUewbtRMk_ztaLSo1Krtre2i9Y7WJqk7iIXKqgSX6DSc2BUAESnyVe9mgXReWoFw4H-0OfTANuDNO17hBCIg1yKLZPEl3eFJ1TklA3E8FX7F2wlf_xBdXrQbyGGRk_jsuuRF3djq-Rwnut6GW37197LFsFuOBwcOoL-5J","source":"ziprecruiter","full_description":"Company Description As a technical writer at Palo Alto Networks, you will directly help our customers, partners, and internal employees better understand how to configure and use our Expanse products to solve security challenges. We are looking for a writer who is curious not only about how a feature works but also why and when to use it, what the best practices are for configuring it.Expanse is a recent acquisition into the Cortex family of products that brings a unique level of visibility to security through the continuous scanning of exposed assets. Integrating Expanse's capabilities into Cortex enables us to offer the first holistic solution for attack surface management, threat detection, and response. The integration of Expanse's internet collection and attribution data will extend Cortex's capabilities across exposed and untracked external assets that might compromise an organization's attack surface. Job Description About You:Facility with technology-You're curious, not afraid to be hands-on with the products, and you can empathize with the challenges our customers face.Know the craft-You like writing more than you like doing anything else and you have an innate ability to think like and write for security administrators. Innovation-You are creative, and love to experiment with new ways to present information in a way that enables a positive user experience with our products.Organization-You can take large amounts of technical details and organize them into topics that users can easily find and use to solve their mobile security problems. Initiative-You're not afraid to propose changes to improve process and quality to enable a better customer experience and you are relentless in hunting down the information you need.Interpersonal skills-You are able to work with developers, QA, PMs, customers, SEs, and support to successfully gather information required to understand the problems our users are facing and the ways our products help to solve them.Problem solving skills-You have strong critical-thinking skills and use them to ensure that you are providing just the information our users need to complete the task at hand.  Qualifications Qualifications:Must have knowledge and background in security.Ability to see the big picture and proven track record of writing concepts and tasks from scratch.Strong initiative and ability to work independently with limited direction.Minimum 5 years of proven technical writing experience including experience writing for a developer audience.Experience documenting APIs using Swagger/OpenAPI, Markdown, CSS, JavaScript, Javadoc, or related technologies. Ability to go and find out not only how something works, but also when and why to use a particular configuration/setting.Experience with source control tools (Git or Perforce) and bug tracking/collaboration tools (GitHub/Jira/Confluence).Experience with topic-based writing (DITA or XML authoring) and using tools such as structured FrameMaker, Arbortext Epic, or XMetal.BA/BS or equivalent experience required. Additional Information  All your information will be kept confidential according to EEO guidelines. Qualifications: Qualifications: Must have knowledge and background in security. Ability to see the big picture and proven track record of writing concepts and tasks from scratch. Strong initiative and ability to work independently with limited direction. Minimum 5 years of proven technical writing experience including experience writing for a developer audience. Experience documenting APIs using Swagger/OpenAPI, Markdown, CSS, JavaScript, Javadoc, or related technologies. Ability to go and find out not only how something works, but also when and why to use a particular configuration/setting. Experience with source control tools (Git or Perforce) and bug tracking/collaboration tools (GitHub/Jira/Confluence). Experience with topic-based writing (DITA or XML authoring) and using tools such as structured FrameMaker, Arbortext Epic, or XMetal. BA/BS or equivalent experience required.Responsibilities: About You: Facility with technology-You're curious, not afraid to be hands-on with the products, and you can empathize with the challenges our customers face. Know the craft-You like writing more than you like doing anything else and you have an innate ability to think like and write for security administrators. Innovation-You are creative, and love to experiment with new ways to present information in a way that enables a positive user experience with our products. Organization-You can take large amounts of technical details and organize them into topics that users can easily find and use to solve their mobile security problems. Initiative-You're not afraid to propose changes to improve process and quality to enable a better customer experience and you are relentless in hunting down the information you need. Interpersonal skills-You are able to work with developers, QA, PMs, customers, SEs, and support to successfully gather information required to understand the problems our users are facing and the ways our products help to solve them. Problem solving skills-You have strong critical-thinking skills and use them to ensure that you are providing just the information our users need to complete the task at hand."}