{"title":"Software Developer (C# .Net) - eCommerce","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALcqN7QCoI101kCbTqXlBzGv1j8Bko_IKMIhDAqlbz97jQOKKlb23S-2y0FJvCTSXV2fv4RZQ9KYqRxbW1ry3PPKydKhoHoP3rsRz6TDVK6pLrwLvIBt5Mr7hA7DOloiN0IuuPXWFiLj8ddo822_XPaJRL9N4Is5UM_w1yR-Onh4LwCjDAKioQzCgBSdh63","source":"ziprecruiter","full_description":"This is an environment unlike anything in the high-tech world and the secret of Costco's success is its culture.  The value Costco puts on its employees is well documented in articles from a variety of publishers including Bloomberg and Forbes.  Our employees and our members come FIRST.  Costco is well known for its generosity and community service and has won many awards for its philanthropy. The company joins with its employees to take an active role in volunteering by sponsoring many opportunities to help others.  In 2018, Costco contributed over $39 million to organizations such as United Way and Children's Miracle Network Hospitals.Costco IT is responsible for the technical future of Costco Wholesale, the second largest retailer in the world with wholesale operations in twelve countries. Despite our size and explosive international expansion, we continue to provide a family, employee centric atmosphere in which our employees thrive and succeed. As proof, Costco consistently ranks in the top five of Forbes \"America's Best Employers\".Costco is looking for a dedicated and experienced C#, ASP.Net developer to design, develop, maintain, extend applications and implement projects in accordance with the Costco development and project management methodologies and practices. This is an excellent opportunity to work on various applications focused on automating and modernizing the E-Commerce pharmacy processes for a fortune 500 company.If you want to be a part of one of the BEST \"to work for\" companies in the world, simply apply and let your career be reimagined.ROLEDesigns, builds, and maintains efficient, reusable and reliant C# code for relational database applications. Including (but not limited to) the Pharmacy eCommerce System.Designs and implements solutions into existing environments and designing business workflows to ensure proper application mapping/flow.Creates conceptual and detailed technical design documents.Provides accurate and timely estimates (work breakdown schedules).Ensures the best possible performance, quality and responsiveness of applications.Documents and executes unit and integration tests.Defines and implements standards and best practices for software development.Participates in code review sessions as a coordinator, owner, reader, recorder or observer.Collaborates with Business Analysts, Solution Architects, Quality Assurance Analysts, Software Developers, and Release Analysts in a DevOps model to extend the capabilities of the applications. Provides 3rd-level application support for the Pharmacy E-Commerce applications.REQUIREDMinimum 4 years' experience with C#, ASP.Net, with a strong knowledge of its related technologies.Familiarity with the .NET framework 4.0 or later.Must have working knowledge of Web Services, SOAP, and XML technologies.Experience programming in major database and middleware technologies.Proficient working knowledge of code versioning tools such as Git, SVN, etc.Strong knowledge of object oriented concepts.Familiarity with continuous integration.Must have strong communication skills, both oral and written. Demonstrated ability to collaborate with other technical experts, develop solution and functional design documents to support development of final solutions, and provide project estimates and lead technical teams to consistently meet commitments.Integrity, accountability, a positive attitude, and be willing to do what it takes to make the team successful.Ability to manage priorities and timelines.Ability to provide project estimates and work-breakdown schedules.Extremely responsive, able to work under pressure in crisis with a strong sense of urgency.Responsible, conscientious, organized, self-motivated and able to work with limited supervision.Detail-oriented and possess strong problem-solving skills and ability to analyze for potential future issues.Able to support off-hours work as required, including weekends, holidays, and rotational on call.Recommended Experience in ASP.net (C#) (Web forms and User Controls), AJAX concepts, HTML, CSS, JavaScript, JQuery, Telerik (3rd party controls), OOPS Concepts and Design Patterns.Working knowledge of backend and Pharmacy Management components, web services, related interfaces and configuration.Previous E-Commerce experience in production support team lead or related role.Required DocumentsCover LetterResumeCalifornia applicants, please click here to review the Costco Applicant Privacy Notice.Apart from any religious or disability considerations, open availability is needed to meet the needs of the business.  If hired, you will be required to provide proof of authorization to work in the United States. Applicants and employees for this position will not be sponsored for work authorization, including, but not limited to H1-B visas."}