{"title":"Senior Oligo Chemist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALPBQPu0g5ovCsWYVtyTptGrWIzOEk5hJkvs8X_lLsRs_LEWNNvoiMGP5e6dMgMnzKi4JtHHN5CYJLVs3LUT2DV4VxyIGpZdZjulUDQZ3zwFBh5fRAbOBxe5fHk_0wazm7KD_asjyQdlL73OGYdVoacItb-qef-EcuFujuqFuJIo53onqkN6NNJdrjfNvA","source":"ziprecruiter","full_description":"POSITION SUMMARY:The Senior Oligo Chemist will perform tasks associated with the production of oligonucleotides in a dynamic fast paced GMP manufacturing environment. This position requires oligonucleotide chemistry knowledge, attention to detail, and excellent communication. The chemist will work closely with research and development teams to transfer and qualify new technology and processes from development into manufacturing. The chemist may also perform in a supervisor role to junior associates.ESSENTIAL JOB RESPONSIBILITIES: + Production of synthetic oligonucleotides in a GMP environment for use in internal diagnostic products+ Production includes operation of automated synthesis and purification instruments+ Analyze and process production materials using bench techniques and lab instrumentation (synthesizers, preparative HPLC, analytic balance, and rotary evaporator)+ Perform process scale up and technical transfer projects with input from Development+ Qualify new equipment and new processes+ Communicate and collaborate with coworkers to maximize production efficiencies and meet production deadline priorities+ Perform and document process steps according to defined protocols+ Author technical documents and edit SOPs as needed+ Handle chemicals and waste according to company safety protocols and procedures+ Ability to perform basic instrumentation maintenance as needed+ Follow all company policies, procedures, and directions from senior associates TRAINING RESPONSIBILITIES: (REQUIRED) + Complete all assigned and required training satisfactorily and on time MINIMUM REQUIREMENTS:Education and Experience (in years):+ BS in Chemistry or Chemical Engineering or a related field with 5+ years of related work experience OR + Master's degree in field with 3+ years of related work experience OR Doctoral degree in field with 0-2 years of related work experience. Knowledge and skills:+ Experience with automated equipment such as oligonucleotide synthesizers, preparative HPLCs, and liquid handlers+ Experience in a manufacturing environment and familiarity with instrumentation, production, and GMP documentation+ Excellent knowledge of analytical instrumentation principles (HPLC, pH, Spectrophotometer) and capable to maintain and troubleshoot laboratory instrumentation+ Strong synthetic chemistry knowledge+ Ability to quickly learn and apply new knowledge and skills+ Ability to think logically, prioritize tasks, be organized, be self-motivated, and work effectively in a team environment+ Excellent oral and written communication skills+ Ability to perform primary job duties under minimal supervision PREFERRED REQUIREMENTS + Experience with oligonucleotide chemistry and large-scale production+ Knowledge of GMP regulations+ Familiar with Agilent, AKTA, Agile and SAP software+ Supervisor experience Physical requirements/abilities: + Must be able to lift 50 lbs. Must be able to stand for several hours. Work may involve repetitive arm/wrist motions. Danaher Corporation and all Danaher Companies are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. The \"EEO is the Law\" poster is available here (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf) ."}