{"title":"Research Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJusA0f3G15WIdISvoaZ9lYeDwblvXLu2eH7cdu-pUMABIUx7HrEsWklUnPH0I_sF8zMZLnfDVup7kHZIDxLq790xne3Ucd3lzameM9PD0dBl5DdpvYDzkODtzyisxtbmSOEVjQAufK-QksnnGH2LeDoIqlfh7RPMTJG7mM3LMHBh4Odou3RBgld3lN7w","source":"ziprecruiter","full_description":"The Agricultural Research Service (ARS) is USDA's chief scientific research agency and one of the world's premiere scientific organizations. ARS Postdoctoral Research Associates are hired to supplement a lead scientist's research on agricultural problems affecting American agriculture.This position is with the Center for Grain & Animal Health Research, Manhattan, KS**ANNOUNCEMENT IS OPEN UNTIL FILLED OR 2/21/2022**Qualifications: This position requires a Ph.D in Grain Science, Food Science, Chemistry, Biochemistry, or a related field of study that has equipped the applicant with the necessary knowledge, skills and abilities to perform the duties and responsibilities of the position.Applicants must meet basic Office of Personnel Management (OPM) Qualification Standard's requirements of the scientific discipline necessary to perform the duties and responsibilities of the position.Education: A degree in physical sciences, life sciences, or engineering that included 30 semester hours in chemistry, supplemented by course work in mathematics through differential and integral calculus, and at least 6 semester hours of physics.Education: This position has a positive education requirement. You must submit a copy of your academic transcripts OR a list of college courses with credit hours, dates completed, and grades received to verify education when applying for this position. If this information is not provided, your education may not be appropriately evaluated and you may lose consideration for this position. If you are selected for this position, you will have to provide an official copy of your transcripts prior to entering on duty. Application materials will not be returned.A Ph.D. is required that was obtained within the last four yearsEmployment Type: FULL_TIME"}