{"title":"Sr. Accountant - Full Charge Bookkeeping, Procore, Construction NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIET8eFPK2wUa69OjBdOReXjAZ69vKLP7Z91N0lEwqOt7wLAReduhdVSYzhppiL1m_cFkv5JSzyauVy2NKJk0ADEy-kRZ9v7uVn8GwuPJMkT89qJUZjqY9VqrPqsbbKPXD8VfLxqDqWsuE4mANOVO7AGzqrTabNBLZBOjuj2cU9Ja3TmUZV68znXrtPDyQ9","source":"ziprecruiter","full_description":"Sr. Accountant - Full Charge Bookkeeping, Procore, Construction Job Title:  Sr. Accountant - Full Charge Bookkeeping, Procore, ConstructionJob Location:  Dallas, TX Salary:  Competitive Salary DOE, Benefits, 401k MatchRequirements:  3+ Years' experience Full Charge Bookkeeping for Construction Accounting Based in Dallas, we are one of the nations top 25 Multifamily owner builders! We have been around for over 20 years, and due to growth and demand for our services, we are in need of hiring a Company Accountant that possesses strong experience with construction accounting to oversee the internal accounting team. If you are interested in joining a rapidly growing and progressive company that pushes the envelope in luxury housing and definitely cares about providing a great working environment for its employees, then apply immediately!What You Will Be Doing- Senior Accountant that is a full charge bookkeeper (construction project experience) with the ability to handle financial statements, GL entries, supervise staff (2-3 people) and knows Procore software.- Run everyday accounting operations for development and construction projects.- Manage and Maintain project financial records, general ledger, and our AR/AP.- Prepare required sales tax reports for individual states.- Job cost reconciliations, monthly. - Oversee different cash management functions and accounts payable for development/construction projects. - Whatever else is required by the owner who you will report to directly.What You Need for this Position- A bachelor's degree in a related field- 3+ Years' Experience:- Full Charge Bookkeeping for Construction/Development Accounting - Procore & Quickbooks- Job Cost Accounting- Accrual Accounting, Coordinating Payroll, AP, AR, and GL - Supervision of accounting department (2-3 people)What's In It for You- Competitive Salary DOE - Vacation/PTO- Medical- Vision- Dental- 401kSo, if you are a Sr. Accountant with full charge bookkeeping experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}