{"title":"CNC Technical Support Specialist - (Remote in Continental US)","location":"","salary":"","description":"","term":"$55,000 to $70,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKoP1yMivDOn56GbR6PE8WWOu9E3l2JSwvjf1cG4rxwIydPVuScWt1f1SSs65XO6Hb5CvCBR3ofOzANxOp9YZBMc7nkg2Cn1Sy25PPWYd3JTT7E5XNC_y_jopRXBJ1KNBEDJQ2qfdI74FscizKk89lAu54vYqxv3CRiQb-67c6xyIyqWjwCRkoyoP525Yg","source":"ziprecruiter","full_description":"Technical Support SpecialistAre you the kind of CNC enthusiast who enjoys connecting with metal shaping machine owners who want to make things? Do you have a zest to work with colleagues who have diverse professional experiences that complement your own? Do you want to be part of a small company where you have the freedom to work with established and new technologies, supporting, troubleshooting, documenting and providing input to product improvements?If so, we want to hear from you.Our story is all about helping people make things. We empower ideas. We make affordable, machine tools and support them with top notch software, customer service and educational resources. We’re committed to being the best CNC equipment provider, serving research and development departments, prototyping shops, educational institutions, makerspaces and small production facilities.Our goals are to have fun, help people make stuff, treat others fairly, grow and be efficient. We’re looking for people with similar goals. If this is you, consider joining our team!ResponsibilitiesYou, our future Technical Support Specialist, technical wizard and customer communication guru will be an integral part of our business. You’ll be responsible for supporting our customers in operating, optimizing and troubleshooting machines. Your daily work will involve working with our customers via email, telephone and video. You will work with new and existing products, accessories and software to investigate and document procedures that customers will love because they are clearly described and easily understood because, well you’ve been there. We’ll even leverage your skills and hands in our customer training courses, both at our facility and onsite if you have interest to travel. Though you possess a great deal of manufacturing knowledge, you will learn new things from your colleagues which add to your technical acumen.Minimum QualificationsExperience in manufacturing, CNC machining, CAD/CAM experienceCNC MachiningExperience a technical role—field service, in-house service, technical support or trainerWillingness to learn and willingness to educate othersBackground in making things, whether for work or hobbyAbility to thrive in an environment that’s less structured than larger companiesPreferred Additional QualificationsElectrical / electronic troubleshootingMetal fabrication experienceStrengths and InterestsIntellectual curiosity and interest in making thingsWillingness to share knowledge and help others"}