{"title":"ACI Network Engineer","location":"","salary":"","description":"","term":"$1 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKM2maxsuH5IZxJb6FWqGUV7X8eXKCidexss3IjIICQsRbTmtstGzE5ipqDj0O_hX1s_w_8sdliLkT3nInAn8Q07pyIfRCkYRzjAczcZmPDnKpAFiHHL4KNC3R01Z1oB3o6qBVEIFCuX4XBuHzZDGuNOBDSFrk03DawrVk583QZ98W8MRKDuqxsZs7vsJQ","source":"ziprecruiter","full_description":"ACI Network Engineer - Contract or CTP - Raleigh, NC The end client is unable to sponsor or transfer visas for this position; all parties authorized to work in the US without sponsorship are encouraged to apply. A Not-For-Profit Financial Cooperative is seeking a ACI Network Engineer in Durham, NC. Role Description A Cisco centric network encompassing multi-layer redundant data centers that are teamed to a wide area network serving over 300 remote branch locations and over 1200 ATM's. Our LAN/WAN environments involve complex routing and switching technologies. The network is heavily involved with F5 and Netscaler load balancers with corresponding features. Our data center designs include Nexus 7k architecture as well as Application Centric Infrastructures (ACI). * Thorough understanding of routing and switching with hands on production experience. Candidate will need extensive knowledge in F5 load balancing fundamentals. Finally, familiarity with design and implementations of networks. * Support the new data center, and they will likely have data center experience in their background. * ACI experience that has worked in that environment, hands on experience. * Heavy documentation related to data center  * Experience with IP Address Management (IPAM) Skills & Requirements * At least 3 years as a network engineer, heavy switching * Cisco ACI * Routing/switching * CCNA * NDS/Catalyst switch * TACACS experience- Terminal Access Controller Access Control System * IP Address Management (IPAM). Why Hays? You will be working with a professional recruiter who has intimate knowledge of the Information Technology industry and market trends . Your Hays recruiter will lead you through a thorough screening process in order to understand your skills, experience, needs, and drivers. You will also get support on resume writing, interview tips, and career planning, so when there's a position you really want, you're fully prepared to get it.  Additionally, this position is a contract role where Hays offers you the opportunity to enroll in full medical, dental or vision benefits. * Medical  * Dental  * Vision  * 401K  * Life Insurance ($20,000 benefit) Nervous about an upcoming interview? Unsure how to write a new resume? Visit the Hays Career Advice section to learn top tips to help you stand out from the crowd when job hunting.  Hays is an Equal Opportunity Employer. Drug testing may be required; please contact a recruiter for more information."}