{"title":"Android CNO Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK1tg-wyUicPVcRH3Rn8y-LOmHBr8qI7GfkgXDlVrhQb3E3VMt7geWOzppo-omemtbFzbrUZXKRioGmlwakW3Qs3OZSWg69kLpjoMivFOZi74tUZ_7Oie9fr99x7BhZCKvc6axQzYEkF35djk5tR04-sK2h76eunjMNeWpCaf6htz1fl6tomjsB5r7Nxww","source":"ziprecruiter","full_description":"Raytheon Technologies' CODEX (Cyber Offense and Defense Experts) division brings together an elite team of mission-focused industry experts who are well known for their ability to overcome the most advanced technical challenges. The team comprises engineers of multiple disciplines including vulnerability research, reverse engineering, CNO/CNE development, hardware emulation, system engineering, and data analytics. Our engineers do more than just work with cutting-edge technology-they ensure the missions succeed for the customers!CODEX offices span the nation and offer its engineers the ability to advance their careers through mentorship, training, and an expansive technical portfolio that covers every side of cyber. If you want to be part of a collaborative team that supports challenging, meaningful work that is vital to our national security, apply today! Position Overview: Raytheon Technologies' Cyber Offense and Defense Experts (CODEX) is in need of senior cyber software developer for Android platforms.In this role, you will design custom software solutions to meet the needs of an ever-evolving cyber mission. Requirements Five years of experience as a cyber-software developer Experience with Android Software development experience in C/C++ Experience in one or more scripting languages (e.g., Python or Ruby) Wireless and network communications Mobile platform experience Reverse engineering Vulnerability research Desired Skills Proficiency with one or more assembly languages (X86, ARM, etc.) Advanced software development experience in C/C++ Experience with tool development Security Clearance Active Top Secret security clearance Education None required Our Interviews Our interviews are technical.Come prepared to tell us about your technical background and interests as well as to work through some of our technical questions.We hope you find our questions to be thought provoking, but we don't ask brain teasers or tricks.This is a chance to have a dialog with our team, and we hope you will enjoy it! 172249 Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, age, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status."}