{"title":"HCM Field Sales Rep - Seattle, WA","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKnTT6se6f8ZcqDHZjwGy2wDH_KXAOb9qGdGRF9gOVUWtI9DWyTAsREIUhg6kIc-DoYG8lHm1XbQLUiizi1Ye_oh_Ovh7eP5gve9nDBQyI9foFkbcFozBOjSUxsS2PLZmXIa-Jsq5ZJxHYp-W8cMVApR4LFDb_CUDL9kUNvdukRTursIy49Ib8Xbf2Kel4","source":"ziprecruiter","full_description":"Field Sales Representative (in Seattle, Washington) iSolved HCM is actively pursuing innovative, forward-thinking candidates for our Field Sales Representative positions. This position is critical to the growth of our company as you will be on the front lines driving top revenue. If you have a passion for technology, an internal drive for sales, and the desire to expand your career, this is the ideal position for you. Apply today! About iSolved HCM We are a fast growing, award winning and highly successful software company, transforming the way organizations manage their most important asset their people. By combining revolutionary SaaS technology and expert services, iSolved HCM delivers comprehensive, scalable, and high value outcomes that give our customers a significant competitive advantage.As a modern tech-savvy company, we understand that a contemporary and diverse atmosphere will allow our employees' internal drive to engage, inspire, and produce incredible sales results. We offer our Field Sales Representatives a compensation plan which includes a base salary and very lucrative commission plan with unlimited upside. We also hold an annual incentive trip called \"President's Club\" for top producers who qualify. We go above and beyond to reward our employee efforts by providing excellent opportunities for fast career progression. Yeah, we get it. Professionalism + Career Growth + Fun = A well balanced work life. Get ready to love your job!A Day in the Life of a Field Sales Representative Reporting to the Vice President of Sales, you'll thrive as an independent, go-getter coupled with all the tools necessary for ultimate success. In the outside sales-based environment you'll sell new customers on our technology, work with insurance brokers and other centers of influence for referrals, and follow up on potential leads. This position will give you the opportunity to play a key role in increasing our company relationships out within the community by working with diverse clientele groups. With a smile on your face, you'll thrive running all phases of the sales cycle from prospecting, discovery, demonstrations, to close your own sales. We have the products and services that Human Resource professionals need. Through the power of our remarkable Human Capital Management (HCM) products and services, you'll come to our clients' rescue. You are an HCM hero! Be prepared to hit the ground running in a fast-paced sales environment and work in a career you know you were meant to have!Job Qualifications HCM experience preferredRelevant education and experience, with motivation for salesTech and SaaS savvinessExcellent interpersonal communication skills to effectively engage with all personalities and business rolesStrong computer skills and understanding of spreadsheet softwareAn energetic modern approach to salesA creative and independent thinkerA desire to continually grow and apply new skills"}