{"title":"Senior Software Engineer, ML Accelerator/GPU Programming NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKmjlHOviKZ1vc92eMYYxT8xYD8dzKgKMA3DSqcrbJDZnehD_rqLQYlDycWl-5MBk_aLy9dlnCVnva00XJFIxSlcySja6ajQWJjTT2KDClz1TwVNRARhHy1L7AMIvqSdY8CiZX0vAKuveUyn--cykfe_w8L9ike3qTvglYkNvkMP3_zb7ZDcWJAYbwx8uw","source":"ziprecruiter","full_description":"This opportunity is located in San Diego, CA.  Remote friendly during COVID-19Email you resume directly to: senior_software_engineer__ml_accelerator_gpu_programming_bfaabf522us@ivy.greenhouse.ioCompany OverviewCome join a higher calling and find a deeper purpose! As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking. While inventing the framework of Autonomous Driving, our current fleet of autonomous Trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy. TuSimple was founded half a decade ago with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable Autonomous Freight Network. Opportunity Overview:As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.At TuSimple, the Heterogeneous Computing team is responsible for optimizing algorithm performance through hardware accelerators, improving accelerator utilization, as well as maintaining the stability of the whole system.Example projects we are working on include:Accelerating existing algorithms using CUDA and GPU.Minimizing hardware resource usage, e.g. GPU computing utilization and memory footprintDeploy GPU related on embedded deviceBuilding the GPU-accelerated Machine Learning Library.Role Responsibilities:Analyze the system and identify potential GPU performance bottlenecks.Perform in-depth study of the working mechanism of CUDA and GPU, and apply them into existing applications properly.Improve the neural network inference speed with minimum hardware resource usage. Conduct research on various neural network acceleration techniques, and take the ideas from conception into production.Lead the team to design, develop and optimize GPU applications or libraries.Define the long-term roadmap for the team.Experience & Skills Required:5+ years of experience in GPU related fields.Solid understanding on Computer System, Computer Architecture.Hands-on experience in at least one of the following fields: DL workload programming & optimization on GPU/ Developing machine learning libraryStrong programming skills.Excellent communication and interpersonal skills.Preferred Skills and Experience:2+ years of management experienceDevelopment experience in following Libraries (MXNet, TVM, Caffe, Tensorrt)Familiar with neural network acceleration approaches, such as network pruning, network quantization, or other optimizations for embedded devicesExperience in arm-based embedded systems/Nvidia Drive productsStrong System Skills (Operating System, Parallel Computing, Distributed Computing)TuSimple Benefits100% employer-paid healthcare premiums for you and your familyWork visa sponsorship availableRelocation assistance availableBreakfast, lunch, and dinner served every dayFull kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and moreStock options / equityGym membership reimbursementMonthly team building budgetLearning/education budget Employer-paid life insuranceEmployer-paid long and short disabilityTuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.This opportunity is located in San Diego, CA.  Remote friendly during COVID-19Email you resume directly to: senior_software_engineer__ml_accelerator_gpu_programming_bfaabf522us@ivy.greenhouse.ioBrown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,"}