{"title":"Heavy Truck Support Manager / Diesel Technician / Mechanic NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ7zTpxXMgUAx73FljNiUinqfDt4KvnJHG-PbEA7ytxY8PCU80ldv9cOgLsVonpF6X-oOWFd7O2pS2oD1AMdcevDCOeCwcKapEU1O8ztwrwwJQ6Sth0HGzXRIkgTvo2mzk1c3r6i0-8GRPEynfzNip3Ca86IY053etU2N9WVofiKsaixnYCDa9yj3Jw5vg","source":"ziprecruiter","full_description":"Imagine leveraging your diesel truck experience to develop a brand-new role with one of the largest truck service organizations in the Mid-Atlantic. Whether you are an experienced technician, service manager or manufacturer’s representative, this is a unique opportunity to become the sought-after expert for everything related to heavy truck repairs for a fun, family-owned dealership that has incredible support staff along with a prestigious reputation.Excel Truck Group is seeking a professional with a diesel truck knowledge to join their Charlotte, NC team as a Technical Support Manager. From leading and supporting their service departments to working close with management and sales teams, this is a critical role responsible for further improving the customer experience while growing the customer base.If you have extensive diesel truck knowledge, this is a career you need to explore.Please click Apply or email your information to: excel34@workrocket.comSome of the benefits to you:Very strong compensation including monthly performance bonusesExcellent benefits – Multiple health plans to choose from with great coverage, dental, short and long-term disability, optional insurances, 401k with match, generous PTO, 6 paid holidays.High market share – Freightliner is one of the most popular brands of trucks on the road; and when those trucks need service, Excel has it! With this kind of high demand, you will always be busy and will financially benefit from the volume of business.Company growth and advancement – The organization has doubled in the last 3 years and continues to grow rapidly. 2017 was a financially strong year, and they predict 2018 to be even better!Fun environment – Enjoy spending time with your colleagues outside of work with outings, baseball games, lunches, Christmas parties, and local trips.Family-owned – Get to know the owners of the company! See how active they are within the organization and how much they care about their employees.MAJOR DUTIES AND RESPONSIBILITIES:Technical “go to” person for any truck repair issue that is resulting in lost hours without resolution. Sharing your knowledge with our service teams supporting the through put of our Service departments. Develops protocol to maximize our Technician’s understanding of when to stop diagnosing and ask for assistance to affectively address the repair.Provide Breakdown assistance – collaborate with other dealers on behalf of your customers to quickly move their trucks through repair and ensure communication of status is in place via Service Tracker, etc.Develop new and strengthen our existing customer relationships as a technical point of contact for our dealership’s key Fleet customers. Utilize Detroit Connect products/tools to provide an enhanced service experience. Understand and maximize value of DTNA’s portfolio of digital solutions available to navigate and solve customer needs. Coach and educate our customers on the digital tools and features available to them.Maximize the flow of repair orders within the Service department and effectively working closely with our Service Managers and Fixed Operations Management team. Actively supporting and leading our Elite Support Continuous Improvement events and initiatives. Supports our Service Manager to achieve “Throughput”Communicate across all departments our customer opportunities and share appropriately solutions.As our fleet customers’ needs evolve and opportunities develop (Continuous Improvement Events), this role will coordinate communications with our Service Management team. Provide clear, consistent communication, leveraging communication tools such as Service Tracker.Work closely to ensure that our dealerships Service Technicians and Management team are maximizing our EA/ER efficiency and our overall customer’s experience. Work closely with our Service Trainers to build a strong process for developing a training path that supports our Technicians and our OEM’s certification requirements.Vocational & Body Builder Support – body interfacing with chassis, parameters – engine, body and smartplex (Chec tool).Reports to the Service Management team and Director (s) of Fixed Operations regarding progress on issues that are identified, pending, or resolved.Adheres to all company policies, procedures, and business ethics codes. Lead by example and embrace our Elite Support principles and our Company’s commitment to Safety.All qualified applicants will receive consideration for employment without regard to the individual's race, color, sex, national origin, religion, age, disability, genetic information, status as a military veteran or any other characteristic protected by applicable law."}