{"title":"Android Software Engineer - Beloit, WI NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI-QTd-uTEzyRmG_iYoZUXO82wjB2ug-VbeIjfn5B3URM4KB8LFZPWGrsNpgKKQgybKAYrsdgVmkSddKB08VB-nQ-k4zfFjLpFY4KrtSHvkzO31Y9FgNJlFCd53o25LZwi3_AkX_Gio5QIEKNUn6rO5TclnLFwf8ANDGSDoKrXWgk4-uozBwngkjCsNZcYA","source":"ziprecruiter","full_description":"About the Position:AccuLynx is a fast-growing SaaS provider of CRM/project management software for roofing contractors. With more than 10 years in the business and impressive year-over-year revenue growth, we have quickly established ourselves as the leading software product in this multi-billion dollar industry.We are actively looking for a passionate Beloit-based Android Software Engineer to evolve our Mobile SaaS offering. This role requires someone who loves the craft of building great software and is passionate about the user experience. AccuLynx is developing the next generation of construction management tools for the mobile space. Construction management is an emerging market that allows us to be creative and inventive on a daily basis.What You Will Be Doing Every Day:You will work independently within a smart and passionate team. No code monkeys here!You will build useful features for our customers.You will contribute to product decision making.You will have time to learn and innovate.You will have fun. We enjoy game days, nerf wars, and company outings.Here Are Some Projects You Might Work On:Implement real time communication between our customers.Integrate with more native capabilities like advanced dialing and calendaring.Solve advanced mapping and geolocation problems.Build offline capabilities for our customers that work in remote locations.Utilize all the room a phone and tablet can give us.Your Qualifications:3-5 years of experience in native Android development (Kotlin).Experience in full-stack mobile development.Smart and gets things done.Belief that performance is a feature.Bonus Points If You Have: Experience with iOS and/or Xamarin developmentExperience with GradleExperience with FastlaneExperience with our backend stack: C#, Sql Server, Redis, ElasticSearch, Git.Contributions to OSS projects, Stackoverflow, or other communities.Familiarity with Agile/KanBan methodologies.Why AccuLynx?At AccuLynx, the employees are a highly-valued asset, and we strive to provide the best working environment possible. Quiet office space, sit/stand desks, super comfy chairs, triple monitors, and casual dress are the norm. We believe that culture is one of the most important ingredients for success. Fun, learning, collaboration, innovation, and personal growth is our way of life.Attractive compensationGenerous paid time off policy and flexible work hoursRelaxed atmosphere without crazy deadlinesFast computer hardwareCompetitive health insurance (medical, dental, vision)Free snacks and drinksGym membership (to work off the snacks and drinks)401K with matching and safe harbor contributionsConvenient Loop location close to public transportationOur Interview Process:We do not hire based on buzzwords or popular acronyms. We expect you to be a master of your domain and be eager to learn any technology or language in the future. We aim to reply to your application within a week of receiving it. Our interview process consists of several stages, each one allowing us get to know you better, professionally and technically. It is also an opportunity for you to gain a better understanding of our culture and the work we do at AccuLynx. The stages include:CV, open source code, or public portfolio reviewPhone interview with an HR RepFace to Face conversation with a few members of your team.The Code Challenge - A take-home 4-8 hour real-world coding problem. Build something that does things. It's not a stupid brain teaser or something requiring special knowledge.Position is based in Beloit, WI, and full-time remote work is not an option at this time.  Applicants must be able to work legally within the United States, and we currently do not offer H1B Visa sponsorship.  Please, no 3rd party inquiries."}