{"title":"Sales and Marketing Coordinator NEW!","location":"","salary":"","description":"","term":"$35,000 to $50,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ3REnHlKgKPciyJoZohUHMjME-LaI5sUTQh_lp_MmpbPXMmR4zR4RDaRITqScJejtdj5vuOQI5ddLgyZcb6JN_AadxkbIdKfhD2er_jSUjEvPZN4PFepkP5gDwDbFZiY0eCLBfZs0-5dZ55A1AYKa7t-U0Qbn_5uLasJmCMrwmr1smTrb5eqQX3RshwPm_","source":"ziprecruiter","full_description":"Empire Management Group is looking for a full-time entry-level Sales and Marketing Associate. Our Marketing Department is an award-winning, hands-on team that creatively communicates all we have to offer our clients and their customers. The team is collaborative and motivated, learning from successes and failures with an openness to change.A typical day as an entry-level Sales and Marketing Associate might include some of the following:• Communicating closely with a senior Marketing Account Executive in order to develop a comprehensive understanding of each client's account and the products/services to be promoted.• Assisting in devising an integrated marketing campaign strategy and then executing the necessary marketing mix through promotional marketing and sales.• Facilitating client customer engagement & relations through direct in-person interactions that build long-lasting customer loyalty.• Implementing promotional marketing & sales strategies to maximize the marketing budget and hit customer outreach and sales targets.• Track CRM and sales statistics; constantly be on the lookout for ways to quantifiably improve your efforts and the business at large.• Reporting daily and weekly results to a senior Marketing Account Executive.This Job Might Be For You If:• You enjoy solving problems. You love taking on difficult issues and finding creative solutions. You don't get flustered easily, and if you don't know the answer, you'll dig until you find it.• You thrive in a teaching/training environment. As a marketing expert (in training!), you need to be ready to help senior Marketing Executives implement the right marketing plan. Learning something new makes you feel warm and fuzzy inside.• You pay attention to the details. Meeting deadlines and planning ahead - is at the core of our success as we get quite a few last-minute requests and constantly change things up to maintain a competitive edge.• You think on your feet. You like learning new things, and you learn quickly. When things change, you know how to adapt.• You communicate clearly. You write well and speak confidently and you're comfortable communicating in writing and on the phone.• You are motivated. You volunteer for new challenges and take ownership of your tasks. With us, that truly makes a difference.Requirements:• Bachelor of Arts (BA) degree in Marketing, Advertising, Communications, or related field is a plus. However, no degree is required for an entry-level role. We do make exceptions based on high levels of interest in the industry and strong customer service and sales skills.• Excellent verbal and written communication skills; interpersonal skills.• Strong organizational skill set with the ability to prioritize tasks, set schedules, and finalize projects within appropriate timeframes and meet high-quality standards.• Strong attention to detail - you check things twice before submitting assignments.• Strong presentation skills - you enjoy the challenge of public speaking and enjoy interacting in social networking settings.• Ability to work well within a team and independently - and lead as necessary.With aggressive growth, expansion plans and ambitious goals, our firm leads the region in strategic thinking and execution for highly local marketing campaigns. Teamwork is the ability to work towards the vision by utilizing direct accomplishments toward organizational objectives. Comprised of problem solvers and strategic thinkers, we work united in the direction of common goals. Our goals include reshaping customer loyalty in the industry, revolutionizing small business marketing & sales programs for consumer acquisition, and representing the top brands."}