{"title":"Mid-Level Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAID9MgEdzKUJDCjThokKHZu4-zjVgGuNkZklU_c-v48losV-92-zzG-0OGsMjcqRSJsCTxlNfe7qP5g_KiZXt3WJA_m45fqIeONFgAv6cThtPjxyvzQVD3rab7nzTmzgs2CdGVgDYLiz0ezEq5big9cyezBx1LtLK3lqnrBM5i9QuPW9RZaLH1zqQfNx8rX","source":"ziprecruiter","full_description":"OASYS, INC.,a Leading-Edge Government contractor in Huntsville Alabama, is seeking applicants for a Mid-Level Network Engineer position to support our Army customer on Redstone Arsenal.Job Responsibilities include: The successful candidate will have proven experience as a Network Engineer/Administrator supporting all hardware associated with both classified and unclassified networks, which includes firewalls, routers, switches, taclanes, and various other security devices. This consists of configuring, managing, deploying, and maintaining equipment to classified sites. Communicate with all levels of support and management personnel both Government and Industry, resolve conflicts that may arise, and work with a diverse group of IT and Security engineers to implement best practices. Manages network monitoring appliances and applications, such as IDS, Spam/Malware, and Anti-Virus Protection Systems.Minimum Requirements:3+ years of Networking ExperienceSecurity+ CE (or higher-level DoD 8570 certification required)Computing Environment (CE) certification requiredFamiliar with DoD STIGs and well versed in DoD information assurance policies and regulationsDesired Skills:Active CCNA certificationCCNP Routing and Switching CertificationExperience with Palo Alto firewallsExperience with SolarWindsExperience with Cisco Identity Services Engine and 802.1XExperience with layer 2 switching and Layer 3 routingKnowledge of OSI 7-layer modelEducation:Bachelor's Degree in in a technical discipline is desired but experience may be substituted for a degree.Eligibility: Candidates must have the ability to obtain and maintain a DoD Secret Clearance. An Active Secret Clearance is highly desired.About OASYS, INC.:Located in Huntsville, Alabama, OASYS, INC. is a technology services and products company dedicated to delivering the right solutions to our government and commercial clients. Our innovative solutions combined with today's technology and our subject matter expertise help to provide full lifecycle support for our client's needs.OASYS, INC. offers a robust benefit plan to include: BC/BS of Alabama Heath & Dental, VSP Vision, Employee Stock Ownership Plan (ESOP), 401-K with Matching, Flexible Spending Account, Tuition Reimbursement, Holidays, Vacation, Short-term/Long-term Disability.www.oasys-incorporated.comEOE AA M/F/Vet/Disability Equal Employment Opportunity is the Law: http://www1.eeoc.gov/employers/upload/eeoc_self_prinJob Posted by ApplicantPro"}