{"title":"Plumbing Technician NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALWnuwSmuGbM3fRJ5PUH-S-m4noD5x84kOtkRWUPIm6hTr6BZnhuUc4BOsyqGMo3_6qasLUm8ujX3O30VSG_OlcwF97faznyWc2XnHzP9EqNIRMRpREWJjgSbSg5uXj5_csePef4yIlmgpqogrKNGP5cckTe_3LRH_DZ7Kf0PaIvrM4vYfmjoflWZoprZQ","source":"ziprecruiter","full_description":"Intro We are looking for hard working individuals looking to better themselves through a fast growing and recession proof trade.  The positions are full-time and located in Charlotte North Carolina areas.Many positions available with benefits package (see below) included! The plumbing trade is in high demand and recession proof. For more information on why you should consider the plumbing trade, visit here:www.plumbingsolutionsllc.com/employment/About Plumbing Solutions LLC Plumbing Solutions LLC is the fastest growing company in the market. Established in 2007 we have experienced year over year growth each year. Plumbing is a recession proof trade (even during Covid). To learn more about our company, visit here: youtu.be/KUiScHaAMP0What to Expect: Plumbers work on various projects independently. The job is in the field and requires troubleshooting skills and the ability to work hard in the elements. After training plumbers can expect their hard work to pay off with a rewarding career, benefits, and steady compensation.Job Qualifications:21-Years or Older (due to insurance requirements)Valid Drivers License with Good RecordAbility to work in Elements and Perform Manual LaborWilling to Learn, Respectful, and Punctual/Consistent AttendanceAbility to Troubleshoot and work independently after trainingAbility to work full-time from start 7:30AM until (end time varies)Work week is Mon. thru Fri., some weekend work available (optional)How to Apply: You can apply and do a virtual interview from the convenience of your PC or smart phone now! Easiest way to your new career: www.jobma.com/pre-recorded-job/MjU0Mzg=Benefits Package:40 Hour+ Work Week (overtime commonly available)Family OrientedVacation TimeEmployee PerksHealth InsuranceLife InsurancePrescription Drug CoverageShort Term & Long Term Disability AvailableHealth Savings AccountsRetirement PlansAdvancement OpportunitiesAdvancement We are looking for Field Managers! We are always looking for great people to advance, lets talk"}