{"title":"Technical Writer - Splunk On-Call (Remote) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJdjEQtYyLbZgyOrlcGVQW01Hidf2Ro8muLMOxJmzQzI4K4XPw7LRJ6N6lWmwFUjavIoLqoCBVIlvDecgDr6k7UutgIQCKxQVbn6nDCWS8nvG9abIisuZGFF6ZBmiqXZ18t4hcOqAyJjPvw2KMfOxRq1Gjg-olsb5sojmKW759E0BZBmKKAzTZEH8yBBXc","source":"ziprecruiter","full_description":"Join a supportive and collaborative team of writers and editors dedicated to building high-quality content for customers who use Splunk software.Technical writers on our team play a vital role in getting our customers up and running quickly. You'll help software developers, site reliability engineers, and technical operations teams configure and use our incident response solution, both on its own and as part of a comprehensive Observability Suite.As a technical writer at Splunk, you'll work in a fast-paced environment, collaborating daily with software engineers, customer support, product managers, other technical writers, and editors. You'll craft customer-facing documentation in an Agile environment, continuously updating your content with improvements and new features.To succeed in this role, you are a confident writer of enterprise software documentation who is passionate about learning new concepts and clearly explaining complex technologies. This position offers continuous learning and frequent direct interaction with enthusiastic customers who rely on Splunk documentation every day to accomplish their goals.This position is remote, but requires working Pacific or Mountain time hours.Please include a cover letter with your application.ResponsibilitiesCraft and maintain high-quality documentation for Splunk On-Call, including both user- and admin-focused guides.Test and validate documentation accuracy and usability, both on your own and in collaboration with technical field, engineering, and support colleagues.Participate in project planning and program status reporting with engineering teams and product management.Plan your work to balance the needs of multiple scrum teams.Work closely with writer colleagues and editors to assess existing documentation and devise improvement plans. Deliver on those plans independently and continue to revise based on feedback.Act as a subject matter expert for your product area by responding to customer feedback and helping colleagues with questions.Manage multiple competing priorities in a fast-paced, constantly changing environment.Basic QualificationsExperience designing and delivering clear, accurate documentation targeted at developers, DevOps, or infrastructure and operations teams.Experience working in an Agile environment, preferably with both onsite and remote team members working in multiple time zones.Experience using Git as a version management tool, including working with branches, creating pull requests, and resolving merge conflicts.Preferred QualificationsDegree in Computer Science or related field, or relevant professional experience.Experience using Git as a version management tool, including working with branches, creating pull requests, and resolving merge conflicts.Experience using and documenting incident response or application monitoring products, targeting multiple audiences, output formats, and use cases.Experience installing and configuring cloud infrastructure and services.#LI-Remote We value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which you are applying.For job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records.Join us as we pursue our disruptive new vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we're committed to our work, customers, having fun and most meaningfully to each other's success. Learn more about Splunk careers and how you can become a part of our journey.Thank you for your interest in Splunk!"}