{"title":"Technical Product Support (E3) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALIy_nsNoIRrHF9eXDhrgaFutHLwLZvte3uwx44HlIC6JA5XpHgxPKS4hVrvfddJgcClDseKsjBxWljzg40U2eO1UQOfJjUaNwHkyOXvlaiL6BbqQmpZ-MpnscRXZFHMSxCMlWAEK8s9Jt5HSaeXp4Mei_qjdrOwdYOZ62UVhea4xA0Gd9PmzKY_XDbulE","source":"ziprecruiter","full_description":"Key ResponsibilitiesResponsible for all technical support related aspects at a specific customer: escalations, fleet performance, system installations, improvement programs and upgrades. Acts as intermediary and field escalation focal point between customer and Division by providing technical support and documentation to field engineers, technicians and product support personnel who are diagnosing, troubleshooting, repairing and debugging equipment. Provides Alpha Site support to Engineering  specifically related to installation, operation, calibration, service and /or testing of a new hardware, process or software design in house or on an engineering toolProvides Beta Site Support; specifically related to installation, operation, calibration, service and/or testing of a new hardware, software or processes on a customer tool. Initiates and provides review of ECO's to ensure data supports fix and follow up with communication to the field.Generates and presents system performance data as required. This includes performance metrics such as MTBF, MTBI and Availability. Reporting will also include process data and I/W spending analysis.Supports GPS in the generation of documentation such as CENs and BKMs.  Creates and reviews  documentation covering technical improvements, system upgrades, and support plans.   Presents at customer level.  Ensures field implementation.  Functional KnowledgeDemonstrates conceptual and practical expertise in own discipline and basic knowledge of related disciplinesBusiness ExpertiseHas knowledge of best practices and how own area integrates with others; is aware of the competition and the factors that differentiate them in the marketLeadership Acts as a resource for colleagues with less experience; may lead small projects with manageable risks and resource requirementsProblem SolvingSolves complex problems; takes a new perspective on existing solutions; exercises judgment based on the analysis of multiple sources of informationImpactImpacts a range of customer, operational, project or service activities within own team and other related teams; works within broad guidelines and policiesInterpersonal SkillsExplains difficult or sensitive information; works to build consensusShould have experience with hands-on vacuum semiconductor equipment.QualificationsEducation:Bachelor's DegreeSkillsCertifications:Languages:Years of Experience:4 - 7 YearsWork Experience:Additional InformationTravel:Yes, 25% of the TimeRelocation Eligible:YesApplied Materials is committed to diversity in its workforce including Equal Employment Opportunity for Minorities, Females, Protected Veterans and Individuals with Disabilities."}