{"title":"Lab Instructor, Chemistry Lab","location":"","salary":"","description":"","term":"Part-Time","detail":"https://www.ziprecruiter.com/k/l/AAIvqwgZgsQswR24Jtuvmzpu9mT_QpatpUryWwi-4v_8v0dKr6ItctAF63nCbv2kkBx261ucXRE_uWZQqGJgCYXcn7IW-RmXlFgHxGlnVlh-uWPTZj2ALXNNiRTirwxwBGAkdmr6e1qCDaNqSnN7BHKGBbfVYP4rAVD3jvjETU78_PVQ1YXoxQA1E4F7eirn","source":"ziprecruiter","full_description":"Lab Instructor, Chemistry LabLocation:                     2800 E Spring Creek Pkwy, Spring Creek CampusPlano, Texas, 75074United States  We are searching for an experienced Lab Instructor, Chemistry Lab.Job Purpose:Oversee assigned lab activities. Work with colleagues to monitor and evaluate student progress and make appropriate recommendations for change in syllabus and/or teaching curriculum. Provide support, training, tutoring, and instruction to department students through one-on-one interaction, classroom presentations, and modeling application of course objectives.Essential Duties and Responsibilities:Oversee implementation of course assignments, projects, and lab instructions.Supervise lab or group activities. Work with colleagues to monitor and evaluate student progress and make appropriate recommendations.Grade lab assignments and submit grades for designated courses. Keep accurate attendance records and generate student activity and attendance reports.Assist with monitoring day-to-day activities in the classroom, including prepping of discipline lab experiments and assisting students in the use of lab equipment (i.e. computers, graphing calculators, and other technology or materials related to the discipline).Oversee implementation of course assignments, projects, and lab instructions, and keep an updated file of faculty syllabi.Maintain confidentiality of student records in compliance with the Family Educational Rights and Privacy Act (FERPA). Ensure offices and files are adequately secured on a daily basis.Follow proper safety guidelines to ensure the safety and well-being of lab students at all times. Oversee implementation of, and adherence to, safety guidelines by faculty and students.Oversee day-to-day activities of part-time lab assistants and student assistants in absence of the Lab Manager.Maintain a clean lab and work areas and maintain inventory sheets of all supplies/equipment. Generate reports on missing or broken equipment and supplies and advise lab manager.Provide Lab Manager with supply/equipment requests for each semester.May collect, document, and store hazardous wastes generated in the laboratory. Maintain records including waste generating logs, chemical inventories, and supply inventories.Perform other duties as assigned.Perform all duties and maintain all standards in accordance with college policies, procedures, and Core Values.Required Qualifications:Bachelor's degree in the discipline from a regionally accredited institution and one (1) year experience required. Master's degree from a regionally accredited institution, preferred. Three (3) years experience, preferred.Experience managing a chemical inventory and hazardous chemical waste.Knowledge, Skills and Abilities:Knowledge of laboratory methodsKnowledge of lab based instructional techniquesKnowledge of standard higher education policiesKnowledge of various types of laboratory equipmentKnowledge of personal protective equipment when working with hazardous wasteKnowledge of OSHA and EPA waste regulationsKnowledge of Collin College policy and procedureComputer skillsOrganization and time management skillsInterpersonal skillsClassroom management skillsComputer skillsCommunication skillsAbility to provide advice to tutorsAbility to follow protocolsAbility to operate and troubleshoot equipmentAbility to work independently Ability to assist students in using technologyAbility to work closely with facultyAbility to teach effectively and assess student learningPhysical Demands and Working Conditions:Light Work - Exerting up to 20 pounds of force occasionally, up to 10 pounds of force frequently, and/or a negligible amount of force constantly having to move objects. If the use of arm and/or leg controls requires exertion of forces greater than that for the Sedentary Work category and the worker sits most of the time, the job is rated Light Work. Positions in this class typically include talking, hearing, seeing, grasping, standing, walking and repetitive motions, plus stooping, kneeling, crouching, and reaching. Relatively free from unpleasant environmental conditions or hazards. Office environment. Little physical effort required.***This is a Security Sensitive position. Therefore candidates will be subject to a criminal background check.***The intent of this job description is to provide a representative summary of the types of duties and responsibilities that will be required of the positions given this title and shall not be construed as a declaration of the specific duties and responsibilities of any particular position. Employees may be requested to perform job-related tasks other than those specifically presented in this description. Fair Labor Standards Act (exempt/non-exempt) is designated by position. The employer actively supports Americans with Disabilities Act and will consider reasonable accommodations.Employment Type:       Full-time Staff  Compensation Type:    Annual  Compensation Range: $47,353.00 - 54,456.00 For any employment questions, please contact HR at (972) 985-3783 or email employment@collin.edu.Collin College provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics."}