{"title":"Network Engineer/Administrator NEW!","location":"","salary":"","description":"","term":"$43 to $48 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJQH1Gz7VFU3Q8lMBDLm4jv_ci2UQD1HKpn-hf8tR1iOoHEsvEi5xmHQ_xgAPR68uLD0Mw03QYDmCgk10RzdcGHIK50VW046smAj1-qrGAlQpBLHoK16IAq3QKZ5diovuXmts9GsgcP2YXHZTd4zPofGalQYLRjeudYk_8kFUgAQrNQ-NBnGHVvbKiLmUU","source":"ziprecruiter","full_description":"We are seeking a Network Engineer to become an integral part of our team! You will be responsible for designing and implementing computer and information networks.Responsibilities:• Experience with routing and switching from both a Cisco and Brocade perspective to include the Cisco Nexus Series• Experience with firewalls and VPN Concentrators such as Cisco ASA.• Experience with other networking hardware such as F5, Juniper and Riverbed.• Experience with monitoring solutions and diagnostic tools such as SolarWinds, NetScout, etc• Working experience with Disaster Recovery planning, implementation and testing• Perform root cause analysis, identify and isolate technical issues.• Communicate complex technical problems concisely and professionally to technical and non-technical audiences.• Complete tasks required to maintain service levels and availability of all site features and functions.Job TitleSenior Network EngineerTop Skills:1. Candidate must have expert experience (8-10 years) providing enterprise network support in a Cisco environment.2. Candidate must have senior level experience with Cisco/Brocade routing and switching.3. Candidate must have senior experience conducting root cause analysis to identify and isolate technical issues along with performing disaster recovery planning, implementation, and testing.Additional Skills & QualificationsCandidate must have a CCNA Certification and a Security+ Certification. and Secret ClearanceRequired Experience• Experience working in a DoD environment• Ability to work many tasks simultaneously with limited supervision, be a self-starter, and able to work in a team environment.• Strong problem solving and troubleshooting skills to include working with external vendors/consultants to diagnose complex problems and drive resolution.Our government customer is seeking a Senior Network Administrator to support an enterprise Cisco environment. Candidate must have experience with Cisco routing, switching, and firewalls as well as senior experience in troubleshooting and disaster recovery."}