{"title":"Senior Embedded Hardware Engineer","location":"","salary":"","description":"","term":"$90,000 to $130,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIxAH6JC8_na7B_de2MgGfTZvWw2JGsTmyaZcD4mXowIGxPVMeA2W9whjJRoLwTXUTvaT_-9OzjpaSJzD1SLAThTs0rOE_FhO8qp0p0eEzlL9GeVToUbyCu9PAWlcl9tNvneyDmV9UdsMuHwdb5nPw9xbfVY-gvEgvWf6YS8PYYlGowQcvl9vro_BZnCd8","source":"ziprecruiter","full_description":"Senior Embedded Hardware Engineer If you are a Senior Embedded Hardware Engineer with experience, please read on!This is a full time position! This position will report directly to our VP of Engineering at our Ann Arbor location. We are a innovative, growing, and collaborative Energy company that specializes in IoT sensors! Due to growth and demand for our services, we are in need of hiring for a Senior Embedded Hardware Engineer.What You Will Be Doing- You will take ownership of the electronics and hardware for our first generation product. - You will be taking our prototype to commercial level.- You will help build out an engineering team.What You Need for this PositionSenior to lead level of engineer preferred. You should know most of the following:- PCB, Circuit Design- IoT devices- BLE, Wi-Fi, Zigbee, LoRa- Hardware and FirmwareWhat's In It for You- Competitive base salary and overall compensation package- Full benefits: Medical, Dental, Vision- Stock Options with ad hoc bonuses. - Generous Paid time off (PTO)- Vacation, sick, and paid holidaysSo, if you are a Sr. Embedded Hardware Engineer with experience...1. Apply directly to this job opening here!OR2. E-mail directly for more information to rex.redjai@CyberCoders.com - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}