{"title":"Senior Software Engineer-Microservices NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ5LxSsIhYqU-wSpQIqaYt2IvGKgbKSfDWYY5T7cUMy0SkYhVwozx3oPi1AL0oeZvBUZCHOh_HAlGjzxl8-7l_w0h6YL88WPQJPsXMBGzTDUYETBx1G7IKj6k_mtI1W-U642ygffB_XrJoV9UklyJTH8bH5keJM1IfKidMuCmKnfSii_sRjOoT8q5izrjQ","source":"ziprecruiter","full_description":"If you are a Senior Software Engineer ready to make an impact in a collaborative, fast-paced, cross-functional team, this could be a great opportunity for you! STAND 8 is a strategic services and staffing company that partners great talent with amazing opportunities in technology solutions for all industries. This position will start remote, but must be able to work on site in Mexico City in 2021. JOB DESCRIPTION We are seeking a highly motivated Sr. Software Engineer with 7+ years of experience in enterprise and/or hosted applications development. You will work closely with a very experienced team to extend and support our industry-leading integration solutions and work with many of the latest technologies. We seek a candidate with demonstrable, proven expertise in Cloud application development, design, and implementation. Broad experience in various types of databases, distributed, and web-based applications.RESPONSIBILITIESYou will be responsible for designing and implementing product enhancements, design of existing product functions, troubleshooting and resolving product defects, unit and integration testing. Active interaction with internal customers, other developers, Quality Assurance, Business System Analysts is an integral part of the role.Participate in project/work planning sessions to analyze requirementsUnderstand requirements to the level of being able to contribute to their creation, in collaboration with capability/product and/or business ownersDeveloping and re-factoring existing products, providing product enhancements and resolving product defects to meet customer issuesProviding technical expertise and peer code reviews to other team membersDevelop and integrate applications per specificationsTranslate technical requirements into application code and modulesMake modifications to existing applications and modules in accordance with specificationsSupport operational teams with system maintenance, such as upgrading, fall back, troubleshooting, etcApproach work with a DevOps and continuous improvement mindsetKeep up-to-date with emerging cloud technology trendsWork in a highly collaborative and dynamic agile team environment with multiple levels of technology staff across various geographical locationsProactively maintain and manage the cloud environment.Ensure consistency with cloud architectural guiding principles for assigned projectsDevelop prototype or \"proof of concept\" implementations of projects where the technical solution is unknown or unprovenAssist in resolving technical support issues.Proactive in raising problems, identifying solutions and giving/receiving feedbackAssist in identifying and correcting software performance bottlenecksAssist team leads and project managers in work break down and story planningEXPERIENCE Bachelors in Computer Science or equivalent work experience7+ years of professional experience designing, developing, deploying, and supporting products in an enterprise or SaaS environmentExperience with full life cycle development: requirements gathering, analysis, design, coding, unit testing, and acceptance testingAWS (EC2,RDS, ALB, Cloud formation, Code pipeline, API gateway, S3 , SQS , SNS)Cloud native development experienceProficiency in Java development frameworksSpring boot developmentWeb services, XML/HTTP, REST, APIs SpringExperience with micro service frameworks (Spring Boot or similar)Experience with Container technologies such as Docker, AWS ECSExperience with Oracle, or My SQL databasesExperience with agile/DevOps methodologiesExperience with Linux or UnixOTHER SPECIALIZED KNOWLEDGE AND SKILLS REQUIRED Proven strong analytical design and trouble-shooting skillsHighly accountable for meeting all commitments and deadlinesEffective communication skills, both written and verbal for technical and non-technical audiencesMust be able to work independently as well as collaborativelyDrive for continuous process improvement"}