{"title":"          Java Full Stack Developer NEW!        ","location":"","salary":"","term":"Contractor","jk":"","detail":"https://www.ziprecruiter.com/k/l/AALIW1yZ2axDo_3T17BC2l2ylQY1SHHowTakboiJ-prjwfiiNvfMdpHjwXJjQGcLreQ1Enx-DMJaGAEXiHOIkZoG6M5WmQHqYvo0GQSSuFfysMKuyke3GW5jUSBhArP6MEg_rSgsWIxgbQU-11r2dy7P-HKbvDFpEyLrfvxazKlWdM6hflxsN6yxWA0qS_w","source":"ziprecruiter","full_description":"\n        This Java Full Stack Developer must have strong hands-on technical experience with Java (WebSphere) development and provensuccess architecting, developing and implementing full stack web applications for a large organization. Services are expected to start 03/15/2021 and are expected to complete by 08/31/2021. The primary goal of the worker will be to drive, assist, and implement web application upgrades. Daily Tasks Include:Participating in all phases of SDLC, including design, software development and code review. Performing extensive code reviews and analysis. Writing reports on code analysis to determine if industry standards and best practices are being followed; Providing analysis to address found short-comings. Providing guidance and knowledge sharing to existing development staff. Minimum Requirements:​7 Years Experience with full-stack web application required7 years of Development Experience with web technologies: HTML, CSS and JavaScript 5 Years of Experience with Struts 1.25 Years of Experience with IBM WebSphere 5 Years of Experience with SQL Server, Oracle, Selenium5 Years of Experience with highly complex application security requirements 5 Years of Experience Required with code reviews and in-depth code analysis 4 Years of Experience with Java 1.7, MyBatis, JUnit, Subversion, Git, and BitbucketExperience with WCAG 2.0 Standards, 508, Compliance/Web Accessibility Experience completing system documentationExperience with Agile development with Scrum, KanbanExperience working with Enterprise software solutionsPreferred QualificationsExperience with Eclipse IDE Public sector experience (Federal, State or Local Government) Experience with ConfluenceProficient with the Microsoft Office products, including Outlook, TEAMS, Microsoft Project, Word, Visio, Excel and PowerPoint The ideal candidate must be able to: Work with Business Customers, Section Managers, Project Managers, Business Analysts and Subject Matter Experts (SMEs) in a professional and collaborative manner to define strategies and implementation approaches.Perform full-stack development using Java (WebSphere)Write web frontends that meet WCAG 2.0 Standards and 508 Compliance/Web Accessibility requirementsWork with relational databases including SQL Server and Oracle.Write T-SQL scripts that store and query relational data including joining and grouping. Perform in-depth code reviews and analysis Write unit tests using JUnit Write automated tests using Selenium Develop processes and procedures for Application Services. Work independently in a team environment with local and remote teams Use strong written, verbal, and interpersonal communication skills.Use knowledge of software development methodologies Agile and Scrum Implement problem-solving skills and ability to multi-task with readiness to put in extra efforts when necessary\n      "}