{"title":"Sr DevOps Engineer NEW!","location":"","salary":"","description":"","term":"$130,000 to $140,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIOg_fjQiFmDeTVadfi3FTRq7uBiCGTmDgSR4Agc2YWqLMc3mvZSl4P0Rp4ZYYwZfB20_HSoWrpQmB7Dm2TE5KOTki4jFDwIbj0su0OGnsLwS8m4PKx1pgIqr3r63W-l_fZvheC4cjD1iN8KoKHjlVNA3NkKj1zUxDHLiUy3KhOL3Bn3hqzK4ze6MPw8vU_","source":"ziprecruiter","full_description":"Swoon is partnered with a Cleveland-based company who is seeking a Sr DevOps Engineer to add to their rapidly growing team.Position Overview:The Sr. DevOps Engineer is responsible for providing build, run and automation support for corporate IT division that is responsible for Enterprise, B2C and B2B infrastructure. The Engineer will be expected to be familiar with datacenter and cloud architecture, logical and physical design, infrastructure as code, virtualization, automation, python programming, shell scripting and backup & recovery concepts. The candidate will also collaborate with the team to design, develop, implement and manage the software development build, deployment, testing and release pipelines/processes to achieve scalable Continuous Integration/Continuous Deployment (CI/CD) objectives with minimal guidance.Job Responsibilities:Act as an Evangelist for Automation, SDLC best practices and Configuration ManagementUtilize proficient understanding of AWS and Azure Cloud technologiesWrite infrastructure as code (Ansible, Chef, Terraform, Docker, CloudFormation)Develop and maintain complex technical documentation and processesSupport existing systems and automate root cause analysisProvide technical guidance on Cloud and server-based technologies, including hardware provisioning and management of virtualization technologies and collaboration toolsWork with Lead to develop standards and procedures that support current and future operational needs with a focus on continuous improvement and automationAssist with the planning and delivery of all major software upgrades, system maintenance activities, technical patching and hardware refresh initiativesReview technical requirements and solutions to ensure all security requirements are addressed and in line with corporate standardsMinimum Requirements:Bachelor’s degree in Computer Science or equivalent combination of relevant education, training and experience3+ years of technical experience in engineering and supporting a large, complex server environment3+ years of providing technical leadership and engineering assistance to experienced and junior server engineers and administratorsExperience in designing, implementing and operating consumer facing server infrastructure in a highly virtualized and dynamic environmentProficient knowledge and technical skills in Linux, Dell / Lenovo hardware including hardware provisioning, hardware installs and upgrades, firmware and module patching and lifecycle planningProficient knowledge and understanding of Redhat server virtualization, the open-source ecosystem, resource management, capacity and failover planning to minimize unplanned disruptions to business applicationsProficient knowledge of ITIL service management and disciplines to drive continuous improvement of service deliveryHands-on experience building and handling VM’s, Containers utilizing tools like Azure Portal and DevTest labs, Kubernetes, Docker, Jenkins and Ansible TowerHands-on experience developing and maintaining CI/CD processExperience scripting Amazon Web Services and Azure using Python, Bash and Perl preferredKnowledge of HTML, HTTP, Content Delivery Networks and other related internet technologiesUnderstanding of Firewall access rules i.e. iptables, AWS security groups, Mod Security, etc.Understanding of declarative configuration management i.e. Ansible, Chef, Puppet, etc.Understanding of key network protocols (DNS, HTTP, SMTP) and related server configurationStrong familiarity with common Linux config files and command line toolsUnderstanding of the basics of IP networking and routingAdept with Linux command lineAdept with ssh (key management, port forwarding, debugging)Proficient understanding of Virtualization platforms, VMware and KVM"}