{"title":"Technical Coordinator NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ98afbdEPuOi8-e-9L3yIipimuZ93fe8LAZtJ3Lnoll51_WuHfq8oRrhe8AMbVI9KrEBo8VW_yZIbpomtkzfof7BvlKLLDHzPnlbHGilseJhOd67CK4rSdXO7o4Ax12oYYffzC-O5TrGxwZqD1cww6KK3r8sdUA_uSqbQI0FSRcbkX-wlKagbxPF2O9F0","source":"ziprecruiter","full_description":"Job Title: Technical Coordinator Reporting To: Service Manager FLSA Status: Salary Non-Exempt Description: Service Coordinators utilize a number of skills to provide all-star support to our clients and internal teams. This includes but is not limited to creating and triaging all incoming service requests, scheduling resources and providing proactive communications with foresight, confidence, empathy and charm. Candidates should possess the ability to think fast on their feet, a willingness to help others and the ability to take internal coaching and client frustrations in stride. It is an absolute must that the Service Coordinator demonstrate superior communication and organization skills to respond to diverse and sometimes urgent needs. The majority of the Technical Coordinator role and responsibilities revolve around supporting: Following Applied Tech’s ticket creation guidelines and triaging service tickets. Own Applied Tech’s Response Time Objectives (RTO) ensuring technicians receive tickets in a timely fashion and following up on tickets that may have breached the RTO. Schedule internal and field resources as needed to facilitate client requests. Oversee the escalation process and ensure tickets are meeting assigned RTO’s during this process. Update company and contact information in our ticketing system as it changes. Oversee proper communication based on Applied Tech’s Problem and Incident Management guidelines.  Other responsibilities may include: Maintaining the On-call calendar Work with Team Leads to ensure members achieve 85% utilization Work with Team Leads to ensure RTO’s are met or exceeded To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required: Basic computer and operating system knowledge Interpersonal skills: telephony, written, active listening and customer-care Ability to multi-task and adapt to changes quickly. Technical awareness: ability to match resources to technical issues appropriately. Service awareness of all Applied Tech’s key services for which support is being provided. Understanding of support tools, techniques and how technology is used to provide services. Typing skills to ensure and quick and accurate entry of service request details. Self-motivated with the ability to work in a fast-moving environment. Our service team supports clients Monday through Friday from 7am - 5:30pm CDST and Service Coordinator position is expected to be Monday through Friday, 8:30am – 5:30pm CDST to facilitate department needs and expectations. Typical work weeks do not exceed 40 hours. This position is metric-driven and key performance indicators include personal and department utilization, Response Time Objective adherence, and overall customer satisfaction.  Applied Tech strives for excellence in all we do and a part of that is continuous skills development. Service Coordinator should be prepared to further their skill sets by focusing on a handful of various industry-driven certifications such as ITIL, CompTia Project+ and other certs or training programs as needed.  The majority of the support we provide is remote and you'll be asked to interact with computers daily for extended periods of time, this could be standing or sitting but could be up to 8 hours a day or more. There are situations where you may also need to travel to a client site to provide technical assistance or during hardware deployments, the ability to travel legally and safely is a must. We also work with physical hardware including workstations, printers, servers and more; you will need the ability to lift and move up to 40 pounds on an occasional basis. This is a full-time position that offers benefits such as paid time off, health/dental/vision insurance, 401k and more. Note: This job description is not intended to be all-inclusive. Employee may perform other related duties as requested to meet the ongoing needs of the organization."}