{"title":"Mobile Applications - Developer Technical Specialist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALo9gqY8KLix1Y2zR5vwh7SLbKAN40TbKVrs_D8T03l_nuIfqOrrUkEmiDiCVbQtsp90DchPTR03xhSmtzb8LfQo1CZF0aOMMGYk3M3eJo4YVB9s3jWQcaDAeSLRZfVoX0S_kFIp5Szq7co6TBvhN8_EVP66agVnqHgXVa-DYKHMNkqLYH5uk3B5GEyDoDR","source":"ziprecruiter","full_description":"Mobile Applications - Developer Technical Specialist Description Our culture believes in POWERING YOUR POTENTIAL. We provide global opportunities to develop your career, make you community a better place and work with most innovative thinkers to solve world's toughest problems. We believe in flexibility for you to explore your passions while making an impact through meaningful work within our inclusive workforce. That's what #LifeAtCummins is all about. We are looking for a talented Technical Specialist - Mobile Applications Developer to join our team specializing in Cummins Electronics and Fuel Systems for our Component Business Segment in Columbus, IN. Your impact will happen in these and other ways: + Applies and supports the improvement of electronic tools development processes and tools. Processes include Electronic Tools Product Line (ETPL) common workflow, 7 step problem solving, application product development (requirements, design, development test, support). Tools include platform specific compilers and toolsets for Windows, Linux, Android, iOS, software lifecycle tools (such as Integrity) and requirements management (Integrity, Doors), configuration/change management. + Obtains input and negotiates with product and software development teams and delivers verified software features, components, builds and support to product teams and end users. Makes decisions in the areas of software architecture, requirements, design, and test that impact product and feature design. + Responsible for review of less-experienced developers/testers' work to ensure robust, reusable, and efficient design. Provides independent leadership of smaller business impact projects or ownership of complex components, products, systems or services with greater elements of ambiguity over the senior or lead engineer level and with full accountability to the project team.  + Delivers independent execution of established and emerging work processes and systems, while still developing technology or product knowledge. Leads the development and improvement of work processes and systems across a functional discipline area within a business unit site. + Coordinates and directs work amongst technicians and temporary student employees, assists in the transfer of knowledge to lesser experienced engineers through either indirect (scope of influence) or direct management of a small, local group of engineers.  + Provides support and guidance to influence technical direction within a project team and continues to develop proficiency in the competency areas critical to success in the role.Operates as a recognized specialist in a discipline or product area within the immediate team. Education, Licenses, Certifications University, or equivalent Bachelor's degree in Engineering or other relevant technical disciplines is required. Post-graduate (Master's) degree relevant to this discipline area may be required for select roles.This position may require licensing for compliance with export controls or sanctions regulations. Experience Prior Senior or Lead Engineer equivalent work experience (5 plus years - leadership opportunity) in a relevant discipline area is required with a demonstrated track record of technical problem solving and quality decision making. Knowledge of MS Office tools is preferred + Senior developer capable of programming in C , Swift (iOS) or Java/Kotlin(Android), exposure to all three will be highly preferred; + Translates requirements for customer features into designs, implementation, and automated tests for mobile applications running on Android, iOS, and other platforms. Ensures standard engineering processes are followed in an agile software development environment adhering to Cummins best-practices. Creates estimates of the effort necessary for delivering customer features + Mentors junior employees on Cummins processes, creating robust designs, utilizing industry standard toolsets. Ability to effectively work as part of a global team + Experience in mobile graphical user interface design; and strong problem solving and troubleshooting abilities + Ability to effectively work as part of a global team. Automotive industry experience preferred At Cummins, we are an equal opportunity and affirmative action employer dedicated to diversity in the workplace. Our policy is to provide equal employment opportunities to all qualified persons without regard to race, gender, color, disability, national origin, age, religion, union affiliation, sexual orientation, veteran status, citizenship, gender identity and/or expression, or other status protected by law. Cummins validates right to work using E-Verify. Cummins will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each new employee's Form I-9 to confirm work authorization. To learn more about E-Verify, including your rights and responsibilities, please visit www.dhs.gov/E-Verify . Ready to think beyond your desk? Apply for this opportunity and start your career with Cummins today.  Not ready to apply but want to learn more? Join our Talent Community to get the inside track on great jobs and confidentially connect to our recruiting team: https://www.cumminstalentcommunity.com/profile/join/ Job ENGINEERING Primary Location United States-Indiana-Columbus-US, IN, Columbus, General Office Building Job Type Experienced - Exempt / Office Recruitment Job Type Exempt - Experienced Job Posting Mar 8, 2021, 9:42:51 AM Unposting Date OngoingReq ID: 2100004I"}