{"title":"Technical Content Lead NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKajlwp2-3CWmNeApJp068Gf3tdh77WoVNmjL56Zi4YoHgMWgvH72__1j8eblZoNhSmBH7fMkM8vXifaZBv6KoE2UEQ15X7NXi60umINnibmFwrmavMBjED9GVgxxnrl5JsWFltyfABdidxcP53QnpwjSh3nhQKhIh461KGkRyQ5yQihzbUSumxCpldireC","source":"ziprecruiter","full_description":"Technical Content LeadAbout US At Vyaire, we help the world breathe easier. As a global leader in respiratory care, we know what we do enables, improves and extends lives. We are a young company with a long history of revolutionary products. We devise extraordinary solutions that allow patients to lead ordinary lives. We believe the best way to create value for our customers, is to become invaluable. We know a dynamic culture with diversity of thought makes this possible. Our colleagues are people who specialize in exceeding expectations, building lasting relationships and making it a priority to listen. We are dedicated to anticipating what's next and get it done. We thrive on contributing and making a difference.To learn more, visit our website: www.vyaire.comWatch our video: https://www.youtube.com/watch?v=ZDrQoMbMRrI&feature=youtu.beAbout this role Vyaire teams are dedicated to connecting clinicians and patients with the highest quality respiratory healthcare solutions in the market. At Vyaire, you will find a company that puts the customer at the center of all we do. Our culture is one that rewards performance and each interaction we have with a customer furthers our mission to be the global leader in respiratory care.As a Technical Content Lead, you will be responsible for developing and managing technical documentation for the US technical support team. You will work with subject matter experts in Technical Support as well as other cross functional teams to develop troubleshooting scripts and manage the knowledge database for US Technical Support.Essential Functions:Create and distribute technical bulletins, troubleshooting guides, technical updates and other pertinent materials to Technical Support, Field Service and other internal teams as appropriate.Develop and manage Technical Support troubleshooting scripts/flowcharts for the entire Technical Support teamWork as a liaison to distribute relevant documentation and updates to Technical Support from the Sales, Service, and Training departmentsCreate and maintain internal parts lists to be utilized by Technical Support and other teamsDevelop and manage a shared site for team members to access knowledge articles, service and operations manuals, troubleshooting scripts and other procedural documentsPartner with the Training team to develop content and schedules for Technical Support ongoing trainingWork with the Technical Support Manager and team leaders to execute strategies to achieve operational objectives.Help onboard new Technical Support team members through introduction to technical content, coaching on troubleshooting guides, and collaboration with supervisors and managers on training and development plans.Drive continuous improvement initiatives to improve customer support.Collaborate and support field sales, service, training, project management and other internal teams to support customers and achieve objectives.Measure, track, and improve customer satisfaction results.Develop, implement, document, and maintain quality system procedures and policies for functional area(s); participate in the development of policies for the field service and factory service teams.Improve patient outcomesMeaningfully impact the company's short-term and long-term successWork closely with executives across the organizationGrow your role as you see fitLearn everything there is to know about respiratory medical device manufacturingCreate an inspiring workplaceQualifications:Five plus years of medical device experience, preferably with expertise in either ventilation or respiratory diagnostics productsExcellent communication skills (both verbal and written)Prior experience documenting technical processes or developing troubleshooting guidesExperience creating and improving processesExperience working with Microsoft Office products (Outlook, Excel, Word, Power Point)Ability to work independentlyCritical thinking skills with ability to think through issuesAbility to work under tight deadlines and manage multiple projects at a time.Self-starter, ability to perform effectively during times of ambiguity, rapid change and growth.Bachelor's degreeAtlanta, GA, Columbus, OH, Dallas, TX, Irvine, CA, Mettawa, ILFull time"}