{"title":"Electronic Module Software Engineer, Wichita, Kansas","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKxlj0sfRCnn2AOCYgmD24kk84Ve4p-ul1GZBUNTTdkoMci2YxCOGz3KJZsJY9BJ1khqE4TDHVnD1cge1kSQ6NqWRS9t6kNaofw8m73hJKtAwEwQyYU_5ffotNbby65SNHa3yF_hVfaLn711o6iazCMj1-ldXgBCv0Jn8UJH6V1MKFejfvm_i2NmUPyFFo","source":"ziprecruiter","full_description":"Link: Electronic Module Software Engineer, Wichita, Kansas Company: PDS Tech Location: United States, Kansas, Wichita Job Title: Electronic Module Software Engineer, Wichita, Kansas Job Description: Develop embedded and hosted software solutions to support IoT connectivity on aviation hardware. This role is responsible for but not limited to developing software on target hardware, deploying secure web communication services, and interacting with internal information security groups to ensure successful integration into product. I. Architect and develop an end-to-end, secure, networked connectivity platform for aircraft hardware II. Develop embedded software using C, Java, and Python III. Implement hosted software solution with industry-standard security and coding practices IV. Design, test and document both embedded and hosted software comprising the complete connectivity solution V. Interface with Application Development Team to produce a UI/UX that will leverage the connectivity platform VI. Coordinate IT security reviews and approvals with Risk Management Team VII. Track and develop functional requirements of software solution VIII. Validate solution using automated test cases IX. Participate in cross functional teams to understand and gather business requirements for new or updated processes X. Support the team as an experienced software engineer I. Architect and develop an end-to-end, secure, networked connectivity platform for aircraft hardware II. Develop embedded software using C, Java, and Python III. Implement hosted software solution with industry-standard security and coding practices IV. Design, test and document both embedded and hosted software comprising the complete connectivity solution V. Interface with Application Development Team to produce a UI/UX that will leverage the connectivity platform VI. Coordinate IT security reviews and approvals with Risk Management Team VII. Track and develop functional requirements of software solution VIII. Validate solution using automated test cases IX. Participate in cross functional teams to understand and gather business requirements for new or updated processes X. Support the team as an experienced software engineerApply Now"}