{"title":"Senior iOS Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALmH8QRjWC4mDkfg_GyMX9jpndOs9sZ5Uvb_0zG_FnMltZcJZwYv-xxKfAFCgMGTtWb9qaunoUrRyc_dzk05sjVShPZjf4Qwf8vZ0ZU0JbBcFWCFBzbSoIbqUJM1AI_zDcAalx0528IqGKvHg_nwCMrpgCrVMPw52kcT5dtzrvlYkr7lMrqBo1bXipSzfgo","source":"ziprecruiter","full_description":"Job Posting TitleSenior iOS EngineerSummaryLife at Big Fish GamesBig Fish Games is an innovative developer and world-class publisher of a diverse portfolio of casual game franchises, including Big Fish Casino, Gummy Drop!, Fairway Solitaire, Jackpot Magic Slots and Cooking Craze. Founded in 2002, we serve millions of players every day and are dedicated to providing players with the opportunity to play, connect, compete and discover anywhere and on any device. We are dedicated to enhancing life through exceptional play.Our four core beliefs are what makes working at Big Fish Games unique. We believe in a work environment that:Creates opportunities for impactShares a passion for challengeCultivates a spirit of creativityThrives through collaborationLife at Big Fish GamesBig Fish Games is an innovative developer and world-class publisher of a diverse portfolio of casual game franchises, including Big Fish Casino, Gummy Drop!, Fairway Solitaire, Jackpot Magic Slots and Cooking Craze. Founded in 2002, we serve millions of players every day and are dedicated to providing players with the opportunity to play, connect, compete and discover anywhere and on any device. We are dedicated to enhancing life through exceptional play.Our four core beliefs are what makes working at Big Fish Games unique. We believe in a work environment that:Creates opportunities for impactShares a passion for challengeCultivates a spirit of creativityThrives through collaborationThe Big Fish SDK team is seeking an experienced Unity Software Developer to work on bringing Big Fish platform features to our Unity developers. We are looking for a software engineer with extensive experience in Unity, in particular interfacing Unity code with the Android and iOS mobile platforms. This individual should have extensive experience working with projects for both iOS and Android and integrating 3rd party Unity Plugins. If you're a wizard with plists and Android Manifests, gradle and XCBuild then this role is a good fit for you. We're a fast-moving team with an opportunity for this individual to bring our Unity offerings to the next level. Empowering developers is one of our top priorities, so if you are passionate about Unity and have the depth of mobile experience to design and deliver an SDK for developers around the world, then this position might be perfect for you.ResponsibilitiesExpand our existing Unity SDK project with feature and architecture improvements to help grow our company's gamesHelp to design and implement new features for the Big Fish Unity SDKBuild out a release pipeline for shipping Unity projectsTackle iOS and Android related challenges when working with UnityBring your Unity experience to continuously drive improvements in Big Fish's mobile investmentsWrite tests for existing and new Unity softwareCreate new APIs for our Unity developers to interface with Big Fish servicesContribute to the technical growth of our mobile engineering teamQualifications4+ years of Unity application development experienceExpert coding abilities in C# and UnityStrong OO design and coding skillsAbility to deal with ambiguity, and willingness to help debug difficult issuesExperienceworking on a development team that practices Agile/scrum methodologies Degree in Computer Science or a related fieldPreferred Experience:6+ years as a software engineer working on mobile client applications written in UnityExperience creating software libraries / frameworks meant for consumption by a 3rd partyJava/Kotlin and/or Objective-C/Swift experience is a big plusStrong architecture, analytical and design skillsExperience using CloudBuild to deploy Unity ApplicationsExperience with iOS and Android applications and underlying technologiesBig Fish Games is an equal opportunity employer. We bring unique talents together to build something special that's why we welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status.Why Aristocrat?World Leader in Gaming EntertainmentRobust benefits packageGlobal career opportunitiesOur core values: All about the player, Talent Unleashed, Collective  Brilliance and Good Business, Good CitizenOur Winning WaysUnite - Come together as one team, with one visionDevelop - Empower, inspire and grow our peopleDeliver - Execute with excellence, be accountable for resultsPlay - Be creative, celebrate successThe US based roles may require registration with the Nevada Gaming Control Board (NGCB) and/or other gaming jurisdictions in which we operate.LocationSeattle, WA, USJob familyBig Fish GamesContract TypeRegularTime TypeFull timeCompanyBig Fish Games"}