{"title":"          Accounting Manager (Areospace) NEW!        ","location":"","salary":"","term":"$85,000 to $115,000 AnnuallyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAIeyRhnl-AY_DfTujRtJp1R89amecTd4nZQiUohtugFN_r5ubTikuf-ITqY6TicpnQ0TKECXJufR4k2vUhPNl2MbYsyYdYuI-2lo1HNrFD2s0UZ0Lyl-trN0k1Pm3tLHyYJl60aWLTgftohSr--nXC7slcKFj51GXG9FsIIuGk9wzGWinJ7Qpdgo4Sdpmk","source":"ziprecruiter","full_description":"\n        Accounting ManagerSummary of position:We are seeking a high caliber Accounting Manager for a long-term basis within our client’s team of experienced professionals to supervise, track and evaluate day-to-day activities. Accounting Manager, responsibilities include establishing financial status by developing and implementing systems for collecting, analyzing, verifying and reporting information. Based in Orange County, CARequirements / Must haves:College degree in Accounting, Finance or related fieldMin. 5 – 7 years in Accounting; Min. 3 years as lead or head of Accounting Dept.Experience in manufacturing environment highly preferredSupervisory experienceKnowledge/Skills/Abilities:Excellent verbal and written communication skillsGood interpersonal skills; ability to interact in a courteous and professional mannerProficient in using Microsoft Office (highly proficient excel skills); excellent knowledge of accounting software; experience with ERP systems preferredProven knowledge of accounting principles, practices and standards.High attention to detail and accuracy; ability to analyze and interpret data; excellent data entry skills.Good judgement and ability to maintain confidential/sensitive information required. Job Duties:Oversees operations within the Accounting Department, and maintains a documented system of accounting policies and procedures in conformance with Generally Accepted Accounting ProceduresEnsures that accounts payable are paid in a timely mannerEnsures that all assets/(disposals) are insured/(deleted) and recorded in a timely mannerEnsures that accounts receivable are collected promptlyEnsures that periodic bank reconciliations are completedEnsures that required debt payments are made on a timely basisMaintains the Chart of AccountsMaintains an orderly accounting filing systemMaintains a system of controls over accounting transactionsIssues timely and complete financial statementsAssists with Forecasting and Budget developmentCalculates and issues financial and performance metricsAssists with financial analysis, variance and budget reviewCoordinates the provision of information to external auditors for the annual review and/or auditComplies with local, state, and federal government reporting requirements and tax filingsAdheres to all Department and Company policies and proceduresEmployment Type: Direct HireLocation of Position: Orange County, CALocation Type: Office/FacilityTo apply for this opportunity, please contact Ora Chak; email: Ora.Chak@trsstaffing.com TRS Staffing Solutions is an Equal Opportunity Employer that recognizes the value of a diverse workforce. Employment decisions are based on job related criteria and not on the basis of any unlawful criteria. We ensure equal access to employment opportunities, services, and programs. Must have legal right to work in the United States. We thank all applicants for their interest; however, only those selected for interviews will be contacted.\n      "}