{"title":"Construction Safety Manager NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL4NFYp6XhGip_uLmPdyZg8dUqtuLDUIHhxGb3qEOIpXua7WmSWCcecaHp-u2aL0FMUPQVcy04TBQ0Y4oXh7YDSbbNkzUTZmu-3rRbMkZ5uu9M67iHmMBZL0pgofVPxQqPyUDEOSblhHsr1yu2HW0qKRHE6PpZSRWpWOr6UoXQL1NlDJ3LskHriKmzlgUI","source":"ziprecruiter","full_description":"Construction Safety ManagerStockton, CA Candidates local to Stockton, CA will only be considered. This position does not pay travel, per diem or relocation. HazTek Inc. is one of the nation’s largest and most experienced occupational health and safety management firms. We are known for our professional consulting services and premium safety training and we are trusted for our effectiveness in keeping workers safe today – so employees and businesses will be here tomorrow. HazTek is growing and currently seeking outstanding performers to join our team.HazTek was recently honored by Inc. Magazine — for the fifth time — as one of America’s fastest-growing private companies. In 2018, HazTek was recognized by NJBIZ as one of New Jersey’s Top 250 privately-held companies.We offer competitive compensation and a great benefits package including, but not limited to, medical, dental, life insurance, long-term disability, paid time off, 401(k), professional development, and education assistance. Please go to www.haztekinc.com to learn more about our Company.The key functions of the Safety Managers are to support specific project needs and ensure that best practices are implemented, safety compliance requirements are met, and an improved safety culture and performance is delivered.Oversee all aspects of a commercial construction project ensuring OSHA complianceWorker safety training verificationsSpot-checking contractor safety data, hours worked, and safety statisticsEnsure applicable laws, regulations, and EHS requirements are communicated to project team members and contractorsIdentify conditions that have the potential to create harm to the environment and communityProvide technical consulting for safety-related issuesEvaluating written COVID-19 Control Programs, and the effectiveness of the site implementation of those program elementsCoordinate incident investigations, documentation, reporting, and follow-upConduct comprehensive on-site safety assessments and verifying effective corrective actions are being completedMonitoring contractor field activity to ensure compliance with OSHA and General Contractor's safety policies, procedures, and applicable regulatory requirementsEvaluate high-hazard work permit processes and periodically monitoring implementation of hot work, excavation, confined space, etc.QualificationsMinimum 10 years of direct construction safety experienceManagement experience preferredOSHA 30 hour in Construction certificationOSHA 510/500 a plusCHST or CSP helpfulFirst Aid/CPRAdvance knowledge of construction safety standardsExperience developing a Site Specific Safety PlanExperience developing a Corporate Health and Safety PlanMust have experience in teaching Fall Protection, Scaffolding, Steel Erection, and Excavation classesAbility to travel helpfulExperience preferred in the following areas:ConstructionContractor Safety OversightIntegrity | Compassion | Dependability | Support | AccountabilityQualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status."}