{"title":"REMOTE Technical Writer","location":"","salary":"","description":"","term":"$30 to $33 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKQCWEa0jBPJxblaW-q8HT0F0ext1s2EMeR79EVssJlDdCpQdClIGk-hEqRgBmmOYhHnHmbc78hhQrq09E8SJIIQalmyUpj9s-fY6fZqhkt2-9MmnGTJsVd0GaFFzBB2X_QgoqHMbLSYoUrM7F5z5lX4K_XaTJBOAvRr3hIispPCP22bA_4AZrNkJ4vjOc","source":"ziprecruiter","full_description":"REMOTE Technical Writer We are currently seeking a seasoned Technical Writer for a 7+ month contractual opportunity (excellent opportunity for extensions) with our Fortune 100 Financial Services client. The qualified candidate will Partners with clients to analyze audience and develop strategy to address technical documentation needs. Responsibilities:Design and develop complex technical documentation including: business requirements, technical and functional specifications and other technical project artifacts, manuals, technical presentations, technical training materials, and/or complex web content. Analyze, recommend and document technical or business procedures and best practices, identifying process gaps and offering alternatives. Actively participate in developing documentation strategy, policy and guidelines. May manage projects related to technical/business process implementation. May edit material authored by others. Provides guidance to less experienced technical writers.Required Qualifications: Extensive (5+ years) procedural technical writing experience Experience with posting procedural writing to websites, digital (paper manuals are obsolete)Input text (HTML) experience Financial/ banking industry experience desiredProcess definition and documentation experience Excellent verbal, written, and interpersonal communication skillsAbout Advantage Resourcing Advantage Resourcing is committed to providing equal employment opportunity for all persons regardless of race, color, religion (including religious dress and grooming practices), sex, sexual orientation, gender, gender identity, gender expression, age, marital status, national origin, ancestry, citizenship status, pregnancy, medical condition, genetic information, mental and physical disability, political affiliation, union membership, status as a parent, military or veteran status or other non-merit based factors. We will provide reasonable accommodations throughout the application, interviewing and employment process. If you require a reasonable accommodation, contact us. Advantage Resourcing is an E-Verify employer. This policy is applicable to all phases of the employment relationship, including hiring, transfers, promotions, training, terminations, working conditions, compensation, benefits, and other terms and conditions of employment. All employees are directed to familiarize themselves with this policy and to act in accordance with it. All decisions with respect to employment matters and other phases of employer-temporary employee relationships will be in keeping with this policy and in accordance with all applicable laws and regulations."}