{"title":"L1 Technical Support Analyst, Part-time and Full-Time (Remote) NEW!","location":"","salary":"","description":"","term":"Part-Time","detail":"https://www.ziprecruiter.com/k/l/AAIlyJ8pgajJIGXeskoYnTkMgWGbpwj1jr6m0u-nYdQg8h3rbuLfAT4wk4Bam4fea3ok3gWGqhdc0UfYXtRmpiVlqYolq8RofGqf4EoamcfIdf0j6YeejftAr3COTKBa5kbQyD1N3nc5-ma8aBUTeqkBr1DUn7zE1T7LPtVefL0iV93Z_72BPKXvU2_Ap8w","source":"ziprecruiter","full_description":"Job DescriptionYuJa is looking for talented individuals to work remotely and play either a part-time or full-time role on our Customer Success and Support Team in San Jose, California. Our team is passionate, excited about growth opportunities and very creative. We are looking for people who are like-minded in vision but also can contribute to the diverse thinking our team requires. About UsYuJa is a leader in enterprise video solutions. Our products harness the power of video to educate, engage, inspire, and collaborate. We serve organizations of all sizes, within all sectors, including higher-ed, K-12, government, healthcare, non-profit, and corporate delivering engaging video experiences. Our portfolio includes products for lecture capture, live streaming, media management, video conferencing, video test proctoring, digital asset management, and enterprise accessibility. We have legal headquarters in Delaware with primary U.S. offices in Silicon Valley, California, and Canadian offices in Toronto. About the RoleAs a YuJa Remote Helpdesk Specialist, you will be responsible for maintaining support operations of the company's infrastructure and environment. The Remote Helpdesk will accomplish this by providing quality after-hours support to our dedicated community of educational leaders and users. About You2 years of customer service experience in a helpdesk environment1 year or more of basic technical support experienceAbility to work from home under flexible hours that will primarily be evenings, nights and weekendsAccess to home internet with speeds of at least 15 Mbps.The workspace must be private (e.g. not via a public wifi connection from a library or coffee shop).The workplace must be private with limited background noise in order to communicate effectively with clients over the phone.Proficient in the use of online and remote-connecting softwareDemonstrated ability to function in a non-scripted helpdesk environment. This position requires the ability to examine, question, explore and troubleshoot a variety of issues.Excellent time and task management skillsExcellent written and verbal communication skills.Technically skilled with good problem-solving abilities (Think of Your Feet)Have access to a private, quiet, and professional appearing working location with strong internet connectivity on any US time zoneAbility to provide timely responses to all incoming requests immediately or within 1 hour.Assess severity/impact level and prioritize support requests accordingly. And escalate to technical lead if needed.Ability to provide excellent follow-through on all open, pending, and resolved tickets that come to helpdesk. CompensationWe offer very competitive compensation packages based on experience and history of contributions.  For Full-Time staff:$40K-$50K Base (based on experience)401(k)Dental InsuranceHealth InsurancePaid Time OffRetirement PlanVision Insurance How to ApplyInterested applicants, please apply directly on the Indeed website with your cover letter and resume. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.   Schedule:40 hr/weekDay shiftHolidaysMonday to FridayNight ShiftWeekendsExperience:Customer Service: 1 year (Preferred)Technical Support: 1 year (Preferred)Communication Skills: 1 year (Preferred)Contract Renewal:LikelyFull-Time Opportunity:Yes Work Location:Fully Remote Hours per week:30-39 Typical start time:6 PM Typical end time:6 AM Schedule:Monday - Friday Company's website:https://www.yuja.com Company's Facebook page:https://www.yuja.com/YuJaNow  Job Types: Full-time, Part-time, Contract"}