{"title":"Application Developer II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKh2jwgBgM9TYN8uk44uxGXydRwGxg4DwctpwhCrG1-VHGsfJ16RrT8rvHAJvit_d2VYArpVBomXjgw0qYGcRXI1QttMQRnsAfJ00NnmaQyWdLflVfaVTwICEF9NvdNeK_WBhh_rbKzIt7mAJ3s8aW7ISJIN5BGYiSZinN4EAwj9eTQOzo1jpRuHuELDks","source":"ziprecruiter","full_description":"Position Description:As part of the Systems Integration team, the Application Developer II contributes to the credit union by designing, creating and providing complex, efficient and resourceful technology solutions.  The solutions may be achieved by integrating 3rd party applications or creating new programs in house, or perhaps a blend of both.  The end result of the technology solutions will enable Ent to meet or exceed various business strategies.Essential Duties and Responsibilities:Development Configures / writes new programs of moderate complexity and scope, working with basic applications systems designs and specifications and utilizing standard procedures and techniques.Conducts code reviews as appropriate for quality and adherence to standards.MaintenanceProvides maintenance support for in-house application infrastructure (business applications and/or host systems).Analysis / Modeling / DesignDesigns and codes programs; creates test transactions and runs tests to find errors and revise programs. Writes documentation that describes installation and operating procedures.Interfaces with system designers to design, code, test, and implement application programs. Assists in developing application specifications.Participates in the RFP/RFI process.Communication Participates in post-implementation reviews of both application development content and process to maximize and share learning.Reports status on activities, issues, projects, etc. to IT management.Other duties as requiredMinimum formal education required for this position:Knowledge consistent with a Bachelor's Degree in Software Engineering, Computer Science or related field of study. Each year of relevant work experience may be exchanged for a year in a relevant degree program or vice versa. For example, a requirement of \"Knowledge Consistent with a Bachelor's Degree in Accounting and 2+ years' of accounting experience\" could be substituted for a High School Diploma and 6 years of relevant accounting work experience or a Master's Degree in Accounting and 0 years of work experience. Minimum work experience:4+ years' combined experience with software programming in a production environment, general IT experience, and/or general financial services experience to include at least 2 years' dedicated programming experience.Technical or specialized knowledge/skills:Working knowledge of and demonstrated experience with Object Oriented programming, as well as other programming paradigms such as functional.Working knowledge of and demonstrated experience building secure web applications using a combination of latest technologies.Working proficiency in regards to understanding and working with relational databases such as Microsoft SQL Server.Basic experience developing mobile applications (such as iOS or Android).Must have good web user interface design skills.Must be comfortable working in highly collaborative environments.Strong experience with development tools such as Microsoft Visual Studio and Microsoft Visual Studio Team Services.Must be able to conduct presentations in group settings in a professional and courteous manner.Strong customer service, organization, communication, and interpersonal skills are a must.Working experience and knowledge of high availability systems.Must be able to work independently to deliver assigned complete system solutions.Must be able to learn new and emerging concepts very quickly.Must be able to maintain good productivity in developing efficient code in a very timely manner, with defect rates kept to a minimum.(Preferred) Experience with advance source control systems, such as GIT.(Preferred) Experience with Scrum software development.(Preferred) Experience building multi-threaded applications.(Preferred) Experience with Creatio (CRM) Development(Preferred) Experience with AzureCertifications required:None requiredEnvironmental, physical and psychological requirements: Must be able to sit or stand for prolonged periods of time in a climate controlled environment. Must be able to use fingers, hands, wrists for repetitive tasks such as typing, using a mouse, handling paper, and operating a telephone.   Demands for visual and auditory acuity are typical of an office environment. Must be able to interact via email, telephone, or in person with diplomacy, tact, and courtesy with all members under varying circumstances. Must be able to lift up to 40 lbs. Must be able to type at least 50 words per minute. Typing at a level below 50 words per minute would negatively impact productivity.Salary range for this position: $68,744.00 to $103,105.60 (This position is eligible for an annual corporate bonus based upon performance)For information on our benefits please visit: https://www.ent.com/globalassets/pdf-files/legal/benefit-summary-sheet-2021.pdf"}