{"title":"Grief Support Assistant - Spiritual Care Seattle","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIwkkEvMA5SkQ7Hx1P0eDYJj1T7ck2ET2DuagmKPInn9b9ztEN3Y44hjvbVVcibv1fKG2VCwiSOf6ROIRb2C8SnB-99D2zkTx29Ibu6FT36k0C1Z1eeOQmk_U24ntCpDLBSk-frpVm-Xh0qYkElkkmlX220Ft4jWFAjzjYH1P80aTzMfO7Lh-LUZx3RW_Y","source":"ziprecruiter","full_description":"Providence is calling a Grief Support Services Assistant (Spiritual Care Seattle, Day Shift, 0.8 FTE) to the Providence Hospice in Tukwila, Washington. We are a community of caregivers delivering every day on our Mission to provide compassionate care that is accessible for all - especially those who are poor and vulnerable.In this position you will:In collaboration with the Grief Support Services Manager, coordinates the day-to-day provision of bereavement services for hospice and community clients.Coordinates grief support and triage to hospice and community clientsServes as primary contact for bereavement referrals from hospice staff.Serves as primary contact for community inquiries related to Grief Support Services programProvides oversight of bereavement assessments of hospice clients through Electronic Medical Record.Maintains the various bereavement databases and manages all aspects of educational mailing program.Required qualifications for this position include:Four (4) years experience in the field of social science or services.Two (2) years customer service related field, preferably in health care.Knowledge/experience with loss, grief and bereavement issues.Experience in supportive telephone triage.Preferred qualifications for this position include:Bachelor's DegreeComputer experience with database management.About the ministry you will serve.Providence Hospice of Seattle is a not-for-profit, community-based hospice ministry serving patients in their places of residence throughout King County in Washington state. We provide comprehensive and compassionate physical, emotional, and spiritual care to adults and children nearing the end of their lives, including support for their families and friends. Our skilled and compassionate team includes nurses, medical social workers, home health aides, chaplains, occupational/physical therapists, medical directors, grief support counselors and volunteers."}