{"title":"Network Engineer (#1670678) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJpcuAqFreOWipqMH_xbDL4zRSYNGUXctqr5jiL4QMZKt1l9aJ2Nppqd7fAjDQnAt8eEBxLL9zV3e7eeo_2LzrkVpJDTtrwh0ZCSIktvwruAb06yxhfnJ6TZTfh4QrTPWUG6FlmcJBrG1k297FDEcNl94wI2LS_8a0cqNd-4ztGa6d_0-jsap2JnDGRUQQn","source":"ziprecruiter","full_description":"Network Engineer (#1670678) + Jobs+ Login+ 09-Feb-2021 to 10-Apr-2021 (PST)+ Huntsville, AL, USA+ Full Time Email Me Similar Jobs Email Me This JobPeopleTec is currently seeking a Network Engineer to support our Huntsville, AL location. The successful candidate will configure and integrate physical and emulated network devices and servers to be used in a cyber hardening environment. The candidate must have excellent communication skills. Required Skills/Experience: + 5+ years of experience in configuring and integrating physical and emulated network devices and servers + In-depth understanding of network topologies, cyber security tools, advanced cyber threats, and secured networks + Travel: 5% + Must be a U.S. Citizen + An active DoD Secret clearance is required to perform this work. Candidates are required to have an active Secret clearance upon hire, and the ability to maintain this level of clearance during their employment. Education Requirements: + A Bachelor's Degree (or equivalent) in a related field, OR equivalent educational or professional experience and/or qualifications is required. + 5+ years of experience in configuring and integrating physical and emulated network devices and servers Desired Skills: + An active DoD TS/SCI level clearance is desired + Defensive cyber operations (Blue Team), Computer Network Defense or related cyber activities + EXata, GNS3, Cisco VIRL, or similar network simulation and emulation tools + RHEL, Windows Server, Kali Linux + VMWare ESXi + Exploitation or penetration testing frameworks and tools People First. Technology Always. PeopleTec, Inc. is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce. Culture: The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields. Career: At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people. Come Experience It. #cjpost #dpost EOE/Minorities/Females/Veterans/Disabled PeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, HR@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify."}