{"title":"Hardware-in-the-loop (HIL) Engineer - Engineering Center NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL3HyByXjlr3YwcMEQi3LfkKxj2lzpsNbYlyXIZ3e5jKQ5d64-FBi1yr4Iuo66viyQ2kiil_1DIwOQaXKrAJDsaYWyPcCBwkYbXi0z23FEzIY-6SW1V34bzgF-cJ8vy2DQxsxf7lHmQP0g0gIlJUdCUSFllMq7rocJMqp8G4Bn3R7FLxo1xhxurHLXm3r2Y","source":"ziprecruiter","full_description":"As part of a small, passionate and accomplished team of experts, you will design and develop Hardware-In-the-Loop (HIL) solutions that will be utilized across the company to ensure the correctness and performance of our avionics and ground support equipment for various spaceflight systems. You will share in the team's impact on all aspects of the HIL design and its use as a verification tool that tests all the electronic hardware and software for spaceflight systems. This position will directly impact the history of space exploration and will require your dedicated commitment and detailed attention towards safe and repeatable spaceflight.+ Design and develop solutions to electrically simulate sensor and actuator components used on all Blue Origin vehicles including hydraulic actuators, motor controllers, solenoids, LVDTs, GPS antennas, PTs, TCs, RTDs, etc.+ Design and develop hardware simulators for vehicle components such as batteries, cameras, serial devices, CAN devices, etc.+ Design and develop fault injection solutions for simulator sensor, actuator and other hardware components.+ Collaborate with software engineers to integrate hardware simulation and fault injection solutions with real-time vehicle simulations.+ Design HIL harnessing and hardware interfaces required to integrate simulated components with flight hardware.+ Design, develop and implement HIL automation infrastructure that can be utilized by New Shepard, New Glenn and Engine HIL engineers to improve testing efficiency.+ Collaborate with New Shepard, New Glenn and Engine HIL engineers to define architecture for new HIL facilities include electrical and mechanical interfaces, test plans, concept of operations, layout, use-cases regression and verification tests.+ Support New Shepard, New Glenn and Engine engineers with the HIL integration of flight avionics hardware, ground support equipment, operatoronsoles and analysis tooling necessary to verify the requirements and performance of avionics units under test within the HIL.+ Support operations of a HIL facility utilized by multiple Blue Origin programs including maintaining cleanliness, tracking and ordering consumables and maintaining an ESD workstation. + B.S. degree or higher in electrical engineering or related discipline+ 4+ year of relevant experience+ Demonstrated history of integrating software and hardware systems+ Solid electrical engineering, digital and analog circuit fundamentals and lab skills+ Proficient in the use of standard electronic lab test and troubleshooting equipment+ Digital and analog circuit design, simulation, assembly, and test, with knowledge of design principles for non-laboratory environments+ Preference for and ability to thrive as a member of a small, tightly integrated team+ Good written, verbal, and interpersonal communication skills+ Must be a U.S. citizen or national, U.S. permanent resident (current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum. + Masters degree or higher in electrical engineering or related discipline.+ Experience working in hardware-in-the-loop (HIL) or system integration labs (SIL)+ Experience in analog to digital and digital to analog converters, power supply components and design, analog testing/troubleshooting techniques, and signal integrity, layout and grounding principles+ Applied experience with hard real-time operating systems and embedded systems+ Broad understanding of instrumentation, interfaces and sensors including DMMs, DAQ, Power Supplies, Oscilloscopes, DIO, GPIO, Serial-422, UDP, SPI, switch technologies and topologies, accelerometers, RTDs, thermocouples, and 4-20mA sensors+ Understanding of metrology, sources of measurement error, and uncertainty analysis+ Exposure to hardware-in-the-loop environments outside of aerospace (automotive, robotics, medical, etc.)+ Experience with a Unix-like operating system (Linux, BSD, etc.) command-line interface and shell scripting+ Experience with programming in C++ and/or Python External Company URL: www.blueorigin.com SystemID: 3732 Street: 21218 76th Ave S"}