{"title":"Senior Java Developer (REMOTE)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKWVJwwq5UxFKADc9lloFRinL_9Ei4IHiUoFZ6TakM4DkKQRAzhMQlpfM7wVp8wAyCusZj2wzWvc6jRpg5_9ixXwy-BgtXRjXv0tB2LZRv7ZSqgb1HNV6peqvPNaIbSUnme8AvsauNNEToYsO8RxqY_ngJDyRkdwsumCQ953C6ym2x1ulkZNNghrBvyuIx7","source":"ziprecruiter","full_description":"Sierra7, Inc. is seeking Senior Java Developers to join a team providing full DEVOPS lifecycle support and services to the Department of Veterans Affairs (VA). This program will consolidate, reengineer, and sustain a suite of Veteran-facing processes. The qualified candidate will have experience in analyzing customer needs and developing overall concept and design objectives. The candidate must be able to create logical and functional software code in a variety of languages and have experience in understanding and articulating the benefits and risks associated with different coding languages in different functional environments. The developer must have experience reacting to problems and correcting the program, as necessary. The developer will create software in utilizing multiple programming languages. The developer must be familiar with scaled agile development and have experience working in a behavior driven and test-driven development environment. The candidate will follow established quality control standards and reviews for software development, be proactive with risk identification and mitigation, and must have experience debugging and correcting software errors.Position Responsibilities:• Develop work products utilizing multiple programming languages (Java, JavaScript, Hypertext Markup Language (HTML) 5 and Cascading Style Sheets (CSS), PHP, SQL, HTML, JSON, XML)• Utilization of Spring Framework Concepts, REST, SOAP, Web Services, Authentication (SAML, OAuth, multithreading, JMS, Schedulers, Workflow Engines, Git, Maven, CI/CD, Databases: Hibernate, Oracle, PostgreSQL• Utilization of test-driven development: jMeter, unit testing, functional testing• Working knowledge of security tools• Analyze business needs and user stories to identify technical solutions• Participate in the requirements definition process to better understand the customer needs• Create prototypes that demonstrate concepts during sprints• Follow established team-developed coding and software tools standards• Develop work products in adherence to established security and quality control standards for software development• Develop work products in adherence to 508 coding standards and tools• Debug and correct code errors• Create the formal design documentation as required• Create interface control documents as required• Coordinate the creation of configuration management, development, and deployment procedures and documentation• Experience with the Digital Services Playbook a plus.Required Skills and Experience:• Minimum 6 years' of Java experience with proven success with multiple implementations• Experience using Java development tools (e.g. Eclipse, JUnit, Git, Maven, CI/CD)• Experience with relational or other database platforms, SQL or other query languages• Experience with API management and usage (REST, SOAP, Web Services)• Experience with Java-based MVC frameworks (Spring MVC, Spring Boot, Jersey etc.)• Experience with JMPS, Schedulers, workflow engines• Experience working with Hibernate, Oracle, and PostgreSQL databases• Experience with Automated quality assurance testing, jMeter, unit, and functional testing• Experience developing, profiling, and troubleshooting Java application code and automated testing tools• Experience in containerization of Springboot microservices• Knowledge and experience in EFK, Kakfa, AWS Cloud environments, JBPM, docker containers• Demonstrated success as a senior developer providing guidance to more junior staff• DevOps experience working within a Continuous Integration/Continuous Delivery program• Scaled Agile Framework (SAFe) experience• Demonstrated, strong analytical capabilities and technical knowledge by providing supportable technical solutions• Strong oral and written communication skills• Must be able to write software documentation.Qualifications:• Bachelor’s degree in computer science, engineering, engineering management, math, or similar technical discipline (8 years of additional relevant experience may be substituted for education)• Minimum of 8 years of relevant experience• Ability to obtain a Government security clearance.• Hibernate and/or Jenkins experience desired• Experience working in VA or other Government agency desiredEqual Opportunity Employer Veterans Disabled"}