{"title":"Technical Writer (Clearance Level: TS/SCI) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKBKZb2y_OcFuuvXnlC_HrUlfUjZwYsHH49NHY59tCmT5d7BQxHOjv6Hj449oPBvD0HU5d5tE_cVgBJqO7C48RaIp1ArpE-Yxd3C2OrhbH_wIs7apPs0Npcq8swth0Vtf2IQkStx7mAK-4YkSnM7xzC37eu282kaA88qTF_ij6_GxCJo50KokoLUxA-v7c","source":"ziprecruiter","full_description":"Description: Job Title: Technical Writer (Clearance Level: TS/SCI) Job Code: SAS20210802-56268 Job Location:Colorado Springs, COJob Description: L3 Harris Technologies Inc. is seeking an experienced Technical Writer development team in supporting Technical Order development activities on the Big Top contract and the Combat Mission Systems Support contract. Essential Functions: + Create, develop, plan, write and edit documentation for all phases of Technical Order (TO) development and sustainment in accordance with MIL-STDs, TO 00-5 series and all other AF compliance directives+ Perform research using technical data and engineering specifications (drawings, A-level specifications, test procedures, etc.) or commercial sources to translate data into user documentation + Work as part of cross-functional team, made up of Subject Matter Experts (SMEs), to accomplish technical writing assignments+ Follow style guides, associated DoD/Mil-Standards for TO production, and TO processes, and understand customer requirements related to writing task assignments+ Coordinate with Trainers and participate in development of Type 1 training packages (lesson plan, student guide, instructor guide, and presentation material) for each TO development task Qualifications: + Active TS/SCI security clearance+ A minimum of 6 years experience of technical writing experience and a Bachelor's Degree, or equivalent+ Working knowledge with Adobe FrameMaker, Illustrator and PhotoShop Preferred Additional Skills: + Independently interpret and follow written technical instructions and procedures, as well as the ability to work harmoniously in a team environment with government customers and other contractors+ Strong technical background, ability to translate technical and SME information into written procedural content as required for technical writing task assignments+ Strong writing, editing, and proof-reading skills+ Excellent written and oral communication skills+ Computer proficiency with MS Office applications, especially Outlook, Word, Visio, and Excel+ DoD work experience developing and sustaining TO baselines for AF weapon systemsL3Harris Technologies is proud to be an Affirmative Action/Equal Opportunity Employer. L3Harris is committed to treating all employees and applicants for employment with respect and dignity and maintaining a workplace that is free from unlawful discrimination. All applicants will be considered for employment without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender (including pregnancy, childbirth, breastfeeding or other related medical conditions), gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, characteristic or membership in any other group protected by federal, state or local laws. L3Harris maintains a drug-free workplace and performs pre-employment substance abuse testing and background checks, where permitted by law."}