{"title":"Mechanics - Bronx & Brooklyn","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIJ3M1zUzc8gYP1qt0GdvkvM9G8Qi-aM1GTe8ZXA2sskhHUj-GPM32rqqYmL5l3UrKl41893STqPGeUxHOWNhz0qZxOUu0XmbFIfaKh7kKOiophuqiBTd9PEdyZFpfoIlaHXQ3_OW06_B29Iel8fJ-FFtKGmjfxfZ7N-RVPq4O1QeasQxZ5hMOOKzo00w4","source":"ziprecruiter","full_description":"Company Introduction Interstate Waste Services is the most progressive and innovative provider of solid waste and recycling services in the country! We primarily service Northern New Jersey, Southern New York State, New York City, and recently expanded our operations of transfer stations into Pennsylvania and Ohio, where we also own and operate a state-of-the-art rail-served landfill. We cater to a diverse range of residential, industrial and commercial customers. Our mission has always been to provide our customers with the highest quality waste, recycling and environmental services, while keeping focus on employee, customer and environmental safety. What makes our company culture unique is we have mastered the ability to balance the standards of a large corporate company while maintaining our small business family style cultureOur Diesel Mechanics perform inspection, diagnosis, preventative maintenance, and repair of electrical, hydraulic, suspension, brake and air systems on vehicles and equipment, including diesel heavy trucks and engines. Utilizing diagnostic software, Mechanics are responsible for interpreting failure modes and initiate or assign necessary repairs. At times, Mechanics may be on call, assisting with emergency breakdowns.  If you have experience or training as a Diesel Mechanic - apply now to join our team of dedicated, skilled tradesmen. We believe in providing the training and development you need to grow your career with IWS.Work EnvironmentWe are continuously investing in equipment, and many of our trucks are less than 2 years old.If need be, there will be occasional travel to other sites as well as assisting with emergency breakdowns will be required.Personal Protective Equipment (PPE) will be providedThe Diesel Mechanic position may be required to lift up to 50 pounds. Frequent squatting and standing is required.RequirementsApplicants must be at least 18 years of age and legally eligible to work in the United States.A valid driver's license is required. CDL preferred.2+ years experience working as a heavy duty Diesel MechanicHydraulics experience is highly preferredExperience with troubleshooting/repairing DPF systems diagnostic software such as Premium Tech Tool (Mack), Allison transmission, Cummins, CAT, Peterbilt, and Paccar.Yellow Iron experience and/or experience as a Mechanic or Technician for a refuge company is a plus.Working knowledge of applicable DOT and OSHA standards and regulations.Must be able to speak and read English well enough to converse with colleagues, drivers and dispatch, and be able to make legible entries on reports and records.Must be able to meet the physical and safety requirements of the position.Must be able to provide own tools Career opportunitiesWe believe in providing the training and development you need to grow your career with Interstate Waste Services. Many of our Supervisors, Managers, and other leadership staff, started their careers as Helpers, Drivers, or Dispatchers. IWS is proud to be an equal opportunity employer. We celebrate diversity and do not discriminate based on race, religion, color, national origin, sex, sexual orientation, age, veteran status, disability status, or any other applicable characteristics protected by law.Salary and benefitsIWS is committed to providing a world class work place to all employees. Each eligible employee receives a competitive total compensation package including, hourly pay based on experience and paid overtime, Medical, Dental, Vision, Life Insurance and more. Our employees also receive Paid Vacation, Holidays, and Personal Days. Apply Now"}