{"title":"Chemistry Lab Tech- Entry Level","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALrTfdDAliVAHfPedZoXMZXE8MTPF6F1Dkkkd1kE81f8cJ306QUAYHi6lNePNnCxmKm5f5Mq2beeSB9NqriY3FLDbjTQyk1mHRcBmeTXgUZZCCLxzCtyYhgE0cYXuGxnC1mEUhGDtIM7JNO9HUWAd8Y22gmUwRP5jmt-upmjZE3I52IhTl86pBYRIbPweA","source":"ziprecruiter","full_description":"Chemistry Lab Technician - Dallas, TX Entry Level As a Chemistry Lab Technician placed with Kelly Scientific Resources, you will be responsible for conducting quality control tests on raw material and product samples per company quality control test methods. Additional Responsibilities: + Ensure timely testing and data recording for all samples + Issuing of COAs to customers + Coordinate responses to customer inquiries and plant management inquiries through Quality Manager + Support plant operations' and customer quality and process efficiency programs + Customer complaints/Internal Quality Issues/Investigate and provide feedback + Follow Lab Safety and regulatory procedures (OSHA, HAZCOM, labeling, MSDS) + Prepare and distribute labels to production staff for packaging + Calibrate and evaluate all QC equipment + Assist Quality Manager with projects Job Requirements: + Bachelor's degree in Chemistry, Biochemistry, Biology or related field + College Chemistry coursework + Wet chemistry skills + pH, viscosity, manual titrations + Strong Math skills + M-F; 6am-2:30pm + Temp-to-Hire Why Kelly **** ? Kelly Science & Clinical is your connection to premier scientific and clinical companies looking to hire talented people just like you. Every day, we match science professionals with dream jobs that fit their skills and interests-it's the way we think job searching should be. Nearly 100 percent of our science recruiters have a professional background/education in science, so we know a thing or two about the science market and how to get you noticed. About Kelly **** At Kelly, we're always thinking about what's next and advising job seekers on new ways of working to reach their full potential. In fact, we're a leading advocate for temporary/nontraditional workstyles, because we believe they allow flexibility and tremendous growth opportunities that enable a better way to work and live. Connecting great people with great companies is what we do best, and our employment opportunities span a wide variety of workstyles, skill levels, and industries around the world. Kelly is an equal opportunity employer committed to employing a diverse workforce, including, but not limited to, minorities, females, individuals with disabilities, protected veterans, sexual orientation, gender identity. Equal Employment Opportunity is The Law. (https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm)"}