{"title":"Systems Software Engineering Intern NEW!","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AAI_nPujwdTuZaYlzOx42ItUHCVdy_S2dd1ekDySTimRTTQmiEm3eR5WXvVga4_8uJ16ctuy6svVEBjMWP2_Iqpvo5D1Yl-5k3msx49UoTiuPuN98f_sG6tcsEmMqV1sU8GVwaeZxFDcLlLIEx66NYUCzr7V5zeiI2Aa_8wi_p9-X4XtjoD_nUZuON6-j9I","source":"ziprecruiter","full_description":"Help us build the DNA of tech.Vishay Siliconix, a global industry leader in the manufacturing of discrete semiconductors for applications in industrial, communications, transportation, consumer, medical, and defense products is currently seeking an Applications Engineer intern in San Jose, California.In this position, the summer intern will assist in writing and supporting software for the analysis of devices and control algorithms in low to medium voltage (4.5V to 60V) power conversion systems.Essential Duties and Responsibilities include the following. Other duties may be assigned. Pursuing Computer Engineering degree; would consider CS with EE knowledge or EE with strong interest in programming Class work or Experience with Embedded Systems, Microcontrollers, and Embedded Communication InterfacesClass work or Experience with C, Python, JavaScript, ExcelInterest in direct lab work.Familiarity with lab equipment like Oscilloscope, Logic Analyzer, AWG, DMM etc.Position Requirements:Ideal candidate should have good communication skills, proficient in Microsoft Office.Vishay offers a comprehensive suite of benefit programs including health care coverage, financial support programs and other resources designed to help you achieve your personal and professional goals. With us, you'll experience unique career paths, an open and collaborative culture, a stable business that will be there for you, and opportunities to work globally and locally. Do you have the skills we need? Are you ready to power your career as you power the world? If so, apply today. Vishay is an AAP and Equal Opportunity Employer"}