{"title":"Electrical Sustaining Engineer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAIg_EstzyX3DU60XcVuGAzl_OEffitj7HVow5ZeTWv62rQNiJVUYsfPkHERCROJWHVEKHehI-8YtOb_Q68JTw_bOn77rXC28rwwn4ijBZHQvUuDF1GXJNWqi7uMO1agYAfDRcdPj_MBEgWM0z4C1bBWZND9eciRmXJOUeINPNhKP0eJdD6x0lIlTTyUL8xe","source":"ziprecruiter","full_description":"Fresh Consulting is a design-led, software development and hardware engineering company, offering end-to-end digital services to help companies innovate. We bring together amazing UX designers, sophisticated developers, digital strategists, and top-notch engineers to help companies create fresh experiences that connect humans, systems, and machines. We’ve been growing fast and need someone to help us continue to manage the delivery of high-quality work in a fast-paced environment. See more at freshconsulting.comVisit freshconsulting.com/portfolio to see our project work across several industries.Title: Electrical Sustaining EngineerDuration: Project Based Long-Term Vendor ContractLocation: Redmond, WABenefits: Employee benefits at 100% including Medical, PTO, Holiday Pay, 401K Plan and much more!Hours: Minimum 40 Hours/Week Role:- Help the team with continuing engineering tasks.- Engage with different teams to help them ramp up & support production of multiple hardware builds.- Work with PCB Fab and assembly houses to get PCB ordered.- Proactively scrub BOM and get risk buy parts ordered from multiple suppliers.- Coordinate custom part ordering and board rework.- Interface between protoline and design engineer to have smooth transition from design engineer to production team.- Skills:- 1+ years of practical industry or academic experience- Experience with schematic and board design using Cadence Orcad, Altium or equivalent.- Experience with use of oscilloscopes, high speed digital test equipment, logic analyzers, and function generators.- Knowledge of analog EE and digital design techniquesEducation: BS in Digital System Design/Electrical Engineering or Computer Engineering, or equivalent.FRESH--- Work on engineering and research assignments with F500 companies and startups. - The relationships that we have created with our clients are one of a kind. - We help solve problems in many technologies focusing on R&D, product development, and manufacturing. - We work at the most cutting-edge and latest technologies from AR/VR to Autonomous technologies. - Closely working with our clients, we believe that long term investments are extremely important to maintain the culture we together have created.We’re a handpicked team of Engineers, digital strategist, designers, and developers united together in creating a fresh experience. Whether we are strategizing, designing, developing, or analyzing, our integrated team works as an extension of yours to improve your impact, your usability, and your customer conversion. In the process, we collaborate with you to get to know your business, understand your industry, and incorporate your big ideas into memorable experiences that keep your customers coming back for more.Fresh Consulting is a participating E-Verify company.freshconsulting.comPowered by JazzHR5j3GAoYUA7"}