{"title":"Territory Account Manager","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKtz81gDA6G6ts8F9vLSUceeajtVCg6xTt2sumkvKJ61mafCqPysD1qXTfBPOq_aJEksNXvJ3JmoOB3eQxW3EghZnwPbfYu-Jh2NBSSAatwCU2nfeu1M83IKGxf2ydMZn7y7hCpYvgkKi7MqYBLAqGD3COv-9kM5bJhtyUTbblPaVxUNtjKPE06H5QvE28","source":"ziprecruiter","full_description":"Territory Account Manager Washington National Insurance Company's largest American marketing partner, PMA USA, is looking for the right individuals who have the desire to earn a good living, work a flexible schedule and provide solutions for wealth preservation and creation to families and individuals. You can make a huge impact on your community and future by educating, advising and servicing clients to improve their quality of life.This position is a territory-based, outside sales role, with opportunity for rapid advancement to Field District Manager. You will be servicing our current rural and urban customers (local farmers, ranchers, and small business owners).As a PMA USA Insurance Sales Agent, you will be provided with award winning training , company provided leads and ongoing support of the latest technology. These PMA USA benefits lead to numerous Agent opportunities such as:Six Figure Income Potential - We have agents earning $100K+ and veteran agents earning $300K+Production Based Rewards - Numerous production-based award trips and incentivesAdvancement Opportunities  Desired Skills and Experience: Our sales teams have been built with individuals from various backgrounds, many of whom did not have previous sales or insurance experience. Experience is not a requirement, but a plus. Our comprehensive training program will assist those that are unlicensed in attaining necessary credentials, which is a short and easy process. We do find, however, that our top sales performers all have the following skills and abilities: Motivated and goal-oriented A professional presence and demeanor A dedication to customer service Ability to travel in state Experience with prospecting, networking and/or new business development Passion for making a difference in the community Stable work history Excellent communication and time management skills Coachable and competitive spirit Ability to earn client trust, along with excellent relationship management skills We offer: Competitive commission package with one of the best bonus programs in the industry. The ability to create a residual income—an opportunity for a lifetime income. Regular bonus incentives, contests and an annual world class travel event for top performers.Unparalleled training program and mentoring program with top veteran leadership. Leadership and team-building opportunities available if desired.  Earn what you’re worth, make a difference in people’s lives, and have a great time while you do it!  PMA USA is an Equal Opportunity Company."}