{"title":"General Labor Experience Wanted! - Weekly PAY! (CSR) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALuCYjldXmXwZL02mjhblJ_WD3EGZrZfg0foz5U5JfhWjqCyWOhGehSZTKmVJLxSY4gbFmONrxZDkyZPwBwLupGa_DyiEHSiPatLnMe_LBalrecEOe8DbscQ9Xv5IH0BNs323tLs-I9tOh54m3jtLZACaQG7TSteEuhCgQCvwyDDVlVtlc9REXEpr14DZhC","source":"ziprecruiter","full_description":"NO EXPERIENCE NECESSARY, WE OFFER FULL TRAINING BEFORE STARTING THE FULL-TIME POSITION! Find your path to starting a new career with us! We are seeking determined individuals with experience in General Labor, Warehouse, and the Military to join our dynamic Customer Service Representative team! Military Veterans, general labor, and warehouse workers generally thrive in our industry due to our hands-on approach and comprehensive training.Are you? A HUSTLER with a drive for successA service-oriented people personQuick on your feetA natural problem solverCharismatic and friendlyCan you? Assist customers with questions or issuesProcess customer ordersRepresent our clients with a professional and warm demeanorTroubleshoot customer concernsIf so, CLICK APPLY NOW! At our firm, the limitations are endless. We take pride in the equal opportunity we provide our entry-level Customer Service Representatives. We represent some of the most renowned brands on the globe. This position is ideal for those looking to expand their knowledge and switch careers into a more professional (and fun) work environment.Responsibilities: Inform customers of current deals or new sales promotions our clients are offeringProvide educated advice and recommend products to clients in order to meet their needsResolve client objections on time and ensure the quality of services is sustainedRecord confidential client account information including address, phone number, and billing informationRecommend improvements to drive sales revenue based off of analyzed dataEstablish and maintain rapport with customers by buildings a sense of trust and making them feel unique and valuedWe Offer: Holidays OffIncredible company parties!Bonuses, incentives, and competitive compensationTraveling opportunities across the USOpportunities to grow withinHands-on trainingDiverse and family-like atmosphereTHIS POSITION INVOLVES FACE TO FACE MARKETING, CUSTOMER SERVICE AND SALES People from all backgrounds seeking full-time opportunities in the following areas are encouraged to inquire about our training program:General Labor, Construction, Home Improvement, Labor, Labor and Development Operations, Field Construction, Telecom Construction, Construction Management or Construction Experience"}