{"title":"Technical Support Specialist - HVAC (Remote) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALTK_Z_s91_l_roU58fX23e_zMOU7J3YLhv0xOJHhBU0A8w6ql7FgVxglR1-MS3Lkr_AjW2n_RLCEay6HV7O27hAp15jcQANeZvtAnE5H1iU3_ETsmmR0p_yJV2KDg5IL0RwOE6SgHC2AONEJEvdGUk4WSv00mJNOG95uJgQ2bU_unQjnk9relUSHyvEN1h","source":"ziprecruiter","full_description":"Job LocationUSA, Louisville, KYOther ID US, Other ID US, Other WV US, Other WY US, USA, Albuquerque, NM, USA, Atlanta, GA, USA, Austin, TX, USA, Baltimore, MD, USA, Boston, MA, USA, Chicago, IL, USA, Columbia, SC, USA, Columbus, OH, USA, Denver, CO, USA, Des Moines, IA, USA, Detroit, MI, USA, Durham, NC, USA, Indianapolis, IN, USA, Jackson, MS, USA, Jacksonville, FL, USA, Las Vegas, NV, USA, Little Rock, AR, USA, Madison, WI, USA, Manchester, NH, USA, Minneapolis, MN, USA, Montgomery, AL {+ 20 more}Job Posting TitleTechnical Support Specialist - HVAC (Remote)The ChallengeThe Technical Support Specialist is responsible for providing first contact support via phone and email, fielding Technical calls from contractors, end users, and our distributor partners in support of GE/Haier's HVAC products. One position will be located in Louisville and the second can be remote in the U.S. This position reports to the Senior Manager, Product Service - HVAC North America and can be located anywhere in the United States.What you will DoPrimary Responsibilities:Provide timely, accurate and professional technical support to contractors, end users and our distributor partners via telephone, utilizing all available resources.Escalate cases to Product Specialists as required.Upon request, provide information such as submittal drawings, wiring diagrams, capacity tables, piping recommendations, or other information.Act as a liaison among all Service and Manufacturing components regarding technical and service issues, including approval for product exchanges.Provide timely, accurate product failure information to the business to drive root-cause quality fixes.Work with Product Specialists and management to drive first time call resolution.What you need to SucceedMinimum Qualifications:High School DiplomaTechnical degree or related training preferredMinimum 3 years of successful experience in HVAC installation and repair or related experienceProven PC skillsExcellent communication and interpersonal skillsAbility to challenge status quo and drive for performance excellenceWillingness to work any schedule, different hours and/or different days, including weekendsGE Appliances is an Equal Opportunity Employer.  Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law."}