{"title":"Technical Assistance Associate","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKuW3Cd-cmrpsIFMKg39PTlf_ITP6nWrT5SSxJiS1xRczbG1MeU7T_UF8hcrZn9jBvVFkrxoznBrXZJ3jWyWMElRfmKRTVrsg4h__5Z2lwcT4jiNqH3E7yiQW09Bi30ETqwKasItoSJYCZb44Kn89EUGUV3KnUHEitDadCvj3VtOuQtb0rp-WCK6jDV_lJ0","source":"ziprecruiter","full_description":"Position Type Permanent Staff (EHRA NF) Department FPG Child Development Inst-631200 Working Title Technical Assistance Associate Appointment Type EHRA Non-Faculty Research Position Posting Category Research Professionals Salary Range Dependent upon qualifications Full Time/Part Time? Full-Time Permanent Hours per Week 40 Vacancy ID NF0004772 Position ID 20037784 Posting Open Date 02/22/2021 Application Deadline 03/08/2021 Open Until Filled No Proposed Start Date 05/03/2021 Position Summary The Technical Assistance (TA) Associate will serve on early childhood technical assistance projects at the Frank Porter Graham (FPG) Child Development Institute at UNC-Chapel Hill. The TA Associate: 1) Supports, or partners with, other team members to manage the quality and outcome monitoring systems and improvement and support activities for FPG Project team's provision of technical assistance support to state and program leadership partners and other stakeholders; 2) Supports, or partners with, other team members providing TA support and resources in areas related to: - Building and enhancing capacity to provide essential support structures for successful implementation of evidence-based practices. - Coaching systems change efforts. - Designing, developing and delivering resources for the field (training, guidance, tools, briefs, etc.). - Providing ongoing coaching and consultation to support transfer of learning and research to practice; build capacity for systems change; build system capacity to improve outcomes for children with disabilities and their families; and support implementation fidelity, sustainability and scale up. - Facilitating peer learning communities, topical cohorts, communities of practice, and stakeholder groups. - Hosting and coordinating conferences, webinars, and other professional learning events addressing important early childhood care and education topics. - Responding to requests for assistance.  3) Provides TA support to programs serving young children with, or at risk for, disabilities and their families to build and enhance their capacity to:  - Provide high-quality early intervention and preschool special education service systems.  - Increase implementation of evidence-based practices, and  - Improve outcomes for young children with disabilities and their families. 4) Maintains up to date knowledge in assigned areas of work and early intervention and early childhood special education systems and practices.This position will join the Trohanis Technical Assistance Projects at FPG (https://trohanis.fpg.unc.edu/). Trohanis Technical Assistance (TA) Projects group at FPG is dedicated to improving the availability and quality of services, and ensuring optimal outcomes, for very young children with, or at risk for, disabilities and their families. We assist states and local agencies that provide early intervention and early childhood special education to implement evidence-based practices, develop and manage effective and efficient systems of services, coordinate inter-agency programs, develop data systems and improve data quality to improve services and outcomes for infants, toddlers, and preschoolers and their families.The TA Associate works under broad direction across TA projects with considerable latitude for independent action. Within the Trohanis Technical Assistance Projects at FPG, this position will provide support for the Early Childhood Technical Assistance (ECTA) Center, STEM Innovation for Inclusion in Early Education (STEMIE) Center, and the North Carolina Early Learning Network (NC-ELN) project.In addition, this position is expected to be a member of the larger FPG community. Expectations include regular participation in institutional activities and events; engagement in institutional and professional service in areas of relevance to FPG's mission; and evaluation of professional performance.Must be able and willing to travel independently to assigned events/meetings, including overnight travel. Overnight travel is estimated to occur approximately once a month (when a virtual meeting option is not available). Educational Requirements Either: 1) A Doctoral degree in education, special education, early education, educational psychology, health, public health, social services or related disciplines; or 2) A Master's degree in education, special education, early education, educational psychology, health, public health, social services or related disciplines; or 3) A Bachelor's degree in education, special education, early education, educational psychology, health, public health, social services or related disciplines and five or more years of relevant experience. Qualifications and Experience Experience providing technical assistance or related support to agencies or communities in building high quality systems and services for young children and their families. Experience related to building collaborative relationships with partners and stakeholders. Demonstrated experience in facilitating stakeholder groups or communities of practice, public speaking and presentation, supporting implementation of evidence-based practices in early childhood, and using data and information for continuous quality improvement. Content knowledge and professional experience working in early intervention, preschool special education, early childhood education, or other human service or public health settings.Skill sets: - Successfully teaming with multiple groups of professionals.  - Supporting and committing to racial equity, including talking about race, racism, and their implications in the early childhood environment. - Designing, developing, and providing training, technical assistance, and coaching support and related tools and resources. - Executing advanced written and oral communication with the ability to accurately summarize project activities in reports and presentations. - Taking initiative and recognizing and solving problems independently. - Proficiently using technology to host and facilitate conference calls, virtual meetings, webinars, etc.. - Being flexible and responsible and prioritizing work independently in a home office. - Building collaborative working relationships with leaders and other professionals. - Providing individual and group-based facilitation, with a co-facilitator and independently. - Effectively and efficiently coordinating and tracking tasks and communication to support project products and events.  - Providing technical assistance or related support to agencies or communities in building high quality systems and services for young children and their families. - Working in early intervention, preschool special education, or other early care and education setting.  - Using MS Office suite products, cloud-based file management software, and social media platforms. Equal Opportunity Employer The University of North Carolina at Chapel Hill is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender, gender expression, gender identity, genetic information, national origin, race, religion, sex, sexual orientation, or status as a protected veteran. Special Instructions Quick Link https://unc.peopleadmin.com/postings/188778  Department Contact Name and Title Sherri Williams, Technical Assistance Specialist Department Contact Telephone or Email sherri@email.unc.edu Office of Human Resources Contact Information If you experience any problems accessing the system or have questions about the application process, please contact the Office of Human Resources at (919) 843-2300 or send an email to employment@unc.eduPlease note: The Office of Human Resources will not be able to provide specific updates regarding position or application status."}