{"title":"iOS Engineer - Consumer Revenue","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKhZCe3zMvPE-P0ennueY_nWwZEdiD2sXgSCImTOAECcklq_lktzTyW9DiEdRfdiO7vgiI7zr13Tb7m9QnY8V0OwSpgl0P-XhDAXm4i2VhHhdjC9-6DBhxOm02Vy_3ZuTxOO0BCrTduY53PlLGfjjYvfBD9vHDQ2syZ1MbtobbGgkzYUa-_TvLArVnPNWJ7","source":"ziprecruiter","full_description":"Company DescriptionTwitter is one of the largest and most popular platforms in the world. Our code operates at massive scale and speed, serving billions of requests per day, connecting hundreds of millions of active Twitter users to real-time information about their lives and the world we live in.Our team loves using the latest mobile technologies and tools for making the highest quality and best performing mobile app on the planet. Our work is an integral part of Twitter's product vision and directly impacts the lives of our users and the success of our business. We are a collaborative and cross-disciplinary product development team.Job DescriptionAs part of the team you'll be responsible for using your creativity, excellent problem solving and technical skills to enable Twitter for iOS to reach every person on the planet. You’ll instrument, measure, optimize and build high quality architectures and code in feature areas such as Timelines, Search, Moments, DMs, and more. As an iOS engineer, you will work closely with designers, user researchers, data scientists, product managers, and the engineers that support the developer platform and infrastructure. You will use your passion and in-depth knowledge of all things iOS to craft the client components and features that will shape the future of Twitter for iOS.Qualifications3+ years of experience developing mobile applications (on iOS with Objective-C and/or Swift)BS or MS in Computer Science or similar field, or equivalent work experienceAdditional InformationWe are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.All your information will be kept confidential according to EEO guidelines."}