{"title":"Network Engineers NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAK3AvxJzpXG93go3yQE8oD2tYGhwXrPXPLpwS3MtNVbR5dLkX9e_X83K1hTSrZzrA467x53yzkmuqoFaPbhjhi_TTMMAFe0a2glUp036B5yLpPxEyr4lJ0_oNmNChhVDfd7ej5ftga8J2UMwUNmx6jhLzJTEP7JLDgQqY9sLcdwmPD6Cx2cw9Ke2jkBsyDC","source":"ziprecruiter","full_description":"Network Engineers in Charlotte, NC at APEX Systems Date Posted: 1/22/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: Charlotte, NC + Job Type:Network Admin & Design + Experience:Not Specified + Date Posted:1/22/2019Job DescriptionJob #: 929925 Looking for a candidate who is interested in working for a large financial institution either in Charlotte, NC; Des Moines, IA; Minneapolis, MN; Chandler, AZ; or St. Loius, MO. Possibility of 2 days remote flex Contract/contract to hire and Contract Length: 3 to 6 months + Top 3 requirements: + Familiarity with cisco routers and routing protocols + Hands on router experience + Experience verifying routing process and make sure it is documented and verified properly on the routers and switches + Day to Day Responsibilities/project specifics:Will be working on the IPAM 3rd party IP space research project while verifying the process and identifying the 3rd party IP space. Candidate will be checking routers while also understanding the routing protocols. Will need hands on experience as a network engineer around routers and switches. EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}