{"title":"Sr. Technical Project Manager-30488-TX NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKrdN52VVHEwjhcq-fW5SmQ-4Ckx0eeHFY8t24Nh4RXaL8Je0M7p65HKNUdeG4-0S0iWrBOQ8BSxic4VmOXziYR2Qyhu3FpiOUu_kBCAlU19liWdU-F28cMoPrkxbWt_05zsROh-hvrlPQ6F-CyK-N0KR7QtRYjjhNU_SgCJwGskyUse__VosYLWIGn6O8_","source":"ziprecruiter","full_description":"MUST HAVE SKILLS (Most Important):Sr. Technical Project Manager - Manage all facets of large scale, cross functional technicalprojects with broad scope to ensure deliverables are met within schedule, budget, and quality goals. 5-7 years of experience. Be able to discuss technically aspects of a SOAP/REST API with customers IT team and engage the Architect when necessary to define integration solution. Business Group is seeking a Technical Project Manager to lead customerintegration projects. Projects involve working with external customers to enable Commerce interfaces between Client and the customer’s application. The Project Manager owns success of the project and is responsible for ensuring the project meets agreed objectives and deliverables on time and within scopeResponsibilities & skills:• Ability to talk clearly on a voice bridge, presentation via WebEx and take accurate minutes of each call. Document them in oneConfluence.• Present the solutions and articulate clearly at a high level the technical details of the API’s.• Document essential milestones, issues and risks clearly to ensure customers and Client personnel signoff.• Facilitates meetings effectively and communicates relevant information to all impacted stakeholders.• Develops and manages project plans for each assigned initiative.• Proactively manages day to day customer interactions.• Provides detailed and accurate status reporting.• Maintains action items register and follows upto ensure all critical issues are resolved in a timely manner.• Communicates and manages project risk.• Creates test plans as needed and executes project testing.• Communicate integration process interactions to customers.• Must have the ability to think analytically and focus on helping the project team arrive at a cost effective solution.• Ability to communicate sensitive information tactfully.• Ability to multitask and work in a fast paced environment.• Must be a quick learner, adapt and prioritize the work according to the issue at hand.Required Experience• Bachelor’s degree in Computer Science,Information Management.• 6+ years of Project Management experience with large projects for Fortune 500 companies.• Projects with B2B2C Integration across enterprises is a plus.• Experience with Microsoft office suite including MS Project and SharePoint.• Experience with Amazon AWS/ OCI web service integration projects a plus.• Network connectivity options knowledge a plus.• ITIL Foundation certification required.• Understanding of ServiceNow Platform (Incident, Change, CMDB & ITOM modules) a huge plus• Experience with Remedy/HP Service Manager• Knowledge with REST/SOAP API terminology and ability to understand the backend/downstream systems integration required.• Execute test cases and provide validations end to end for UAT & Production implementations."}