{"title":"Sr Software Mobile IOS Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI88v_hNQwGOZIk8wFWukk_WHBzW8ZlumYnVXbuy4d-d5r2IIV13ZjDRGD0im5XgRhp63XsXpHlHxPI-8BGtCTwMsVhN-76JvJ86-B5jrwdhSZSa__SqzDULn543LWKakwgNEO6o8iwNlSJhd26arfywDTWLVn2dKKJaodzz__vcp0UsKHsCjNAe9w-DdM","source":"ziprecruiter","full_description":"The iOS team’s vision is to enable a friction-less experience allowing our customers to listen and engage with the largest Audiobook portfolio. Our goal is to deliver world-class products that scale for millions of daily listener sessions across the entire iOS eco-system including smart phones, Car Play, Smart Watches and living room devices. We are a nimble team with a game-changing mind-set, endless passion and uncompromising user focus. We operate like a start-up, yet have the resources we need to deliver on our goals.You are talented, adaptable, and flexible. We’re looking for creative, open-minded iOS software development engineers to help build technologies that continuously improve the listening experience. While focusing on iOS development, you’ll build and scale mobile software, and coordinate cross-functionally by integrating new features, maintaining high performance, and creating intuitive interfaces. Our team is working on building native iOS products, without compromising compatibility with various iOS devices in an agile environment.If you are ready to become a part of a culture that celebrates “thinking big” and want to use your passion and creativity to improve the daily lives of listeners around the world, we have a place for you on our team – come join us.HOW DOES AMAZON FIT IN?We're a part of Amazon: they are our parent company and it's a great partnership. You'll get to play with all of Amazon's technologies, but it doesn't stop there. We are built on a strong foundation of Amazon technology and you'll have insight into the inner workings of the world's leading ecommerce experience. There's a LOT to learn! Your career will benefit from working with teams like Alexa, Kindle, A9, P13N and many more.If you want to own and solve problems, work with a creative dynamic team, fail fast in a supportive environment while growing your career and working on high volume (5000+ transactions per second) services that support millions of customers worldwide, we want to hear from you.KEY RESPONSIBILITIES· Own and be responsible for key components within the team.· Design, develop, implement and support Key Components using latest technology that will influence teams beyond us.· Work with Product Management and take the lead to help create, design and develop software that involves exploring and bringing out latest technology on the platform to make the listening experience better and easier for our users.· Take every opportunity make a large impact on the design, architecture and implementation of cutting edge mobile based products.· Provide technical direction and strategy to the team, drive the system architecture, spearhead the best practices and influence peer teams with brown-bag sessions and hackathons.· Staying up to date on the latest trends & technologies industry-wide and sharing that knowledge with the internal community· Committed to team work, hustle and strong communication skills (both to business and technical peers).· Thrive in delivering high quality technology mobile products in a fast paced environment with shifting priorities.· Demonstrated experience in problem-solving with experience in ambiguous situations.· Experience in documentation, unit testing, code reviews, test automation, continuous integration & deployment.Basic Qualifications· Experience in Agile development.· 4+ years of experience in Objective-C or Swift.· Bachelor’s degree or higher in Computer Science or related field.· 4+ years of professional software development experience.· Data-oriented skills with knowledge of Core Data and database design.· Working knowledge of dependency injection, operations/promises, and modular development.· Demonstrated experience in problem-solving with experience in ambiguous situations.· Experience in documentation, unit testing, code reviews, test automation, continuous integration & deployment.· Experience in Agile development.Preferred Qualifications· Recent experience building enterprise-scale mobile applications.· Experience building mobile UI with UIKit, especially Auto Layout and related SDKs, including use of storyboard and animations.· Background in synchronizing information across devices with support for offline transactions.· Competency in automation, enthusiasm for continuous integration/deployment or Chaos Engineering.· Experience with Swift, bridging headers etc.· Solid Coding practices including good design, unit testing, peer code reviews and a preference for agile methods.· Knowledge of professional software engineering best practices including coding standards, source code management & build processes."}