{"title":"Software Developer( Manufacturing Execution Systems (MES)/PLC exp) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKlgkGVkQulWmY5RpZQ87LsA0EQpZfy_nvI-GvZ0umjpvIYQ0aq1jdK0MCBnC676el0MXU0Ma2EZS2fU9iMMPRt8L6-5GieHJz6blzXPFGPW_4qfzk9efqF_ZBRKnl5-z9xF5mstGGuR7ohmaseDKI-huyOovcooXb0KMMWzMfvtCEAvJRKzoGNDzlsDawU","source":"ziprecruiter","full_description":"Position Summary:Manufacturing Systems Software Developer is responsible for developing software,troubleshooting, diagnosing/resolving issues related to Manufacturing Execution Systems (MES)and integrating MES software into plant floor machinery. They work with the ManufacturingSystems UI Developer and Manufacturing Systems Analysts to ensure programs are; supported,installed, configure and completed. Familiar with a variety of the field's concepts, practices, andprocedures. Relies on experience and judgment to plan and accomplish goals. Reports to theManufacturing Systems Manager.Essential Job Functions:Travel to company sites (including production facilities, offices, datacenters) and Vendorsto assist with deployment of Manufacturing SystemsSupport Manufacturing Systems Analysts to install new programsDevelop MES softwareAssist Manufacturing Systems Analysts in determining locations for data collectionequipment in the plant floor machineryWork with Production team to test Manufacturing SystemsWrite software to integrate with PLCs and robots to collect dataWork with PLC Programmers to integrate the MES software with the PLCsDevelop and maintain databases (both SQL and NoSQL) related to MES softwareDevelop and maintain integration between distributed data collection systems, centralplant systems and corporate systemsAssist the Manufacturing Systems UI Developer aggregate data and map data for the UIand reporting systemsAssist other team members in any other areas as neededResponsible for documenting codeResponsible for checking in any production code into the Version Control System beforedeploymentPerform backup duties of Manufacturing Systems UI Developer and ManufacturingSystems AnalystsTS-16949 Quality SystemWARNING: This printed document is an UNCONTROLLED COPY. The user must verify it is the current revision prior touseQualifications:Four years college or trade school in computer science, software development, or relatedfields. Equivalent experience may be acceptable.2 4 years of experience in software developmentExperience working with PLCsExperience with gitExperience in C#, ASP.NET, JavaScript, Typescript, Node.js, MongoDB, MS SQL Server,OPC, REST, GraphQLExperience with SPA, preferably AngularSoftware installation, setup, troubleshooting and maintenanceExperience monitoring progress of projects and working independently and proactivelywithin tight, concurrent deadlines with accuracyAbility to communicate professionally and effectively internally and externally in a teamenvironmentDemonstrated eagerness to learn, apply new technologies and solutions and effectivelycommunicate with clients and/or other teams to resolve simple and complex technicalissuesPhysical Requirements:Travel, including overnight travel will be requiredNormal office environment including computer and telephone workManufacturing environment including working with industrial equipment"}