{"title":"SOFTWARE DEVELOPER, INFECTIOUS DISEASE SURVEILLANCE","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI4gVDet7p0yfbfTHeC_Fwh6QjVdbXl8dopBAdIRBL9G7MVzzuUr2BvKkNTTQY3QI2G_z8XKg-PqK-mYzQU2uCc0hboJyxAUUexa_9gocEZAEDC1BVdZ2WD0UfbA94vG9I5IRpozR74uAFvd7HysI42vtG5PUMfHIAqOKr7mPy7b-GinuzQmqWS7VN6MgPp","source":"ziprecruiter","full_description":"Req #: 187426 Department: BROTMAN BATY INSTITUTE Posting Date: 02/17/2021Closing Info: Open Until Filled Salary: Salary and benefits are competitive. Salary is commensurate with qualifications and experience.Shift: First Shift Notes: As a UW employee, you will enjoy generous benefits and work/life programs. For detailed information on Benefits for this position, click here. (http://hr.uw.edu/benefits/wp-content/uploads/sites/3/2018/02/benefits-academic-professional-librarians-staff-20191231.pdf) The University of Washington is following physical distancing directives from state and local governments as part of the collective effort to combat the spread of COVID-19. Click here for updates\"Onsite work\" in the interim will vary for units and for specific positions and will be discussed with candidates during the interview process. As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem solving skills and dedication to build stronger minds and a healthier world.UW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty.The Brotman Baty Institute for Precision Medicine (BBI) is a joint venture between the University of Washington, the Fred Hutchinson Cancer Research Center and Seattle Children's Hospital, made possible by a $50 million gift from the Brotman and Baty families. The BBI offers a dynamic work environment with cutting-edge science and computational resources. The BBI developer team is a small, newly formed group committed to embracing best practices and using a breadth of technologies to support the BBI's mission to deliver impactful results to research and public health.POSITION PURPOSE:Positions for up to two Software Developer(s) are available immediately at the BBI to work on an open-source research platform enabling a large-scale study of respiratory illness in Seattle. The developer team leverages cloud technologies across AWS and Azure and writes most code in Python, with PostgreSQL as the primary datastore.POSITION COMPLEXITIES:The Seattle Flu Study (https://seattleflu.org/welcome) , already in its third year, has produced high-resolution analyses of the spread of influenza and other respiratory illnesses in Seattle. In year one of the study, the SFS sampled and sequenced thousands of influenza and other respiratory pathogens in near-real time, and, from these viral genome sequences, uncovered influenza transmission dynamics. In year two of the study, the team identified the first instance of community spread of COVID-19 in the United States, and transitioned to help support public health surveillance through the Seattle Coronavirus Assessment Network, in partnership with Seattle Public Health King County. In year three, the SFS is adding projects to support organizations returning to school and work.DUTIES & RESPONSIBILITIES: Develop and maintain the information and analysis systems underlying the SFS's research aims, with potential expansion to new studies around the world in the future. The existing software platform (https://github.com/seattleflu/id3c) used in the study ingests subject and sample metadata, lab assay results, and raw and processed genome data. It also provides access to this curated data for downstream analysis. The platform is open-source, adaptable, and designed with future infectious disease outbreak surveillance in mind, regardless of the targeted pathogen. (75%)Collaborate with a diverse interdisciplinary team across faculty, staff, outside project collaborators based in different home institutions to define informatics needs for the study and communicate updates. (25%)MINIMAL REQUIREMENTS + B.S. degree in computer science, engineering or other equivalent field. Equivalent experience can substitute for the degree requirement. + Minimum three years related experience required, whether in an academic or professional setting.ADDITIONAL REQUIREMENTS + Self-motivation and enthusiasm about taking a hands-on approach to collaborative scientific discovery efforts. + Fluency in at least one high-level programming language, such as Python, JavaScript, or C#. Much of our core software is written in Python. + Experience with relational database systems. We primarily use PostgreSQL + Enthusiasm about writing code that is robust, understandable, and maintainable + Excellent written and verbal communication skillsIf you think you might be a great fit for this position but are concerned about meeting all qualifications, we'd like to hear from you anyway.PREFERRED REQUIREMENTS + Experience with web development + Experience with cloud infrastructure + Experience with software engineering best practices including code development, operational support, and documentation + Experience or interest in public health, biology, bioinformatics or genomicsThe Brotman Baty Institute is committed to improving diversity in the computational sciences. Applicants of diverse backgrounds are particularly encouraged to apply.Application Process:The application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select \"Apply to this position\". Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your \"My Jobs\" page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.University of Washington is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, sexual orientation, gender identity, sex, age, protected veteran or disabled status, or genetic information."}