{"title":"Network Engineer (Computer Information Systems Engineer)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK6Rs515eFfjuIzNg2tTCrUzOOhWLK5Sc6lbSxvxgA5NgyRdiwPzskP0et7l1cssFtW6vCFucYSimE2KZKV-oruVqOAD-zsJ2SpOceDPGcx5CdYzq-9y65v5dR_OVibrIJ2u0LhyHz-tU1bbcvox2M_Yfqd_ZdF2RTm7GLNiEzrco8QW8LhXaWdWL3ZaCW8","source":"ziprecruiter","full_description":"Gray Analytics, an emerging and rapidly expanding small business specializing in Hypersonics, cybersecurity, DevSecOps, digital forensics, and C5ISR, is seeking a passionate, self-starting individual that will thrive in a small company by applying their skills to resolve challenges while learning new skills along the way. Without the bureaucracy that often exists in larger corporations, Gray Analytics can offer increased flexibility, more visibility, and greater opportunities along with big-time benefits, such as a flexible paid time-off policy. Gray Analytics' experienced leadership has successfully grown several companies, and we believe in taking care of our people, who in turn will carry out Gray Analytics' mission. Thank you for considering our company, and we look forward to welcoming you aboard!Position: Network Engineer (Computer Information Systems Engineer)Location: Huntsville, ALPosition Description:Gray Analytics is a technical consulting and solutions provider for our customers. We are seeking to hire senior and mid-level engineers to provide support to our growing Hypersonics business area. With current activities providing support to defense, space, cyber and commercial fields; Gray Analytics mission is to provide exceptional services/products to meet our customers' needs.Selected candidates will support testing and engineering analysis of hypersonic programs. Current efforts will focus on developing Modeling & Simulations (M&S), Continuous Integration/Continuous Delivery (CI/CD), and Hard-Ware In-The-Loop (HWIL) test capabilities.The candidate will support the customer both locally in Huntsville Alabama, as well as provide support at multiple test venue locations across the United States. Most of the work will be performed in an office environment but will also include time at integration laboratories and hypersonic test facilities.Gray Analytics is an Equal Opportunity Employer and VEVRAA Federal Contractor. This contractor and subcontractor shall abide by the requirements of 41 CFR 60-1.4(a), 60-300.5(a) and 60-741.5(a). These regulations prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities and prohibit discrimination against all individuals based on their race, color, religion, sex, gender identity, sexual orientation, or national origin. Moreover, these regulations require that covered prime contractors and subcontractors take affirmative action to employ and advance in employment individuals without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, protected veteran status or disability. Gray Analytics, Inc. welcomes minority and veteran applicants.Job Posted by ApplicantPro"}