{"title":"Android Developer ( Job id: WR-2021-0210-MD )","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIbyG0OUeAuGN84j-S5Kj8f-Hf8B8Qhgvt6kyMilXN7046_9243akzc_ILsyRup0HVz2Ian2ghP3-l4TRWcqzSkJOpcIYXCLSotNyWt9zyt2JFAQT1J44arwr49ySTeftj1h0X16Voo92DuS-Qgh0_uxFMap0plnNh0jzCSP0lETAQozHd6WwZdfVEdQaU","source":"ziprecruiter","full_description":"Migrate the current WSF ‘Mobile Redeem’ application so that it continues to perform the following operations in the Android platform within the new application. • Scanning printed or electronic (mobile screen) reservation barcodes (17-digit number prefixed with letter ‘R’ in shown as Code 128 barcode image) or 18/20- digit Wave2Go tickets. This includes all features that exist in the current application. • Develop the ability to read Next Gen ORCA card and process transactions, includes e-purse, monthly and multiride passes. • Searching locally downloaded reservation manifests by Last/Company name and by the Confirmation number. • Ability to mark a reservation as Stand By. • Ability to redeem offline and periodically synchronize to central Save a Spot SQL database on successful network connectivity. • Ability to notify customer via e-mail on successful redemption. • Average processing time in real world conditions (including lookups) less than 5 seconds with optimized battery usage and network indicators. Note: The expert-level Application Developer will create documentation as required by the Manager for Technical Design, User Manual (End User training), Maintenance Manual, and other technical documentation as required by management. In addition, the Application Developer should work with the existing staff on knowledge transfer sessions and user training sessions for the performed work for product maintenance and product usage.Minimum 5 years’ experience in the last 8 years using Android Studio Minimum 5 years’ experience in the last 8 years using Java Minimum 5 years’ experience in the last 8 years using XML Minimum 5 years’ experience in the last 8 years using JSON Minimum 5 years’ experience in the last 8 years using C#.NET Minimum 5 years’ experience in the last 8 years using SQL Experience working with SDKs (Software Development Kit) Experience working with UI’s (User Interface) Experience working with APIs (Application Programming Interface) Experience working with Object-Oriented Design Experience working with Memory management Experience working with File input/output Experience working with Multithreading Experience working with secure resources deploying applications.Experience in migrating applications from one Android device to another Android deviceExperience working with complex transit collection systems"}