{"title":"Senior Core Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALhwXv1amfg8pudNPL663FTkoZDjVDFWYbOEZqbxcUcEJRo9EgXrrDuCMpnQ76ECHgxpfaDltPy2i__UGqA40o9cIx8jHfpbMmYhExglCW8ilAO-q2gEJqodg4LjfRalX5pBQ-WI-r1GdmstDQFn5DnMVM5WXROBBYfUEa-_ly8iotqyUhNI3q0zZKXhmoL","source":"ziprecruiter","full_description":"Leading FinTech Firm in Manhattan is looking for a Senior Core Java Software Engineer.This position is a full-time, permanent opportunity.Job PurposeNearly half the world's crude oil futures trade and clear on the Firm’s state of the art electronic trading and clearing platforms.As a Senior Developer at the Firm, you will play a key role in developing systems which provide clearing services to vital markets such as oil, sugar and cotton which are essential to economies around the world.If you are a self-starting, talented designer and coder that builds reusable software components and has a desire to understand and support the business of derivatives clearing, we would love to hear from you.Duties and ResponsibilitiesDesign, architect and code key systems using Spring, REST, SQL, Hibernate, iBATUS, and MQTake ownership of key systems and build reusable utilities and frameworksWork on the scalability and performance of high-performance componentsWork closely with the business units, product management and QA teamsAssist in writing functional specificationsProduction support Knowledge and ExperienceBachelor's degree in Computer Science or related fields; or equivalent years’ experience required5+ years of experience developing with Java TechnologiesStrong working knowledge of:Java 8+Data structures, Algorithms, OOD and Design PatternsDistributed messaging, JMS,Spring and its frameworks like Spring Boot, Spring DataRelational Databases (such as Oracle), SQL, PL/SQL, Hibernate/iBATIS, JDBC, and JPAMulti-threaded server-side developmentExperience in Java performance tuning, debugging and memory profilingAbility to work independently, productively under pressure, and effectively multi-taskStrong interpersonal and writing skills and ability to work well in a team environmentBuilding business applications from design to live production systemsExcellent communication skillsPreferred:Experience building front ends using HTML5/JavaScript UI frameworksExposure to financial markets - particularly in futures and optionsDemonstrated open-source contributionExperience with Container and Cloud technologies – e.g. Docker, KubernetesThis is an Equal Opportunity and Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin or ancestry, age, disability or veteran status, or other protected status."}