{"title":"Mid-level Systems Engineer","location":"","salary":"","description":"","term":"$110,000 to $160,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJGqVWUFCnnF_FXB-ghbfszcoccLfMS0yd7nw2xVFZmsaoqCEYSzy3W3dLdobEQlifrtKoDzqP4yoJ89P9AyJjt4x53tKITSyt25TpJlKd2-feW2X-L285cM2pyFsC-nye80wptZ822nneuwG3IYkQP96ljpFB8KZJSKKGYoeeFfLsUBNvhBnW692oH7ggv","source":"ziprecruiter","full_description":"Mid-level Systems Engineer If you are a Mid-level Systems Engineer with experience, please read on!Top Reasons to Work with UsFounded in 2005, we are one of Maryland's most innovative, fastest growing companies. Our expertise is focused on technical solutions for the Department of Defense, Nasa, and our commercial customers. We're a Top Secret cleared facility known for innovative, rapid, development and close working relationships with our customers.What You Will Be DoingWe are seeking a Mid-Level Systems Engineer to join our Advanced Adversary Fighter team. They will support our effort to integrate high-tech avionic and mission systems onto various fighter jet platforms. For this role, the candidate must be able to work well in a fast-paced team environment, communicate clearly, and have a consistent track record of delivering high-quality products. The candidate must either be willing to locate to St. Mary's County, Maryland or demonstrate previous ability to work remotely. The candidate must either possess, or be able to obtain, a security clearance.Responsibilities:Support efforts in system design, requirements development, and functional allocation of hardware, software, and other system components in support of modernization of legacy fighter jet platformsSupport the development of system integration plans, procedures, and scenariosParticipate in system requirements reviews; create and/or update requirement specifications and technical documentation as requiredUse a structured requirements process to ensure requirements are clear, unambiguous, and verifiableReview system engineering documentation to ensure specifications meet system needsAssist in the development of test cases including reviewing proposed test cases, adding missing content, and deleting non-value add contentInterface with avionics manufacturers to identify, investigate, and resolve system issuesCollaborate cross-functionality with a system engineers, project managers, and other engineers in an agile environmentParticipate in laboratory, ground, and flight testing to verify and validate the productBasic Qualifications:BS Degree in Systems Engineering, Engineering, Engineering, or related field with 4+ years of demonstrated experience in the industryExperience with system integration of avionics systems/equipment on airborne platformsExperience with system modeling and other MBSE tools/techniquesAbility to convey technical ideas in a clear, logical fashionAbility to translate highly technical discussions into executable plansExperience developing hardware and software system specifications and requirementsAbility to work in a team environment; provide constructive alternatives/approaches to solving issues; be flexible; and have a strong sense of urgency for critical tasksDesired Qualifications:Experience with Enterprise Architect (EA)Experience with system integration on fighter jet platformsSystems integration experience with 1553 communications, RS-232/422 communications, and ARINC-429 communicationsExperience with MIL-STD 882E and/or DO-178CQualified applicants will receive consideration for employment without regard to, and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.What You Need for this Position- MBSE- Systems Integration- Avionics Systems- EA- Fighter Jet Platforms- 1553 communications- RS-232/422 communications- ARINC-429 communications- MIL-STD 882E- DO-178CWhat's In It for YouCompetitive salary  benefits!So, if you are a Mid-level Systems Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}