{"title":"Sr iOS Developer NEW!","location":"","salary":"","description":"","term":"$80 to $85 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AALBgmsfeQX33mlsoTn2PcyPu_6ZgQt6Qx78WY-CDpA7pFb4mgwgGQHNNMItOu8D0p4-yZswHL9gBVKyivP5h8bzsDdPgW98Br944C3xqR7rh5u-RaH8MtKWc9I3bo79uBUkTSz1Rnvjhexze-W0LrIC_XZuDmHVkwqNqFmIBgzvhc5R-69zkgXeqPplitQ","source":"ziprecruiter","full_description":"Responsibilities · Works closely with the leadership of the devices team to develop native software solutions based on a given set of requirements.· Team player attitude. You need to work well with others.· Architects, designs, develops, tests and maintains native iOS applications across multiple form factors. (Phone, tablet, TV, Wearables, etc…)· Leading and mentoring other team members.· Works with project managers and ensures that all project milestones are met· Investigates and resolves issues with our applications.· Works collaboratively with peers and teams such as Business Owners, Product and QA· Works closely with external teams for ongoing development.· Provides technical estimates for development efforts.· Provides solutions to requirements presented by the Product Team.· Evaluating and researching latest device technology, coding patterns, OS Frameworks and features, and recommending and implementing within the larger digital team.ExperienceYou'll need to have these skills and experience:· BS/BA in Computer Science, Information Systems, Engineering or related field and at least 8 years experience or equivalent training.MINIMUM 3 years’ experience developing native iOS client applications, with working knowledge and demonstrated experience of Swift, Apple SDKs and Frameworks· MINIMUM 2+ years experience as a Senior Software Engineer.· Experience building iOS UIs using Swift UI is a plus· Experience building iOS apps using reactive programming such as Combine or RxSwift is a plus· Solid demonstrated experience testing your applications, including writing unit tests, test automation, and working closely with quality assurance teams.· Successful launch of consumer grade applications to the Apple App Store· Experience with efficient client-side integration with Restful services in a high-performance ecosystem.· Thorough understanding of memory management in mobile environments.· Solid demonstrated experience launching native mobile applications on multiple devices.· Solid demonstrated experiencing optimizing native mobile applications for non-functional performance (memory, power, etc…)· Experience working in Agile/SCRUM or Kanban processes and project methodologies.· Best practices for source code management, Git, modern branching concepts, etc.· Experience with Continuous Integration tools and processes.· Excellent analytical and problem solving skills.· Experience in media based apps, wearables, health a plus."}