{"title":"Spec 2, Technical Writing","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIRz6OWOEcF7RVpxXGQ1mQpM1Hg7WJSezh2Ollt3xpbZJisq22-7ip6NMzANtnK1ZaOjDnyg-k7CtjEfXO0uKDQKzHrIeI1e12ZLFvhbofdhDULbQJ4Ck6q4ARsianhuTgDIc_b4vQNAgm8n6N59XNGX5P5cot8Gf6qO68dxRvDJRcAqUujgpmvJ4z9vs8","source":"ziprecruiter","full_description":"pay rate of ***/hour and a bill rate of ***/hourRemote for now and when the office resumes after COVID guidelines, it will be onsite. Must be local3 Must haves on the resume: Technical Writing, Medical Device Product Labeling, Project CoordinationThe Technical Writer is responsible for developing, revising and implementing new and revised technical documentation primarily for Client products. This associate will act as the liaison between Labeling Design and User Information Development, R&D, Marketing, Quality, Medical, Regulatory and plant production teams, and will lead or participate in special projects on behalf of the Labeling Design and Development group.Responsibilities: Develops, revises, and reviews product package inserts and user's manuals to ensure compliance/conformity with existing Corporate, Regulatory and Global (ISO, PAL, etc.) guidelines. Works with internal teams (R&D, Marketing, Quality, Medical, Regulatory, and Plant production teams) to obtain an in-depth understanding of the product and the documentation requirements.Writes and/or prepares technical software documentation. Studies and reviews manufacturers' data, drawings, parts lists, and prototypes to delineate technology, operating procedures, and specific logistics of operation. Collaborates the development or revision of product documentation/digital content to determine specifications for: type style, font size, clarity and conformity of wording, formatting, topic-based order, and printing deliverables. Works with Label Control, Incoming Inspection, Operations, and Quality to resolve issues regarding technical documentation and to develop procedures geared toward minimizing and eliminating recalls related to technical information. Creates and maintains multiple information architecture outputs. Analyses existing and potential content, focusing on reuse and single-sourcing opportunities. Develops and reviews vendor specifications for technical documentation, and develops and maintains graphic standards for manuals and digital content. Participates in the GPDS product development process. Communicates effectively with all levels of management, business units (Corporate and International), and possesses a high degree of flexibility/selectivity in prioritizing business unit and plant projects to meet established goals. Keeps abreast of the basic requirements for compliance in own area of work and complies with those requirements; participates as required in training on regulatory issues affecting own area of work; brings regulatory compliance questions/issues to the attention of management.Qualifications Bachelor's degree in English or related field with a minimum of five years of experience in technical writing and a minimum of two years of experience managing digital content projects; or equivalent combination of related education and experience. Ability to lead and participate in group projects, act as a team leader, develop project timelines, communicate effectively, and implement projects. Ability to handle multiple projects with excellent follow-up skills. Detail-oriented and have the ability to work under deadline pressure; must be able to deal with unresolved situations, frequent changes, delays, or unexpected events. Ability to perform spreadsheet and database maintenance for reporting the status of projects to management. Strong interpersonal and oral communication skills. Demonstrated proficiency in technical writing and editing for print and digital content. Functional knowledge of Microsoft Office Suite (MS Word, MS Excel). Demonstrated proficiency in DTP software applications (Adobe InDesign, Adobe FrameMaker, Adobe Illustrator). Knowledge of digital content software applications such as MadCap Flare or RoboHelp is required. Able to travel domestically and internationally up to 10%."}