{"title":"HIL Hardware Engineer - EMB46 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKnFQvWHeV0_C_VnkHhnQ8Dk1EGDMnIRppt9yo2zq8LbgiM-I770TweUijkaTXmacZqW6dQgqSRIkrx5i9vYVb7gc-LCmpkJcOvlIw0Or-JbBl17y-zM7nf6i3xlYYcvg4rKFU6rfoljuNnIFI5UyVv6HAUjjpR9xQh2Vdiy7e0meUXD9tXqhknVYkYYak","source":"ziprecruiter","full_description":"Job DescriptionDescription:The HIL Hardware Engineer’s duties include but are not limited to:• Assisting with the development and support of the HIL system equipment focused on the system hardware• Designing and testing HIL harness’• Design, test, and deploy hardware modifications• Assisting with new powertrain hardware and ECU designs to integrate new features or external devices to the HIL test system• Assisting in harness build and modifications and troubleshooting of HIL hardware issuesRequirements:Bachelor of Science degree in Electrical\\Electronic Engineering, Computer Engineering, or a closely related Engineering degree from an accredited universityMinimum of 5 years of professional engineering experience in electrical/electronics, hardware, software or controls Knowledge and experience with ADAS, EE, electric and hybrid SystemsDemonstrated Hardware- In-the-Loop systems experience (dSPACE, ETAS, NI HIL systems) Experience with model-based development tools such as MATLAB/SIMULINKExperience with C/C++ code generation Experiences with scripting languages (e.g. Python, Perl) Knowledge of CAN stack, SPI, LIN and Flash bootloader integration Experience in diagnostic management: CANalyzer, CANoe Knowledge of Simulation Tool (e.g. CarMaker, ASM)Experience with UDS, XCP protocol Familiarity using trace capture tools, data acquisition and analysis tools such as ETAS - INCA Experience with HIL testing, vehicle integration and validation Outstanding interpersonal and problem solving skillsDemonstrated ability to work independently and in a team environment Strong communication skills, both verbal and written, with the ability to speak with individuals at all levels in the organization Experience working cross-functionallyPreferred Qualifications:Master of Science degree or higher in Electrical\\Electronic Engineering or Computer Engineering Working experience of MIL/SIL validation and verification.Basic knowledge of vehicle dynamics and specific simulation software. Knowledge of AUTOSAR adaptive platform. Knowledge of ROS environment.Experience of working within an AGILE or Scrum framework. Experience in Test Automation. Experience with Ethernet networking protocols such as 802.3, 802.1AS, TSN, and requisite transport layer formats.Experience with HD Mapping protocols such as ADASIS-NG or equivalent. Ability to adapt to changing environment with minimal effect on productivity Strong understanding of the development of embedded softwareAbout Kyyba:Founded in 1998 and headquartered in Farmington Hills, MI, Kyyba has a global presence delivering high-quality resources and top-notch recruiting services, enabling businesses to effectively respond to organizational changes and technological advances.At Kyyba, the overall well-being of our employees and their families is important to us. We are proud of our work culture which embodies our core values; incorporating value, passion, excellence, empowerment, and happiness, creates a vibrant and productive atmosphere. We empower our employees with the resources, incentives, and flexibility that they need to support a healthy, balanced, and fulfilling career by providing many valuable benefits and a balanced compensation structure combined with career development. Disclaimer: Kyyba is an Equal Opportunity Employer. Kyyba does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other basis covered by appropriate law. Minorities / Females / Protected Veterans / Individuals with Disabilities are encouraged to apply. All employment is decided on the basis of qualifications, merit, and business need.Rewards:Medical, dental, vision401k Term lifeVoluntary life and disability insuranceOptional Pre-paid legal planOptional Identity theft planOptional Medical and dependent FSAWork-visa sponsorshipOpportunity for advancementLong-term assignment with opportunity for hire by client SELECT AWARDSAn INC 5000 company for 10 yearsCorp! Michigan Economic Bright Spots Crain’s Detroit Business Top Staffing Service Companies in DetroitTechServe Alliance Excellence Award- IT and Engineering Staffing & SolutionsBest of MichBusiness winner in HR Wizards & PartnershipsMetro Detroit Elite Category: Recruitment, Selection & Orientation for 101 Best & Brightest101 Best & Brightest Companies to Work for in Michigan"}