{"title":"Technical Support Account Manager- Remote","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAISMkmEHCLs66W1P0IZ7ueWozIfmornii5PWad76Wi8H7L5JS5dnANPh0rrSXnAul9qhWr5CdhpG27St1IlRjcb7E2UyE5p3bGGz-2ds-_CXxzgaYm1gMs5geFLkgIBTMIQCazFuw0tyTaWWe1HDQt0N4xGGOCEFvp8tvU8S9SFN_ADLygD33ecWuSHeg8","source":"ziprecruiter","full_description":"Join us as we pursue our disruptive new vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we're committed to our work, customers, having fun and most importantly to each other's success. Learn more about Splunk careers and how you can become a part of our journey!Role:The Splunk Technical Support Account Manager (TSAM) is responsible for the overall Technical Health of Splunk Customers. The TSAM Program delivers partnership, technical guidance and advocacy to customers either via consistent sustained relationships, Get Well programs or Migration assistance in partnership with Professional Services. The TSAM's primary focus is to ensure that Splunk customers remain successful and realize the full value of their investment at Splunk.Our TSAMs have the ability to support multiple accounts strategically and are responsible for the technical health of our customers. The TSAM has a wide latitude for independent actions and can complete all duties assigned while operating with minimal supervision.Responsibilities:Act as a primary point of contact for assigned accounts on technical health related itemsRestore and maintain technical health through detailed and documented Technical Health PlansAdvocate for customers during migration efforts and assist with coordination of operational tasksUnderstand the short-term and long-term business objectives of each customer as they relate to Splunk enabling them to achieve those goals and objectives through the use of Splunk products.Provide proactive guidance, planning and recommendations for achieving and maintaining the overall technical health of a customer's Splunk environment.Be the internal advocate for the customer to facilitate the resolution of customer issues through coordination of efforts among Splunk's internal organizations (technical support, incident and escalation management, product development, product management, and executive leadership teams)Proactively analyze tickets and interactions to help guide training plans via Customer Success Managers (CSMs) and EducationDeliver QBRs with customers (onsite and over the phone) in conjunction with sales to review service levels, usage metrics and customer environment performance.Work with the relevant technical teams to proactively handle customer configurations and recommend customer environment upgrades and add-onsMaintain a close working relationship with multiple organizations including Support, OPS, CSM, and SalesUnderstand and communicate the customer's needs to the Account TeamKeep the customer informed of key information that may be critical to their success (e.g. product roadmaps, new product releases, customer events, or organizational changes)Requirements:Knowledge of software development process, IT Operations, and Technical InfrastructureExperience supporting customers using SaaS products and/or Cloud platformsAbility to learn Splunk Enterprise and additional Splunk products as needed. Minimum of Splunk Admin certification will be required (training and testing provided)Experienced in customer service and relationship management skillsAbility to clearly communicate ideas in a business and user-friendly language primarily through email and conference callsAbility to plan, coordinate, and lead multiple activities simultaneously both independently and as a team memberBe available on nights and weekends as neededAbility to build relationships and influence Senior LeadershipPossess the confidence to have difficult conversations with multiple levels within the organizationTravel up to 30% may be requiredRequired Technical and Professional Expertise5+ Yrs. Experience in technical services and customer relationship management5+ Yrs. Experience managing strategic/top accounts in the technology sectorProject management experiencePreferred Tech and Prof ExperienceFundamental working knowledge/overview of SplunkBA/BS technical degree, or equivalent work experienceSystems Administration and/or networking experience in a mid to large IT environment#LI-RemoteWe value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.For job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction records.Thank you for your interest in Splunk!"}