{"title":"Laboratory Curator, Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALeU0U9dzUi0o3B_fOIvoJiao6U_XNoNMdANnGYFwuKS2ME7sQ7VOgKob9oOXN25VxQgENYMYlurJI2E_QdUoYnQCIPcqT_c6paP3MN7NvKFGpoN9griHSmWI4JaEQI56roppQ7vrulvmiFBzjgcjgrRW3hx211bwm4S3RqQOfVcIX6qSmSpqfy3cJR8Ey9","source":"ziprecruiter","full_description":"Job Description:POSITION SUMMARY: The Laboratory Curator for Chemistry and Biochemistry is responsible for preparing and supplying chemistry labs for approximately 1800 freshman chemistry students per semester. Preparation includes setting up experiments, preparing all chemical solutions needed, and preparing and maintaining lab equipment. Incumbent also collects, inventories, and disposes of all waste associated with the labs. Incumbent is also responsible for ordering and inventorying necessary chemicals and equipment. In addition, incumbent supervises and trains graduate students as teaching assistants. PRIMARY RESPONSIBILITIES: 1. Prepare the labs for approximately 1800 freshman chemistry students per semester, which includes setting up experiments, preparing all chemical solutions needed, and preparing and maintaining lab equipment. Collect, inventory, and dispose of all chemical waste (hazardous & non-hazardous) associated with the freshman chemistry labs and work with the Dept. of Environmental Health & Safety. 2. Supervise federal work study students and manage check-in and check-out of all laboratories. Supervise and aide in training of graduate students as teaching assistants. 3. Supervise the labs as they occur. This includes some supervision of the teaching assistants (graduate and undergraduate students), maintaining correct levels of prepared chemicals for the experiment and aiding the graduate students in case of equipment malfunction during the lab periods. 4. Use BobCat Buy and Concur to purchase and inventory all of the necessary chemicals and equipment for the freshman labs. Manage the shipping and receiving of said orders. Provide back-up coverage for the department's purchasing office. 5. Serve on the department's safety committee and complete other duties as assigned.Minimum Qualifications:Associate's Degree in Chemistry At least one year of work related experience At least one year of supervisory experience Valid driver's license Chemical Hygiene Safety Training (OU EHS provided)Preferred Qualifications:Bachelor's Degree in ChemistryPlanning Unit: College of Arts & SciencesDepartment: Chemistry and BiochemistryApplicants may contact this person if they have questions about this position: Julie Masterson, masterso@ohio.eduEmployment Type: full-time regularAdvertised Salary:Minimum of $14.36 hourly, commensurate with experience and credentials. Salary is accompanied by our generous university benefits such as tuition for self and dependents, a comprehensive insurance package (including but not limited to prescription, vision, dental, and life insurance), an excellent retirement plan including company contributions, parental leave, adoption reimbursement, and more. OHIO is also proud to offer wellness programs, on-site wellness facilities, and a generous employee assistance program. Additional information is available at https://www.ohio.edu/hr/benefits/."}