{"title":"Technical Services Lead","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKVgq8PH3_HfW7uF4IDGqVIfehDlqCgXqxiiwcdFzl6mDcxvF85dFESFEZtWSkWud7p-BjGZJM3GGIu2gQdV-7U3G644VEIuUCYXCf1_PVqk_8T52l3KmNGrycLyvZEi5CBU8TPEnrCcAUXBDrvT9wNMUVTawobduOoLyM2pnGEfoZs51_f2Mk0gWlREbCy","source":"ziprecruiter","full_description":"Ascend Learning is a national leader in data driven, online educational solutions for learners, educators and employers in high-growth, licensure-driven professions spanning healthcare, fitness and wellness, skilled trades, insurance and financial services. We are passionate about accelerating learning while impacting job readiness, employment success and employee retention with the belief that our work changes lives.Our culture is intentionally results-driven and selfless with a relentless focus on our customers. We believe in trust, transparency, freedom and responsibility with a commitment to meritocracy, inclusion and diversity of thought. Continual investment in our over 1400 employees is also a core principal realized through ongoing professional development and providing opportunities to grow, develop and lead. Ascend Learning is headquartered in Burlington, MA with additional office locations and remote workers in cities across the U.S. and in the U.K.Job OverviewThe incumbent will take the lead to drive the successful delivery of technical support services offered by the Service Desk organization. Our technical support services focus on identifying, troubleshooting, and resolving technical and product related issues impacting Ascend Learning clients. The tremendous growth in product offerings adapted by our clients and the demand for quick access to technical support has led to the growth of our technical support team. This position will contribute to our organization providing a world class customer experience while implementing strategic initiatives to improve operational efficiencies.   Responsibilities & DutiesAct as lead managing the delivery of Service Desk support activities to meet or exceed pre-defined performance measures.Deliver a Quality Assurance program which includes evaluation of technician performance, development and implementation of coaching for improvement, and mitigate skill and knowledge deficiencies.Monitor contact (i.e., phone, chat, email) performance to identify processing backlogs (i.e., handle time, time to resolve, abandon rates, customer satisfaction) and implement steps to mitigate and return service delivery to expected levels.Deliver escalation management function to include management of external and internal customer issuesResponsible for maintaining team's daily work schedules, including weekend support, as well as after-hours support requests submitted by clients.Conduct new hire onboarding and existing staff refresh training. Identify performance gaps and recommend appropriate solution (i.e., training, new tools, process improvements) to remediate.Skills & AbilitiesExcellent verbal and written communication skills allowing effective interaction with peers and across all levels of managementAbility to learn new product support functions and features as well as transfer that knowledge to othersMust be detail oriented with the ability and desire to follow workflow process as definedProficient in creating reports used to analyze performance and creating effective presentationsEducation & ExperienceThree to five years experience in a call center environment providing end user technical support, preferably software and product related support.Two to three years of leadership experience within a Service Desk environment required.One to two years combined experience performing root cause analysis, developing and delivering training, and workflow process improvements.Bachelor's degree in computer related technologies preferred or equivalent experience required Ascend Learning, LLC is proud to be an equal opportunity employer (M/F/Vets/Disabled). No agency or search firm submissions will be accepted. Applications for U.S. based positions with Ascend Learning, LLC must be legally authorized to work in the United States and verification of employment eligibility will be required at the time of hire."}