{"title":"          Accounting Assistant NEW!        ","location":"","salary":"","term":"$21 to $24 HourlyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAJpbt124OJvZguRgT3FRlmaHMNHu4Wz2z-Z7CBDyyHzh2bG4b3IbLfZrPkMAe7piq9mRHvWRCdMegVBB_OmxVrcbC04TsqCdTQtLIWYd5uNhH5ORuu7e51MGDVmNlmqrfWOgCbX_usLaOSj8MUpHdrowqXLS-xSRXWqWJaJD9bwiTlNNmc1NPPEb-4Z_WC4","source":"ziprecruiter","full_description":"\n        Our very well established and growing distribution client is PARTNERING with STAFFING PARTNERS in search of an experienced Accounting Assistant for this IMMEDIATE DIRECT HIRE CAREER OPPORTUNITY!SALARY - $21.00 - 24.00/HRBENEFITS - Medical, Dental, Vision, Life, Disability, 401K, Paid Holidays, Sick Pay, Paid Vacation, Employee DiscountsJOB LOCATION - ModestoHOURS - Monday thru Friday, 8:am to 5:pmResponsibilitiesAssist Executive Vice President / Controller with all accounting related tasks.Enter financial transactions into ERPS database.Prepare bank deposits.Scan daily checks via remote deposit capture.Assist Accounts Receivable in deposit research.Assist in reconciliation of monthly bank accounts and identify discrepancies.Assist in preparation of journal entries as assigned.Assist in preparation and payment of monthly/quarterly sales tax returns.Participate in annual audits.Maintain digital and physical financial records.Enter rebates and update contract info into ERPS.RequirementsMinimum 2 years work experience in an Accounting Assistant or similar role in finance/accounting department.Associate’s business degree a plus, or an academic background in Business, Accounting, or Finance field, OR equivalent experience will be considered.Good math skills and the ability to spot numerical errors.Hands-on experience with MS Excel.Great Organizational skills.Ability to handle sensitive, confidential information.HOW TO APPLY:VERY IMPORTANT!! RATHER THAN APPLYING THROUGH THE WEBSITE, PLEASE EMAIL YOUR RESUME as a Word Doc Attachment DIRECTLY TO Trish Miceli: trish@staffingpartners.netAlso, please email your resume specifically as a Word Doc Attachment as it is necessary to receive, read and save it in this format. Applying through the website may convert it to a PDF or an UNREADABLE format, and CAN ALSO CAUSE DELAYS IN PURSUING OPPORTUNITIES FOR YOU!! Please make sure your resume reflects your contact information to INCLUDE City and State.We will contact you if you are qualified for this position or any other positions that become available.IF YOU HAVE ALREADY SUBMITTED YOUR RESUME TO OUR AGENCY PLEASE CONTACT OUR OFFICE DIRECTLY. THERE IS NO NEED TO RE-APPLY FOR THIS POSTING.NOTE: All applicants applying for U.S. job openings must be authorized to work in the United States.\n      "}