{"title":"Network Engineer - CCNP CCIE","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAID2C95JRTVYSinfdKk8m-brh2AGVyfHczxdploOYH4j6XwHuS_I-KGtbUvSMhjuSlQsV60gpbt3X7_aR73bTdGER9S16PZC4Irely5Ccz6_rO8rFDpNN68quleEcAlmw6JXQAtUWvLFTmcAIrvP8hl1_8BeZzOaCMVHglEJ0n_CQNb3QFr7WvgMZdjarhR","source":"ziprecruiter","full_description":"Network EngineerRedmond, WALong term contractPreferred LocalsThe successful candidate will need to have primary skills as Network core technologies experience in Operations and deployment, Design & Troubleshooting.The candidate will: Have the ability to understand and interpret complex business and IT requirements, design an appropriate solution and implement the network. End to end project delivery. Have sufficient knowledge of IT Operations understanding policy, processes, procedures and systems deployed. Practical experience in Cisco Routing and Switching at CCNP/CCIE Level Have excellent knowledge of the project lifecycle.Experience Cisco Routing and Switching at CCNP/CCIE LevelCisco ,Juniper,F5,Citrix hardware and implementation Knowledge Excellent inter-personal skills including the ability to influence peer group good negotiation skills. Proven ability to prioritize competing demands for time and resources Have the ability to understand and interpret complex business and IT requirements and assess futureManaging Enterprise Network project implementations. Essential Skills/Basic Qualifications: 2+ years of experience working effectively with internal and external suppliers to ensure that projects are delivered on time and in line with the budget. 5+ years of Data Networking experienceDesirable skills/Preferred Qualifications: Experience in working in IT Infrastructure Knowledge of ITIL disciplines Broad understanding of Network technologies including routing and switching, firewalls and load balancing Experience of managing and influencing stakeholders, achieving high levels of stakeholder satisfaction through setting and meeting / exceeding realistic targets.#networkengineer #networkadministrator #ccnp #ccie #enterprisenetwork #networkengineer #networkadministrator #ccnp #ccie #enterprisenetwork #networkengineer #networkadministrator #ccnp #ccie #enterprisenetwork #networkengineer #networkadministrator #ccnp #ccie #enterprisenetwork"}