{"title":"UC and Network Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAINalV9kdvWJlVvEluaFZCETSlr2guDZTJpR8sbNMm2_gvwYyT-gYSFYSRphg7EQLd4ja7UYEU4v58PY7WfQO5AuvcKM_7PJN6JZ9Y0vq-rMgTsn6UdMolYzagYsT4WswITdZf969JhKtFtv3MSmd_5fxbJzh0wlKK4tmIR3B21nFXxLZxAgAEbU9myKQk","source":"ziprecruiter","full_description":"Job SummaryThe Unified Communications (UC) and Network Engineer is tasked with product management and engineering responsibilities for Microsoft Teams Voice, and operational and engineering responsibilities for the network. The UC and Network professional is adept with telecommunications, email, and networking; is proficient with Microsoft Teams Voice, LYNC and/or Skype for Business, and Exchange; and skilled with campus and data center routing and switching. The primary focus is accountability for MS Teams Voice configuration, Dynamic E911 and Direct Routing, phone system licensing in M365, reporting metrics, end-user account support, the trade-offs of features and functionality for all affected, governance, cost allocations, and vendor management. Be the technical lead and play a role in the expansion of MS Teams Voice across the firm. Additionally, play a support role for networking of remote offices and/or data centers handling configuration changes, routing and protocol updates and monitoring performance of circuits. The UC and Network Engineer will maintain a focus on automation and DevOps within the ecosystem. We require a commitment to collaborative problem solving, sophisticated troubleshooting, adherence to governance policies, and comprehension of related US laws and compliance. This role is a member of the Infrastructure & Operations departments and reports to the Operations Services Lead.Primary Duties & ResponsibilitiesOwnership of MS Teams Voice product and service, including vendor managementUnderstand and advocate for Practice IT and stakeholder needsOperational support for MS Teams Voice using logs, metrics and reporting to identify issues and performing corrective actionsWork cross-functionally to determine suitability of new MS Teams Voice features, develop and share planMaintain Dynamic E911 (US) with MS Teams Direct Routing and configuration with Legal and ComplianceManage dial plans, communication credits, phone system licenses, and role-based access controlsCreate and prepare annual reconciliations on cost allocations and license countsConfigure and maintain network equipment for the campus and data center environmentsTroubleshoot and resolve issues related to the campus and data center environments by analyzing with packet capturesMaintain optimal user experience for MS Teams and the campus and data center environments, i.e. Call quality, priority queueing, latencyManage a diverse workload and portfolio of tasks and work under time constraintsEffectively communicate issues and resolutions to diverse levels of understandingLead small to medium-sized technical projectsSome travel may be requiredQualificationshave 5+ years of managing a phone system, PBX or VoIPMust have 3+ years with industry level experience in modern network OS'sMust have 3+ years' experience automating and performing scripting tasks, PowerShellExperience in network monitoring toolsComputer science or Engineering degree; or general degree with 3+ years of technical experience; or 10 years' experience industry experiencePossess expertise of unified communications, VoIP and IP networking protocolsExpert in MS Teams Voice, Skype for Business, LYNC, or other Unified communication technologyExperience with switching/routing protocols, fine-tuning/prioritizing voice vs. data traffic, QoS, MPLSProactive working style and mindset to drive innovationExperience with DevOps, preferred"}