{"title":"Technical Support Representative","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ4Ae6wyYNEM0WOkLVlTKNE8ltfI-txmbfziYC88JfLu5T3ZMrv6f9cuK9eKLF4hxTJGiytTr-BVSeCVT1qTnlYBfBZwVGEgX8lsINR5Gz84RS5b97SyQNQ4sDpSK_KlgiZ-RzuzdzZsb0RIOXI52cqq3kJ6Js6ASBGGw2SC6ukrGBB96P308WqPx5yrK6p","source":"ziprecruiter","full_description":"Technical Support RepresentativeAjilon is partnering with a premiere marketing company to fill their open Technical Support Representative job in Madison, WI. To qualify, you must possess at least one year of recent, relevant experience providing technical support, preferably in a call center environment. Our client is a national company. They offer two weeks of paid training to ensure your success in the role as well as many different paths for career growth! This is a TEMP-TO-HIRE job opportunity where you will earn $16.00 per hour. Once you are hired as a permanent employee, you will also be eligible for this company’s competitive benefits package.Responsibilities:-Taking client calls and troubleshooting their basic technical issues with phone and computer applications-Setting up new customer accounts-Gathering all necessary information to escalate calls if necessary-Documenting all customer interactions in the database-Following up with customers to ensure that their issues were resolved-All other related tasks as requiredQualifications:-At least one year of recent, relevant experience providing technical support-Previous experience in a call center environment preferred-Previous experience with Epic software preferred-Excellent attention to detail-Excellent written and verbal communication skills-Excellent customer service skillsIf you think your skillset makes you the best candidate for this Technical Support Representative job in Madison, WI, then apply NOW! Apply here or e-mail your résumé in Microsoft Word format to Justin.Pagador@Ajilon.com for immediate consideration.Equal Opportunity Employer/Veterans/DisabledTo read our Candidate Privacy Information Statement, which explains how we will use your information, please The Company will consider qualified applicants with arrest and conviction records"}