{"title":"Chemistry Lead","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIpQ6-DDLt9aulDbDV9LmLW-0AeaaBWoEWacPFs8lTLSO6DtaPBVQyw4FRU3ATommLVyvCny9I9mTUIV_hpxMOZdh2u7lix-Ckdrm3UhdoxVeJiiveaWCgeYSjdyLR-TObAmWTh8WgvUP4BqXb38-CCxRFLv6ixMTSf9s9q2DXgghBbT2d9ui4zhDtnndSu","source":"ziprecruiter","full_description":"Chemistry Laboratory LeadPosition OverviewATL is seeking a dynamic Chemistry Lead to join our team of dedicated professionals focused on client service and quality. The ideal candidate will be motivated, energetic, forward thinking, and possess outstanding leadership development and/or technical skills, organizational awareness, and a commitment to excellence. The Chemistry Laboratory Lead is responsible for the efficient day-to-day operations of the lab including analyst assignment, testing workflow and compliance. The Chemistry Lab Lead is also responsible for driving the completion of lab tasks and assignments on time and consistent with meeting client expectations. This role is also responsible for training and coaching lab associates under the direction of the Manager. Essential Functions:Leading the BusinessCoordinating daily work flow with client and management ensuring the lab meets all testing deadlines.Perform identification, gravimetric, qualitative, and physical testing on a routine basis as assignedExecute titration testing and chromatographyPerform chromatography testing on a routine basis as assignedUtilize basic instrumentation to perform testing on a routine basis as assignedPerform quality review of testing completedPerform method validations and verifications as neededIdentify and/or initiate improvement initiativesPerform routine lab maintenance, maintaining a clean and safe laboratory spaceEnsures work is being performed with regard to safety at all times; monitors adherence to safety SOP’s including proper PPE, product storage and prevention activities.Completes all testing to ensure that results are on-time and regulatory compliant while troubleshooting activities that would impact our ability to meet client expectations.Identifies special projects and cross-training opportunities to assist with professional development for associates.Reviews testing data and conducts investigations for any lab result that does not meet specification.Collaborates with internal departments to ensure lab is operating with the tools and resources necessary to complete testing.Monitors associate performance, identifies and implements ways to increase productivity and efficiency; escalates ongoing concerns to lab manager.Leading OthersTraining other chemistry analysts on instrumentation and methodsEffectively communicates expectations to team as outlined from Lab Manager.Identifies and implements ways to improve the technical performance of associates, escalates to Manager for formal performance improvement process. Ensures associate behaviors in the lab are aligned with the ATL service framework and culture.Escalates any performance behaviors that do not align with ATL culture, service standards and values to Lab Manager.Inspires and motivates staff to go above and beyond to exceed client expectationsLeading Self Uses effective communication to relay information using the ATL brand voice which is optimistic, approachable and wise.Identifies and appropriately addresses actions that do not align with our culture to ensure a positive work environment.Assesses situations, seeks to understand and gathers all relevant facts to determine the best course of action to resolve problems.Utilizes critical thinking to find solutions to complex problems; escalates to Lab Manager for assistance.Demonstrates flexibility to adapt to changing deadlines and prioritizes tasks based on business needs.Serves as a culture champion that cares intensely about ATL’s successRequirements:Bachelor’s degree in chemistry or closely related field or combination of science and professional experience required.3+ years of experience in a laboratory setting required.Experience in GMP or cGMP regulated laboratory setting preferred.Experience in the consumer products, pharmaceuticals or personal care industry is preferred.Demonstrated ability to lead and train on all technical aspects of the lab.Must have strong interpersonal skills such as communication, relationship building, initiative, adaptable, positive attitude, and team building.Ability to present facts and recommendations effectively in oral and written form.Excellent foundation in technical problem solving skills to assist in trouble shooting for sample, method or equipment issues.Ability to work in an extremely fast paced environment. Must be flexible and be sensitive to changing priorities.Time management; the ability to organize and manage multiple prioritiesStrong understanding of Microsoft Office suite.Ability to work independently as well as in a team environment.Company OverviewAt ATL, we don’t just do the science, we have the opportunity to transform organizations. We need people who want to grow with us and contribute directly to our clients’ success. As scientific sourcing experts, the largest and most respected companies in the world ask us to create innovative solutions to big problems. We have more input and influence, so we can have a significant impact on brand-name products and visible projects. And you can play a bigger role.Interested and qualified candidates, please apply with a resume and salary requirements.ATL offers a comprehensive benefits package including: Medical, Dental, Vision, Life Insurance, Short Term Disability, Long Term Disability, Pet Insurance, a 401(k) Retirement Plan with company contribution, Paid Time Off, and an Associate Assistance Plan. In addition, we offer a competitive salary and the advantage of a professional environment that supports your development and recognizes your achievements. ATL is an Equal Opportunity Employer (EOE) and strongly supports diversity in the workplace."}