{"title":"Software Engineer Embedded Systems NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJc_FvZh7JyNqoMDEPT7qy9E1pzMMUfa4yamON0nM4RRxb04dXUG1BCDreydg0fFau452TgQdrt47S7ol2Ef1FSlQYH1GQXQMLcZlVdmlfVXtZqnAKMCA3XAbdSM5VbTZnx7npN-amfRvfYSBYY2XvWeKBWfDetXUar1YmZEFuYnQB6l7-EEs0bKq90XCpl","source":"ziprecruiter","full_description":"5-D Systems, a KRATOS Company, is seeking a highly motivated candidate for a full-time software development position with the ability to successfully work in a small-team environment. Potential tasking for the candidate will be varied and may range from developing real-time software for an airborne, embedded system to developing custom system test software for a desktop environment. In general, the candidate must have experience with developing embedded software using C++ and interfacing that software with external hardware interfaces and peripherals.Duties will include but are not limited to the following:Developing software for new and existing systems for aircraft and aircraft test systemsDeveloping design documentation for internal and external useWorking in adherence to 5-D Systems software development processDeveloping software test plans and procedures to demonstrate compliance with system requirementsParticipates in planning, design, testing, and deployment of moderately complex, engineered systems and software to ensure conformance with functional specifications and customer requirements.Peer reviews fellow team members’ workSupports trade studies and performs design research and explorationsReports project and task status to project tasking leadAssist in preparation of proposals and presentation materialsExperience & CapabilitiesRequired:Experience developing software for embedded systems in C/C++ in aerospace environmentsSelf-directed, sharp analytical abilities, excellent communication skills, and capable of working effectively in a dynamic environmentResults-oriented, sense of ownership, urgency, and driveAbility to travelPreferred:Experience working within the Defense industryExperience with safety-critical/mission-critical developmentApplication development for Linux-based target environmentsWindows-driver developmentExperience integrating embedded applications on VPX/VPE platformsModeling and simulation of systems using SimulinkTest and Measurement systems designSystems Engineering experienceQualificationsBachelor's or Master’s Degree in Electrical Engineering or Computer EngineeringAt least 4 years of industry experience developing embedded applicationsMust be a U.S. CitizenA U.S. DoD Secret Clearance or higher (or the ability to obtain such a clearance if needed)"}