{"title":"          Autonomous Software Engineer C## NEW!        ","location":"","salary":"","term":"Contractor","jk":"","detail":"https://www.ziprecruiter.com/k/l/AAKWx8F0weGO8vKCspFoQCjDEUXR-ikn1sgV8Os_E6KeOGw1BOFGfKfPt3vft-yf0ad5PZnWUfHKeb10AwhjyHqqb-2bHvD0NxrWQQZ_e1qn31puvq90NR8OkDjWNkR-ojazVamJOj4w2wV2TZMuS_kTD2J5-yLuVIUwq6gsyWG4IdWKSEmY4wtAL24LP3I","source":"ziprecruiter","full_description":"\n        Autonomous Software Engineer C##/Python - 955127 Location: Mountain View, CA 94043Pay Rate: Open based on OEM pay per hour.Remote: YesType of hire: Contract for 6 months with longer term potential history with strong performance. Required: US Citizen/GreenCard holder. (No H1B or TNVisa)Position Summary:Seeking: B.S./M.S. degree in Computer Science, Computer Engineering, or related field - 1+ years of object-oriented software development experience - 1+ year of experience with developing software for traffic simulators such as AIMSUN, VISSIM, with Experience with programming languages (C++, Python and C#).Autonomous cars, edge computing, IoT are some of the trending buzz words in the automotive industry. Connected cars, which can be a combination of all of the above and much more, are a path breaking space with a lot of potential for new customer centric mobility and safety applications. Intelligent Mobility Systems (IMS) group in Toyota InfoTech Labs, is conducting research in connected car technologies to build the next-gen traffic management system which includes the development of simulation platform, designing methods for hierarchical traffic management, developing, and testing prototype vehicular networks. We are seeking passionate candidates for a software engineering role who will join as a software engineer and help the team to build and maintain hybrid testbeds for solving transportation and mobility problems through the connected car technologies.We’re looking for a talented software engineer who has significant experience in application design and development and good programming habits to produce quality software. The candidate must be at ease working in an agile environment with little supervision. The candidate should be willing to learn new technologies and focus on continuous improvement for a demo-driven development.Position Responsibilities:Coordinate with researcher/trainees/project manager/engineers to come up with elegant transportation/mobility solutions and demonstrate their benefits through connected car technologies.Model/implement/validate realistic driving behavior and vehicle interactions to simulate/emulate the traffic events on roads, analyze the impact of traffic events on other vehicles and traffic, design/develop solution methodology to mitigate these impacts on the overall traffic.Design, develop and analyze tests/test-automation suites in both software and hardware in the loop platforms.Perform engineering analysis, prepare/present reports in support of implemented testbed and applications.Maintain, support, and enhance the existing testbed and application platforms.Create and update documentation of existing testbeds and applications.Position Requirements:B.S./M.S. degree in Computer Science, Computer Engineering, or related field1+ years of object-oriented software development experience1+ year of experience with developing software for traffic simulators such as AIMSUN, VISSIM, etc.Experience with programming languages (C++, Python and C#).Experience with development environments (Visual Studio, PyCharm/Anaconda, etc.).Knowledge of multithreading, multitasking, concurrent programmingExperience with network/process communication protocols (like MQTT, ZMQ etc.).Excellent verbal and written communication skills.(Optional) Experience with front-end development technologies (Unity, Qt and/or HTML)(Optional) Experience in some or many of the following areas: machine learning, deep learning, reinforcement learning, etc.\n      "}