{"title":"Technical Writer- Partner Management","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AALXETH-LOLlwTDw2l_JnCfBOjLhTL2CJ1k0OhQXxooxTLEzL_2oLnx8ZeKnqlYgu9J3qNAMVQGvqK0SXcrfdK-UWpgo5q5oASCjmkLAUBGhPUsyXCMliCLk4lbn5JmH5dSh69hY9dJiqK5VP9VzPwDl_SZRDbxbpPeH-zm5Lm3VZOHH0py4HGLRKiLdSdjB","source":"ziprecruiter","full_description":"4-6 week contract which could extend into 3-6 monthsweekly pay and benefits are availableMust work PST hours, remote roleJob Brief:The company is looking for a writer who can design, create, and manage content for a set of Integration Solution Guides. In this role, you'll develop content from existing documentation and discussions with Subject Matter Experts (SMEs). You'll work with a project team to develop a suite of solution guides with a consistent look and feel and to build an initial set of content that's effective and easy to update. This position is a 4-6 week contract.Responsibilities:Create web content for technical development solution guides and in-product assistance for the company's partners on a temporary basis as part of the company's Partner Management team. Your content will be published on the company's website.Work with product-groups and subject matter experts to understand your feature area and write great documentationCreate and test sample cURL requestsInvestigate and prioritize updates to existing contentTrack and communicate project status, and deliver what you promiseConstantly seek and respond to stakeholder, developer and partner feedbackRequirements:Be prepared to share samples demonstrating the qualifications below as part of the interview process.3+ years creating assistance content for external customers (samples required; please be prepared to submit them on request)3+ years developing software-product user guides in an online environmentDemonstrated ability to analyze customer needs and develop a writing plan to meet those needsExperience using authoring tools to create and publish content on the web; experience with Adobe Experience Manager a plusExperience collaborating with software development teams and turning solution and integration information into developer-facing contentAbility to use standard software tools and, more importantly, the ability to learn new onesExperience documenting RESTv2 APIsKnowledge of taxes is a benefit and may replace some writing experienceSamples that demonstrate strong writing skills are essential"}