{"title":"Lead Software Engineer","location":"","salary":"","description":"","term":"$82,000 to $107,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJM7w37bTin4ZL_GrZa9PGS5PsFfa368jDHYo4fHVbCh0rWMamHpWnx_CiviUqigAeRZxR7m7QLwBJurG0HruHfUmOSeijTLr2Rv-TqpKCFktD6eWkPZSWsoXy4IxCkGPA6Ks0doL0154_x6QUPdsgj--06Nch2Loh0oC5SR0-ihiaZfeWHPQnwXH-iQWQX","source":"ziprecruiter","full_description":"Interested in developing leading edge medical device technology in a small company with a history of success? Join our team and have the opportunity to work on several exciting projects at once in an R&D environment that leads to success, not excessive meetings and paperwork. You’ll have the opportunity to eventually lead efforts to commercialize the technology you develop or continue focusing on early stage efforts.Who We AreConvergent Engineering (CE) focuses on the application of advanced technology, signal processing, and machine intelligence to biomedical applications. CE has strong ties with the Colleges of Engineering and Medicine at the University of Florida.Convergent Engineering has developed and commercialized several products since its formation. CE developed VentAssist™, an FDA-cleared decision support system for monitoring ventilated patients and optimizing ventilator settings. VentAssist has been licensed to Philips Healthcare and is currently commercialized in the NM3™ respiratory monitor and their newest ventilator, the VX850. CE has also spun off two companies, one that is developing electronic pill technology and one that commercialized CE’s electrode-based fetal monitoring system – now acquired by Philips Healthcare.Convergent Engineering offers a retirement plan, health insurance, yearly bonuses, and standard holidays/vacation days. We are a small company that allows employees to grow and acquire a wide variety of skills by working holistically on all aspects of the product development cycle.What We are Looking ForLead Software Engineer with Full Stack CapabilitiesThis position is in a small team developing medical device hardware and software. Multiple projects will be developed each year and the desire and ability to learn new skills quickly is required. Primary task in first year is developing a software system that supports respiratory therapists in taking care of ventilated patients. This involves acquiring data from medical equipment, uploading to an online database, and creating application interfaces to display combined data for the user.Minimum requirement:· Bachelor’s degree in Computer Engineering, Electrical Engineering, or equivalent· 3+ years of medical device, secure database implementation, and/or embedded software development experience.Preferred:· Masters or PhD in Computer Engineering or Electrical Engineering· DSP or machine intelligence experienceSelf-starter, independent worker able to work in inter-disciplinary teams of engineers, scientists, and clinicians.Required Skills:· Quality-based software design, using industry standard source/revision control with clear/concise engineering documentation (Medical device experience preferred)· Secure back-end database design· Hardware/software debug experience· Mobile applications including Java, C++Desired Skills (or willing to learn):· Microcontroller experience such as ARM, arduino, ATTiny· Embedded software including CCode optimization for limited resources and multi-threaded applications· Experience using matlab for algorithm design, development, and test· Physiologic/biomedical signal analysis (plethysmography, ECG, ventilator waveforms, etc)· Machine intelligence· Android and/or Linux kernel drivers· Real time operating systems· Experience with Bluetooth LE· Experience with inter-hardware communication such as I2C and SPI bus"}