{"title":"          Remote Senior Full Stack Developer Lead NEW!        ","location":"","salary":"","term":"$110,000 to $140,000 AnnuallyFull-Time","jk":"","detail":"https://www.ziprecruiter.com/k/l/AALebDwYtF-Trf6LVpUv7XYU1MjeghV-pBXrUsEkgonRgDq9YyXbd0eWcKWn7HfIzGCWJdpLALCqcONW_by2Tdu1by-VPancLcvQOAt-vEdq_lb6ijSHCocrB7Re_0OdvpQJENhDXr3m-lHryU59v6rlS2y9eGii2Vav3pJZ_Y6ejTBwS8AdiLWfNoMrf5g","source":"ziprecruiter","full_description":"\n        100% remote Team Lead Full Stack Java Developer - 70% back end and 30% front end workWork from anywhere! Up to $140,000!8+ years of full stack developer experience with 70% back end experience full stack developer to lead a team of 5 developers, architect for new features and work with the stakeholders on two parallel projectsThis International employee-focused State-of-the-Art Government Contractor with cutting-edge contracts throughout the USA seeks a Senior Full Stack Developer Team Lead who is ready for your next stop on the Java Journey? they have a destination for you. they're looking for the right person to join our team as a Full Stack Java Developer Team Lead.The ideal candidate needs to have strong understanding of multiple technologies and their deeper layers as well as to be able to move between technologies.You will review codes, architecting for new features, working with stakeholders, provide technical leadership to other developers on the team, use Agile/ Scrum methodology for daily and retro meetings and having the ability to move towards a large-scale project planning, be in charge of the landing zone project that involves moving off the legacy application (Scala) and transitioning to Informatica, oversee the development of microservices project that involves creating an automated tool allowing stakeholders to self-service and producing comprehensive reports for executives to make decisions, and work with the infrastructure management group to monitor and patch servers as well as tracking vulnerability to coordinate patchingYou need proficiency with at least one dynamic AND at least one static language; Proficiency with at least one relational database; Being on a senior level with MongoDB to do data architecture; Being on the architect level with web services and API; Strong back-end development skills; Experience with Docker and Kubernetes; The ability to lead a team of developers; Flexibility with languages: Being able to move between technologies; Excellent communication skills; Strong understanding of computer science and algorithmsYou must be a US CitizenYou must have solid 8+ years working knowledge of TypeScript / JavaScript, MongoDB, Angular, Express, GraphQL API development, REST API development, Object Oriented Development / Design and Relational Databases – one of (MSSQL, PostgresSQL, MySQL, SQL and Solutions ArchitectPreferred Requirements:· Experience with Azure· Exposure to Scala, Spark and Hadoop· Exposure to Big Data engineering· Experience with Informatica· Experience with Nodejs· Experience with working with large servers environments (75,000 servers)· Managing Kubernetes clustersYou must have 8+ years of Senior Full Stack Developer with heavy back end experience and management of projects and peopleThis position is 70% backend work and 30% front end work and leading and mentoring junior developersExperience with Solutions Architect is a must and experience with sales, technical, and managerial experience is highly desired.Highly Desired Skills:NestJSMongoDB Aggregate FrameworkMongoosePassportTypeGraphQLRollupBabelJestUnsurpassed benefitsUp to $140,000The firm offers extensive Medical, Dental, Vision & Prescription Insurance, and pays 80% of the premiums, free life insurance, STD/LTD, and Accidental Death and Dismemberment & Worker’s Compensation. A 401(k) Retirement Plan, an annual Performance/Profit-Sharing bonus program, and a stock incentive plan.The firm offers tuition reimbursement per calendar year for eligible fees, and expenses of a degree that is related to your job for career advancement, and the firm will pay for I.T. training as required and offers a bonus program for certifications achieved while at the firmPTO is 120 hours (15 days) per year plus nine company holidays.The firm offers other unique benefits such as affordable Legal Services and Identity Theft Protection services. The firm provides a monthly phone and Internet allowance, plus a company laptop and service plan.\n      "}