{"title":"Maintenance Mechanic-Forklifts","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJZx9vDqNkqgm6clb4Li6y77JrvPFLSliSR6ZlWa-IkWnB0jVyU5BJwllOHe8QfNPrAdUvAKWWt3isqtYdi0z2qEmfxerEhd0x43kxWu2zf2O3HK_u5wgYNgzkrfpvxfJ1adYenON6F0FltnDpcuM3wUPFLtKbKfkVen1X4vgZG0FVy4qHzeMyYWbF46crW","source":"ziprecruiter","full_description":"Apply Today! https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=8774&clientkey=B38E004F17E260CC9A2761B7F6E6221FPOSITION SUMMARY This position will be responsible for the repair and maintenance of electric, diesel, and gasoline industrial trucks and batteries and/or construction and aerial equipment.ESSENTIAL FUNCTIONS Reasonable Accommodations StatementTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.Essential Functions Statement(s) ● Accepts assigned work orders from Service Dispatcher, Planner and Manager in order to begin diagnosing and planning work required to repair the units.● Makes mechanical repairs to equipment after a complete inspection and analysis of breakdown has been completed and approved by the Service Manager / Shop Lead.● Responsible for writing complete repair descriptions on work order, including the correct model and the serial number of equipment and hour meter reading.● Examines protective guards, loose bolts, and any specified safety devices on units and makes adjustments.● Lubricates moving parts and drives repaired truck to verify conformance to specifications and ensures final quality inspection is conducted prior to make the unit ready for the return to service.● Turns in all paperwork to Service Dispatcher/Planner daily. Includes work orders, time cards, etc;● Provide the Service Manager with reporting data related to work in progress totals for field technicians● Control flow of work in the shop (including trucking and rentals when necessary)● Create and communicate all quotes for work to be done in the shop.● Provide guidance to technicians to assist in the completion of repairs when necessary● Open, review, and validate all information on all work orders at the time of the service job as well as throughout the process until the billing is complete● Create and organize all paperwork generated during the shop repair. (Including the shop folders)● Communicate with customers on the status of their shop job via outbound calls as the work is being performed● Confirm scheduled maintenance has been performed on all units in the shop for repairs● Create and communicate field service quotes when necessary● Answer and respond to incoming customer service calls● Final sign off on shop work orders prior to invoicing● Perform other duties assigned by managementSKILLS & ABILITIES Education / Experience: High School Diploma or Equivalent; 1 year of related mechanical experience and or/training; or equivalent combination of education and experience.Language Ability: Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports and correspondence. Ability to speak effectively before groups of customers or employees of an organization.Math Ability: Ability to add, subtract, multiply, and divide into all units of measure, using whole numbers, common fractions, and decimals. Ability to compute rate, ratio, and percent and to draw and interpret bar graphs.Reasoning Ability: Ability to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form. Ability to deal with problems involving several concrete variables in standardized situations.Computer Skills: To perform this job successfully, an individual should have knowledge of Microsoft Office products including Word, Excel, and Internet software.Certificates and Licenses: Must have valid driver’s licenseWORK ENVIRONMENT Work environment varies from office to job site to industrial locationsOUR CORE VALUESPassion to Perform – We are passionate to perform and focus on concrete achievementsTrust to Act – We are empowered to act, and act in a powerful wayAct Responsibly – We are responsible for our actions and the consequences they have for our stakeholders and our environmentMake it Fun! – We are serious about making work fun; it’s the way we do thingsAn Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.The Company has reviewed this job description to ensure that essential functions and basic duties have been included. It is intended to provide guidelines for job expectations and the employee's ability to perform the position described. It is not intended to be construed as an exhaustive list of all functions, responsibilities, skills and abilities. Additional functions and requirements may be assigned by supervisors as deemed appropriate. This document does not represent a contract of employment, and the Company reserves the right to change this job description and/or assign tasks for the employee to perform, as the Company may deem appropriate."}