{"title":"HVAC Counter Sales NEW!","location":"","salary":"","description":"","term":"$15 to $19 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJRFU85VL1ZL-YkEhl_vb-XNIxmOa_s6QJQU1Ksa51j05OZdphcR0JAl_VgSbmPHsf2TXpck-XeQ3SsI8m_StVcGJKVpJKtqc-7m894wShpB49Ek24htrWQf0PDyewnrX74Q_bkdF4LcYQLR-2EHqsrGZvnvUGyeVBZmZUkAycCUk_SPLS0rWopDIII3Xw","source":"ziprecruiter","full_description":"Austin Staffing, Inc. is now hiring a personable and customer-oriented person for an HVAC Counter Sales position located in South Austin.In this role, you will be responsible for assisting customers both in-person and over the phone for their HVAC supply needs. In addition, the Counter Salesperson is expected to develop an understanding of each customer's needs by guiding them through the warehouse and assuring that all their supplies accounted for and loaded into their vehicle. A sharp and motivated individual who is able to learn quickly and is skilled at customer service/sales would be ideal for the role. This is a long-term position, and our client is seeking people who are very interested in the HVAC field to join their team. An ideal candidate will have HVAC supply knowledge and or experience, but an individual prior parts counter sales of other industries will suffice.Overview of Duties:Provide helpful and friendly customer service both in person and over the phoneDetermine necessary replacement parts through both visual inspection and verbal description of the old partAssist customers with the placement of ordersAddress customer complaints with tact and professionalismRecommend parts or products to customers; answer questions with a demonstration of expertiseBuild and maintain an up-to-date knowledge of HVAC requirements and productsResearch product database to find out stock levels and determine which part is best for the customerProcess customer transactionsGuide customers through the warehouse and assist in picking parts and loading vehiclesAssist in maintaining the cleanliness and neatness of the showroom, and make sure it remains well-stockedAssist with customer training for new product linesRequirements:A HS Diploma or GEDExperience working in the HVAC field or the ability and willingness to learn the profession; experience in counter sales preferred; retail sales experience in hardware or appliance stores would also be applicableComfortable speaking with a diverse demographic of customers both in person and over the phoneAble to display energy and positivity to make the customer experience top notchAble to read and write reports, invoices, and purchase ordersAble to learn and maintain a solid working knowledge of all product linesAble to perform basic mathematical functions and run a Point-of-Sale machine accuratelyExperience with Microsoft Excel and comfortable working with computers and learning new programsAble to lift 50 poundsAn Associate’s or Bachelor’s degree, a technical certification in the HVAC field, and the ability to speak Spanish are all a plus, but not requiredJob Type: Full-timeCall Austin Staffing, Inc today to set up an online interview512-647-8233"}