{"title":"Expert Pool Mechanic NEW!","location":"","salary":"","description":"","term":"$25 to $35 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALQOtYvyL8PWM25qrC8U1w-MSIhtiW6qomy3vFaqY5hFFsi3FGXL3pPMRCQXa89_NYfH-OkpBLicvBDccw-WW6x1AgmcVyQnkxrLKl0wCdDeQlWXDjWM1Nswkppo56ZLxUTXiN9elOZmSgdeCIRibde5KC4Rm_pPvAiegh04waUhesdXwIsGyn7BvKQNeI","source":"ziprecruiter","full_description":"Mechanic Class lJob description1. This position must be able to perform all duties of Valet Service Tech., Open Crew Leader and Class ll and Class lll Mechanic2. Measure all new liner replacements.3. Measure all new winter safety covers.4. Measure all safety fence jobs.5. Measure all new spa covers.6. Make and diagnose any and all repairs to all filter systems including pump, filters, heaters, and ancillary equipment i.e. ozonators, salt generators, chlorinators, all piping, plumbing, valves, manifolds. Diagnose and repair all electronic controls.7. Perform all new pool start up and indoctrinations.8. Assist service manager in all in checking in and giving out work scheduling of service appointments.9. Assist customer service representative by speaking to customers with the technical questions in the office and on the road.10. Be responsible for training of Class ll & Class lll mechanics.Job Description Role and ResponsibilitiesEvaluate, diagnose, and repair pool equipment (including pump, filters, heaters, and ancillary equipment i.e. ozonators, salt generators, chlorinators, all piping, plumbing, valves, manifolds).Install new pool equipment.Evaluate and estimate service for new customers.Evaluate service and quality for current customers.Diagnose and repair all electronics controls.Must be able to take measurements for new liner replacements, new winter safety covers, new spa covers, and safety fences.Perform all new pool start up and indoctrinations.This position must be able to perform all duties of Open/Close Crew Leader.Assist customer service representative by speaking to customers with the technical questions in the office and on the road.Be responsible for training junior mechanics.BENEFITS: 401K, INSURANCE REINBURSMENT OF EMPLOYEE PORTION, SICK TIME/VACATION TIMEMinimum QualificationHigh School diploma or equivalent.Minimum of 5 to10 years of pool construction, service, repair & diagnostics experience.Must have a valid driver’s licenseRequirements and Essentials for PositionAbility to maintain and adjust controls, systems, preventative maintenance and repairs.Must be able to maintain pool, including reading, repair and maintenance.Knowledge of cleaning methods and equipment, along with basic understanding of the upkeep and care of equipment.Understanding of cleaning compounds and chemicals, and their safe, efficient use.Ability to lift 75 lbs. unassisted, multiple times a day.Must be able to frequently reach, stoop, bend and kneel daily.Must be able to withstand extensive walking and standing daily.Usually work 40 hours a week, which could include weekends. During peak season (April to November), you may need to work longer hours.Excellent customer service skills.Proficiency with computersJob Type: Full-time"}