{"title":"Mobile Native Application Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALUKGMoMpTA6geIvAxrW8cNJ3ZBBEd3ExsywJCieeHBAwaTMOjWXB-5fTKa24ZummAhpjsnxvLHUaN5qXutV46zKq_23zXLoFgPS2_0rkliBl4GybY3ndIggrkFyQuwWlapoz1KhBD5ucD5yKqEGstvjJYYXldluCca-GI2au6tPnT31uLhtBpGlcb7AHoY","source":"ziprecruiter","full_description":"As a Mobile Application Developer Intermediate/Senior in our Mobile Native Apps team, you'll support and enhance iOS and Android native applications, developing solutions to complex business problems. With a solid understanding of mobile application patterns like navigation, delegation, dependency injection, object mapping and RESTful services, you'll also develop testing activities and document software development and maintenance. With over 350,000 logins per day, our apps are quickly becoming the platform of choice for our customers!Must-have qualificationsBachelor's degree or higher in an Information Technology discipline or related field of study and two years of related work experience designing, programming, and supporting software programs and applicationsInstead of the above, a high school diploma or GED or higher and: The completion of a technical training program, and two years related work experience, orFour years related work experience designing, programming, and supporting software programs and applicationsPreferred skillsiOS and/or Android native apps development experience with a willingness to learn the other. Having an iOS and/or Android app released in the app store is a plus!Functional Reactive, MVVM patterns, Kotlin, Swift, Java, Object Oriented programming and/or Reactive Programming languages, and Web APIsContinuous Delivery or Agile/Scrum delivery practices highly desiredTechnical troubleshooting, diagnosing and problem-solving skills  Ability to analyze data from various sources and determine next steps   BenefitsGainshare bonus up to 24% of your eligible earnings; Progressive rewards each of us with an annual bonus based on company performance401k with dollar-for-dollar company match up to 6%Diverse, inclusive and welcoming culture with Employee Resource GroupsCareer development and tuition assistance Onsite gym and healthcare at large locations Wellness programs to help you maintain a better quality of life Medical, dental and vision, including free preventive care Equal Opportunity EmployerSponsorship for work authorization for foreign national candidates is not available for this position."}