{"title":"DC Systems Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJX3Knyo8L6jIESHqjA09LGEwwmF1Nz01h-AFYWAX5A4DCyYbzWAvqW-kg5Co4Sr3VQutnZo2J02yj7uaO9SbuB0fkm6y9y1URzgS6FyZ7NjE14bio2m4j51WoG1QWKrJOO0JOGCmI7HF0RnaM5j7qg6p3H4XcqqcV81ATxhJbraIVEWa9-ugumi35mtis","source":"ziprecruiter","full_description":"Keno Kozie has been recognized once again, as the “Best IT Outsourcing Provider in Chicago” by The National Law Journal’s Best of Chicago awards. We are the IT partner of choice for law firms across America who entrust their reputation and business to our experience IT specialistThe Systems and Network Engineer will be responsible for providing a high level of technical support for both maintenance, troubleshooting and participation in network implementations in numerous client environments. The position provides exposure to a wide range of technologies and offers many challenging opportunities to help grow your career.ESSENTIAL DUTIES AND RESPONSIBILITIESProvide on-site and remote support to our client’s ends users and engineers.Dispatch “as-needed” and in recurring on-site assignments at client offices.Assist with network implementations, projects and support.Install, configure and troubleshoot various desktop/server applications and hardware solutions.Assist clients with a wide array of network and application issuesResolve ticket escalationsWindows server administration and Active Directory configurationKNOWLEDGE, SKILLS AND ABILITIESExceptional problem solving and technical troubleshooting skillsStrong Network AdministrationVLANRoutingLAN/WANFirewalls, routers and switches (Cisco, SonicWALL, Meraki, Extreme, Dell, HP)The candidate should have implemented and configured devices and be able to speak to overcoming challengesNetwork DiscoverExperience with installing/supporting Windows Server, Windows, and MS Office, M365Strong Active Directory skillsPrior expertise with a variety of technologies:Microsoft Exchange M365SQL ServerCitrix and/or Microsoft Terminal ServerVirtualization (Azure, VMware, VMware View, Hyper-V)SANExperience with various backup (Datto, Veeam, etc.) and antivirus solutionsDesktop imaging and deployment technologiesDocument Management experience a plus (iManage, NetDocuments, etc.)Excellent verbal and written communication skillsExceptional organizational and time management skillsRelated technical certifications desirableMinimum of 5 years of related work experienceKENO KOZIE IS AN EQUAL OPPORTUNITY EMPLOYERDiversity and inclusion matter to us here at Keno Kozie Associates. We celebrate our differences and advocate an environment where everyone feels included. We’re proud to be an equal opportunity employer – and celebrate our employees’ differences, including race, color, religion, sex, national origin, citizenship, marital status, sexual orientation, gender identity, age, disability, Veteran status or any other protected group status. Our differences make us better, stronger and more successful. Equal employment opportunity extends to all aspects of the employment relationship, including hiring, transfers, promotions, training, terminations, working conditions, compensations, benefits, and other terms and conditions of employment."}