{"title":"Software Technical Support Representative","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJv5IoZotq5YdnX85FnOqHe6wc6mWvqwgc5z_fL5cjTAtqzGx8TavfARbQxk3xD8F6ivyZcE-BLovCHnBO6I4EOlKzy3usU5OMA1QqrrsdRr3QSi3UYNXRi8C0awnGUqCFznYGJ6T3xUgRTkwIUT0iVXJKh0KWF3zPOrzIBqsPqRXZybu6NDZxIrU_GBIW2","source":"ziprecruiter","full_description":"Position PurposeTo provide support to users of Labelmaster Software products and services, provide Manual QA for software, manage software subscriptions and provide in house helpdesk support to Labelmaster Software employees. Essential Functions & Principle AccountabilitiesProvide phone support to external customersProvide email support to external customers Provide chat support to external customers Answer phones as necessary Provide walkthroughs of our softwareTeach regular classes on software useProvide DGIS onboarding services and data entryProduce support content and mediaSupport Manual Testing/Quality AssuranceChange management for support content and mediaManage subscriptions of software customers Set up workstations Assist in VOIP phone configurations Support internal software applicationsAdditional ResponsibilitiesISO compliance program & supportTake responsibility for the safety of self and others at all timesTake responsibility to eliminate accidents, injuries & hazards at all timesObserve and act in accordance with all applicable laws & regulations & company policiesOther duties/projects as assignedKnowledge/Skills/AbilitiesSuperior verbal communication skillsSuperior written communication skillsSuperior command of the English language (written and spoken) skillsSuperior problem solving skillsExcellent math skillsAbility to work with limited supervision Superior organizational skillsAbility to work cooperativelyAbility to think criticallyAbility to act logicallySuperior interpersonal skillsSuperior listening skills Strong analysis skillsStrong judgment skills Ability to conduct research Ability to delegate Professional adaptability Ability to think creatively Project management skillsDecision making skillsAbility to read, interpret and analyze documents Good people skills Training skills Public speaking skills Ability and skill to relate to all types of people at varying levels of organization Ability to define problems, collect data, establish facts and draw valid conclusionsAbility to interpret a variety of data and detailed instructions with multiple variables Ability to manage multiple tasks/projects at the same timeAbility to handle information confidentially Ability to handle pressure and meet deadlinesGrammar and spelling skills Problem solving skillsTime management and organizational skillsProject management skills Ability to set priorities Ability to adapt to changeCustomer service skills Negotiation skillsAbility to create presentations Ability to give presentations Ability to manage unhappy customers Order entry skills Compute using whole numbers and fractions Compute with percents, rates, ratio and proportion Interpret data from graphs and compute averages Use estimation and mental arithmetic Education/Training/ExperienceHigh school diploma, GED or equivalent experienceAdvanced degree in technical fields preferred or equivalent experience 1 year of hiring/interviewing skills preferred1 year of training skills preferred1 year of discipline/separation skills preferred1 year of team building skills preferred1 year of coaching/motivation skills preferred TechnologyMS Office skills preferredGood keyboarding skills preferred Basic SharePoint skills preferredBasis GreatPlains skills preferred Basic ALIS skills preferred Basic SQL skills preferred Strong windows operating system skills preferredGood OSX skills preferredGood CRM software program skills preferred Good Screen Sharing Software skills preferred Personality CharacteristicsDependability Enthusiasm Creativity Attention to detailCustomer centric Discretion InitiativeOutgoing persona Courteousness Pride in work ProfessionalismTactfulnessDiplomacyDeadline orientationFlexibility Integrity Individual responsibility Willingness to demonstrate positive behaviors Responsibility Adaptability Essential Physical DemandsThe physical movements or activities described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.SittingLift and/or moving materials up to 10 lbs.Pushing, pulling and/or carrying up to 10 lbs.Visual acuityReaching with hands and armsTalkingHearingUse hands to finger, handle or feel objects, tools or controlsRepetitive motionsBendingStanding Climbing Kneeling CrouchingPrimary EnvironmentIndoor work environmentAmbient room temperaturesLighting & traditional office equipment as found in a typical office environmentSupervisory ResponsibilitiesNone EEO Employer – Veterans and IWD are strongly encouraged to applyLabelmaster is proud to be an Equal Employment Opportunity Employer and we are committed to the concept and practice of equal opportunity and affirmative action in all aspects of employment. It is our intent to comply with our duty to provide reasonable accommodations for qualified employees and applicants as required by law. All requests for accommodations should be made in writing to Jay Hollins by emailing jhollins@labelmaster.com.Pay Transparency Policy Statement - The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information.Acknowledgements & ConsentAmerican Labelmark Company (ALC) will not consider your application for employment unless you read and sign the following. I acknowledge that any employment offer is:Solely for at-will employment and I understand that this means that either ALC or I may terminate my employment at any time for any or for no reason. This understanding cannot be altered by anyone unless it is in writing and signed by the President of ALC; and Conditional on the satisfactory result of any drug and/or alcohol, medical examinations, other tests, educational requirements, educational verification, criminal and/or credit record check, satisfactory references and/or background check that ALC may require. I agree to sign and execute the following form included with this application packet: Consent to Drug and Alcohol Testing.I affirm that the information I have provided in seeking employment with ALC (including this application form and any accompanying documents such as my resume) is correct and that any false or misleading information, including omissions may result in my not being hired or, if already hired, in my dismissal.I have no obligation to any former employer or to any other person that would prevent me from fully performing my duties to American Labelmark Company(ALC). I am not subject to any outstanding agreement or restrictive covenant inconsistent with the terms of ALC employment. Should I fail to disclose the existence of a third party obligation, whether enforceable or not, for cause.I authorize investigation and verification of the information I provide in this and other documents relating to my application for employment. I authorize, now and in the future, all persons, companies, schools, former employers, credit bureaus and law enforcement agencies to provide ALC with information about me and I release each of the above from any liability for doing so now and in the future. I also authorize ALC, now and in the future, to provide information about me to conduct the investigation and verification process. I understand the public websites may be reviewed to gather information for this application and I release ALC from any liability for doingso.If I am hired, I will completely read and remain familiar with ALC's Employee Handbook and other policies as issued or amended. Please direct any questions to Human Resources at 800-358-6200 x2300Powered by JazzHRhGG2J7Po5M"}