{"title":"Junior Technical Support Specialist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJTq1YC7qTjdt2JjhUVgd_EQzzW1NYUmWgvNKd8EC2I0KYKjsLJenxVN1Iz8IcZvQj_ui5dKKbvq9MQ2RWXLmzTqn5doy2KaE-jwfD5pyu7iOeBulXpTpsz6MZZdjH1y9nALGL2Z1sY2QSSb1qSA3Rh5mpXBAa4bUV8jrLdAj7nAI-joGLnxL4T3tNwduuD","source":"ziprecruiter","full_description":"Overview SnapAV is a leading manufacturer and distributor of audio, video, surveillance, power, and wiring equipment for residential and commercial A/V integrators.  We believe that life's better when everything works together. And the same can be said about the collaborative work we do. Join our award-winning team in our continuous quest to deliver the most brilliant, personalized smart home experiences to people around the world. The Junior Technical Support Specialist will report to the SunBrite Customer Service Supervisor and will be responsible for offering world class customer service to all SunBrite customers.  This role will need to be able to perform calm under pressure while meeting customers' needs, have an eye for details and excellent follow up.  The Junior Technical Support Specialist will partner with various departments to establish point of resolution.   Responsibilities Specific ResponsibilitiesProvide every customer with world class customer serviceRespond to customer inquiries via phone, email and live chatAssist customers with the placement of orders, repairs, returns and exchangesListen attentively to customer needs and concernsCommunicate and collaborate with internal departments Qualifications Required QualificationsHigh School diploma or equivalent1+ Year Customer ServiceMust be able to work the hours of 11am-8pm Preferred QualificationsBachelor's DegreeExperience using Microsoft Office ProductsExperience using SAPExperience using SAGEPrevious call center experienceExperience installing technical products (AV, Surveillance, and/or Networking products)  #LI-LK1"}