{"title":"Technical Support Associate NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKE5PJHd6BSrp7GOBSf0KMUmE2Eq7UIBC-xpiolxhCmsBCoqGwbNgsw7fnPmwLFQnUTFN6tKaB0FprHyCxR3Uoy34u9urrCtJ2n4_UCn7VDIhMbb-ODxSXo4fNDb1vLZZRcYDYFH-edeHn13JtkeSKCWnhOfybqYw5UBbbyG8Rmi5goT3_bJzC8EjQx3v4","source":"ziprecruiter","full_description":"Technical Support AssociateAmazing opportunity for a Technical Support Associate to work for an established, leading global company!What You’ll Get:The Technical Support Associate will work in a dynamic culture and receive a competitive compensation. The Technical Support Associate will work in a supportive team environment with a company of 60 years of global experience.What We Want:You will be preferred if you have an Associate Degree and 3-5 years Help Desk experience. As the Technical Support Associate, you have an analytical mind, are a problem solver, and have superb communication skills. In addition, you are well organized, have superb time management skills and is customer focused! For an extra leg up, you have proven experience using Radiant and VeriFone.What You’ll Do:As the Technical Support Associate, you will receive and resolve problem tickets from tier 1 technicians. Additionally, you will perform root-cause analysis and provide trouble updates. The Technical Support Associate will provide timely technical support to onsite technicians as requested. In addition, the Technical Support Associate will provide customer support and document trouble issues. Who We Are:Innovative Talent Solutions is an established firm with over 20 years of combined experience in the staffing industry. ITS is a firm companies, candidates and employees trust. Job seekers depend on ITS to start and finish their job search because we make it priority to get to know our candidates, bringing out the best in them and finding the ideal position for their skills and expertise.\"The dedicated staff at Innovative Talent Solutions is determined to place candidates in a position where they can excel and make an impact in the workplace. They act as a mentor during the interview and hiring process. Once ITS places you in a position, they continue to monitor your progress with weekly check-ins. I am employed at an outstanding company thanks to ITS.\"- Amanda W.Apply Today!!Innovative Talent Solutions (ITS) is an Equal Employment Opportunity (EEO) employer and prohibits employment discrimination for employees and applicants based on, but not limited to, age, race, color, sex (including pregnancy, gender identity, and sexual orientation), national origin, religion, disability, or protected veteran status."}