{"title":"Innovation Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJAM1ieFhHe-brcYhc3_xvv7ZQu0wzmZnAUQYAWMUKm_s2PMiGc_oxkKwyLyIlwpIREsJz_8RhjW04cr4JWihlEYfd1YVusbPdkULoZThTZnGmzjUD_MD9IP9c9qyvll15SveOQrO2sxm0G5Dj16d41DBu4fe7Djggs2Eo50trZW0gOBzx4BKlvv_dSIGdd","source":"ziprecruiter","full_description":"Sealed Air is in business to protect, to solve critical packaging challenges and to leave our world better than we found it. Our portfolio of leading packaging solutions includes CRYOVAC brand food packaging, SEALED AIR brand protective packaging and BUBBLE WRAP brand packaging, which collectively enable a safer, more efficient food supply chain and protect valuable goods shipped around the world. Sealed Air generated $4.8 billion in sales in 2019 and has approximately 16,500 employees who serve customers in 124 countries. To learn more, visitwww.sealedair.com. Summary We are expanding our innovation group within our supply chain organization and were looking for our thought leaders of tomorrow. This person will be leveraging their Mechanical or Electrical knowledge, Engineering Design skills and Project Management experience to drive our Manufacturing Capabilities to the next level. You will own both large and small projects from conception through implementation. This is a great opportunity to continue expanding your technical skills and experience, while making a significant and lasting impact on our global operations Responsibilities As an Innovation engineer, you will be responsible for the conception, design, fabrication, and commissioning of production and process equipment. Your skills and talents will be stretched as you help drive step change improvements of our production equipment. As a global company with multiple international location, you will have the opportunity to engage with new cultures and a diverse array of colleagues. Primary responsibilities include the following: Creative problem solving using cutting edge technologies to reinvent our existing production processes that will maintain our position as the Market Leader in the Packaging Industry. Leverage your knowledge of mechanical systems and industrial controls to develop high throughput, high quality, and efficient production equipment.  Work independently or with a cross functional team to develop your project scope, budget, and timelines to execute projects which delight internal customers and exceed expectations.  Must be able to collaborate with multi-discipline teams consisting of Engineering, R&D, EH&S, Operations, and Marketing, as well as external suppliers to ensure solutions are cost effective and deliver step change in our processes. Effectively communicate and coordinate at all levels of the organization including shop floor to the executive suite. Apply strong technical skills to all facets of the project including solution development, equipment specification, design, installation and equipment commissioning. Identify / evaluate latest technologies that can be incorporated into our processes to improve yield, increase throughput, and/or reduce cost. Ability to rapidly pivot to address shifts in markets, technology, or other external factors which develop during course of your project. Proactively develop contingency plans to mitigate any surprises or challenges as they arise.  Qualifications  Bachelor of Science from an ABET accredited Engineering program. Mechanical, Electrical or Chemical engineering strongly preferred Demonstrated ability to effectively apply technical and project management skills to successfully execute projects. Experience with motion control applications with robotics being a plus. Candidate engineers should have a strong working knowledge of the integration and programming of HMIs, PLCs, Servo Drives, VFDs, Industrial Networks, and Temperature Control Systems. Rockwell or Siemens hardware and software experience is a plus. Candidate engineers should also have strong 3D design skills and experience with computer aided engineering tools such as SolidWorks, Matlab, FEA / CFD Simulation, etc.  Ability to work effectively in a fast-paced and rapidly changing environment, take initiative and drive for results to exceed customer expectations. Must have strong written and oral communication skills, a collaborative work style and ability to effectively work with an interdisciplinary team Must be willing to occasionally travel internationally.Requisition id:31719Relocation:YesAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability or protected veteran status.LINK1 MON1"}