{"title":"Registered Nurse | RN | CORR (Contract)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI94S8bNsv5BiJGcKgOsJVfnNT0WqB-mabE20rMnltWWwo4jAj5lfHoAuoDSNlfzd0qloegYjTtNvWLuCaxSumViQ5M2JqFnLkVZiW6c41SKMDb9qRUihHobrCW8UIFclblkcPAqD7ZJLq5qbiqPpXb3mysmMFPenHyplFj8F35O_YuQNE7pBCXzz2XVIA","source":"ziprecruiter","full_description":"At Favorite Healthcare Staffing, we aspire to learn what thrills you about being a travel nurse. Our exceptional recruiters thrive on the challenge of discovering the perfect position for you. From day one, your dedicated recruiter has your back as you search for your next adventure. Apply today to join the Favorite Family!Favorite Healthcare Staffing is looking for an experienced Corrections Registered Nurse (RN) for a travel contract in Charlotte, NC! This assignment is for 8 weeks and ideal candidates will have at least one year of recent experience as a Registered Nurse.Corrections Registered Nurse (RN) Position Details:ʥ Contract Length: 8 Weeksʥ Location: Charlotte, NCʥ Facility Type: Correctional Facilityʥ Shift & Schedule: Full-Time, 12 Hour NightsPay Details:ʥ Hourly Pay Range (Local Contract): $43 - $47 per HourCorrections Registered Nurse (RN) Requirements:ʥ Must have 1 year of recent Registered Nurse experience in the last 18 monthsʥ Active North Carolina Registered Nurse License requiredʥ Current BLS Certification requiredPerks of Traveling with Favorite:ʥ Live Recruiters, Customer Service, & Tech Support 24/7/365ʥ Schedule Shifts & Submit Timecards on Favorite Mobile Appʥ Referral Bonus Program, First Day Health Insurance, 401(k) Retirement Plans & Matchʥ License & Continuing Education ReimbursementTravel nursing with Favorite Healthcare Staffing gives you the opportunity to advance your career, develop new skills, and experience new things, all while exploring the country. Call 800-755-1411 to speak to your Favorite Recruiter today! One year current experience in the area of practice within the past two years, current license and appropriate specialty certifications and credentials, and references."}