{"title":"Organon -Sr. Spclst, Eng., Senior Network LAN/WAN Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJPTrXCBrPLibebaY-ZXXzXLhdeFXUem2tzXS9owpkVxew3aVyJi-4_gZgC1LL4RPSXv3-Q5luBXRtfr2bcXcdIoKkmUo9KWzQm1i6QzaCThsxkx45d6s8L3k4npj3uCp7gseZa7zNZ_mMFuhV29QfkJE_Snd427nd52gOJUxt_7DT9AdJzKqLbkofNa98","source":"ziprecruiter","full_description":"Job DescriptionOur IT team operates as a business partner proposing ideas and innovative solutions that enable new organizational capabilities. We collaborate internationally to deliver the services and solutions that help everyone to be more productive and enable innovation.As a member of the team in Business Technology Operations, the successful candidate will be responsible for the Architecture, design, planning, management and operation of Organon's Network services. These services allow Organon to communicate globally and collaborate worldwide with partners and customers. This role requires a highly skilled individual with subject matter expertise in Routing and Switching Technologies Primarily in IP based communications protocols.The role involves detailed design/test/operate of new network solutions and planning the deployment and integration with security infrastructure and change management plans to deliver new features to our clients. The candidate must interface globally and have deep experience in the development, planning, deployment and support of network solutions.The individual will need to demonstrate Organon leadership qualities, strong communication skills, financial prudence and proactive delivery of network infrastructure and services.Primary job responsibilities include: Support and Engineer Organon's Network solutions with a focus on routing/switching/SDN in the on prem solutions. + Design and lead Planning and deployment for Network project solutions. + Develop Change management plans to effectively communicate new capability to clients. + Plan and Support of add on capabilities for Network solutions to support the IoT and Software Defined solutions as required by business (ACI, SD-WAN, etc.). + Develop Integration strategies and Architect solutions to integrate with external security/logging tools as well as Automation tools (Splunk, MoogSoft, Ansible Tower) + Operate (Tier3) all infrastructure technologies with focus on Business Continuity, Resiliency and Scalability of all the infrastructure. + Engage and collaborate with business partners to interpret business requirements and deliver solutions in coordination with network and security architects.We are seeking professionals with the following qualifications, skills and experience:Education Minimum Requirement: MSc Degree or BSc Degree or equivalent with relevant experience in Computer Science, Computer Science Engineering, or equivalent experience.Required Experience and Skills: 6+ years functional and technical experience in Routing/Switching environment on prem including WAN + Fluent in English, in both verbal and written communication. + Possesses expert knowledge of Cisco Routing/Switching/SDN technology, cloud network services (LB, service GW), F5 technology + 1+ year experience in Network Automation and scripting (Python, Bash, Ansible) + Experience with advanced routing designs (SDN - E/VPN, ACI) + Ability to provide support for Enterprise level environment with deep knowledge of IP based protocols troubleshooting. + Ability to acquire new skills in a diverse environment.Desired Experience and Skills: Working Knowledge of automation API/tools or management GUI (ACI, Postman, Ansible Tower). + Knowledge of Splunk, good scripting knowledge welcomed. + Routing protocols (BGP/OSPF preferred), strong experience of design principles for routing environment with focus on operational stability and flexibility + SD-WAN experienceOur Support Functions deliver services and makes recommendations about ways to enhance our workplace and the experience of working at our organization. Our Support Functions include HR, Finance, Information Technology, Legal, Procurement, Administration, Facilities and Security.\\#NewCoNOTICE FOR INTERNAL APPLICANTSIn accordance with Managers' Policy - Job Posting and Employee Placement, all employees subject to this policy are required to have a minimum of twelve (12) months of service in current position prior to applying for open positions.If you have been offered a separation benefits package, but have not yet reached your separation date and are offered a position within the salary and geographical parameters as set forth in the Summary Plan Description (SPD) of your separation package, then you are no longer eligible for your separation benefits package. To discuss in more detail, please contact your HRBP or Talent Acquisition Advisor.US and Puerto Rico Residents Only:If you need an accommodation for the application process please email us at staffingaadar@msd.com For more information about personal rights under Equal Employment Opportunity, visit:EEOC Poster (https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/eeopost.pdf)EEOC GINA SupplementOFCCP EEO Supplement (https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP\\EEO\\Supplement\\Final\\JRF\\QA\\508c.pdf)OFCCP Pay Transparency RuleWe are an equal opportunity employer, Minority/Female/Disability/Veteran - proudly embracing diversity in all of its manifestations.Search Firm Representatives Please Read Carefully Merck & Co., Inc., Kenilworth, NJ, USA, also known as Merck Sharp & Dohme Corp., Kenilworth, NJ, USA, does not accept unsolicited assistance from search firms for employment opportunities. All CVs / resumes submitted by search firms to any employee at our company without a valid written search agreement in place for this position will be deemed the sole property of our company. No fee will be paid in the event a candidate is hired by our company as a result of an agency referral where no pre-existing agreement is in place. Where agency agreements are in place, introductions are position specific. Please, no phone calls or emails.Employee Status:RegularRelocation:No relocationVISA Sponsorship:NoTravel Requirements:10%Flexible Work Arrangements:Remote Work, TelecommutingShift:1st - DayValid Driving License:Hazardous Material(s):Number of Openings:1Requisition ID: R89614"}