{"title":"Contract- Network Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIemAxHqOUB6KJ2Kol7yIc7Swwb2RSHxipL9vFXjSrSUHSHMZBZD6fXxqd-fz0AgBWrn1uIt4Ykdb33e17RaJWmUlXzC0d03IB90hvdJx3jnw5NCUBgaVvq_TbRp4wEFJ80Z7-9T3oervBZza17VqqeNOXoUKYPsmACuqXWW-YzY2g4IUwoTGSk5ukbKbQ","source":"ziprecruiter","full_description":"As part of a small and highly-skilled team, you'll provide corporate network engineering to our engineers and staff, co-manage critical information technology infrastructure, and support a company building space vehicles. You must have a passion for solving complex and interesting problems, and be adaptable as you'll work on a variety of systems. The Network Engineer is a member of the information technology department and reports directly to the Manager, IT Network. This position will directly impact the history of space exploration and will require your dedicated commitment and detailed attention towards safe and repeatable spaceflight. + Produce and manage highly reliable, multi-segment Ethernet networks that span multiple sites, possibly across the globe+ In-depth understanding of network Layer 1/2/3 protocols and applications, such as multicast/unicast, PIM, Precision Timing Protocol (PTP), VLAN tagging, network traffic QoS, OSPF, Timing Sensitive/Triggered Ethernet, etc.+ Establish network specifications and requirements by conferring with customers and working with the capacity planning working group+ Perform Verification of requirements and specifications against selected network hardware through bench testing and hardware in the loop labs+ Research the application of technologies and develop integration analysis and present to various pathfinding stakeholders+ Develop and maintain configuration control of all corporate and mission networks+ Maintain inventory of all network devices on all corporate and mission networks+ Develop and maintain all documentation for all corporate and mission networks+ Perform trade studies to develop or procure cost-effective network verification/test infrastructure, such as data capturing and analysis tools, network traffic simulators, performance measurement tools, etc.+ Secure all mission networks by deploying and maintaining firewalls at interconnects to the corporate networks+ Develop and maintain the tunneling of vehicle telemetry from various ground stations and mission networks+ Familiarity with Cisco, Juniper and Extreme network devices + Travel as needed to support launch operations, maintenance, or new network deployments+ Minimum of a bachelor's degree in information technology, networking or equivalent+ 5+ years of experience as a practicing network administrator or network engineer+ CCNP or CCIE certification+ Excellent written, verbal, and interpersonal communication skills+ Ability to work independently and as part of a team of highly skilled software engineers and IT systems administrators+ Must be a U.S. citizen or permanent resident (current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum + Familiarity with time-critical Ethernet applications and technologies, such as Precision Time Protocol 1588v2, or Time Sensitive Networks External Company Name: Blue Origin External Company URL: www.blueorigin.com SystemID: 3653 Street: 21218 76th Ave S"}