{"title":"Board Certified Behavior Analyst (BCBA) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKF8oJipQ59HTcsIi97zts_r7CIStfkFub-fSXagFzq6AM_TiOaBCDO_XQt7HA4apWw5pYgtg0kIZzq5i752L9zkMfyPO7lSvtyBjUaAGn7zYnpP19xvkjFjkmoqAXulK7Bf0mHZ2SYRNy30LBXzzMQDJTjtl7zO69Ml4XnWAixwdEx_dycwFpL7d82V0hw","source":"ziprecruiter","full_description":"Come join our AMAZING team! The Stepping Stones Group is seeking for a talented and motivated BCBA for a Supervisor position in our Austin, TX office who is interested in helping us to grow and carry out our mission of service to individuals with autism spectrum disorders and their families. The Stepping Stones Group is a leading behavioral health agency delivering ABA services. Our unique service delivery model, well-established procedures, infrastructure, and investment in state-of-the-art technology allow our staff to focus on creating meaningful outcomes for the individuals and families we serve. We are deeply committed to the professional development and advancement of our staff, in addition to helping them achieve a balance between their professional and personal lives. What sets us apart in the field, is the expertise that we have in the most current naturalistic ABA practices, with doctoral researchers and clinicians who bring the integration of Pivotal Response Treatment into our programs. We use an eclectic approach and have the expertise to draw from a variety of ABA methodologies to develop individualized behavioral programs, from early intervention to focused behavior reduction programs to meet the needs of the clients we serve. As a BCBA Supervisor you will: Conduct functional behavior assessments Provide direct intervention across home, school, and community settings Conduct parent/caregiver education Develop ABA programs for children and adolescents with autism spectrum disorders Utilize evidence based Naturalistic Developmental Behavioral Interventions Collect behavioral data and completing progress notes Organize and summarize behavioral data and write progress reports Case management and coordination Provide clinical direction, training, and support to The Stepping Stones Group behavioral technicians Conduct behavioral consultation in school and group home settings Opportunities to provide Supervised Professional Experience to The Stepping Stones Group staff pursuing BCBA and RBT certification through group and individual supervision Job Qualifications: Possess a BCBA Strong interpersonal and leadership skills Commitment to the field of Behavior Analysis and Autism Spectrum Disorders Prior experience supervising ABA programs for individuals with ASD Valid TX driver's license and reliable transportation Pass an FBI/ DOJ background check This position requires you to be onsite, whether in the office, in-home or school setting. We understand the concerns revolving COVID-19 and we are taking every precaution necessary to provide you with a safe and healthy environment. The Stepping Stones Group provides staff with Personal Protective Equipment and follows rigorous safety precautions per CDC guidelines.The Stepping Stones Group places an emphasis on promoting a positive culture and staff morale in ways such as maintaining a social budget for employees to get together and socialize at events outside of work hours, and by providing various staff incentives such as bonuses for staff at all levels of the agency. Benefits: Highly competitive compensation Reasonably sized caseloads Part time hourly and full-time salaried positions available CEU stipend and paid time off to maintain certification Accrued Sick & Vacation pay 401 K plan Mileage and drive time reimbursements Cell phone and iPad issued Advancement opportunities Competitive compensation based on experience and credentials Signing and/or Relocation Bonuses offered Quarterly Bonuses offered to Supervisors Comprehensive Benefits: Including Medical, Vision and Dental, and Life Insurance Cell Phone and iPad Provided"}