{"title":"Senior Formulation Chemist","location":"","salary":"","description":"","term":"$85,000 to $100,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKdshWxQ1n6rzQC0X90VEq1WKdW5qfJg-OfNsIpFYkj4jG8yj5BuHBXZ5TkxD_skIAx65q49QB3FPsP0bTcuOo-rJwkhffFA_FlzVooQhDwuQ8SnLY77NNyry9UkuX7KtN7oPzKksbpN5nSbYCk0cyZfq6c4RxyAwRiH1AVHSEDSMohbE8QSLEODryXxf1J","source":"ziprecruiter","full_description":"Hernon Manufacturing Inc. is a leader in the manufacture of adhesives, sealants and the related processing equipment. Hernon offers a full range of products such as anaerobic, cyanoacrylate, epoxies, methacrylate’s, impregnation resins, UV curable, environmentally friendly primers and activators; used in the aerospace, automotive, electronic, electrical, speaker and munitions industries to name a few.We currently have an opening for a `Senior Formulating Chemist' at our Sanford, Florida headquarters. This position is responsible for technical support to assist the company in attaining sales and financial goals. This includes the development of new cost effective products conforming to market needs; cost reduction, raw material rationalization and performance improvement of existing products; providing technical support when sourcing from outside vendors; assisting Manufacturing and QA in the production of products; and technical support to Technical Department, Marketing and Sales. In performing the responsibilities, the incumbent must operate to ensure the safety of the company's employees and customers and preservation of the environment.Authority:1. Setting up new and changing existing formulations, work orders and raw material specification sheets2. Submits new and requests changes in Standard Test Methods and Standard Operating Procedures3. Recommending new, offset and alternate raw materialsResponsibilities Include:1. Development and/or introduction and implementation of new products as prioritized by management.2. Implementation of cost savings and justification (e.g. formulation, raw materials and processes).3. Provide product maintenance and support to Manufacturing and QA in order to meet order- filling requirements.4. Work with Manufacturing Technology to improve the first pass rate of manufactured products.Duties:I. Develop new formulations and adapt existing ones for new product launches.2. Change existing formulations to improve product cost.3. Assist the Technical Department in managing product performance and compliance inquiries.4. Support Manufacturing and QA.5. Performing special projects as assigned.Performance Measurements:1. Meeting agreed timeline for projects.2. Drive cost savings to meet company savings goals.Minimum Requirements:· PhD in chemistry· Minimum 10 years technical experience in chemical manufacturing and formulating adhesives/sealants· Excellent communication of technical topics to different groups like Sales, Marketing and Manufacturing· Flexibility to work on multiple projects simultaneously and independently with minimal direction· Team player· Good analytical and problem-solving skills· Experience with relevant raw materials"}