{"title":"IOS Dotnet mobile developer","location":"","salary":"","description":"","term":"$65 to $70 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAKy3BomL_kQ0oFz-pwuKWAYGSSUP1drbKptdgWtnUAUYvfZJ-r-lBaEp9FaukebXpTIBSZQdZ6nDpOsRs8I_WwbPFfK8Oq0Ly6ZGNOXXAqs3-BCxOf4lafRGrHmRXm4yROT6eFnV_hbbPnni17WXaaM4YvN_jtCn8y145ab-PEmFocvjaNKVJg1q3SnMbYf","source":"ziprecruiter","full_description":"Mandatory Requirements 4 year college degree or equivalent technical study.  5 years' Advanced Microsoft SQL (Structured Query Language)  5 years' ASP.NET MVC, C#  1 plus year Mobile Development Requirement Description: The candidate will be supporting The Ohio Department of Commerce's Liquor Permitting  Modernization project. The ideal candidate will provide system architect and design  expertise for multiple ASP.NET initiatives.  This position will function as a highly skilled TS4 with specific responsibilities that include  • Proven work experience as a Mobile developer  • Demonstrable portfolio of released applications on the IOS app store or the Android market  • In-depth knowledge of .net Core  • Experience with third-party libraries and APIs  • Familiarity with OOP design principles  • Excellent analytical skills with a good problem-solving attitude  • Ability to perform in a team environment Experience • Supporting the entire application lifecycle (concept, design, test, release and support)  • Producing fully functional mobile applications writing clean code  • Gathering specific requirements and suggest solutions  • Writing unit and UI tests to identify malfunctions  • Troubleshooting and debugging to optimize performance  • Designing interfaces to improve user experience  • Liaise with Product development team to plan new features  • Ensuring new and legacy applications meet quality standards  • Researching and suggesting new mobile products, applications and protocols  • Staying up-to-date with new technology trends Desired Skills 1 year Azure experience  5 years System Architect experience  5 years Telerik Controls  1 year .Net Core"}