{"title":"Senior Software Engineer, Accounts NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALtuadQBIceyQcs-B39rde1FooFWGoynk-unwEaVHm3XQBNiQu9CMzKU40MzwWABfmr8OXlt3zQdKiJHg1HGjEAmGeUsFqMhu0jNrpRVSsOlYhdTckN7MXtX5ECC0wXduEFQN9pAgaPUXFc4ajBik5IUJVLEN8YlCrgJmHvq5qCQYiukSaIqFFoGZdSy2M","source":"ziprecruiter","full_description":"The candidate will work on the cutting edge of open financial protocols and build systems and tools that enable scalable, high performance trading. All our teams have high standards and a dedication to delivering high quality, high value solutions that meet the needs of millions of global customers. As a Senior Software Engineer on the Accounts Team, you will work closely with Security, Trust & Safety, and other engineering teams to mitigate account risk and ensure our customers can access and manage their accounts in a secure manner. The “A Team” is also frequently called upon to build new product features beyond the scope of customer accounts. This is a full stack application engineering role, meaning you will do everything from designing database schemas to building backend microservices to implementing frontend designs. What you’ll work on: Build secure, reliable, and scalable features for a 24x7x365 cryptocurrency exchange Help design and build our next generation automated risk decision engine Enhance and maintain various Java microservices, lambdas, and code pipelines Collaborate with engineering teams and stakeholders across the organization Provide coaching and mentorship for co-ops and other team members Work with product managers to gather business requirements and deliver solutions Be empowered to drive new initiatives and make a real impact What you’ll bring to the team: 5+ years of full-stack application engineering Strong Java development using DropWizard, Spring, or similar framework Solid SQL and relational database knowledge (MySQL, Postgres, Presto) Experience with backend scripting languages (PHP, Python, Node.js) Familiarity with front-end frameworks (JavaScript, Vue.js) Exposure to AWS (CloudFormation, Lambda, CodePipeline, ECS, S3, SQS, SNS) Git, Linux, and Docker in your toolbox Electrical tape over your webcam (security conscious) A track record of writing good, clean code that adheres to SOLID principles Proficiency with at least one unit testing framework Plenty of experience digging through Splunk logs and tracking down bugs No ego and a strong desire to both teach and learn Ability to understand complex concepts and explain them in simple terms Comfort shifting gears and working on an evolving product without having all the answers"}