{"title":"C#.NET Developer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJhLLkzzTy7NB5G6ffBZ2THeS2q-dRlKc_Wv0YMS6S5qGHN6F5RDiPSFm-NnpUdW0zhmBmOtryC53wXROg9qQDXoa9PNmB8Fqd-6bM7z4XmcTt7Qd8FntSifAtIuyFZdr2l0bpDQea4SOpM17WEI3Liaw04zcgUNEwTROYB3rk6FGWirKSlVXEXqkHUyilc","source":"ziprecruiter","full_description":".Net Developer Location: Local to CO Duration: 12-months ++ Description:Responsible for developing, testing, implementing, and maintaining web-based application systems. Troubleshoots system problems and issues and looks for ways to improve the application.Qualifications:Minimum 3-5 years IT, training, and/ or work experienceMinimum 3 years experience with .Net DevelopmentHands on experience with API'sBusiness process education, training, and/or work experienceAnalytical skillsBachelor's Degree required or equivalent hands on IT experienceTelecommunications background is desiredJob Description:Designs, develops, codes, tests, modifies, debugs, and documents software solutions that satisfy the requirements of one or more user areas.Provides hands-on new development as well as support, maintenance, or enhancement of existing applications in programming languages such as ASP.Net Core, C#, TypeScript, Angular, Web Forms, and AJAX.Designs, maintains, and performance-tunes extraction, transformation, and load (ETL) processes using SSIS and C# Scripting for source-to-target data mappings.Develops complex database solutions for SQL Server, including creating tables, stored procedures, custom user-defined functions, triggers, and indexes.Elaborates with stakeholders and helps define requirements and solutions to meet the requirements.Developments requirements, assessment of LOEs (Level of Effort), and communication of priorities and execution progress for complex solutions.Monitors KPI (Key Performance Indicators) Trends and supports areas needing improvement.Corrects, or work with business unit to correct, data quality errors and provided guidance or solutions for corrective action.Utilize and monitor technical best practices for data movement, data quality, data cleansing, and other related activities on complex solutions.Leads and drives communication with users and management.Creates and maintains documentation related to the technical process and stakeholder usage of presentation layers.Trains stakeholders on complex solutions."}