{"title":"Full Stack SW Engineer","location":"","salary":"","description":"","term":"$91,787 to $122,383 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKUaRjgt8V5EaYuJjV9ndR6AR43xIJphrApYR9YcjCWEvPsoRh6zTFTBvMKdR604tP_fcFmNfHwCQxhg7_AmzZSDCLiPmGHDhSK05_SXtkEW1n722D7CCnoZufSxFtpS87O2CyB-FtOjxRHb6_IyESG4tyhyAHMKjnb4i34nIrn9-lADgJmHzjjZKIn_NY","source":"ziprecruiter","full_description":"We are currently seeking a Software Engineer III. The Software Engineer III position is responsible for the design, development and support of new software applications for ModivCare. The Software Engineer III takes an assigned project and works with business owners and IT support staff to create and implement the software product. They are responsible for documenting that design in functional and design specifications to ensure the product handles the users' needs. Once the design is complete, they code the software components to complete the project. They must show an expert level knowledge of the application development tools being used by the company to develop new software including programming languages, scripting languages, business process tool sets, data modeling and reporting tools.After Completing the initial software development, the Software Engineer III must effectively unit test their work and then partner with the Quality Assurance group to test and fix bugs in the software. They must work with the IT Network group and end users to install the software and must follow up with end users to ensure the application is working properly.A Software Engineer III must work well with others and be responsive to the business needs. They are required to be subject matter experts for a variety of products maintained by the software development group. The Software Engineer III is a group leader, self-sufficient, and is expected to resolve issues, propose solutions, assist the software development manager in project oversight, and mentor junior engineers.Develop and maintain business applications in client-server or web-based environments.The Software Engineer III will code new software and will perform unit and functional testing of the code.Leads design meetings and work with software architects to develop overall design of new system modules, and data layouts.Writes functional and design documentation, user requirements, unit test plans, and user documentation.Must have experience with data models and class diagrams.Codes new software and performs unit and functional testing of the code.Subject matter expert for the IT department's source control system, application lifecycle management toolset, and the release management process.Works with the software development manager to set coding, review, and design policy.The software engineer will be required to Mentor and coach junior engineers.Researches and evaluates methods and techniques for solving problems.The Software Engineer III may be asked to perform periodic technology overview and training sessions.Work within an agile methodology and perform the role of scrum master.Assist the technical services team to resolve customer problems.Present product demonstrations to IT management, and product stakeholders.EducationThe position requires a Bachelor's degree in Computer Science, MIS, or related technical discipline.Skills & Experience7 - 10 years of industry experience.The successful candidate will demonstrate an expert level knowledge of an enterprise relational database system, such as MS SQL Server, Oracle, or DB2.The position requires an expert level knowledge of an object oriented programming language in either C# or Java.Proven experience in the implementation and design of Service Oriented Architectures, utilizing a SOAP protocol, and a Rest-based API.Experience working with a modern source control system and a solid understanding of branching concepts.Demonstrate an understanding of release management concepts, such as continuous integration and continuous deployment.Follows a test driven development process, and has mastery of unit test, and mocking frameworks.Has a solid understanding of user interface design including HTML, JavaScript, JavaScript Frameworks, and CSS.The candidate must possess effective communication skills, both oral and written.Self-starter and detail oriented individual.Angular JSKnowledge of EDI interfaces and HIPAA compliant transaction setsJava programming experienceRed Hat BRMSPrevious employment in the healthcare or insurance industryTravel not requiredWe value our team members and realize the importance of benefits for you and your family.ModivCare offers a comprehensive benefits package to include the following:Medical, Dental, and Vision insuranceEmployer Paid Basic Life Insurance and AD&DVoluntary Life Insurance (Employee/Spouse/Child)Health Care and Dependent Care Flexible Spending AccountsPre-Tax and Post --Tax Commuter and Parking Benefits401(k) Retirement Savings Plan with Company MatchPaid Time OffPaid Parental LeaveShort-Term and Long-Term DisabilityTuition ReimbursementEmployee Discounts (retail, hotel, food, restaurants, car rental and much more!!)Salary: $91,787 - 122,383 annuallyModivCare is an Equal Opportunity Employer.Salary: $91,787 - 122,383 annually"}