{"title":"Senior/Lead iOS Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIZUYnf7A5aKwVI9wLzLJgR8D5xwygnW9P7ic6kFQis1AU6AfI28ZiHalilrQ2k4R40P0RtVCsUd6niOWNL5GW4RZezvHvJk-PTaiwFwM8HG4lmrDRF-rETdYOYnUGZmPvod4p1NWSIhljdNXgfoBGICFZqYILswiqQYs4615T5Aw-Wo5IjEj_46pa-NyPf","source":"ziprecruiter","full_description":"Senior/Lead iOS DeveloperSan Diego,California,United StatesHardware+ Knowledge of Apple's development platforms & frameworks (UIKit, Cocoa Touch, Cocoa, CoreFoundation) + Experience developing and deploying high quality applications for iOS/watchOS on the App Store. + Thorough understanding of scalability, reliability, power and performance on iOS + Fluency with essential tools (Xcode, Instruments) + Extensive knowledge of object-oriented programming, multi-threading, and MVC + Experience working with RESTful APIs and full-stack solution. + Excellent problem solving and debugging skills + A drive to learn and master new technologies and techniques + Strong understanding of data structures & algorithms + Strong written and verbal communication skills + 3-5+ years of experience in Objective-C / Cocoa / Swift / C+ **Description**As a member of the team you will have the opportunity to support several health related efforts at Apple. You will develop iOS/watchOS applications for a variety of purposes including research studies that fuel our future health roadmap. These Applications operate across several modules on iOS/watchOS and you will collaborate on projects across multiple teams at Apple. This position requires a self-motivated engineer with strong technical and interpersonal skills.**Education & Experience**BS/MS in CS/CE (or equivalent)**Additional Requirements**+ - Experience with other mobile platforms will be a strong plus + - Experience with cloud platforms is a plus + - Interest and background in Health and Wellness topics is a plus**Apple Footer**Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant (Opens in a new window) .Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. United States Department of Labor. Learn more (Opens in a new window) .Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law. If you're applying for a position in San Francisco, review the San Francisco Fair Chance Ordinance guidelines (opens in a new window) applicable in your area.Apple participates in the E-Verify program in certain locations as required by law. Learn more about the E-Verify program (Opens in a new window) .Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace. Reasonable Accommodation and Drug Free Workplace policy Learn more (Opens in a new window) ."}