{"title":"Back-End Software Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIRYucRmc86-i7srUEXNa5DyA_VvcR-Q-s63Q42fC4XODBXXu7I3KIQrexZdE4MZ7bejt2Bxejfv-si4cnyQ9l2j2r2gOypv_VFqoboZWnhYJZaiRC4ZQkZcw7N1wCfNOhSWcAcq2gu6JUn8VvjnCmsUGVfYETSRvqoyzzJSlhSEFqLE0Clgguf0eXHfuc","source":"ziprecruiter","full_description":"The CompanyLocated in downtown Kirkland, Net-Inspect is an established software company that provides web-based quality improvement software for the aerospace and medical industries. Our customers range from small manufacturers to large Original Equipment Manufacturers (OEMs) like Boeing, Pratt & Whitney, Honeywell, and Bombardier. We are currently looking for an experienced Back-end Software Developer to help us grow our business.Net-Inspect is different from most companies. While we are perceived as a large company by our customers, we have worked hard to maintain a small, but agile company internal feel. This enables all employees to get broad exposure to the ins-and-outs of a small business and work side-by-side with our CIO and Executive Team. Our people are fun, passionate, self-motivated, and innovative change agents. Net-Inspect believes our people and company culture are critical to growing our business over the long term, so we invest in growing, developing, and retaining our talent.The OpportunityAs a Back-end Software Developer, you will have the chance to learn, grow, try something new and take risks. Even the most experienced developers in this position will have the opportunity to expand and improve their skill set in many advanced areas of knowledge.The TalentNet-Inspect is seeking a candidate with a minimum of 4 years of experience in the following areas:· ASP.NET (.NET 4.0+)o MVCo Web API· C# and VB.NETo OOPo Dependency Injection· Web Service Developmento Developing REST APIs using Web API· MSSQL Server 2012+o T-SQLo Performance Tuning· HTML / CSS / JavaScriptBonus points if you have knowledge in the following areas:· Product Definition and Design· Azure (PaaS and IaaS)· UI Web Developmento AngularJS / JQueryo Bootstrap / Sass / Kendo UI· Version Controlo GIT / Subversiono Branching / Merging / Resolving Conflicts· XML / XSDThe Requirements· Hard-working, self-motivated and willing to learn new things· US citizen to work with our customers’ sensitive data· Ability to work well within a team environment and/or with little supervision· Aptitude/affinity to work with new, up-to-date technologies and software frameworks· Minimum 4 years of experience in back-end development· Fluent in EnglishIf you are passionate about technology, love building software that can disrupt an entire industry and can enjoy working with a small, but young development team, this opportunity is for you!"}