{"title":"Concrete Superintendent","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALcldBN9hbiOvP4IRjwjwJFglQGoPGDz3-Ln0ZbkmE6qtT4rdNeudf_M_R3lxMr4Kp9SplzOsvOJOGcFZhjiyUqI1nk-WwCA-nPB1LDrO4adWDSkdcBAsY39UyLJrHRbMb6zJBnyqKLU-RMHunD2dK5lHXIyvOnO5z9JqbxKNOW-VNXJemm697q0gNwfSfU","source":"ziprecruiter","full_description":"Position(s): SPAN is proud to be a 100% Employee Owned Company (ESOP), and we are currently seeking qualified Concrete Foreman to join our company. We are looking for highly skilled individuals to lead a concrete sub-contractor for the foundation of a pre-engineered steel building. As a pivotal part of the SPAN team, you will lead a subcontractor crew in effectively completing a specialized component of our pre-engineered steel building projects throughout the United States. Please reference the specialization summaries below. Come join an industry-leading team of people who pride themselves in being fast-paced and always having an “anything is possible” attitude while maintaining safety, quality, and integrity on all projects. The Preferred Concrete Superintendent Candidate Will Have:Specific knowledge and who is proficiency with Commercial Structural Concrete Projects.Ability to manage a team and take ownership in completing a specialized portion of a project scope while adhering to project schedules and timelinesAbility to foresee potential constructability problems with their project scope, take ownership when needed, follow up with a resolution, and inform the Project Manager and all levels of personnelAn approach/mindset to work that is focused on providing total quality and extraordinary service to our clients and our teamStrong communication and organizational skillsProficient in operating a forklift, scissor lift, and boom liftIs OSHA 30 certified and is able to complete work in accordance with OSHA regulationsMinimum 5 years of supervision experience, specifically on commercial structural concrete projects, must be able to oversee 20-30+ skilled laborsIs proficient in reading construction drawingsA good understanding of steel building systems and what is needed for their foundationAbility to establish and maintain effective and positive relationships throughout a project (customers, design team, subcontractors, and suppliers) that focus on SPAN’s core values and meets/exceeds customer’s expectationsComputer proficiency and utilization of cell phone/company communication tools (e-mail, Microsoft products, internet, etc.)Multi-tasking skills with the ability to handle the multitude of issues that arise daily on a construction projectAvailability for extensive travel throughout the United States and internationallyBenefits:ESOP - 100% Employee OwnedPer diem paid while working away from homeCompany Truck/Auto AllowanceMedical benefits and 401KOpportunities for career advancementEnjoy working in an exciting, challenging, and fast-paced work environmentIf you’re interested in our industry and want to have a fulfilling career with opportunities for professional and personal growth, we want to hear from you."}