{"title":"Chemist - Trace Detection Technologies","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJT-yCH-uBild1M9WMg8_OYs17cwYD5i4VMTSjvRuPKOc9RXEWcmS9JZpNe-VF9mWpTJO_qZO9pP2T8MI-Vk4A8f8bq7VN2IW-rWhck25REk7NGFxvlt0tvFLTbTCjsX8wbR1R3fO051ERGXZcKZkv71BmOwBn0Y0wn84F5oHK-NQ91U_v3yiYdWSbFTutB","source":"ziprecruiter","full_description":"Global Systems Technologies (GST) seeks applicants for an upcoming opportunity. One Chemist with experience in TSA Trace Detection Equipment will be needed to support testing at the TSA System Integration Facility (TSIF) in Arlington, VA.The Chemist will work with Functional Requirements Documents (FRD) for Explosive Trace Detection (ETDs), Bottle Liquid Screener (BLS), and Liquid Explosives Detection Systems (LEDS) technologies. Testing performed will (a) ensure systems meet requirements following implementation of change requests, (b) determine suitability of new systems, (c) troubleshoot malfunctioning fielded systems. The successful candidate will apply their understanding of the technology underlying trace detection to accurately predict how machine/process changes will impact detection and field operations. The Chemist will also represent TSIF at Integrated Project Team and System Evaluation Team meetings.The Chemist will perform routine and preventative maintenance, as well as coordinate more advanced repairs with third party maintenance personnel.Newer technologies may also be evaluated including mobile trace and colorimetric technologies. He or she will perform safety assessments for all data collection activities. He or she will also design, develop, and manufacture test tools to improve test efficiency and/or accuracy. RequirementsCitizenship: Must be US Citizen.Security Clearance: Must have or be eligible to receive a DoD Secret Clearance.TSA Suitability: Must be able to obtain TSA suitability.At least 5 (five) years of experience using and evaluating ETD equipment.Must have expert operator experience with a familiarity of administrator-level system configuration and maintenance tasks with at least one ETD systemExperience independently using HPLC and GC equipmentA bachelor's degree in chemistryMust live in the Arlington, VA areaBeneficial to Have:Experience working at the TSA Security Integration Facility (TSIF)Existing Secret or Top Secret Clearance.Experience contributing to a Chemical Hygiene Plan Benefits  Complete, comprehensive benefits package. We will respond with more details to qualified applicants."}