{"title":"Project Controls","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKLaSo8GK1nZx0rtAc2m9NlzYqEIatG3ejpJTPY48qohHrf39KiJcvBN_qwkRe5zNfUVcxQuGjOQn31eBAqxT0lju6w_fGCZwBGmJCZqed42GAnX1YuRzeT05dN_aUgouSPeaCZUCb_JliA5lnKeaJuU9tIu8eqDfFZ_-iAdeFV8vyhgUwdV7L2iBG8qII","source":"ziprecruiter","full_description":"Project Controls / Cost Estimator / SchedulerJimale Technical Services, LLC. (JTS), based in Seattle Washington, is a construction management and project controls company that provides consulting services on large capital projects. JTS is currently seeking individuals with 10+ years of work experience in the Project Controls profession, interested in working on upcoming projects.Specific knowledge, skills and/or abilities sought and not limited to: •Develop, establish, and maintain all aspects of the cost control and planning/scheduling effort (using Primavera P6) on one or more of demanding projects varying in size and complexity.• Develop and maintain cost control systems to support project management.• Analyze changes to determine the potential cost or schedule impacts.• Assess impacts of design/construction changes and schedule slippages. Develop or maintain a system to show the hierarchy of plans and schedules and inform the project manager or RE.• Understand and apply engineering and construction terminology, concepts, and relationships.• Develop progress reports including work accomplished and planned, status and analyses of schedules and budgets.• Interface with clients, attend regular meetings, and provide statistical reports.Qualifications: • Degree in Engineering or Construction Management (or related field) and 4 years of related work or equivalent experience.• Requires basic engineering knowledge in electrical, mechanical, civil, or a related field. • Proficient PC skills including a proficiency using various software used in the Project Controls industry, such as Excel, Primavera P6, MS Project, and RS Means. • Leadership skills and familiarity with industry best practices is preferred.Required Skills:• Ability to work as a member of the construction management team and owner’s staff• A clear understanding of and ability to interpret engineering drawings and specifications• Implement scheduling best practices and create and execute schedule management system• Experience preparing various levels of construction cost estimates• Experience in preparing change order estimates and negotiating cost proposals with contractors• Ability to anticipate problems and develop solutions• Able to research details and inform management of potential delays and problems• Demonstrated attention to detail and ability to set and meet deadlines• Software skills with computer relational databases, Excel spreadsheets, contract administration and financial systems, budget monitoring tools, and scheduling software• Ability to report information in a concise mannerDesired Certifications: • Certified Cost Engineer (CCE) ® or Certified Cost Consultant (CCC) ® • PMP from PMI• Primavera P6• Construction Specification Institute’s Certified Construction Contract Administration (CCCA)Wage•Depends On Experience#JTSPowered by JazzHR1Xd4Reqdry"}