{"title":"Pilot - Cessna 340 NEW!","location":"","salary":"","description":"","term":"$50,000 to $55,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJmRKBsHOKZVQV5vFS32TrS5O8vMuRZCRXJgMi2an7k7_6WpjhTp4106xBIq7JfqvZzo-ZBtMga1uSa8zn1Y_HdpMDqcHg3P2A8kZJTYCtA6KdrP_A2BIfQI3xAJ26Vk1plediDgiLS7dCn09QwIgTYA1fymbeowoU3Dp1LIxdAxpbafVUZbokZE0d3P9Y","source":"ziprecruiter","full_description":"Hellas Construction Inc., headquartered in Austin, TX, is nationwide specializing in sports facility construction. We manufacture, install & resurface artificial turfs & synthetic surfaces while completing the design from start to finish.Hellas is seeking a full-time Pilot to fly our Cessna 340 aircraft. This position is located in Carlsbad, California. Responsibilities include but are not limited to:All pre-flight, in-flight, and post flight functions, such as: pre-flight inspections, weather evaluation, planning and implementation of crew and passenger transportation, crew accommodations, loading of luggage and cargo, flying, post-flight inspections, aircraft cleaning, stocking, and security.Reviewing and calculating the aircraft weight and balance, fuel on board and performance chartsSupervising aircraft maintenance as directed and communicate aircraft deficiencies for maintenance review and correctionPosting revisions to the flight and maintenance manualsExpert knowledge of Federal Aviation RegulationsAbility to fly and handle the aircraft including instrument approaches and other flight maneuvers including emergency procedures safety and confidently.Maintain a high degree of proficiency concerning aircraft systems and performance knowledge and ensuring that aircraft are operated smoothly within their limitations.Provide excellent customer service to passengers. Studying weather conditions at destination, enroute, alternate airports and departure points. Maintain an aircraft that is clean and prepared for flight with all provisions on board for the safety and comfort of the passengers.Perform flights in day, night and all-weather conditionsEXPERIENCE:High school diploma or equivalent from an accredited institutionAviation school as required for attaining necessary licenses / Pilot / Medical Certification5 plus years of piloting aircraft with commensurate skills and experience3,000 hours total flight time required with 500 hours total multi engine time preferredLifting requirement up to 50 pounds in weight with height requirement to 60 inches above ground levelAbility to pass a company background check and drug testTwin Cessna PIC time preferred but will send selected candidate to Ground and Sim school for Cessna 340 trainingWhen not flying, individual must be able to be on call 24/7.No telephone calls please.Hellas Sports Construction is an Equal Opportunity Employer. For more information about our company, visit hellasconstruction.com, matrix-turf.com and epiqtracks.com"}