{"title":"Computer Software Engineer","location":"","salary":"","description":"","term":"$65,000 to $95,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIzAnJiryaFgMjoKU-eqSE4Ag38NtPCJC443MNZ4SeHe_mStsotxW4pUAVaWRnhys89pgulv0jdQWjVVuCZXlSjobAhOVi5C5MKtrR8ANQlCW1A-Wfw7c1tWR6aUccmuWjdZKUT_hE1ZxJSULgJY-m6k8mwSnBT9Tglb4R2_05OTQ0_JXjVcbaXL6InOqKr","source":"ziprecruiter","full_description":"Overview: Quadridox Inc. is seeking a full-time electrical/computer/software engineer to develop data acquisition and processing software for a prototype, next-generation X-ray imaging system. Quadridox is a small business with focus on design, implementation and analysis of X-ray sensing and measurement systems in the security, medical, and non-destructive testing domains. These exciting efforts include both hardware and software development and QSim, Quadridox’s own tool for simulation and modeling of advanced X-ray systems. The current project focuses on the development of a novel X-ray scanner to identify explosives and other contraband materials in the aviation security arena.Purpose: The engineer will develop data acquisition and analysis software for a prototype X-ray imaging system for security and aviation applications, working closely with senior scientists on the design and implementation of the data acquisition software and analysis tools. The engineer will lead the implementation of the software control system, including interfacing with hardware controllers, implementing data acquisition protocols, and developing a graphical user interface for control of the X-ray scanner. The engineer will lead the implementation of image acquisition, readout and display software, and data processing algorithm implementation and training. In addition, the engineer will assist with developing and executing simulation models for testing scanner performance that leverage cutting-edge machine learning techniques. The engineer will report to and work closely with the senior staff scientist on the project.Major responsibilitiesImplement software control system, image acquisition, and analysis software for prototype, next-generation X-ray imaging systemBuild and design the graphical user interface for control of the X-ray imaging systemGenerate software manuals and help guides for control system and analysis softwareDevelop and execute simulations of X-ray technology for testing scanner performanceAssist team members with data generation and the development of software tools for the X-ray systemAssist the team with preparing reports on software development and implementation tasksBasic qualificationsBS or MS in computer science, computer engineering, electrical engineering, or related fieldProficient in C/C++, Python, LinuxPreferred qualificationsExperience with software control system developmentWorking knowledge of signal processing and machine learningExperience with MATLAB, CUDA, OpenCV, Blender, Unity, SolidWorks are all a plus2-4 years relevant experienceAbility to hold US govt security clearanceLocation: Raleigh-Durham area, NCApplication: To apply, please send your resume and a cover letter to careers@quadridox.comAffirmative actionQuadridox Inc. is an Equal Employment Opportunity and Affirmative Action Employer and supports a diverse and inclusive work environment. We do not discriminate based on age, race, color, gender, religion, nationality, sexual orientation, marital status, pregnancy, medical condition, genetic information, military or veteran status, or physical or mental disability."}