{"title":"Applications Engineer","location":"","salary":"","description":"","term":"$60,000 to $75,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKb5X6qPmCRd0NNF0RyPunDH23YlnqEUV6Cstf9oAaW-YHEr-8cXMFOVXw9SzFHoWu_5-zYnE4x0zP1J40IpezCyrWUz_j-u0z0_Dp2NmqlfkeHPbkZp7lhFkuiPOQNs60QRx5d72j2hDwcz_NZRG5yljXYmTKpGgTdkIm6J6QB2fIFwszCOIE_u1iG71e-","source":"ziprecruiter","full_description":"We are committed to provide our employees a stable work environment with equal opportunity for learning and personal growth. The success of ESS Metron is built by committed, efficient employees who believe in our company, who gain satisfaction from their work, and who strive towards extraordinary achievement. We believe that people work best in an environment where they are recognized for their efforts and respected as individuals.Core Competencies: DrivenSelf MotivatedDetailed OrientedTeam OrientedPassionateWorks well under pressureDedicatedResponsibilities/Qualifications: We are currently seeking dedicated and self-motivated individual experienced in application engineering in manufacturing environment. Candidate should be knowledge in power distribution centers, low and medium voltage switchgear, electrical engineering and design, manufacturing, and have a strong desire for achievement and promotion. The candidate should be able to interpret technical information provided by the customer and produce material costs and technical proposals.Interpret technical information provided by the customer and produce material costs and technical proposals.Must be able to work and communicate effectively with sales, engineering, operations, and project management.Understand customer needs and interface directly with customers.Interact with vendors when selecting and obtaining quotations for electrical components.Experience and understanding of low and medium voltage switchgear, motor control centers, power monitoring, and power distribution will be helpful. Candidates who have only some experience with these requirements must have the aptitude to learn and understand.This position will provide ongoing improvements in quoting processes, efficiency and quality of information that can be directly measured to improvements in gross profit and throughput.The candidate will work closely will all departments to ensure a smooth transition of information once a quoted opportunity becomes a job.EDUCATION and/or EXPERIENCE: 4 year degree in mechanical engineering, electrical engineering or equivalent experience in a manufacturing related environment.LANGUAGE SKILLS: Must be able to read and write English. Ability to read, analyzes, and interpret general business documents, technical procedures, or governmental regulations. Ability to read and write email and to prepare simple instructions or direct communications via email and in written documents. Ability to effectively present information and respond to questions from groups of managers, executives, clients, and customers.What Else Do I Need To Know About Being an Applications Engineer For ESS METRON?Hours: Full Time, with a minimum of 40 hours per week (may require more hours depending on the needs of the business, including some weekends).Start Date: ImmediatelyCompany Benefits Include:MedicalDentalVacationSick Pay401K PlanPaid HolidaysGrowth opportuinitesLong Term DisabilityAbout ESS MetronAs one of the world's leading designers and manufacturers of low and medium voltage power distribution product solutions, integrated power distribution centers, custom control products, modular control buildings and skid mounted power distribution & pumping systems. With over 60 years of experience, ESS Metron has produced the highest quality products for the most demanding applications & environments know.EEO StatementESS Metron provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex national origin, age, disability or genetics. In addition to federal law requirements, ESS Metron complies with applicable state and local laws governing nondiscrimination in employment. This policy applied to all terms and conditions of employment, including recruitment, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}