{"title":"Tax Senior Associate NEW!","location":"","salary":"","description":"","term":"$65,000 to $85,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIaqXTK_IyO5sNRUM1yJkkJB_im5RHRRCPCJN1OM9LKRBOtwNuTicMM1P7ZiytD-ccXIrPShSYPAzX7L4zDIgyUkNSMc_0Ysf2DKsOzexm7fTNJDkMSh6jMu2oEBdpBO0ZhZxX4m2z79t95JVmxl4sOJzxcq9EoQSEP4I8EXD7cgGoQ0WksOBRFJ-NJMC0i","source":"ziprecruiter","full_description":"Brown, Graham & Company, P.C. has career opportunities for highly motivated individuals as Tax Senior Associates, starting after the deadline. As a Tax Professional, you will be responsible for performing complex tax preparation, tax research and tax planning with minimal supervision and may be assigned tax in-charge responsibilities and/or supervision of staff. Specific responsibilities may include but are not limited to:Review and manage staff deliverables including tax returns, extensions, tax planning calculations, and write-up work for all entity types (C-Corp, S-Corp, Partnership, Fiduciary, Non-Profit, gift, multi state and TX franchise).Manage and monitor client deliverables and due dates.Conduct complex tax research and prepare memorandum outlining findings and conclusions.Communicate directly with existing clients, colleagues, management, and IRS representatives regarding various tax matters.Assist with employee training for new hires and ongoing employee training.Engage in consulting and special projects as requested by Management and Clients.Qualifications:Bachelor’s degree in accounting requiredValid CPA License preferredExperience in the public accounting field, preferably in the Agriculture, Low-Income Housing, Oil & Gas, Government, Non-profit and/or Multi-state segmentsWorking knowledge of GAAPExperience with ProSystem fx Tax and Engagement software preferredApplicants must be currently authorized to work in the United States on a full-time basis.Brown, Graham & Company, P.C. is proud to be an affirmative action/equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, veteran status or any other status protected under local, state or federal laws."}