{"title":"Semiconductor/IC Sr. Project Engineer","location":"","salary":"","description":"","term":"$120,000 to $150,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJgmvTu5K1LXGHqx93Ngec7B5USa8RdWZqurzt_BbKNTfZP33YtYQuD_JTnfGrqpBYUjaubC2LJ_zkU0-jIKfoWFsjKTr92xo-EXHeH8sptQkm_6Q7FaXFyGQmzoJZxNnlhmNR7NtTYJ2ecIjmtFzxVBrUFRM5ih9_VD3GeFNa9lABjqYap6YbkJzkZVw2g","source":"ziprecruiter","full_description":"Semiconductor/IC Sr. Project Engineer LeadItasca, IL (NW Chicago)YES- Relocation package provided. Direct Hire. $120-150KOnly persons authorized to work in the United States to applyYou will lead a MEMS microphone development team. You will be analyzing designs of others plus lab data collected by others, and conduct engineering analysis and design validation. If you have a semiconductor/IC background, knowledge of MEMS, and a knack for project leadership, this is a perfect role for you!The company is a market leader of advanced micro-acoustics & specialty components used in communications, consumer electronics, medical technology, military, aerospace and industrial markets! Also a leader in micro-electro-mechanical systems microphones, speakers and receivers which are used in smartphones, tablets and mobile handsets.You will be responsible for:Performing technical feasibility for new projectsDefining performance requirements for component teams (MEMS, IC, Packaging, etc.)Leads design reviews, DFMEAs, validation testing planning and executionDefining and analyzing design verification results to ensure project is meeting requirementsTroubleshooting design / technical issues as they ariseWorking closely with other design and test engineers to test, and characterize designs at every stagePOSITION REQUIREMENTSBS in Electrical or Mechanical Engineering, Material Science, Acoustics, Physics, or similar3 years experience of CMOS analog /mixed-signal integrated circuit designExperience with product developmentElectronic circuit design and testing. Acoustics / electronics lab testing and debuggingPrior experience with frequency and time domain based lab equipment like Spectrum and Audio Analyzers, as well as, OscilloscopesBe comfortable performing lumped element modeling of acoustic transducers (using spice or other modeling tools)Experience with scripting language (Matlab, Python) for modeling and data analysisPrior Project/Team leading experience a plusExperience with audio DSP algorithms is a plusVOLT is an equal opportunity employer."}