{"title":"Senior .NET Software Engineer","location":"","salary":"","description":"","term":"$80,000 to $130,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKA3VLYXgcwiTaacXeK3FCg8i9d6FuSlE6wVyfD95Jb6od0C9iifVpRHI9BiEJd3LWD6S_erqXJezxPNwEZzZoWn_0GnB_FKouaBsVmS4NWhN40qOLo58mkhF8XCxzyX5FMbxtq_cK4jBteTBnLqHCHC9VOiDLqOriDOx7uSe157Q_nykPpMdt6pSasito","source":"ziprecruiter","full_description":"Senior .NET Software Engineer  Apply today if you are a Senior Software Developer looking for a growing company in the insurance industry! This position could be contract to hire or direct-hire and full-time! This position is ON-SITE with ability to lead and grow the team Title: Senior Software Developer Location: Palm Bay, FL 32901 Salary: $80,000 - $130,000/year | Contract to HireRequirements: C#, .NET Core, SQL, Azure, AgileHeadquartered in the beautiful city of Melbourne, FL, we are a technology-driven insurance company entering its hypergrowth stage! Our company has created an intuitive and advanced application with over 15,000 users generating an annual revenue run rate of over $10 million. Our technology enables agencies to quote, bind, and issue policies at a fraction of the time of our competitors while allowing our consumers to manage their policies in real-time through a custom-built portal. For 2021, we are projected to 2-3x our revenue and users as we expand our operations across the US! You'll be part of an energetic and growing team looking to push the boundaries of our technology and homeowners insurance!Top Reasons to Work with Us- Brand new development! No boring maintenance work! - Work with a lean and mean team looking to triple its revenue in 2021!- Chance to take on lead positionWhat You Will Be Doing- Develop new features with quality, maintainable code- Translate business requirements into code- Document! Document! Document!- Debug and test code before deploymentWhat You Need for this PositionAt least 3 to 10 years of software engineering experience with some of the following:- C#- .NET Framework- .NET Core- Azure- SQL Server- JavaScript, Vue or willingness to learn Vue Framework- API, web services- Agile environmentWhat's In It for You- Competitive base salary: $80,000 - $130,000/year- Full benefits: Medical, Dental, Vision- 401 (K) with a generous company match- Generous Paid time off (PTO)- Vacation, sick, and paid holidays- Life Insurance coverageSo, if you are a Software Developer with experience, please apply today OR e-mail me your resume at Trent@CyberCoders.com! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}