{"title":"Agile Software Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJhyKycma0ReGLXMjbVfo9RaMVgkfjkAZAJEDKR8QkXuzjPI90Cnjh4_M6ut00N5XPa0Ya6WOSn-1ja2jXDUnUnodTej_ixovyAtN-em11cnKTjoRZwfOfYzoTOlidcbGruZZWMh8puhcjdEyjft0XC0EPtFcg-jHE-XRCmmA_-c6nbvXdXDKcmLpMS3TM","source":"ziprecruiter","full_description":"Agile Software Developer in Denver, CO at APEX Systems Date Posted: 1/23/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Full-Time + Location: Denver, CO + Job Type:Other + Experience:Not Specified + Date Posted:1/23/2019Job DescriptionJob #: 907051 Our financial client in Denver is looking for a Senior Agile Software Developer.Job Description: One will execute true end-to-end development and testing of software products in an agile lifecycle. Partnering with key technical and business stakeholders, the agile developer will help refine the product vision, estimate and design a solution, create, purchase, or customize the requisite hardware and software to create the solution, ensure the quality of the final product through manual and automated tests, and support the new software as it is moved to production. Basic Qualifications - Bachelor's degree in Computer Science or related fields, or equivalent work experience - Eight or more years of work experience in Application Development/IT Systems Testing, and team leadership - Expert-level Coding Skills (typically Java or C#), including Version Control Systems - Functional Testing experience, including ability to create, maintain and execute both manual and automated tests - DevOps capabilities - containers, cloud, automation, security, configuration management, CI/CD Preferred Skills/Experience - Extensive knowledge in modeling and application design and architecture - Expert knowledge in IT/Software quality assurance - Expert knowledge with system/application testing tools and implementation - Strong understanding of Information Management - Extensive knowledge in product/vendor management and change control - Experience in: Unit Testing and Agile Software Development (typically Scrum, Kanban, SAFe) - Strong understanding of system and network architecture - Ability to identify, resolve, and retest defects - Expert skills in service virtualization, test case modeling, and test data management tools and processes - Demonstrated technical leadership and direction - Demonstrated enterprise-level collaboration and system architecture design - Expert knowledge in CI/CD solutions, such as Jenkins and Maven - Ability to follow policy requirements related to documentation and other processes Please email jgoulding@apexsystems.com if you are interested and would like to discuss further. EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}