{"title":"Technical Support Specialist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALhBxQpraLU8wCw5MVmP012DFevjSCFd1W0lHbNtNKCUlQItvGmVZYfdPNa0M70BD_3QMfqVCATHXrnCrc_RnvZTiIZ-nFghdME7q_raqwjw2Ce-bEeZGr1Zqt7n-2LB1oMkk8w5fA-PU7-jNs5K9_8QCDbnNL7DQsr9KBzyAeUvsd_4DHPAC91iCJYEJY","source":"ziprecruiter","full_description":"Stoel Rives has an immediate opening for a Technical Support Specialist, based in our Seattle office. This role provides professional, reliable, and responsive information, training, troubleshooting, and other support related to the setup and use of the firm's information technology. Technical Support Specialists are experts on all the core applications and hardware in use at the firm. This position responds to escalated technical support incidents and requests for technology setups via email, telephone, and in-person during core business hours and after-hours when necessary. This position also requires excellent communication skills and the ability to convey information and provide technical support and training both in-person and remotely.Technical Support Specialists also deploy and track end-user hardware inventory and participate in the successful completion of all IT projects.JOB FUNCTIONS AND RESPONSIBILITIESRespond and provide timely resolution to requests for technology setups and escalated incidents, in accordance with published service level agreementsAppropriately escalate requests and incidents to other resources (IT or otherwise) as necessaryEffectively communicate resolution of incidents to end users, and ensure needs are metRecord and track support incident details, communication, and resolutionsProvide training and how-to information on the use of the firm's technology whenever necessaryAuthor and edit knowledgebase articles to support the exchange of IT knowledge at the firmKeep all loaner hardware in working order and maintain the inventory and checkout statusTroubleshoot software and hardware issues, research and implement immediate solutions, and provide input on permanent solutionsSetup and support of conference room audio/video technology (includes audio, video, and web conferencing technologies)Track and record the movement of end-user hardware inventoryProvide after-hours, emergency support when necessaryOther duties and responsibilities as assignedKNOWLEDGE, SKILLS AND ABILITIESExcellent oral/written communication and interpersonal skills to effectively communicate with end users at all levels within the firmExpert diagnostic and troubleshooting skillsExpert knowledge of Windows OS, Microsoft Office Suite, iOS and Android and remote connectivity technologies from Windows OS and Apple OS devicesAdvanced working knowledge of legal specific software (e.g. iManage, InterAction, Lexis/Westlaw legal research products, etc.)Advanced knowledge of wireless networkingAbility to work independently and cooperatively as a member of a teamFunction effectively and maintain a customer service orientation under the pressure of changing priorities and deadlinesAbility to organize and appropriately prioritize tasksUse active listening skills and be able to give clearly stated instructionsPHYSICAL AND MENTAL CAPABILITIESThe ability to stand or sit for extended periods of time dailyAbility to lift 25 poundsMust be able to operate firm computer equipment and a touch tone telephoneEDUCATION AND EXPERIENCEAn Associate degree or related equivalent combination of education and work experience is requiredMCDST and MOS certification or demonstrated, equivalent experienceTwo or more years in a technical support role, preferably in a law firmNORMAL WORK HOURS: This position is non-exempt, with a standard work schedule of 37.5 hours per week. Stoel Rives is an Equal Opportunity Employer.About Stoel Rives LLP: Stoel Rives is a leading U.S. corporate and litigation law firm. One of the largest national firms focused on energy, natural resources, environmental and climate change, Stoel Rives also serves the agribusiness, food and beverage, health care, life sciences and technology industries. With more than 380 attorneys operating out of 10 offices in seven states and the District of Columbia, Stoel Rives is a leader in regulatory and compliance matters, business, labor and employment law, intellectual property, land use, real estate development and construction law. For more information, follow us @stoelrives or visit www.stoel.com"}