{"title":"Senior iOS Developer- Perfecto","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJZIlgKqZqZ9bWtbK3mdaFekHg7rgLoYCIBhr__jbGClDs4AH57SuHnwcbyDt9WHdfeCKS4Wl2G8DgKxCqjlt1yVPSMAWfE_vREfeOgIGT1rh2ox_enaFjCyY-qVDH1xk7DkNKNC--LdCQwCiyVGNVOlhLIPw_9-BniBkrSHHygCPDMePeuJu5LpL0jY_10","source":"ziprecruiter","full_description":"Role: Senior iOS DeveloperLocation: Rosh Haayin, Israel, Burlignton, MA or Mason, OHPerforce develops DevOps tools that improve software quality and security as well as team productivity for several of the world’s leading companies, such as PIXAR, CD Projekt Red, NASA, Verizon, Honda, NVIDIA, and Johns Hopkins.Position Summary:Perfecto is currently looking to expand its iOS flagship team and we are looking for a Senior Developer with solid Mobile experience to help us make miracles. Perfecto is the most trusted platform for testing web and mobile apps. Test faster, test smarter and test continuously with Perfecto’s AI-driven, end-to-end testing platform. The world’s leading digital Enterprises reply on Perfecto to reach their DevOps goals by making continuous testing a reality. As a Senior Developer you will take a major part in developing our product. This will involve research of different features and protocols and non-public APIs. As you will be working on supporting non-trivial functionality, you daily tasks will be quite different from the average iOS app development tasks. Perfecto is the most trusted platform for testing web and mobile apps. Test faster, test smarter and test continuously with Perfecto’s AI-driven, end-to-end testing platform. The world’s leading digital Enterprises reply on Perfecto to reach their DevOps goals by making continuous testing a reality. Responsibilities:• Tracking communications between an iOS device and development tools running on a Mac• Interfacing with services running on an iOS device• Looking into various binaries• Using Jailbreak as a research tool for different functionalities• Code development in Objective C, Swift, C++, Python &amp; JavaRequirements:• B.Sc. Degree in computer science / Software Engineering• At least 4 years of software development• Experience developing backend APIs and services• Knowledge with low level frameworks of iOS and ability to investigate private APIs• Server side programming in Java and Python• Profound knowledge of iOS internals and Mac OS• Experience with Reverse Engineering• Strong OO design and programming skills• A natural researcher and problem solver• Continuously discover, evaluate and implement new technologies to maximize development efficiency.• Self-motivated, independent learner and a strong team playerIf you are passionate about the technology that impacts our day-to-day lives and want to work with people as talented and dedicated as yourself, apply today!www.perforce.comPerforce is an equal opportunity employer. We value diversity and celebrate its strengths."}