{"title":"Software Developer / Software Engineer","location":"","salary":"","description":"","term":"$60,000 to $80,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKI9T9jhW9PM6VP_1rVcf4Fut2__ECxAnR2Df9bw073qVHmX59fdAxOAmG_0FbaFXVZ-LOYYIEqZZm-KSBDhzcLyaagVPqDCTifh1ad5I0tvMur9qNCmMdHJClGOR-ac_zUZVU2J-Q08oU7fX-OAZsJX0l12xjy3K_SuUtpZjbhs_dyPk8s4joYKzP8L6Y","source":"ziprecruiter","full_description":"Your ImpactAs a Software Engineer you’ll be responsible for building and maintaining the Qualifi product. You will collaborate with the team to determine the best roadmap and strategies to ship updates fast and effectively. Beyond shipping new code, you’ll be able to have a high impact on many company and product decisions as we are a small team and make decisions together. This role reports directly to our Co-founder and VP of Engineering. Specific responsibilities may include:What You'll Do:Code like crazy! Our tech stack: React.js, Node, Postgres, TypeScript, GraphQLCollaborate with designers and other engineers to deliver on our product roadmapCollaborate cross-functionally with our Consulting & Sales teams to implement feedback and guide our platform's user experienceDesign, build, test, and deploy highly-scalable APIsFix bugs as neededWhat we are looking for: 1+ year experience developing software in a SaaS environment (includes freelance work)Expertise in GraphQL, TypeScript, Node, and ReactAbility to move quickly, multi-task, and adapt to our rapidly changing customer needsA vibrant passion for coding and creating intuitive user experiencesExperience with cloud development tools like Heroku, Github, JIRAExperience integrating with 3rd party APIsComfortable working in a remote-first working environmentYou're a self starter who is excited about the fast pace of a growing, changing startup environment.Compensation$60,000 - $80,000Qualifi BenefitsHealth Insurance - Medical, vision, dental, and life plans available.Disability Insurance - Short-term and long-term coverage.Paid Parental Leave - Because time with your new baby is important.Unlimited PTOEquity - When we win as a team, you should win, too.Flexibility - work remotelyProfessional Development - We all learn together from the best network of advisors and mentors + we provide a stipend for independent learning and education."}