{"title":"QC Chemist, Cleaning & Process Validation - 1st Shift","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKWBfSk93WJs6kINhIF7CxGyjiw8Qpbfg3lHnbWUkV7HGN21vM4qYb0dln8HPO75LBABD7UUFR7S6nYIxy5x5QvVHAb521N7VB74jcKVmlEv-sVSVzTD4Tit_4cEMydUaZxPrJgY6ZmAQMBDDrv8_chDzL0x_0OpGckdaKoGwreMnNINu8mwYL76BpoObfS","source":"ziprecruiter","full_description":"Description Perrigo Company is dedicated to making lives better by bringing high quality, affordable self-care products that consumers trust everywhere they are sold.  Help us do it.As a QC Chemist in the Cleaning and Process Validation group, you will perform analytical testing on samples relative to the release of Perrigo materials and product according to cGMP requirements.Please note this role may be hired at the E3 Chemist level or the E4 Senior/Lead Chemist level, dependent on the selected applicant's qualifications.Other Key Responsibilities may include: Collect samples including raw material, finished product, process equipment and environmental.Test purchased materials and/or Perrigo manufactured products per cGMP requirements and participate in laboratory investigations.Operate laboratory equipment.Participate in internal and external quality audits.Maintain personal laboratory work area and assist with general laboratory cleaning.Participate in training and development. Qualifications: Bachelor of Science in a scientific discipline (Chemistry or Food Science preferred, Biology) which includes academic lab experience, is required.Minimum of 1-2 years' experience working in a GMP/FDA regulated manufacturing environment is required. 3+ years of experience is preferred.Good written and verbal communication skills, excellent documentation and organizational skills.Demonstrated critical thinking skills, attention to detail, and the ability to work independently and with others.Ability to take ownership of assigned tasks and responsibility for the results.Ability to work overtime as required.We are seeking a diverse applicant pool to ensure the diversity of our team reflects the end consumers we serve through our self-care mission. We are proud to be an equal opportunity employer that celebrates our team's differences. Individuals of all races, ethnicities, nationalities, ancestries, religious creeds, sexual orientations, genders, gender identities and gender expressions, national origins, ages, mental and physical abilities, familial status,' veterans status', military status' and more are encouraged to apply. TOGETHER, we make lives better."}