{"title":"Auto Mechanics, Technicians, $5000 Signing Bonus! NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL5osQ1Kk-dLYP4GWGe-DWtbpkt1QyLwOxz5cnNb0drpjsgryuRL_D67Hu1TEAVB8USVIn5WCK65IJx3WdtBVv_dgbvEkuc2-inBRx9Ii-YS7LABELeY5q6aLJZRmDNDtbYpSI7D3RWP29j8NdQ82BF31OjNrPWqKuvF7QlpvckcV9ixt9dPQqDlogaqSKX","source":"ziprecruiter","full_description":"2140 N Morton Street, Franklin, IN 46131Automotive Service Technicians/ MechanicsUp to $5,000 Sign-on Bonus for the Right Candidate! Flat Rate Pay | Tool Relocation | Great Benefits!At least 1 Year’s Experience is Required We Service Fleets - Plenty of Work!Walk-in Applicants are Welcome!Hubler Ford Franklin has an immediate need to hire an experienced Service Technician to perform vehicle repairs and routine service/maintenance according to skill and certifications. Rewarding pay is based on knowledge your skill, experience, and A.S.E. certifications. We are breaking ground on our new facility in April 2021!Build and advance a rewarding career as part of a family-owned, growing organization where your contributions matter. We value our employees and invest in their success! Upload your resume AND complete the assessment for immediate consideration.We offer:Rewarding Income Based on Your Experience!Up to $5,000 sign-on bonus for the right candidate!Flat Rate, Competitive Pay PlanTool relocation assistanceMultiple bays availableWe service fleets – plenty of workMedical, Dental and Vision plansBasic Life Insurance401(k) savings planOpportunities for advancementTraining programsFlexible schedulesWork/Life balanceResponsibilities - Service Technician:Inspect vehicle and diagnose problem(s).Perform quality recall/general repair and maintenance work that meets dealership and manufacturer standards including engine, transmission, electrical, steering, suspension, brakes, air conditioning, etc.Provide labor and time estimates needed to repair/serviceLearn new information and techniques in training sessionsKeep shop area neat/clean and account for toolsOther duties may be assigned according to expertise and certificationsQualifications/Requirements - Service Technician:At least 1 year of Service Tech experience is requiredReliable with a good work ethic and problem-solving skillsA positive attitude and works well as part of a teamValid driver's license and good driving recordResume must be uploaded, and online assessment completed for immediate consideration.Must be authorized to work in the U.S. without sponsorship and be a current resident.Must pass pre-employment testing to include background checks, MVR, and drug screen.We are an equal opportunity employer. All qualified applicants will receive consideration for employment regardless of race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."}