{"title":"IT Cloud/Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKXMLBpOBmJxhhraHPFc-j-ng6blRD0qpnIbK_wknXC5ApD7lwm-8MMnJcFToXnRwrYGcjfV_Z9x3zCNTFyBSQxDka-0lhIFWqeiec8VdQT4MzhgpKHqzgR2chV4S9jjKauafe51i3w-U-VqkBObrKQeuMWH362cWHaRDTFpTnSk5lyx100l6Dfc2QRq2-N","source":"ziprecruiter","full_description":"Position Summary: The IT Cloud and Network Engineer is responsible for the administration of the company's cloud and network infrastructure and maintain all components of the Azure and local networks. This position is responsible for the company's backup strategies, Azure SQL databases, monitoring the overall network, and assessing the functionality of the Azure environment. The engineer will also be responsible to maintain and administer legacy computer networks and related computing environments including systems software, applications software, hardware, and local network configuration. A successful candidate will demonstrate experience with Azure infrastructure, and automation to create and deliver modern, scalable, and resilient cloud-based technology solutions. Travel amounts of 25-35% are associated with this position along with occasional overnight stays.We are open to remote candidates that are within driving distance or short flights away from Greenville, SC.Essential Duties and Responsibilities include the following and other duties that are assigned.Design, build, maintain, and support a public and private Azure cloud infrastructure and solutions to support the availability, orchestration, scalability, maintenance, and monitoring of the platform (network, storage, compute, security, traffic management, identity management)Architect, develop, deploy, and maintain core infrastructure and services in Azure through automation Design and implement functional network infrastructure while resolving issues that have been escalated by troubleshooting cloud and local infrastructureWork with management to develop, maintain, and implement the company's network/computer infrastructureMonitor the Azure and legacy infrastructure; patching and updating as necessaryMentor team members on technical issuesEvaluate partner solution portfolio roadmaps and new technologies for potential deployment.Conducting a continuous assessment of current infrastructure practices, systems, and identifying areas for improvementMaintains high network availability for redundancy and resilience. Provide direction, monitor performance, motivate staff, build a positive working environmentQualification Requirements: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Position requires constant mental alertness, attention to detail, and high degree of accuracy required in completing all assignments. Strong problem solving skills. Smart, driven, exceptional work ethic. Must be able to follow oral and written instructions and follow through on all assignments. Excellent organizational skills. Highly detailed-oriented. Ability to work well in a group setting and independently.If recovering, three years of continuous verifiable abstinence is required.Education and/or Experience:Associate or Bachelor's degree in Information Technology with computer science or related subject is required.5 years of previous IT work experienceValid State Driver's License and a driving record/MVR that is insurable by company auto carrier's standards/requirementsCCNA / Network+ certification or above is preferredMicrosoft Azure Administrator Certification is preferredQualificationsAzure Active Directory / Active Directory / Microsoft Intune / Azure Database platformsNetwork Routing and SwitchingNetwork Cabling and Infrastructure technologies including buildout of the new facility and network designMS Server Operating Systems; 2008 2019, MS Windows Operating Systems; Windows 10 Professional; Office 365; Azure; MS Intune; MS SQLSolid people management skills providing direction, monitoring performance, motivating staff, and building a positive working environmentCustomer service experience within a helpdesk environment and a strong customer relations attitude with the ability to receive customer feedback to improve serviceExcellent interpersonal and communication skills providing verbal and written communication that is outstanding to both direct reports and senior management as well as other stakeholders"}