{"title":"Field Service Engineer-CNC/Factory Automation NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALvB6PyDdXTBStQs-g4Gu3XaJ-VEX4UwRQII77sMKZxykNuFeGHLrIQ5xkNnAUw-mYer2TwkexzA7KcU7yShBTKScXofvVcPXw3RxaaK9FTOatfxQfnIt1ZSoxi6ZrWnVVJ8gBxwXh3OCW1SIESA-0acCf8Nfcd4UvMbE3YyUCJuNJ7bhuifs9FwHO5pmLj","source":"ziprecruiter","full_description":"Our client, a leading factory automation manufacturer, is seeking a Field Service Engineer-CNC. In this role, you’ll provide superior on-site product and application support to company customers. Additionally, you will be provided with a company vehicle and have the flexibility of working in your home office to support your assigned region.Provide technical service and support to our customersOn-Site service at customer facilities diagnosing of equipment problemsCall center supportEnter all technical claims, service activity, follow ups, opportunities, and other customer related inquiries into the database, while maintaining data integrityInstall components, software, and solutions offered by company using knowledge of programming, calibrating, tuning, rebuilding and maintaining customer’s equipment in the fieldPresent and sell customers our value-added services (VAS) Promote all company and support key initiativesTravel Requirements60-80% travel based on customer demand, primarily with in region. Ability to travel by car and plane, stay overnight in hotels, and be on-call to meet customer service needs.Essential Education, Skills and ExperienceBSEET or equivalent related experience3 + years of experience in field service for industrial automationAbility to sell value added services to customersKnowledgeable on electrical and mechanical tools for machine repairMechanical aptitudeHands-on knowledge of volt meters, oscilloscopes, and other test / measuring equipmentAbility to read and understand technical documentation: schematics, logic, procedures, etc. Beneficial Education, Skills and ExperienceExperience in Computerized Numeric Controls (CNC’s) products preferredExperience with robots and factory automation is a plusExperience in motion controllers (AC and DC) and programmable logic controllers (PLC’s) is a plusExperience in field service is a plus"}