{"title":"Software Engineer ( Sr. TECHNOLOGY ENGINEER DIGITAL CHANNELS ) NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAKuDMO2jlYm65GKRa9a1WfMvyFKuuraQgxKURqX6YP7OHSl459MUKRY5_FFSysojzkKaiBQOgHvc1JKnuZoFZhVo8I4mun2OHXPX0YYDHJm1adgW8p0Cme0Cms1B9uk9MoY0uixCso2UfhlCIUdvZxVgdNSviEdNmdRW5qHWP2I2etDaDcDEvKJmDQ2x80","source":"ziprecruiter","full_description":"Top Skills : Sitecore, SAP, Azure, Okta, AgileJob Description:SENIOR TECHNOLOGY ENGINEER DIGITAL CHANNELSThis Project Senior Technology Engineer role is specifically for the Digital Customer Product Team which has oversight for MyAccount, Mobile App and Digital Voice Channels (Alexa and Google Assistant). Technologies would include Sitecore, SAP, Azure, AWS, Okta and Layer 7. This position works on these technologies to implement requirements related to Clean Energy Future (CEF) Products such as Energy Efficiency, Electric Vehicles.In addition to the requirements below, must be familiar with Technologies that include:Sitecore, SAP, Azure, AWS, Okta and Layer 7This is a multi-level position and placement of the successful candidate will be based on job performance, skills, knowledge and experience. For a Senior Technology Engineer, must have 6 or more years of professional technology solution engineering. For a Principal Technology Engineer, must have 8 or more years of professional technology solution engineering.Required Education and Experience:Bachelor's degree in Engineering, Computer Science or a related field i.e. STEM6-8 years of professional technology solution engineeringDemonstrated good leadership capabilities through technology solution ownership and adoption, projects or other work experiences.Good track record of translating business outcomes, business requirements and technical requirements into technical designs for new technology solutions or enhancements to existing technology solutions, while following architectural standards and organizational policiesGood track record of implementing technology solutions using structured methodologies such as agile (SCRUM, Kanban etc.) and waterfall.Desired Qualifications:Graduate degree or MBAExperience with public cloud providersExperience implementing off the shelf productsExperience with mission-critical technology solutionsUnderstanding financial principles as they apply to technology investments such as cost to achieve, cost to operate, depreciation, maintenance, etc."}