{"title":"Senior/Lead Software Engineer (C#/.NET) NEW!","location":"","salary":"","description":"","term":"$130,000 to $140,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKYtP-Mj3qvraLZddd3rvALA7YAttcC9NohAUSeQy8QnRMvmEkzVd9eBcrpVDEg9kADpwptY7yNErcBjmg8CUByWB2XBy7Xvhy9Iqq3fB0drx0LxCWQY0Axv9lUGfFTO1FyN0yLHcz-Um_9SuQH2eaiV40uM1ovctY6jFizs0-f1mH0mXtyAUyG38I3Oy5k","source":"ziprecruiter","full_description":"Senior/Lead Software Engineer (C#/.NET) If you are a Senior/Lead Software Engineer with 7+ years of experience in (C#, .NET, SQL, Entity) and experience in .NET Core, please read on!Headquartered in San Diego, we are a growing Computer Software company offering financial services to our customers for over 10 years. We have doubled in size this past year and have received numerous amounts of awards for our Software Products. We are searching for a Senior Software Engineer with expert skills in the Microsoft stack (C#, .NET, SQL, Entity), microservices and AWS to join our team and lead our junior-mid developers. If you bring 7+ years of experience in C#, .NET and have scaled back-end RESTful API's - we want to speak to you! We are considering any applicants in the Pacific Time Zone (PST).Top Reasons to Work with Us-Growth opportunities-Award winning productsWhat You Will Be Doing-Designing and developing back-end RESTful API's using Microsoft stack-Creating SQL queries-Leading infrastructure and architecture (microservices and AWS)What You Need for this PositionMore than 7 years of experience in:- C#- .NET Core 5.0 (recent experience a huge plus)- SQL - RESTful API- GIT- Microservices- Docker- Entity Framework- Azure DevOps- AWS-JavaScript/AngularSo, if you are a Senior/Lead Software Engineer with 7+ years of (C#/.NET) experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}