{"title":"iOs Engineer (Sr. Software Engineer)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL9BrqkanTNWZVD6Wa6n4xtPonQznn_CJPgdjcPSYh8qNIh6quGfEwz0d_SfeXZgW9sSSC0ZtgR4uCxlLzhcG1-ryD5GvPeXNhTihnbalcanlKm272ujoso7tjh70efyMYslomEBrOR0mEJdznW8L_UJng3VdbHwdWs59uiM9g7nRwHWWdFfCYcdOhea-0","source":"ziprecruiter","full_description":"What does a great iOS Engineer do?Every day, Clover devices handle the core credit card and point-of-sale processing for hundreds of thousands of merchants. Behind the scenes, we operate a cloud platform providing processing, storage, and collaboration for merchants, application developers, service providers, and our merchants' customers. To support all of this, we have a team of engineers dedicated to ensuring our systems remain operational, safe, and secure. The iOS Engineer on a daily basis will spend 10% of the time reviewing designs of new features, 50% of the time developing features, 30% of the time investigating/reproducing/resolving bugs, and about 10% of the time creating tests and helpful documentation.Responsibilities:Own one, or more, of the Clover applications; add new features, resolve bugs, and refactor/ improve codebaseIdentify technical requirements in product meetings and assist the business team with realistic project planning and feature development; translate product requirements into functional, maintainable, extensible software that is in-line with company objectivesImplement new Clover applications as needed; take ownership of the new product from development through deployment and production monitoringCollaborate with Server Application Engineers to determine the best way to maintain low response times as new features are designedWork with QA to develop test plans/strategiesBasic Skills for consideration:Strong Swift skillsPrevious development on iOS platformFamiliarity with one or more SQL/RDBMS systemsSuperior problem-solving skills and debugging capabilitiesFlexible and self-driven with a collaborative approach to problem-solvingPreferred Skills for consideration:Experience with a cloud platform: AWS, Google Cloud, etc.Comfortably writing unit, integration, and instrumentation testsExposure to RESTful APIsExperience with distributed computingExperience in web development (React)Data analysis experienceExperience with RxSwift"}