{"title":"Technical Writer - Front-End Web & Mobile Developer Tools","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL9ssX3vDShDgFQ4wNefWsGuWLd56aHZcBtyjIdspZJFi0fuuz4awd-vBfV-8jRvArhfxyzX7vqbHQFZ4Rlsdx387-L0tPrluvsALVEgH7fODInrGUTCpnY4ZDtPbe9lHOMMGlzUIwl8dH0n4jX_NtLRLCluCDFlIGYKy4sKxtnaICQYJqlkfGNtzgoeQsh","source":"ziprecruiter","full_description":"Are you interested in the latest in front-end and mobile development? Are you a great technical writer? Then we want you to apply to this job! The AWS Documentation team is looking for a technical writer to join our dedicated team of writers that work on our front-end and mobile development service docs. Covered services areas include: AWS AppSync, an enterprise level, fully managed GraphQL service with real-time data synchronization and offline programming features. AWS Device Farm, an app testing service that enables you to test your iOS, Android and Fire OS apps on real, physical phones and tablets that are hosted by AWS.Ideally, you have both a technical background that enables easy interaction with software developers and a demonstrated ability to deliver high-quality technical documentation. Any experience you have with web services, GraphQL, XML, and GIT is also a bonus. While we don't expect you to be an expert in these areas, we hope you are excited to learn about them.AWS is constantly moving and that can be one of the best parts about this job! You will always be learning and growing. But our team also puts a high value on work-life balance. Striking a healthy balance between your personal and professional life is crucial to your happiness and success here, which is why we aren't focused on how many hours you spend at work or online. Instead, we're happy to offer a flexible schedule so you can have a more productive and well-balanced life-both in and outside of work. When our community isn't in quarantine, we can still work in from home most days with the option to work in the office on occasion.The AWS Documentation team writes and provides support for a diverse audience consisting of developers, DevOps professionals, IT professionals, technical program managers, and scientists. We have both the technical background and the writing background that enable our team to deliver high-quality technical documentation. On behalf of our customers, we do much more than just write the docs. We innovate, we research, we learn, and we experiment. We collaborate with product managers to understand our customers' needs. We partner with software developers to learn the inner workings of AWS services so that we can influence design and the customer experience. We know that what we do makes a difference in the successful adoption and implementation of AWS services.We have a formal mentor search application that lets you find a mentor that works best for you based on location, job family, job level etc. Your manager can also help you find a mentor or two, because two is better than one. In addition to formal mentors, we work and train together so that we are always learning from one another, and we celebrate and support the career progression of our team members.Here at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon's culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.AWS has the most services and more features within those services, than any other cloud provider-from infrastructure technologies like compute, storage, and databases-to emerging technologies, such as machine learning and artificial intelligence, data lakes and analytics, and Internet of Things. Whether its Identity features such as access management and sign on, cryptography, console, builder & developer tools, and even projects like automating all of our contractual billing systems, AWS Platform is always innovating with the customer in mind. The AWS Platform team sustains over 750 million transactions per second.Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, visit US Disability Accommodations."}