{"title":"Software Engineer, iOS Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJkp3KB4p3bOmdI48xcq0Q2B4epZ_BXDrevkXgCkZ-Qq09W19LhQwf5IU0lii0Pd6drVdm9X3Ravq7ej3IsCaLdDCxu1NJTShD4u2vdfbCH9QDTAkKvZ1GarkSt7Hii5U-7b_aG3F3xKaYpm-sEjg5uWsJvlvAWT5iiSQJgwC3eNS0kg5LNsV5E-WqbZUQ","source":"ziprecruiter","full_description":"About UsOver 360 million people worldwide experience hearing loss, yet 80% of them do nothing about it. At Eargo, we?re striving to disrupt an industry that?s desperate for change. Through product innovation and web technology, we?re looking to make a true difference in the world. Think Warby Parker for eyewear or Casper for mattresses. We?re a family of engineers and entrepreneurs with an ambition to dream big, and we?re looking to you to join us and help make it all happen.Position SummaryThe Software Engineer, iOS Developer will be responsible for developing a brand new mobile application from the ground up. As such, the position will offer the opportunity to set the standard for how we build and develop on the iOS platform moving forward. As a startup, we also offer the opportunity for the motivated individual to extend their contributions beyond the mobile application into other areas of our system codebase. You will be part of a rapidly growing team.Responsibilities + Contribute to the overall design and architecture of the codebase+ Participate in project planning efforts to coordinate mobile development work+ Build integrations with third-party platforms to provide a seamless, enhanced mobile app experience+ Design, code, and test new features in an independent manner+ Ensure compatibility across various devices and iOS versions+ Implement mobile-friendly design for optimal app experience and performance+ Deliver functionality in an agile development environment+ Advocate for and adapt industry best practices for mobile technologies Qualifications + Bachelor?s degree in software engineering or equivalent+ 3+ years experience developing iOS mobile apps+ Relevant experience as a mobile developer+ Strong understanding of the iOS SDK+ Strong expertise in Objective-C or Swift+ Experience with supporting various devices and SDK versions+ Ability to work in a dynamic, agile environment Preferred Qualifications + Experience with mobile app testing+ Experience with Bluetooth Low Energy+ Strong empathy for creating fluid, intuitive mobile user experiences+ Good understanding of mobile app optimization techniques Eargo is an Equal Opportunity Employer. All employment is decided upon the basis of qualification, merit and business need. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}