{"title":"Software Developer (#1678569)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIZj89zxlCDN3YGebz4E-4xRFrIuoC3LInlLD2lKyZ0YzFK5HUNTyyhZfDcYXYAHdPF14MwfJu9l1bgaMGO-LzalQ5tk5xXHwaqlfEykaQoMpovBMYr3ivtEdQIq7iZTSF8gJsaV6JT2xEYJI9KoYqFpCPCemJPmzwp0UJ2WDlK1vS3sXGQ5RoZJHRsGl2F","source":"ziprecruiter","full_description":"PeopleTec is currently seeking a Software Developer to support our Huntsville, AL location.-Our team is looking for an exceptionally motivated self-starting Software Developer with a deep background in software development. The candidate will provide hands-on technical leadership to our growing team of cyber, space, and engineering professionals who design, implement, test, and deploy cyber effects in a lab environment and develop a syndicated system integration lab. -Duties Include:Support planning, development, and execution of T&E development and operational test events for aviation systems Participate in technical working groups and discussions with respect to aviation programs' development efforts to remain cognizant of all system engineering and program aspects including program priorities, design, cost, and schedule. Support the development of the Test Strategy and/or Test and Evaluation Master Plan (TEMP) and participate in the T&E Working Integrated Product Team (IPT) Support the development of test and evaluation input into Milestone documentation such as the Systems Engineering Plan (SEP), Program Protection Plan (PPP), Systems Specification, Performance Work Statement (PWS and/or Statement of Work (SoW), and Source Selection Plan (SSP) Support test planning with the OEM and the Government Test Agencies to include the Army test community and its subordinates for developmental and operational test events Conduct developmental test tool survey and study of future test tool development to fill gaps Develop a tool development plan spanning all phases of test with an emphasis on integration of AI/ML to existing and new DT tools Employ Agile in all software development Utilize modular open system architecture (MOSA) principles, streamline integration and persistent test capabilities for Future Vertical Lift (FVL) and other Army Aviation stakeholders to provide common architectures for PMs to leverage in achieving the Army's intent of a modular modernized forceAssess architectures & designs early in the lifecycle to identify MOSA issuesAssess feasibility and utility of delivery and storage of digital twins of aviation systems' models-Required Skills/Experience:Familiarity with modular systems and open architecturesExperience using multiple analysis techniques from science, engineering, mathematics, statistics, or operations research to support DoD system design or procurement decisions Experience in the development and programming of mathematical models to represent actual system or subsystem hardware, processes, or employment strategies Proficient/experience in one or more of the following: Java, Python, C++, Monte Carlo simulation, AI/ML techniques, hypothesis testing, Analysis of Variance (ANOVA), high performance computing Networking experience with an exposure to communications/data links Exposure to developing algorithms, writing simulations, and analyzing key performance parameters associated with space/missile/aviation system design Technical and project leadership experience Excellent written and verbal communication skills Experience supporting the T&E and/or FVL communitiesTravel: 10%Must be a U.S. CitizenAn active DoD Secret clearance is required to perform this work. Candidates are required to have an active Secret clearance upon hire, and the ability to maintain this level of clearance during their employment.- Education Requirements:Bachelor's Degree in Computer Engineering, Electrical Engineering, Computer Science, Information Technology, or related field and 3 years experience-People First. Technology Always.PeopleTec, Inc. is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce.Culture: The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields.Career: At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people.Come Experience It. #cjpost #dpostEOE/Minorities/Females/Veterans/DisabledPeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, HR@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc.All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.Job Posted by ApplicantPro"}