{"title":"Polymer Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALkZubKtNI3mNKrphxCRD5ICQzbiVYynLPJXD2hKx_GkgC4qypFr2BRL7_ughV2vB7Pwa5lT3iQskgPTPf45ZvXWaj-rQwIPqrsmbFV4oB4grGZbW_Lq0K3PFGkmUcwWOKOrlqztyJh9geU7fe9661P0z9RT_psX1Af0r04TZetG0-jeb_pq6LeNeHczKQ","source":"ziprecruiter","full_description":"DescriptionSmall business with a 40 year history as a first class materials science applied research and development firm seeks chemist with experience in hands-on laboratory formulation and optimization of new, patentable, high performance polymer materials such as coatings, molding compounds, adhesives, resins, sealants, and foams. Candidate should have a proven track record of developing new materials. The role of this position is to develop new and next generation polymers. Candidate must be a self-starter, creative, and organized team player with excellent interpersonal and leadership skills. Company has an innovative, multi-disciplinary staff and flexible, intellectually stimulating environment. Position offers excellent quality of life in Austin, TX and an attractive benefits package. Salary is commensurate with experience.RequirementsRequirements - Education and Experience:BS Degree with a minimum of 5+ years of experience, or MS with 3+ years of experience, or entry level PhD in Chemistry, Materials Science, or other related disciplines. Experience in a Research and Development environment with chemical formulation a plus. Experience managing project/contract budgets and writing and winning research proposals is desired. The ability to obtain and maintain a U.S. Government Industrial Security clearance is mandatory.Desired Attributes, Skills, and Qualifications:Knowledge of industry practices and standards, with a particular focus on the fabrication, chemical formulation and testing of materials.Manage product and process development initiatives which require knowledge and expertise with advanced concepts in the field of chemistry and/or polymer science.Effective technical communication skills, interpersonal communication skills, presentation skills, and technical writing skills.Ability to set goals and tasks to effectively manage and execute multiple projects with competing deadlines.Demonstrated ability to solve technical problems by combining scientific knowledge and hands-on experiments to undertake specific tasks and projects.Project management experience in leading the scoping, costing, and scheduling of engineering projects.Successful in taking innovative technologies from the applied research stage to product development and ultimately to the commercial market.Experience interacting with industry and/or government research sponsors.Regularly detail and communicate results through laboratory notebooks, periodic project reports, and presentations.TRI Austin, Inc. is an Equal Opportunity Employer with a commitment to diversity. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, sexual orientation, gender identity, disability or veteran status. All individuals, regardless of personal characteristics, are encouraged to apply."}