{"title":"Senior Controls Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJvujgwxPFYIlwlABNSHRBjEo7Gq2IXWC6tWBNgNz_NcCyJ8_CrR-3LunzNC-RWV6Y8qIMcrioN8S5peMqjIaFuqFtn1QCZG92Rcx2mEdvqOL8JYoLL3vLiJoXdwEXcs0C53hH8TBJBblhJXegeSpX9TRjZ5KPO_HdZ-ef2TxXG1Sfi8htp7BroKIam3AmJ","source":"ziprecruiter","full_description":"At Trane Technologies we Challenge Possible. Our brands - including Trane and Thermo King  - create access to cooling and comfort in buildings and homes, transport and protect food and perishables, connect customers to elevated performance with less environmental impact, dramatically reduce energy demands and carbon emissions, and innovate with a better world in mind. We boldly challenge what's possible for a sustainable world.   Job Summary   This Senior Controls Hardware Engineer will develop embedded hardware designs for Trane Residential HVAC equipment.  Hardware designs consist of analog, digital, mixed-signal circuitry, and embedded microprocessors. Additionally, this position includes power electronics support and design for switching power supplies and motor drives. Core Job Responsibilities (others may be added):   Analyze and design electronic control circuit boards utilizing embedded microprocessors with analog and digital circuitry.  Design hardware to meet system, environmental, safety and EMC requirements.  Hardware designs using analog, digital, mixed signal circuitry, and embedded microprocessors.  Power electronics support/design for switching power supplies and motor drives.  Create and maintain hardware specifications for products.  Verification test planning to meet Trane's demanding quality and reliability requirements.  Perform root cause analysis and implement design changes to assure product integrity.  Interact with contract manufacturers, plant manufacturing and suppliers to provide a quality product.  Communications - wired and wireless Minimum Qualifications: Bachelor's Degree in Electrical Engineering and 5 years of hardware product development experience is required. Key Competencies: Experience using Altium PCB for board layout and schematic capture is a plus.  Experience with industrial networks and wireless technologies are a plus  Ability to analyze, design and document hardware designs.  Experience in the HVAC or appliance industries is a plus.  Willingness to learn new technologies and develop new platforms.  Need excellent collaboration and team communication skills.  Ability to communicate technical information to external suppliers and internal customers.  Proficient in speaking and writing in English.  We offer competitive compensation and comprehensive benefits and programs that help our employees thrive in both their professional and personal lives. We are proud of our winning culture which is inclusive and respectful at its core. We share passion for serving customers, caring for others, and boldly challenging what's possible for a sustainable world.  We are committed to achieving workforce diversity reflective of our communities. We are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identify, national origin, pregnancy, age, marital status, disability, status as a protected veteran, or any legally protected status."}