{"title":"iOS Developer - Vivofit Junior","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ3jLcp7kAmHrrUGZGoaeP-A4WPblrd_JIw7CYnfjEY8E8ae_BObZtnl46onlpmqv9-qfkSQQv7MM1LmViPAozegmR2JkVO-u5Ui3LNanl0Sy7qctDlCihXbPmye0neFSM9z-B9DKPeKw-Mwpy-hf7A6LVuZfQ0RWPdDzkG6qMPkkLaJmJwkw90kydhoQ4","source":"ziprecruiter","full_description":"Are you interested in working with a small team on an exciting product that parents and kids love? Do you like working on UI and middle or high-level software that interacts with web services and Bluetooth devices? Are you interested in investigating new technologies to create fun and engaging mobile app experiences? If you said yes to any of these, the Garmin Jr. team would love the opportunity to talk with you! \\n\\nWe are looking for a full time iOS Software Engineer 2 to join our team in Olathe, KS. In this role, you'll be responsible for architecting and developing well-designed, extensible solutions for our Garmin Jr. mobile app. Responsibilities include:\\n\\n\\n\\tDevelop software using Swift, Interface Builder, and Cocos2d-x\\n\\tUtilize tools in the software development process such as Git, Gerrit, Bitbucket, Jira, Confluence, Xcode, and Jenkins\\n\\tCreate and implement designs for software components within a larger project\\n\\tProvide technical leadership on software projects\\n\\tCollaborate across teams and other Garmin locations throughout the software development process, and add value through participation in peer code reviews\\n\\tProvide reliable solutions to a variety of problems using sound problem solving techniques\\n\\tPerform technical root cause analysis and outline corrective action for given problems\\n\\tMentor to less experienced software engineers\\n\\tEstimate level of effort, evaluate new options of similar technology, offer suggestions to improve processes\\n\\n\\n Qualified candidates for this role will possess a Bachelor of Science in Computer Science, Electrical Engineering, Computer Engineering, Aerospace Engineering, Math, or Physics from a four-year college or university and a cumulative minimum 3.0 GPA and a minimum of 1 year of software development experience.\\n\\n\\n\\tWork effectively and efficiently both on your own and in collaboration with teammates and other teams\\n\\tUnderstand the full software development lifecycle and capability to contribute to all stages\\n\\tStrong design and development skills, knowledge of common and modern architectural patterns and paradigms\\n\\tAbility to keep up with latest mobile app development trends and tools, provide technical advice and training on best practices to teammates and other teams\\n\\tDesire to create and maintain clean code, documentation, and test cases\\n\\tExcellent written and verbal communication skills\\n\\n\\nPreferred qualifications include:\\n\\n\\n\\tExperience creating native and responsive mobile apps and/or SDKs for either Android or iOS\\n\\tProficient with some of the following: Swift, Objective-C, Xcode, XCTest, Git, Bitbucket, GitHub, Jenkins, CocoaPods, Swift Package Manager\\n\\tExperience with Bluetooth/BLE, communication protocols\\n\\tFamiliarity with threading and synchronization (i.e. Dispatch Queues)\\n\\tExperience with automated testing, SDK development, CoreData/Databases, other common iOS platform and 3rd party mobile frameworks (UIKit, CoreBluetooth, CoreLocation, Network, NotificationCenter, Promises, etc)\\n\\tExperience in a wide variety of other technologies such as Python, C++, networking, software security, etc.\\n\\n\\nGarmin International is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran's status, age or disability.\\n\\n \\n\\n"}