{"title":"C# .Net Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALmWLgKj49dCCiKEkOlp-MMpRGFyPDzFreg6UZZB8ehZUdXYJkzGs-cvMTqwWu0JHLnBL9AzXMjhrXpTTDx8Q5oHcjkpPtXohDA0B4TL8uNzVvzV8zwxUBr3n1U-KZMvx69yhKp61jetHNESE-TKth8GfoRKd0FUoWubRhGMoYQ1vYd5h0rzw5zuakjFzjK","source":"ziprecruiter","full_description":".NET C# Remote opening this is a Direct Hire position for one of our preferred clients, a leader in the Software space! 110 K a year to 130 K a year Responsibilities and DutiesDesign and code new features and enhancements, and troubleshoot production issuesWork with Microsoft technologies, primarily in C#Develop tools and practices that will increase the efficiency of your teamWork with Microsoft Azure DevOps for task tracking, source control, etc.Work with industry partners to bring their services to our productsFollow established procedures, version control, and coding standardsComplete thorough unit and integration testingFollow agile development practicesWork collaboratively and cohesively in a great team environmentSkill RequirementsMicrosoft C#.NET experience, 4 or more years of hands-on development and design experienceStrong Object-Oriented development skills and knowledge of design patternsExperience with SOAP-based Web Services, XML and JSONExperience in WinForms development is highly desiredStrong SQL Server experience is requiredStrong skills in unit testing, integration testing using frameworks like MSTest and NUnitStrong Agile/Scrum development process experienceQuick learner, self-starter with strong troubleshooting and communication skillsStrong customer service skills and ability to work in team environmentMust exhibit a high-level of analytical and problem-solving skills, and attention to detailExperience with WCF, NHibernate and Windows Workflow a plusExperience with multi-tier/distributed systems a plusBe creative! Jeff Nevez | Strategic RecruiterAlliance of Professionals & Consultants, Inc.Office (919) 582-5939 /Cell 405-343-3575 | jnevez@apcinc.comwww.apcinc.com | www.linkedin.com/in/jeffnevez"}