{"title":"Tooling Engineer NEW!","location":"","salary":"","description":"","term":"$70,000 to $80,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKCEOHlfyXmqAKRvnEoqjX5aU_fYfv8FM8QunJhkLC0teT3rtR46fR5BwXCjS9UIPCKh26I5Kp44HhNFh3ox78pxOaXNaDfM26oTo3ZWm7UErkKgiXf1AkaXVustvcvMipnVAAaSkl1O0qND5PdfLgVDpGIyVtiA3VcFhEtYhefCsC8erGW3WmheX3uqMI","source":"ziprecruiter","full_description":"Are you an experienced design engineer looking for a new opportunity?Do you want to climb the ladder within a fast-growing and reputable company with a global network?Keep reading! Our client is looking for an experienced Tool Design Engineer to work with their sales and marketing team to design and develop tooling to meet customer requirements. The ideal candidate will have experience in mechanical design, engineering thermoplastic materials, systematic processing approaches to engineering custom solutions, design improvement, and vendor relations.About Our ClientOur client is a glass, plastic, and steel manufacturer operating nationally and distributing their products globally. They are a family-owned corporation that focuses on the well being of their employees offering a healthy work-life balance. Located in Northeast Ohio, this is a great opportunity to work for a multi-million dollar corporation right in your own backyard and establish a lasting career.Job Functions:Design and oversee all new tool builds and equipment for production to meet customer specifications; ensure tools are delivered to internal requirements and best practices within timelines.Participate in multi-team design and feasibility review to understand the product design intention and manufacturing processes.Participate in tooling construction problem solving efforts through zero series commissioning.Run and support projects ranging from tooling improvements to new product development to ensure design for manufacturability and a flawless production launch.Develop, evaluate and improve tooling methodology including documenting into specifications, standard work processes, and tracking metrics.Investigate and set up a local supply chain for tooling; identify, negotiate and build long term partnerships; responsible for vendor management – daily interaction, training on specifications, repairs, and meets our standards and technological capability.Conduct fluid flow simulations as per the specifications and be abreast of new technology in the market.Support capital investment process through participation in setting strategy, defining projects, and executing upon assignments. Purchase capital aligned with the budget and internal standards.Collaborate with global colleagues to ensure best practices are met; open to travel to explore and learn Technoform tooling technology and leverage expertise.Requirements:Education Bachelor’s degree in mechanical engineering or equivalent5+ years of experience in tooling design, extrusion, capital purchasing, and project managementComputer Skills: Microsoft Office 365, Solid Works, AutoCADStrong written and oral communication skillsSelf-motivatedAbility to lead projects and initiativesEntrepreneurial mindsetStrong attention to detailsAbility to wear many hatsWe are an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status."}