{"title":"Hardware Engineer 2","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKGrSSdyWxZgBEylWSnDpCcHvk5tH4w6uX2YbCDgoSxgAJDxcirU_4pICbg9cba9VHMeVHbCn9WoycRbsJgHX-RY-iYw3b-9iNcJJZkB5Ibw406i-TxYKfpiG4o7TFhW5jTIV8htMGnUU_6KHJqOw-g8E4kGCSSH0OM2XVRieYE1_8f6WSF2FSvKVWdQLo","source":"ziprecruiter","full_description":"Come join us in blazing the trail for FPGA-based AI acceleration at datacenter scale! By leveraging the huge amounts of fine-grained parallelism delivered by current and future FPGAs, reconfigurable computing can radically accelerate many types of computations. We are applying this technology to challenging applications important to Microsoft and our customers, including but not limited to Bing search. Our work includes developing, optimizing, deploying, and maintaining FPGA accelerators, infrastructure, and tools.Our current focus is on accelerating deep neural networks (DNNs) via the Brainwave accelerator architecture. We are heavily involved in developing, extending, and deploying Brainwave, and in bringing DNN models to production on FPGAs using Brainwave. Working with Microsoft model developers to deploy their models on Brainwave gives us the unusual opportunity of working across the whole DNN stack, from cutting-edge DNN models, techniques, and frameworks to accelerator architecture.This cutting-edge development takes place in the context of a live, global-scale distributed system that touches millions of users daily, running on the world's largest distributed FPGA-accelerated hardware platform.**Responsibilities** Develop, maintain, and extend high-performance FPGA-based computing applications. Deploy and maintain systems to meet significant reliability and service level requirements. Work in a team of hardware and software engineers to deploy working systems to a very large user base. Collaborate closely with other product groups, including Office and Azure.**Qualifications**Required Qualifications: A solid computer engineering background (MS or PhD in computer engineering or related field, or 2+ years of industry experience) Experience with FPGA application RTL design (Verilog, SystemVerilog, or VHDL) and FPGA-based systems, beyond course work (e.g., industry experience or a large multi-term research project)Preferred Qualifications: Experience in system-level design, especially in high-performance, distributed and/or fault-tolerant systems. Software development experience, particularly high-performance C/C++ system software. Familiarity with neural networks and related frameworks and algorithms.Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form (https://careers.microsoft.com/us/en/accommodationrequest) .Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\\#WebXTPlatform#"}