{"title":"Senior Hardware Development Manager","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALc2zqWCKaiVKqLOIP7soZY4Utmz1KpfuxYNBQxYBfT8_2mj6pAcWqbOH8zmT3dhVBeLQns8zwJWu_m9mkBuBhfMohXfjtX6vBhHy-BPqIiv35PXo4-2dVcdhQKCLTFcCjHRfA9lRh6gv4cnz_xUjkZp2H8fvTt7U-HNqoDb61OZhNF57UPLYZlZTRbr2oC","source":"ziprecruiter","full_description":"Amazon Web Services (AWS) Hardware Engineering team creates compute and storage server designs for Amazon's web services. Our engineers work with leading edge technologies, solve challenging problems, influence the industry's roadmaps, and develop new and unique solutions that are ahead of the pack. We work in an environment that fosters innovation and creativity. We encourage and invest in new directions and new ideas that will serve our customers better. We sometimes fail, but we learn from such failures and we improve. It is because of the team and our constant focus on the customers, that we are able to develop creative and new designs that set the standards on performance, quality, cost, and operational excellence.What you will do:As a member of the Server Hardware Engineering team you will lead a team of hardware engineers engaged in the design and development of various server products utilizing a wide range of technologies, design, and manufacturing partners. You will work closely with your customers to understand their short and long term business goals and product needs. You and your team will work with an interdisciplinary team across components, firmware, test, and qualification, along with external suppliers and design partners to develop, deploy at scale, and provide ongoing operational support for the servers you develop. You will provide technology thought leadership to both the hardware engineering team and our customers, identifying long term trends and how these can be intercepted in our products for the benefit of our customers. You will build your team through the identification and hiring of critical talent, and you will enable your team members to grow through mentoring and challenging assignments.This is a fast-paced, intellectually challenging position with significant impact on the future of the cloud. You will have high standards for yourself and everyone you work with, you will be constantly looking for ways to improve your products' performance, quality, and cost. You will be responsible not for just delivering products to the roadmap, but also continuously raise the bar on how we develop products.We're changing an industry, and we want individuals who are ready for this challenge and want to reach beyond what is possible today.Why you will love it: You will work directly with engineers and product owners across the company to create next-generation hardware. You will have a direct impact on our bottom line and the ability to deliver improvements for our customers. You will be part of a growing, fast paced, and fun team. You will have ownership for the implementation of your work. You will help to change the world by enabling customers to achieve their dreams and ambitions."}