{"title":"SDET (Software Development Engineer in Test (REMOTE) NEW!","location":"","salary":"","description":"","term":"$110,000 to $120,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKLNH8-D5i2mauGonfxyxZlpxyxTjnvTH7ylb8Er25jNVbE6T-EhSO1JJ0lif3p4IdDAQe-iyjLsm_ISkRWVB6kNZm0lJx8Y2IkRE8P7LZMkOiiazBY3CqGPwbFSy-X02SDrfIIPEhTrzd1AZn7J0kzVCaWfMiVtboa8RHkr7vWKvmO60fB0mE2R0_Ojvpb","source":"ziprecruiter","full_description":"Title: SDET ( Software Development Engineer in Test)Location: REMOTE (FL, NC, GA, TN, TX, CO, Hawaii, VA)Type: Direct/Full TimeWe are seeking a highly driven and effective SDET for our client. Our client has a reputation for hiring some of the most talented developers and SDET engineers in Tampa. They are passionate and believe in the value of Team, Comradery amongst team mates and sharing best practices so everyone can be better!!If this sounds like a team you are interested in being a part of, you should apply ASAP!Overview:Deep experience in integrating a strong software development background with a passion for the discipline of quality assurance.o Develop and mature automated test frameworks for desktop, web, and native mobile apps and API’so Design test cases and execute all types of testing (e.g. functional, integration, end-to-end) on all variety of platforms (e.g. mobile, web, portal frameworks)o Work closely with the Scrum team throughout a project to continually monitor and provide feedback on the quality of the producto Produce test estimates for testing activitieso Produce status reports and quality metricso Participate in test case reviews and ensure requirements traceability, proper coverageo Participate in selecting and configuring appropriate toolsets to support the quality assurance disciplineo Work with product and discipline leadership to develop and evolve operational metrics and reporting frameworks to drive operational execution, transparency and efficiencyo Be an active participate in all aspects of test planning and execution through all phases of the product development lifecycle, including testing strategies, and communicationSkills & Competencieso Strong team player with ability to collaborate with all levels of the organizationo Strong analytical and problem-solving skills with a high aptitude to learno  6+ years of professional coding experience in C#, JavaScript or Typescripto 6+ years of experience using any of the following IDE or BBD tools (SpecFlow, Cucumber, Visual Studio, Visual Studio Code, etc.)o 4+ years UI Test automation experience with (Selenium and Protractor)o 4+ years of Desktop automation experience (Ranorex, Test Complete, etc.)o 4+ years of hands-on working experience of testing REST, Web APIs or SOAP APIs (ASP.Net, Karate, MSTest, NUnit, Postman, and SoapUI)o Expertise in SQL programming (queries, joins, etc.)o Experience in all phases of the software and testing lifecycle, inception through deploymento Diverse experiences in leading test strategy, test planning, test case design, and executiono Delivery input within Agile methodology projects (e.g., Scrum)o Proficiency using standard test management tools (Azure DevOps)Education or Prior Work Experience· Bachelor’s in computer science (or relevant degree) with 4 years of experience· AWS Certified Cloud Architect or Practitioner – (Desired)· Certified Software Test Automation Specialist (CSTAS) – (Desired)"}