{"title":"System Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKK9j_2hJBDPz35LXpd8UfDRKlPQ9Audyge7feQFKodNWutden9Rdd6yh01i-fjTGW6DrXEp4_brKol72uyHebLYUN4UMTVaO4KgdCS1R5sMmBtk-OTXxn9WqNp4fbAJzTD24LcSKj3SfJFH3nEMFBw7Hw7eR9z2YWHmSYxA_6VRbIrpTlspWM65ih4vjY","source":"ziprecruiter","full_description":"Brief Description:Maintain and manage the system environment; including but not limited to upgrades of server operating systems, fully own and manage the active directory environment, assist in planning and designing of System installations, administration of the SAN environment, Maintain and upgrade the network environment. Work with others to be successful with projects, issues, and other items as they arise.Responsibilities:Installation, configuration and administration of mission critical applications operating on Windows/Linux servers in both on and off-premises environments.Formulate system architectures and develop supporting implementation plans.Develop, publish, and maintain technical system documentation.Knowledge of IT change management methodologies and independent verification and validation processes for IT systems.Evaluate engineering change proposals against baselines and processes.Implementation and maintenance of system security configurations in accordance with industry standards.Installation of application upgrades and patches in test and production environments.Conduct vendor evaluations and make recommendations to management.Monitors and maintains onsite servers, operating systems, backup systems, and virtualization.Maintains user network: cabled and wireless, LAN, WAN, VPN, remote access, active directory for user management.Ability to solve problems in a collaborative and mutual manner based upon the needs of multiple parties.Monitor hardware and supporting software for the purpose of ensuring that resources are available and utilized effectivelyCoordinate work assignments with other subject-matter experts.Provide technical support and customer service directly to end users through the use of a ticketing system, telephone, electronic communication, and remote screen sharing.Troubleshooting, diagnosis and timely resolution of system problems and issues engaging vendor support when appropriate.Requirements:Experience - Two plus years of general IT experience and three plus years in a Systems Engineer/Data Center RollGood understanding of computer systems, mobile devices, Windows Server Products, and Networking EquipmentExperience with Windows Server OS, Active Directory, Microsoft ExchangeAbility to diagnose and resolve technical issuesExcellent communication skillsCustomer and team-orientatedPreferred RequirementsAssociate degree in computer science, management information system, business, or a related field.Technology certifications (A+, Net+, MCP, CCNA, MCSE)Experience with VMWareExperience with Cisco NetworksExperience with SAN supportExperience supporting users at remote locations.EducationMust possess high school diploma or equivalent. College degree or certifications a plus but not required.Additional NotesThis job description in no way states or implies that these are the only duties to be performed by this employee. The Systems Engineer will be required to follow any other instructions and to perform any other related duties as assigned by the appropriate manager. The Tire Rack, Inc. reserves the right to update, revise or change this job description and related duties at any time."}