{"title":"Analyst I, Technical Operations Center NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJwe5tXECmWwyAMpOXJAMFLPZ_jNsB796gZP5pxcFAVrkHOTB9XeJDyERoX9PVzq53OtN4Oce6BzZD1wE6_1M8_kKG8LbCexRSzdqvFW1zPi3gvXUZoLgF0vAB84d9wGy_aCcgeCYoAJsvIaONaq8L4uSDvgzCgp0iTkXo_pzK_Eie4jcqRE28AZFVD3HVn","source":"ziprecruiter","full_description":"Job Title: Analyst I, Technical Operations Center Job Description: Provide customer service focused technical and operational support to theatre management for all aspects of the Sight & Sound experience.Identify, communicate, and support operational issues by following predefined processes and using proactive monitoring systems.Partner with field support team to document and maintain field and remote knowledge and processesComplete projects assigned by TOC manager and/or Supervisors (e.g., software/firmware deployment, strategic initiative support, process documentation, field-facing communication, etc.)AMC team members enjoy a very competitive benefits package that includes medical/dental/vision coverage, 401(k) match, accrued vacation/absentee time, an open and casual work environment equipped with Coca-Cola Freestyle machines, half off eats and drinks at the theatre, and most importantly for us movie people...FREE movies at any of our 600+ theatres nationwide!AMC's company culture is focused on innovation and diversity to ensure that we provide the latest and greatest experience for our guests and associates. We lead by example in doing what is right and take responsibility for our own results and our company's success. Our open work environment promotes teamwork and unscripted conversations, resulting in fast solutions and therefore, better outcomes.We appreciate your interest in AMC and look forward to seeing you at the movies! AMC and its subsidiaries are committed to equal employment opportunity and complies with all applicable federal, state, and local employment laws. AMC strictly prohibits and does not tolerate discrimination and will provide equal employment opportunities to all applicants without regard to an applicant's race, color, religion, creed, gender, sex (including pregnancy), sexual orientation, gender identity or expression, national origin, age, disability, military status, veteran status, genetic information, or any other reason prohibited by applicable federal, state, or local law, regulation, or ordinance. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, promotion, discipline, compensation, benefits, and termination of employment. Job ID: 25079BR Department: DTDS Support Services Pay Rate Type: Hourly Employment Status: Full Time Relocation Eligibility: No Minimum Job Requirements: KNOWLEDGE, SKILLS AND ABILITIESCustomer ServicePC SupportMicrosoft OfficeHelp Desk's ticketing system, DSSP, or similar ticketing systemRemote Desktop systemsExceptional customer serviceAvailable to work on the weekends, at night, and on holidaysExperience following predefined technical tasks.Experience with computers, Point of Service systems, and networksRemote desktop (or similar) troubleshooting toolsAbility to work with little supervisionMINIMUM EDUCATIONAL REQUIREMENTSCertificate programs for computer hardware and software training or commensurate experienceCertificate program training to fulfill digital projection warranty agreements/requirements or commensurate experienceMINIMUM TRAINING REQUIREMENTSThorough knowledge of MS Word and Windows operating systemsMINIMUM EXPERIENCE REQUIREMENTS2+ years experience in remote resolution and ticketing system usage and/or 2+ years theatre management experience2+ years experience in troubleshooting of operating systems/hardware and/or 2+ years troubleshooting digital cinema equipmentBasic understanding of database systems2+ years customer serviceExceptional communication skills including technical writing aptitudeAbout AMC: AMC amazing. That's the promise we deliver to nearly 35,000 associates, 240 million guests domestically, and 350 million guests worldwide each year. AMC has propelled industry innovation since 1920, and we continue to innovate by delivering premium sight and sound, new and improved food and beverage options, and diverse content in our state-of-the-art theatres. We focus on delivering friendly, superior service to our guests. We lead by example, have fun, and give back to the communities in which we live and work. If you feel motivated and energized by our culture, and if you can name your three favorite movies in the next 30 seconds, then AMC may be the right place for you. We offer competitive compensation, excellent benefits, and an environment that encourages teamwork, inclusion, collaboration, and results.Job Summary: Provide technical and operational support for all Sight & Sound systems by following predefined processes and ensuring a high level of customer service and exceptional time management.  Location Address: One AMC Way, 11500 Ash Street, Leawood, KS 66211"}