{"title":"Network Engineer - I NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIgBai4egyyxqXDb9Ny3NOKFVp6w4Y4V9w5IpQVcbIIPwrf9_RMXAT7yLlfpbGBqOqOwK6Rjtx8WVGD6RYx0gcB1_xkO5GtQmcTMvAlrS_vYyk23kxMdBxGisdwq-hC03X_BHaKcNwNH74QeGcZjqRLTu-JD2sf8U4xpQAEKHwvUhSCoTDaX5AW_SxxpbjN","source":"ziprecruiter","full_description":"Network Engineer - I in Cary, NC at APEX Systems Date Posted: 1/22/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: Cary, NC + Job Type:Other + Experience:Not Specified + Date Posted:1/22/2019Job DescriptionJob #: 924298 Apex Systems is searching for Entry Level Network Engineers for a position based in Cary, NC If Interested: Please send an updated copy of your resume to slindsey@apexsystems.com with a phone number where you can be reached. **Due to volume of applicants, only qualified individuals will be contacted.The primary goal of this position is provide an entry level opportunity to be a network engineer in the support of the Managed Services Infrastructure. Responsibilities include a wide range of activities including the architecture, planning, implementation, design, capacity management and operational support for the routing and switching platforms supporting Verizon Managed Services applications and tools. This engineer will be trained to resolve user level tickets and understand the issues behind them. This position will also participate in project related activities to include requirements gathering, solution analysis and supporting principal level engineers. You will collaborate with Operations Systems Support, Infrastructure, Project teams, IT, Operations and Product teams. Activities including but not limited to Change, Incident, Problem and Risk Management. This position offers the opportunity for new hires to get hands-on experience with Cisco routing and switching equipment. In addition, to gaining technical experience, candidates would gain a practical understanding of compliancy standards like SOC and PCI. What you will be working on: Cisco router and switch configuration, implementation and troubleshooting. Project management of new equipment deployments and product solutions. New technology assessments and integration. You need to have: Bachelor's degree or one or more years of work experience in networking or cybersecurity technology. Basic level knowledge of WAN and LAN technologies. Entry level understanding of configuration for routing protocols and switching. Understanding of TCP/IP and other networking protocols. Candidate must be eligible to obtain and maintain a government security clearance. Must be a motivated self-starter with an interest in new technology and eager to learn. Able to thrive in a fast-paced environment where new challenges come up every day. You are flexible, dependable and work well in varying environments. Flexibility - with work hours, as position may be required to work an off-shift or on-call. Even better if you have: Bachelor's degree in Network Engineering. Knowledge and ability to communicate on an entry level on network management platforms, applications and protocols. Excellent communications skills and ability to deliver results under pressure. Experience with Cisco networking equipment, common network security practices, networking standards and troubleshooting. EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}