{"title":"Chemist - Chemist | Architect-Engineer (A-E) Services NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALEKRQB7yG7hjrEUU2hmyqV60dFC9C07ZG85wCh3nAGe8XlzMXyDYsXH8fZjG6ZIFAlWXU1IhrHU2Jagm30AKkSGc2Zldh3E_K2WP9xOuSXbzQPfnpBNhh_PgDrjPjMXNqJlobRVRggmC8Ksd_PBOpa3XKj6IYth8JP-a0MKhjEzABBV6LfJKqHrjDnpjmh","source":"ziprecruiter","full_description":"Company Description ProSidian is a Management and Operations Consulting Services Firm focusing on providing value to clients through tailored solutions based on industry leading practices.  ProSidian services focus on the broad spectrum of Risk Management, Compliance, Business Process, IT Effectiveness, Energy & Sustainability, and Talent Management.  We help forward thinking clients solve problems and improve operations. Launched by former Big 4 Management Consultants; our multidisciplinary teams bring together the talents of nearly 190 professionals nationally to complete a wide variety of engagements for Private Companies, Fortune 1,000 Enterprises, and Government Agencies of all sizes.  Our Services are deployed across the enterprise, target drivers of economic profit (growth, margin and efficiency), and are aligned at the intersections of assets, processes, policies and people delivering value. ProSidian clients represent a broad spectrum of industries to include but are not limited to Energy, Manufacturing, Chemical, Retail, Healthcare, Telecommunications, Hospitality, Pharmaceuticals, Banking & Financial Services, Transportation, Federal and State Government Agencies.  Learn More About ProSidian Consulting at www.ProSidian.com. Job Description  This Non-Exempt | Full-Time position currently best aligns with the Chemist Labor Category and ideal candidates exhibit the ability to visualize, analyze, and convert data and experiences to meet performance challenges while confidently engaging in productive \"Jugaad\" and dialogue targeting mission success.  ProSidian Team Members work to provide support for a variety of A-E services and environmental support projects nationwide. work may include but not be limited to assignments on a wide variety of Hazardous, Toxic, and Radiological (HTRW) sites in addition to other environmental sites in a manner that complies with federal, state, and local regulations and laws, and within timeframes required.  The A-E services required will include professional services to support military and civil environmental programs for several federal agencies including but not limited to the Army, Army Reserves, National Guard, Air Force, Navy, Marine Corps, Defense Logistics Agency, other Department of Defense Services, the Environmental Protection Agency (EPA) and other Federal Agencies. Chemist - Chemist | Architect-Engineer (A-E) Services Candidates shall work to support requirements for Enter GSA SIN and provide support for a variety of A-E services and environmental support projects nationwide. work may include but not be limited to assignments on a wide variety of Hazardous, Toxic, and Radiological (HTRW) sites in addition to other environmental sites in a manner that complies with federal, state, and local regulations and laws, and within timeframes required.  The A-E services required will include professional services to support military and civil environmental programs for several federal agencies including but not limited to the Army, Army Reserves, National Guard, Air Force, Navy, Marine Corps, Defense Logistics Agency, other Department of Defense Services, the Environmental Protection Agency (EPA) and other Federal Agencies. participate and support project requirements for  Environmental Engineering and Architectural Engineering (A-E) Services required including but not limited to: performing environmental studies, designs, and general support of environmental issues under Resource Conservation and Recovery Act (RCRA), Comprehensive Environmental Response, Compensation, and Liability Act (CERCLA), Superfund Amendments and Reauthorization Act (SARA), Toxic Substances Control Act (TSCA), Clean Water Act (CWA) and other federal programs; performing environmental studies, designs, and general support of environmental issues under State and Local environmental laws and regulations.conducting site investigations and assessments; remedial investigations/feasibility studies; remedial designsfeasibility and other engineering studies and reports; preparing Environmental Condition of Property reports;performing National Environmental Policy Act (NEPA) analyses and documentation; conducting archaeological investigations and mitigationbiological evaluations and assessments; performing wetlands determinations and mitigation studies; groundwater and other modelingcontaminant fate and transport analysis; surveying and mapping; community relations; resource and regulatory agency coordination; construction-phase services (engineering-design during construction, checking shop drawings); preparation of plans and specificationsvalue engineering screenings and studies; sustainability screenings and studies; evaluation of reasonably foreseeable renewable energy sources; pilot studies; performing human health and ecological risk assessments; hazard evaluationsfield inspections; developing Data Quality Objectives (DQOs); chemical QA/QC; conducting surface/subsurface soil, sediment, and rock sampling/testingsubsurface exploration; water sampling/testing; conducting laboratory analyses (water, soil, lead paint, asbestos, etc.); cost estimating and engineering;working on a variety of hazardous waste and other environmental type projects, including radioactive and mixed waste, energy conservation, sustainable remediation, pollution prevention, waste reduction, reuse of recovered materials, underground storage tanks and fueling systems, habitat restoration and mitigation, and sites potentially contaminated with military munitions.  The munitions services consist of conducting preliminary assessments, site inspections, remedial investigations, and feasibility studies. For on-site investigations, firms must provide personnel with current health and safety training, as required by the Occupational Safety and Health Administration (OSHA) and adhere to all USACE requirements for Health and Safety. #TechnicalCrossCuttingJobs #ArchitectEngineerJobs #EngineeringJobs #Jugaad  Qualifications The Chemist - Chemist | Architect-Engineer (A-E) Services shall have consecutive employment in a position with comparable responsibilities within the past five (5) years, Must be able to use a computer to communicate via email; and proficient in Microsoft Office Products (Word/Excel/PowerPoint) and related tools and technology required for the position.  Work products shall be thorough, accurate, appropriately documented, and comply with established criteria. All employees, in the performance of their respective responsibilities, shall conduct themselves in the highest possible standards of ethical and business conduct. Bachelor's degree in chemistry (preferred) or environmental sciences, 5+ years experience. TRAVEL:  Occasional travel may be required to attend meetings, events, site visits, or other training requirements.  Travel is coordinated with the technical point of contact and approved in writing by the Contracting Officer in advance, is allowed, in accordance with Federal Travel Regulations.  LOCATION:  Work shall be conducted at or in proximity to CONUS - IL, IN, KY, MI, OH, WV, PA, VA, NC, MN, NY, TN U.S.  Citizenship Required - You must be a United States CitizenExcellent oral and written communication skills (This employer participates in the e-Verify program)Proficient with Microsoft Office Products (Microsoft Word, Excel, PowerPoint, Publisher, & Adobe)All ProSidian staff must be determined eligible for a \"Facility Access Authorization\" (also referred to as an \"Employment Authorization\") by the USG's designated Security Office. #TechnicalCrossCuttingJobs #ArchitectEngineerJobs #EngineeringJobs #Jugaad Additional Information CORE COMPETENCIES* Teamwork - ability to foster teamwork collaboratively as a participant, and effectively as a team leader* Leadership - ability to guide and lead colleagues on projects and initiatives* Business Acumen - understanding and insight into how organizations perform, including business processes, data, systems, and people* Communication - ability to effectively communicate to stakeholders of all levels orally and in writing* Motivation - persistent in pursuit of quality and optimal client and company solutions* Agility - ability to quickly understand and transition between different projects, concepts, initiatives, or work streams* Judgment - exercises prudence and insight in decision-making process while mindful of other stakeholders and long-term ramifications* Organization - ability to manage projects and activity, and prioritize tasks------------  ------------  ------------OTHER REQUIREMENTS* Business Tools - understanding and proficiency with business tools and technology, including Microsoft Office.  The ideal candidate is advanced with Excel, Access, Outlook, PowerPoint and Word, and proficient with Adobe Acrobat, data analytic tools, and Visio with the ability to quickly learn other tools as necessary.* Business Tools - understanding and profici..."}