{"title":"Software Developer 4 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ7dnO0CogFz9vGtPIohtEnbJ5vbY7hzse5VmgjIwsFYORUzn-1-Cou-O_HdHPvKT9cncW-kXndmZuggt2u7Ifat_e7RB5op-yDHxj4em6D-wn0CJc5lpmUSKYbUEYm3j5cxeX3IJSjF1VH36byrFsLbJYPHnsu3JHHwlpn4ybCr96qu11TrfEbv9OF-wqf","source":"ziprecruiter","full_description":"Preferred QualificationsPreferred QualificationsDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc. As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.Education Preferable : Bachelor's degree in Computer Science, Engineering, Information Technology, or related technical fieldSkills :   Working knowledge with Linux and internals    Experience with Oracle databases, Administration of Oracle databases    Experience with Perl, Python or Shell is preferred    Experience with Oracle Real Application Clusters    Experience with Oracle Exadata is recommended. Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law."}