{"title":"Sr. Quality Control Associate, Chromatography/Wet Chemistry NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALioyylllsdPES7vZB6MbWYaYyuyq0cbTESpFWi5P4ko_rE_P-fVp1DbuZ3T9HdYsnv52qe4FDZ_1oAHINznovDA7ZuhhsqvGI0S2HZYRrTb3revHrrfhF-O1W-k2doAndpoSF9jeppUQoPkgFZ1NRfSrnqxGNh0Xj0GN5L6K0CjuXhTrjaHXVWU5192HSr","source":"ziprecruiter","full_description":"Sr. Quality Control Associate, Chromatography/Wet Chemistry Sr. Quality Control Associate, Chromatography/Wet Chemistry This position will support clinical and commercial development and analyses of monoclonal antibodies. It requires having a good understanding of the functional and structural characteristics of monoclonal antibodies and several years of hands-on experience performing analytical chemistry, HPLC and capillary electrophoresis assays on antibodies.The position requires management of QC activities and testing at various contract organizations, where he/she will play a key role ensuring QC testing and test results for chromatographic, electrophoretic and other needed data is generated promptly and accurately by planning ahead and continuously tracking activities between OMEROS and the contract organization(s).Other related responsibilities include review and maintenance of data associated with cGMP release and stability testing of drug substance and drug product. Supporting analytical transfer activities, validation, troubleshooting, investigations and lifecycle management of analytical methods, as well as establishing internal best practices. The management of stability programs and small molecule experience is a big plus.  Good things are happening at Omeros! Come join our Omeros CMC Team!  Who is Omeros?  Omeros is a commercial-stage biopharmaceutical company committed to discovering, developing and commercializing small-molecule and protein therapeutics for large-market and orphan indications targeting inflammation, complement-mediated diseases, disorders of the central nervous system and immune-related diseases, including cancers. In addition to its commercial product OMIDRIA (phenylephrine and ketorolac intraocular solution) 1%/0.3%, Omeros has multiple phase 3 and phase 2 clinical-stage development programs focused on complement-mediated disorders and substance abuse. Omeros also has a diverse group of preclinical programs including GPR174, a novel target in immuno-oncology that modulates a new cancer immunity axis recently discovered by Omeros. Small-molecule inhibitors of GPR174 are part of Omeros' proprietary G proteincoupled receptor (GPCR) platform through which it controls 54 new GPCR drug targets and their corresponding compounds. The company also exclusively possesses a novel antibody-generating platform.  What are your job responsibilities?  Your responsibilities in this position will include: Support in-process, release and stability testing of clinical and commercial drug substance and drug product at contract organizationsReview of Chromatographic, electrophoretic and other QC test data to support GMP manufacturing and release of drug substance and drug product lotsTrack QC activities; follow up on deliverables and resolve pending issuesHelp identify problems and assist with investigations and their resolutionTracking, trending and maintenance of standards, controls and critical reagents; in-house or at contract labsProvide internal and external QC support to help establish and monitor assay control trending chartsSupport setting specificationsWrite and review protocols and reportsWrite and revise SOPsEnsure compliance with all applicable regulatory guidelinesOther duties as assigned What education and experience do you need? BS or MS degree in Biochemistry, Analytical Chemistry or related field8+ years of pharmaceutical industry experience5+ years in a QC GMP environment with a minimum of 3 years of commercial product testing experienceManagement of QC stability program is a big plusSmall molecule experience is also a plus What knowledge, skills and abilities does our ideal candidate have? Working knowledge of monoclonal antibodies and large molecule biologicsHands on HPLC experience (affinity, CIEX, SEC, RP)Hands on Capillary Electrophoresis (CE) equipment and testing experience (CZE, CE-SDS, cIEF)Spectrophotometric determination of protein concentrationWet chemistry techniquesUSP, EP, JP Compendia testing (Appearance, pH, Osmolality, Particulate)Experience with Deviations and OOS investigations; CAPA and Change ControlsGood knowledge of ICH, FDA, EU guidelines and regulationsExcellent written and verbal communication skills Behavioral Competencies we are seeking: Energetic, proactive and self-motivatedExcellent attention to detailGood listener and communicatorDemonstrated problem-solving and multi-tasking abilitiesAbility to build and maintain positive and collaborative relationships across functional areas, with management, peers and external partnersWell organized, detail oriented and deadline drivenSelf-motivated and adaptable to changing prioritiesAble to function well in a fast-paced environment and under pressure Other things you'll need to know: Intermittent physical activity including bending, reaching, pushing, pulling, or lifting up to 40 lbs. May encounter prolonged periods of sitting or standingThis position requires working around hazardous materials  If you have the experience, skills and knowledge we are seeking, we'd love to hear from you! This is an exciting opportunity for the right person! Omeros is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to status as a protected veteran or a qualified individual with a disability, or other protected status such as race, religion, color, national origin, sex, age, marital status, or any other factor determined to be unlawful by federal, state, or local statutes. It is our policy to ..."}