{"title":"Hardware Development Engineer II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK5_3RawD2vH4KdOfbA3nMt8tlXW6CS_LusWeTDifu63tYA7yUdk-C5bVeqD9aSxA-EpNInU78Krmcpnt4rVOa9jumqB8vjEJwfXvRcDs1g_CT_euFPGKfhBQgmraxS5k-yVDsMV1EuojEMKbtainng7jSTXc7v2uY13bYE9QL-zoVx263tJAKu3wThWBzK","source":"ziprecruiter","full_description":"The Team: Amazon Go is a new kind of store with no lines and no checkout. You simply use the Amazon Go app to enter the store, take what you want from our selection of fresh, delicious meals and grocery essentials, and go.Our checkout-free shopping experience is made possible by our Just Walk Out Technology. It automatically detects when products are taken from or returned to the shelves and keeps track of them in a virtual cart. When you're done shopping, you just leave the store. Shortly after, we'll charge your Amazon account and send you a receipt. Check it out at amazon.com/go. Designed and custom-built by Amazonians, our technology uses computer vision, sensor fusion, and advanced machine learning. Innovation is part of our DNA. We need people who want to join a high-reaching program that continues to collaborate and push the state of the art hardware design. We are looking for excellent engineers that epitomize technical and operational excellence - that can drive innovation and apply state-of-the-art technologies to solve real world challenges. As an experienced Hardware Design Engineer within our team, you will engage with a skilled and accomplished cross-disciplinary staff to conceive and design innovative technologies. You will collaborate with internal and external stakeholders to drive key aspects of technology solution definition, execution and validation. Full cycle product development experience from inception through maturity is important. Working simultaneously on projects in different phases is common; you are able to demonstrate strong design and validation skills in addition to the understanding of mechanics of ongoing operational excellence and product support. You are responsive, flexible, and able to succeed within an open collaborative peer environment."}