{"title":"Architect Network Engineering","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALAIJPbrE1nDdZk2VQvfRXm7WtLag-gi_EJqHjZyhcbOIVk5PDO-Kk4ioL0blymbPlCpvcrH_lJX85QK94poO5IPNWpA-9jyMewFGjvKcxmfQUur5MmUb2wQAHJCYDpboZXMmdRvpbQHGmKt-bAtoo7hKnB1F2Rt-IU8i_VT-Q3IH1GrxlzDGBs588i_MoV","source":"ziprecruiter","full_description":"Description  Position:  Network Architect - SaaS Production Data CentersLocation:  San Jose, CANOTE:  U.S. Citizenship is required for this position due to the nature of customers assigned to this role.For over 10 years, Zscaler has been disrupting and transforming the security industry. Our 100% purpose built cloud platform delivers the entire gateway security stack as a service through 150 global data centers to securely connect users to their applications, regardless of device, location, or network in over 185 countries protecting over 3,500 companies and 100 Million threats detected a day.We work in a fast paced, dynamic and make it happen culture. Our people are some of the brightest and passionate in the industry that thrive on being the first to solve problems.  We are always looking to hire highly passionate, collaborative and humble people that want to make a difference. We have a terrific opportunity available for a Network Architect to join our team.  As a key member of our team you will have an opportunity to make a significant impact and contribution as we continue to build and expand our global data center infrastructure.  This includes the development and support of our expanding next-generation architecture, enabling highly scalable growth and increasing stability and performance. Responsibilities / What You'll Do:Partner with business units to best understand the organization's needs and how it relates to our global network infrastructure and security posturingContribute to the planning, design, and implementation of customer facing production data centers around the globeManagement of multiple high-visibility, high-impact projects simultaneouslyThrive in our world class Network Engineering and Information Security team, supporting our 24/7 revenue-generating systems and infrastructureProactively identify gaps, risks and issues and navigates organizational structure to resolve themQualifications / Your Background:10+ years of experience with planning and design of customer facing SaaS production data centers with carrier-grade reliabilityExpert knowledge and experience with routing protocols and traffic engineeringExpert knowledge and experience VPN encryption technologies, modern switching platforms, and firewalls including policy implementation and capacity managementWorking knowledge of Juniper, Arista, and Cisco equipment highly desirableProven ability to manage mission-critical, highly visible infrastructure projects to completion.Experience with low-level infrastructure testing and troubleshooting tools including packet capture devices, network equipment debug and diagnostics, (Wireshark, NetFlow)Understanding of security-policy implementation details and how to manage design and support of network environments to maintain policy integrityExcellent written, verbal, and presentation skillsWhat You Can Expect From Us:An environment where you will be working on cutting edge technologies and architecturesA fun, passionate and collaborative workplaceCompetitive salary and benefits, including equityThe pace and excitement of working for a Silicon Valley UnicornWhy Zscaler?People who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we'd love to talk to you about joining our award-winning team. Learn more at zscaler.com or follow us on Twitter @zscaler.  Additional information about Zscaler (NASDAQ : ZS ) is available at  http://www.zscaler.com .  All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.  #LI-LG1"}