{"title":"CNC Machinist - Level II (5-Axis Mills)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIaG5tp8XlAV-NyPYBZhb_qYD7buh1fKMCflbn3Ilw9w7q8MJynCLOsMz3brxjgqzqaGVUMElNqFYWFzyuSHz08yt23VJbZkf7RqNdfv5MipVo9pmKw_h3zOwAshFgPjfeb5qNYRqSEMbQOGtGM-fxlBQWr1qwqwp9I49fSSz0iifKDxBYHrZsBWZD-bz3y","source":"ziprecruiter","full_description":"CNC Machinist - Level II (5-Axis Mills)SUMMARY OF POSITION: Responsible for the set-up of moderately complex jobs and operation of CNC equipment, and ensuring that all required processes are completed to produce parts that meet quality and ISO standards. Responsible to assist in the training of personnel as required. May be responsible to operate CMM.ESSENTIAL FUNCTIONS: Set-up moderately complex jobs and operate conventional, special-purpose, and computerized numerical control (CNC) machines and machining centers to fabricate metallic and nonmetallic parts and fits and assembles machined parts into complete units, applying knowledge of machine shop theory and procedures, shop mathematics, machine ability of materials, and layout techniques. Able to run multiple machines at one time.Review and understand blueprints, sketches, drawings, manuals, specifications, or sample part to determine dimensions and tolerances of finished work piece, sequence of operations, and set-up requirements.Selects, aligns, and secures holding fixtures, cutting tools, attachments, accessories, and materials on machines, such as mills, lathes, jig borers, grinders, and tooling pre-setter.Calculate and set controls to regulate machining factors, such as speed, feed, coolant flow, and enter command to retrieve, input, or edit computerized machine control media; observes machine operation to detect malfunctions or out-of-tolerance machining and adjusts machine controls or control media as required.Sets up and operates machine on trial run to verify accuracy of machine settings to programmed control data ensuring functionality and performance.Starts and observes machine operation to detect malfunctions or out-of-tolerance machining and adjust machine controls or control media as required.Verifies conformance of finished work piece to specifications, using precision measuring instruments.Fits and assembles parts into complete assembly, using jigs, fixtures, surface plate, surface table, hand tools, and power tools.Verifies dimensions and alignment of assembly, using measuring instruments, such as micrometers, height gages, and gage blocks.Specializes in setting up and operating machines in a particular machining area; i.e., Swiss lathes, chucker lathes, grinders, mills, wire EDMs, etc.Responsible to assist in the training of personnel as required.Confers with engineers, production personnel, programmers, or others to resolve machining or assembly problems.Complete essential documentation as required.Assure all polices and procedures are followed and safety precautions are taken to reduce the risk of injury.Maintain a clean work area and assure safe operation of all equipment.Must be available on reasonable notice for unscheduled overtime to meet production schedules.Perform and document Operator Preventive Maintenance operations as needed.OCCASIONAL DUTIES: Assist Manufacturing Engineer.Assist production in all areas.May assist with tooling / fixturing build.Occasionally, miscellaneous non-recurring duties such as, but not limited to, packing, shipping, unpacking and sorting, inspection, cleaning, finishing, deburring, etc.EXPERIENCE / EDUCATION: High School Graduate or equivalent. Three or more years CNC machining experience or demonstrated performance.SKILLS: Ability to work with minimal supervision. Excellent problem-solving skills. Ability to handle multiple tasks and prioritize accordingly. Ability to read blueprints. Knowledge of GD&T. Complete knowledge of G-Codes. Ability to be a team player.No sponsorship visa (H1-B, etc) candidates at this time, sorry.Qualified candidates must submit their resume in Microsoft Word format along with at least three professional references to:COYOTE TECHNICAL & EXECUTIVE SOURCINGPhil MontoyaDirector of SourcingCNC Machinist - Level II - Indianapolis, IN#CNCMachinist#IndianapolisJobs"}