{"title":"Automotive Technicians, Mechanics - All Skill Levels NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL2S92OQn_nryZU3LNnSoMzpVCsD7_tUDaQeXde6E4xTTAVjJv6p6svBqTaAg4CXHnJh_9M9JTWPni5WW8POmaZjNxJbJ6y3aDys-Qz54rsMVOrpGvgGjNGM182rr_eGt4fNGk0okBtbuTZOSI_lSyOx7Hi45d91dp1Bux9xcL2b-gviJkJJEJ1LQUR2hQ","source":"ziprecruiter","full_description":"436 US-17, Palatka, FL 32177Automotive Service Technician / MechanicHiring All Levels - Experience RequiredExcellent Pay Plan and Performance Bonuses!Walk-in Applicants are Welcome!Beck Automotive Group is in need of Service Technicians / Mechanics for our Ford Lincoln, Chevrolet Buick GMC, Nissan and CDJR brands. If you have experience with any brand not just the ones listed, please apply, we will place you where you fit. This is a unique opportunity to join one of the best Automotive Groups in the region. Please apply today.We believe culture makes a difference and we strive to build lasting relationships with our employees, customers, and the community.We offer: Competitive pay plan!Health InsuranceDental & Vision Insurance401(k) PlanPaid Vacation6 Paid Holidays a YearEmployee Purchase DiscountsTuition ReimbursementCareer Advancement OpportunitiesDrug-free companyResponsibilities - Service Technician:Safety and courtesy inspectionsGeneral lube, oil change, and maintenance servicesDiagnostic services through proficient use of electronic test equipmentSpecialized repair and replacement services to include fuel injection, systems, on-board computer systems, and emission control systemsGeneral repair and replacement services to include, but not limited to: resurfacing rotors and drums, disc drums and brakes, wheel alignment, struts and suspension, engine performance (tune-up), fuel systems, cruise control, sound systems, exhaust systems, fluid and filter service, heating and cooling systems, air conditioning systems, drive train/ u-joint service, front wheel drive/ constant velocity joins and specialty installations.Qualifications - Service Technician:Must be an experienced Auto Service Technician / MechanicExcellent customer service skills a mustThe successful applicant must be able to work efficiently in a fast-paced environmentExcellent written and oral communication skills requiredKnowledge of all shop equipmentMust have a valid driver’s license and clean driving recordBasic computer skills requiredAdhere to company policies, OSHA regulations and any other city/ state mandated regulationsApplicants must have own tools, special tools are providedValid Driver's license and clean driving recordResume must be uploaded, and online assessment completed for immediate consideration.Must be authorized to work in the U.S. without sponsorship and be a current resident.Must pass pre-employment testing to include background checks, MVR, and drug screen.We are an equal opportunity employer. All qualified applicants will receive consideration for employment regardless of race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."}