{"title":"Principal Scientist, Medicinal Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL2eF4siyatI-VASvzCmLadtNgnHRcPELis5Cpsq5NiNnEK0rk7zw-xLcLeHIQczt34-vRRSnmI9Xy97gpMvfmpepd08-2E87zhKYdmNf3V1AMILBTwTvmt3NaYRyOKBOW18nW7vQzlTFAaL5ho-HofcpPcHDmwXEgeCd412r7r-qYg0lmRFcNjQSMQoYFn","source":"ziprecruiter","full_description":"At Bristol Myers Squibb, we are inspired by a single vision - transforming patients' lives through science.In oncology, hematology, immunology and cardiovascular disease - and one of the most diverse and promising pipelines in the industry - each of our passionate colleagues contribute to innovations that drive meaningful change. We bring a human touch to every treatment we pioneer. Join us and make a difference.Job Summary Experienced medicinal chemist who is seeking a new challenge as a project leader in an interdisciplinary team and who is interested in leading and mentoring a group of direct reports.Job Title/DescriptionWe are seeking an exceptionally talented and highly motivated medicinal chemist who is passionate about joining our fast-paced medicinal chemistry group in the pursuit of discovering innovative therapies in Oncology. A strong proficiency in fundamental aspects of drug discovery and demonstrated ability to lead or co-lead multi-disciplinary discovery programs and advancing them to critical milestones is required. She/he will contribute to programs by setting strategies, priorities, and driving critical path drug discovery objectives. The candidate should have relevant supervisory experience with internal direct reports as well as external CROs. Candidates must have experience in the independent design and execution of multistep syntheses of complex organic molecules using modern organic chemistry. Excellent hypothesis driven problem-solving skills and a thorough understanding of medicinal chemistry principles, synthetic methods, and reaction mechanisms are required. Candidates will have expertise in the purification and characterization of organic compounds. Excellent oral and written communication skills and a desire to work in a collaborative team environment are required. A track record of innovation documented through co-inventorship on issued patents and authorship of publications in peer-reviewed journals is necessary. Knowledge in E3 ligase and UPS biology is a plus as protein homeostasis is one of the fundamental research engines at BMS delivering therapeutics to patients. Not being bound by therapeutic modality creates a very dynamic, exciting and creative environment where the successful chemist will interface with an excellent team of scientists in biology, biochemistry, structural biology, computational biology and translational development.QualificationsPh.D. with 7+ years of medicinal chemistry experience in a pharma or biotech environmentM.S. degree with 10+ years or a B.S. degree with 12+ years of industrial medicinal chemistry experience.Track record of innovation and impact on programs documented through co-inventorship on issued patents and authorship of publications in peer-reviewed journals (may include both successful advances and smart terminations).High level of creativity and productivity with strong synthetic problem-solving skills, synthetic methods, and reaction mechanisms are required.Committed to experimental work - skilled in multi-step synthesis, purification, and state-of-the-art techniques for characterization of organic compounds.Strong skills in gathering, documenting, and analyzing information from competitive sources such as patents or conferences and using this information to guide program strategy.Experience with supervising Ph.D. and associate level scientists to high levels of productivity, whilst improving the skills and knowledge of direct reports through mentorship.Broad knowledge of the drug discovery and development process.A naturally collaborative style as necessary to work effectively in a fast-paced, highly integrated team environment.Excellent written and oral communication skills demonstrated ability to write peer reviewed quality work or invention disclosures for patent applications, and able to present the rationale, key data, issues and accomplishments department wide.Preferred QualificationsExperience working in the field of protein degradation and understanding of E3 ligase biologyTravel RequiredLocal and international travel for conferences and regulatory meetings may be required depending on project needs up to 5-10% of the timeFit with BMS Culture and ValuesDiversity, inclusion and integrityStrong team orientation; highly collaborativeSolutions and results-oriented focusHands-on approach; resourceful and open to diverse points of viewAround the world, we are passionate about making an impact on the lives of patients with serious diseases. Empowered to apply our individual talents and diverse perspectives in an inclusive culture, our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.Bristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives."}