{"title":"Research Scientist Assistant-Seattle Flu Study (Limited Term/Temporary)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJhgRQrF6x1uNulFHe1glhSjN05cVbwkJ_c4ZQiWugn5WZ_zQrfC5dxoWhiQxk_qca7agwNMzJYQ70tzP_OCfVMwnIKfMiPLWxmk6arCqMtBe1NDqJjsS3EcC0CtUU8Q_CAN73jsvop9LzJlSgrVR_dzynzwaEq8gGrN1AmY_OznD6-7RtH88qmytBa06U","source":"ziprecruiter","full_description":"Req #: 187517 Department: Allergy & Infectious Diseases Appointing Department Web Address: https://aid.uw.edu/ Posting Date: 02/19/2021Closing Info: Open Until Filled Salary: Pay Rate is Competitive. Pay Rate is Commensurate Upon Qualifications and Experience.Shift: First Shift The University of Washington (UW) is proud to be one of the nation's premier educational and research institutions. Our people are the most important asset in our pursuit of achieving excellence in education, research, and community service. Our staff not only enjoys outstanding benefits and professional growth opportunities, but also an environment noted for diversity, community involvement, intellectual excitement, artistic pursuits, and natural beauty.At the University of Washington, diversity is integral to excellence. We value and honor diverse experiences and perspectives, strive to create welcoming and respectful learning environments, and promote access, opportunity and justice for all.The Department of Medicine's Allergy and Infectious Diseases Seattle Flu Study program has an outstanding opportunity open for a Temporary Research Scientist Assistant.The Seattle Flu Study (SFS) is developing a research study with the Snohomish School District (SSD) that aims to develop a COVID-19 testing strategy in elementary schools as they reopen for in person learning. Participating students in grades K-2 and participating staff who work in elementary schools will be swabbed once per week, either at home or at school. Staff and some students will collect their own swabs at home, and most students will have their swabs collected at school with help from an SFS staff member.Once per week at each school, a research staff member will drop off study materials for new enrollments, collect nasal swabs from students on campus, and transport swabs back to UW for testing. The SFS team is looking for new team members to deliver testing supplies to students and school staff, perform swab collection of participants at participating school campuses, and to transport bio-specimens back to the laboratory for testing.Job Duties: Work in coordination with team members to execute clinical protocol: implement plan, obtain study consent, perform enrollments, oversee participant swab sample collection, maintain up-to-date study inventory, provide weekly updates on supply numbers, deliver and pick-up study materials from various Snohomish School District schools Assist with basic laboratory procedures: transport samples between study sites and the laboratory, may perform environmental sampling including collection of surface and air samples Oversee/assist with anterior nasal swab collection from students on campus Work closely with research coordinators to troubleshoot and address study workflow, work in Redcap and help with data quality control as necessary Assist with maintaining study inventory and kit assembly Assist with other study procedures as neededMinimum Requirements:Bachelors in Biology, Microbiology, Public Health or related field and at least 3 months experience. Must have a valid driver's license, a UCar will be provided for transportation to and from the lab Availability to work at least 30 hours during the week Available to start working in late February until the end of June 2021 Knowledge of basic principles of sterile techniques Ability to work independently with moderate oversight and supervision Strong interpersonal skills Good organization skills Previous experience working with children is a plusKnowledge, skills and abilities that are desirable, providing for an enhanced level of job performance, which includes:-Research experience handling human samples- Prior clinical research experience.Application Process:The application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter, and/or others. Any assessments that you need to complete will appear on your screen as soon as you select \"Apply to this position\". Once you begin an assessment, it must be completed at that time; if you do not complete the assessment you will be prompted to do so the next time you access your \"My Jobs\" page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed. The University of Washington is following physical distancing directives from state and local governments as part of the collective effort to combat the spread of COVID-19. Click here for updates\"Onsite work\" in the interim will vary for units and for specific positions and will be discussed with candidates during the interview process.University of Washington is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to, among other things, race, religion, color, national origin, sexual orientation, gender identity, sex, age, protected veteran or disabled status, or genetic information."}