{"title":"Technical Analyst II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJZlmVdhfZ-LHlgq-VuLoHtqLgJJZZ6c6JYdYafOFAcntKDSAFKcwlCyAZyH_gZ8niGC73Etva3ZVQw6WQ_MS5yPCbSqhRz0z2-a2QEuD8wga4ibUkI0dEgY5Db68wY88NAkS64Hq-AEsimqD320pu5tlUUK-7V2d8mFU_GruIQ7KaU9B4rpxLhdqXp5nKf","source":"ziprecruiter","full_description":"Description/Job SummaryPerforms various tasks underlimited supervision typically requiring high degree of complexity, versatility,and responsibility related to gathering facts, defining and exploring problemsand developing alternative solutions pertaining to the provision of integratedlogistics support elements. Performs tasks of a more advanced level in suchareas as maintenance development concepts, personnel and training provisions,technical publications, and data management.Responsibilities/DutiesUnder limited supervision,performs detailed logistics planning, repair analyses, technical manualdevelopment, extensive logistics support analyses, data management, andtraining provisioning for military electrical, electronic, mechanical, andcomputer systems. Develops/reviews test plans and materials involved inreliability, maintainability, safety, durability, and performance analyses.Designs and develops data management approaches for test data associated withreliability, maintainability, durability, and related tests. Works under limited supervision of and providesassistance to senior Technical Analysts.Required ExperienceMilitary experience and general understanding of military Engineering Changeprocess.ICAPS: Integrated Computer Aided Provisioning System: A minimum of 5 years utilizing the ICAPSsystem to obtain and input system component data in the establishment andmaintenance of various Associated Parts Lists (APLs).JETDAS: Joint Electronic Type Designation AutomatedSystem: 3 years' experience in the use of the JETDAS type designationsystem. CDMD-OA: Configuration Data Managers Database - Open Architecture: 3 years'experience in research and data input into the CDMD-OA database. Experience in establishing equipmentconfiguration and system modification utilizing JETDAS.Technical Writer: 3 years' experience utilizing ArbortextEditor w/Styler, MIL-STD 3001 / NAVSEA S1000D, Mil-Std 38784, and thedevelopment of military technical manuals. Planned Maintenance System: 3 years' experience in the use of thePMSMIS system to develop and update Maintenance Information Pages (MIPs) andMaintenance Requirement Cards (MRCs).General Logistics Experience: Familiarity with the use of ILIT (IntegratedLogistics Information Tool): Experience in using ILIT for the generation andtracking of PCCNs (Provisioning Contract Control Numbers).Required Qualifications 1. AS/AA degree (business administration or related/equivalentmajor); or graduate of a high school, accredited technical school, or military equivalent, plus four (4) years relevant experience. 2. Relevant years of experience should include integratedlogistic support elements such as reliability/maintainability engineering,parts control and standardization, technical manual development, trainingcurriculum development, provisioning and acquisition documents, andconfiguration management.3. Demonstrated ability to read, understand, and interpretvarious logistic test data and develop data management approaches forcontrolling the data. 4. Firm grasp of logistics support concepts and theirapplication with respect to military systems support.5. Excellent written and oral communications skills."}