{"title":"Facilities Technician/Maintenance Engineer- Belmont Park NEW!","location":"","salary":"","description":"","term":"$24 to $28 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIREa6IRFK3uSc80ZGY_HEzVnyt_3ukdGeWs8UyH6LtTJBSUwDmisnAJlErtBbHhqObKgjMPQLRNg5oem8H7-YAIv259zr2BZjx-FxpVm4jlG8hBUS1zlP_Vamr36hnd_bozMmUUqjwpUjOtfkvlPevDYNDC1D7Cbx4QynzxylrIHGIk_OFEkBCsp83F7k","source":"ziprecruiter","full_description":"Belmont Park is looking for a skilled building engineer / facilities technician to join our team! This position is responsible for installing, maintaining and repairing electrical systems in Park facilities ranging from buildings to restaurants to our many attractions in the park!As a full time employee at Belmont Park, you get many benefits such as :Park Discounts and FREE passes to the park!Restaurant discountsPaid Time Off and Company HolidaysMedical, Dental, Vision and Life Insurance401k Benefits with Company MatchEmployee EventsLots of opportunity to grow!Job Duties/Essential Functions:Install, rehabilitate, troubleshoot and repair all HVAC and Plumbing systems throughout the parkRepair and maintain a variety of commercial food service equipment using standard maintenance methodsTroubleshoot, repair, and replace park lighting and electrical systems as neededWork as part of assigned crew performing Carpentry and Maintenance work to facilitate repairs and installationMake a wide variety of repairs to: buildings, roofs, fences, gates, walls, drains, floors, doors, stairs, carpet, and fixturesPerform work on generators, compressors, blowers, fans, pumps, and motors as assignedParticipate in emergency procedures regarding flooding, wind storms, utility outages, earthquakes and hazardous waste spills.Maintain a clean and orderly work area free of hazardsMaintain adequate inventory of parts, tools, and suppliesEnsure that work orders are competed correctly and in a timely manner.Follow all safety procedures and hazardous material policies. Wear personal protective equipment as needed.Ensure cleanliness and upkeep of work area and department equipment.Adhere to all Park policies.Other duties as required.Work safely and adhere to all safety policies.Provide excellent guest service.Skills/Qualifications:Prior experience in a related field.Must possess a high school diploma or its equivalent.Proven ability to communicate effectively both verbally and in written form.Excellent organization, multitasking, and prioritization skills are critical for success.A working knowledge of the operation of hand and power tools, heavy equipment, etc., with the proven ability to train others on the safe usage of equipment is critical to successPhysical Requirements:Able to stand, walk, and sit up to 8 hours in a single day.Able to lift up to 40 lbs. All lifts over this limit require assistance from a co-worker or the use of a mechanical device.· Required to use hands to finger, handle or feel; reach with hands and arms,· Occasionally required to sit, climb or balance; stoop, kneel, crouch, or crawl; talk or hear, taste, smell.· Frequent use of protective equipment for eyes, hearing, head covering, arms, hand and fingers, legs, feet and toes, and body protection.Able to safely perform heavy, physically demanding work: crawling, climbing, pushing, pulling, stooping and lifting materials and equipment.· Required to work at heights above 70 feet.· Occasionally working in extreme cold, heat/sun, temperature change, wetness and humidity. Working in confined spaces, intense vibrations, fumes, dust, mists, gases, and caustic chemicals."}