{"title":"Senior Project Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJA-cPvjBRPEVjLQhGGqcDhqNBwIkBXsxIUhMI5YLNnxqRcQNde7n5QzcsAfdvC97eMIn6vnkp1X02e_0RRQ9_gtMlJgxSADdjg4TFfLhpQwUyiJ-8SPiHa-5yTThaZN1DffQCocHXqkkx0shrhWDVFjb4qnHIFXFmg9pabUAcOdP9M9qFwPpWXXRSgQ4g","source":"ziprecruiter","full_description":"Are you interested in joining a company that will map out your development within the first year and provide you with a career coach?If so, GenConnect is looking for a talented Senior Project Engineer in Huntsville, AL. In this role you will:Reports To: Chief EngineerRequirements: Candidates must be able to obtain and maintain a DoD Secret Security Clearance; U.S. Citizenship requiredThe company is looking for an experienced project engineer to take on the needs of supporting our world class engineering design teams. The ideal candidate has significant experience leading the development, testing, and fielding of products requiring the support of a multidisciplinary engineering group. They have demonstrated the ability to lead the root cause analysis and resolution of complex engineering issues. The candidate has experience bringing transparency and engineering process to the development cycle while holding team members accountable for assigned work. The candidate is comfortable understanding project schedules, scrum sprints and is able to guide teams to on-time, on-plan performance through clear and consistent communication and identifying and removing roadblocks. The candidate has experience in the complete product development cycle. The candidate has basic training in Agile Scrum and traditional Project Management methodologies and can apply principles from these techniques where applicable to garner positive results.The candidate will use their expertise to help guide project trajectories and work closely with the Chief Engineer and functional engineering managers to ensure project deliverables and milestones are successfully met. This role is an integral part of the team designing the company's world class autonomous drones.Core Responsibilities:• This candidate works with the Chief Engineer and Systems Engineering to ensure requirements are correctly understood and translated into clear tasking assignments across the team• Coordinate the development, integration, test and fielding of the company's systems and products across multiple engineering teams• Coordinate and execute system level test and integration• Coordinate and facilitate resolution of system and subsystem issues• Work with multidisciplinary teams of engineers executing engineering plans.• Support and implement best practices and ensure proper procedural rigor is followed during system design.• Facilitate design reviews• Develop detailed schedules and translate tasking to an Agile/Scrum workflow• Author and maintain systems engineering and project management documents and artifacts, including requirements, V&V procedures and results, trades and risk, product specifications, project plan, budgets, and schedules.• Act as Product Owner to one or more Scrum TeamsSkills and Qualifications:• Experience in the design and integration of embedded systems. UAV or aircraft systems preferred• Experience leading the engineering design process for multi-disciplinary projects• Experience developing and leading system, subsystem, and formal testing• Team leadership experience and high comfort level in holding team members accountable for performance and building healthy team culture• Ability to creatively solve problems is essential.• Ability to create process, structure and solutions in a dynamic environment is essential• Experience with Agile Scrum, and traditional Waterfall Project Management• Knowledgeable in model-based design and requirements-based design paradigms.• Software development experience is preferred.• Experience with Atlassian tool suite is desirable.Professional Experience Requirements:• 5 or more years of engineering development and integration experience with a focus on embedded software or electrical engineering, with at least 4 years of Project/Systems Engineering experience leading projects.Educational Qualifications:• Bachelor’s Degree in Electrical Engineering, Computer Science, Computer Engineering, or a closely related field.• Dedicated systems engineering and Agile/Scrum training is preferredRequirements: Candidates must be able to obtain and maintain a DoD Secret Security Clearance; U.S. Citizenship required.Compensation:The company offers a compensation package that is commensurate with experience and abilities."}