{"title":"District Manager | Wingstop, Seattle WA NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKJhzIUU1rQ-ETOP358rwXttw7qvcVLlCQKh1OhPGBMKlm5xqRXStMR9KshqnvAcz-t4ZEIo2DXfuMp7HbPXQDCHVJYsueWFcL3GKfBehyUUwmVV2c1yGziP2ZPlnHb6wlZbR1FVDP_HSQlvAwfqg6fEg13KZTudUuZ4JSmAQHOo9TK9YuBReSUNt6CQg","source":"ziprecruiter","full_description":"DESCRIPTION OF THE COMPANY: The Far West Services group of companies is the second largest franchisee in the Wingstop system. Founded in 2004, the group owns 64 Wingstop locations in Southern California and Nevada and has 15 stores in active development in Washington, California, and Nevada. Far West’s long-term goal is to operate 150 locations by 2024. Its success is based on the twin pillars of team member well-being and customer service. Far West believes that if you take care of your team members, maintain stores appropriately and treat customers with respect, good things will happen.DESCRIPTION OF THE POSITION: The primary role of the Wingstop District Manager is to work in tandem with the General Managers to oversee the daily operations of the store, provide exceptional customer service and proactively manage the front- and back-of house team. The ideal candidate is focused on excellent customer service and excellent operational results. S/he has demonstrated restaurant leadership experience and has a passion for growing the business. The District Manager position oversees an entire district where multiple stores operate. The District Manager oversees the operational practices of all stores making sure each runs smoothly, cleanly, and meets budget and sales goals. The District Manager interviews, hires, coordinates and disciplines General Managers, and check in on individual stores to make sure the store is running properly. The internal development and growth of the team is a primary function of the role. It is the responsibility of the District Manager to achieve customer satisfaction, productivity, schedule adherence and economic goals. Current WA District locations include Oak Harbor, Poulsbo, Everett, and Burlington. BENEFITS:401(k)Health insuranceDental insuranceVision insuranceVacation timeEmployee DiscountsCar AllowanceCompany laptop/phone providedJOB SKILLS AND REQUIRMENTS:Leadership Skills: District Managers must keep your employees motivated, resolve conflicts and make hard decisions. A successful District Manager is a good leader.Time Management: District Managers work with multiple stores and managers across a large region, coordinate visiting these stores weekly. District Managers might have to create schedules, order supplies and write reports. Time management is essential to make sure everything gets done.Business Acumen: District Managers are expected to keep and maintain a budget in almost every field. You will need to be confident in using math skills to make sure you know where your strengths and opportunities are with your individual areas.Analytical Skills: District Managers are in charge of hiring new store managers and being a good judge of character will help ensure that you hire the right people to maintain an efficient and motivated team. You will also need analytical skills to be able to solve problems that may come up during a typical workday.Decision-Making Skills: Whether it is dealing with employees, management or vendors, you will have to make decisions that affect the company. Having the ability to make hard and fast decisions is crucial to your success.Speaking and Writing: District Managers do a lot of communicating. This might be in front of a group of employees, or in a meeting with management. You might be called upon to write reports, recommendations, or reasons for termination. Great verbal communications and writing skills will help you in any of these scenarios.QUALIFICATIONS:3-7 years of experience in quick service/fast casual restaurant management or service-related field with high customer/client contact required, in a District Manager role or above.Experience managing high volume or multi-unit operations w/ minimum of 4 locations. Ability to communicate effectively in written format and oral presentations.Ability to multi-task and establish priorities.Ability to maintain organization in a changing environment.Exhibits initiative, responsibility, flexibility, and leadership.Proficient in the use of Microsoft Office Suite, including but not limited to Word, Excel, PowerPoint, and Outlook.Proven team building and development track record.Proven development team track record.Effective time management, proven track recordThis is a full-time position and hours of work and days will vary. Availability on evening and weekends is required as job duties meet the needs of the business. Travel is primarily locally during the business day, although some out of the area travel and overnight may be expected. Daily driving is expected. PI131767359"}