{"title":"Network Engineer - Southeast Houston","location":"","salary":"","description":"","term":"$70,000 to $100,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALKXj9i9QkbsRySy2IKcnGh5hnl8FDEYbqh6X2qO1zIHgpvFIscWEs47oulPq6mDltsz0nadK4QWSomLvnRH3PtRVN7eupbkxAX5-lmT7Bb8ZDEdmcxYj9kYdZgP8UMDq2D8BXu5LK810N5E-8ygxeRtzpwTL_FkzdUgox2PyPW1s4V4UnWOwRNiqfuwQ","source":"ziprecruiter","full_description":"Looking for an opportunity to use your 5+ years of Network Engineering in a team collaborative environment where your input to solutions is encouraged? Are you stuck in a position where you’re just under challenged? Then you should consider joining BEMA where opportunities for technical and personal growth are numerous.BEMA Information Technologies is a highly recognized provider of IT services to churches, schools and medium-sized businesses. We are 20 years old, have grown without a sales force and do not advertise. Our consistent growth comes from hiring Network Engineers who provide excellent service thereby turning our clients into salespeople.In this position, most of the clients you serve will be South of I-10 in Eastern Harris County as well as in Galveston County.We are a bit different….We care about you, your family, and your career developmentWe don’t want you working overtimeWe strive to over communicate rather than underWe serve many clients, but work hard to keep you working on your side of townYou will:Brainstorm with 40+ engineersBe exposed to many different environmentsGrow your technical skill setReceive career coachingPreferred candidates should have 5+ years experience with:Servers, switches, and firewall experienceDesktop troubleshootingMicrosoft Office 365Wireless access points and internet connectivityActive Directory managementReliable transportationDesire to provide excellent customer serviceCompensation: Pay will be commensurate with depth of skill, hands-on experience, and communication savvy.Send your resume now to recruiting@bemaservices.com"}