{"title":"Mechanical Design Engineer NEW!","location":"","salary":"","description":"","term":"$110,000 to $125,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALzLfHeE1RCV8i-aXjZQ71s5SqD3wxoN9edItLymc1VieTBUpvyQmetH3n51oaESRg07K1I-HXMANBSUUswKy7nU7z_DAV-oG1w6PWHV92-6OG4CjFijrHlbtgniEekvqQnE89WnUVPpGJ9P3y62r0SC00XSUXWTnATxmawoibbyiXL8nokkoqATjgsgrs","source":"ziprecruiter","full_description":"Austin Staffing is seeking a Mechanical Engineer to design customer specific Electromechanical (EM) actuators for the aerospace industry for a direct hire role for one of our great clients in downtown Austin, Texas.Position SummaryThe Senior Mechanical Engineer is a key, customer facing role within our customer’s company. The engineer in this role will have broad responsibility and ownership of New Product Introduction (NPI) projects from proposal through qualification testing and production support. The successful individual in this role will be a self-starter requiring little supervision. The individual filling this role will have significant influence on the development of the product line and the advancement of our client in the marketplace.Essential FunctionsPerform detailed mechanical design of Electro mechanical (EM) actuators including, but not limited to:Gearing and bearing design and analysisStructural analysisAnalysis and specification of ancillary Electro mechanical components (clutches, brakes, position sensors, etc.)Tolerance stack-up of precision assembliesSupport proposal efforts in a fast-paced aerospace environmentAssess customer system level requirements.Develop derived requirements.Produce requirements compliance matrix.Generate engineering models of proposed designs with substantiating analysis balancing rigor and speed.Contribute to estimating recurring and non-recurring costs.Contribute to development schedule.Develop weight and cost estimates.Creation and ownership of CAD modelsConduct finite element analysis (FEA) (structural and thermal)Create detailed component and assembly drawings.Generate customer deliverable test procedures and reports (ATP, QTP, QTR, etc.) as well as other data items (structural analysis, reliability predictions) in support of development.Additional DutiesPerform basic project management tasks as required.Knowledge, Skills, and AbilitiesWorking knowledge of geometric dimensioning and tolerancing (GD&T)Able to perform structural analysis and weight optimization.Creative mechanical packaging of the above components as well as:Wire routingSealingKnowledge of common aerospace materials and process specification and applicationExpertise in CAD design tools – SolidWorks preferred.Knowledge of Finite Element Analysis (FEA)Working knowledge of common manufacturing processes including:Gear hobbing/shaping/grinding.Heat treatment (nitriding, carburization, induction hardening)Precision CNC milling/turning (X. XXXX tolerance)Common assembly techniquesExceptional attention to detailProfessional, customer-centric attitude and communicationAbility to multi-task in a fast-paced product development environmentAble to work collaboratively in a small team environment, offering assistance and expertise to other cross functional team members as required for project execution. Minimum QualificationsBachelor of Science degree in Mechanical Engineering from an accredited college or university required.Master of Science degree in Mechanical Engineering preferredAt least ten years of engineering experience required.This position requires a self-motivated individual willing to “go the extra mile” to ensure project success.Must have designed Electro mechanical (EM) Actuators, motors and gears for the EM actuators.Design experience with mechanical power transmission components, including but not limited to:Spur/helical/epicyclic gearing.Shaft and bearing analysis.Ball screws/roller screwsGearbox housing structural analysisExperience with system performance tolerance analysis, including but not limited to:Sensor accuracy assessmentBacklash assessmentExperience operating in an AS9100 quality environment, preferred.Working Conditions / Physical RequirementsWork is generally performed in an office environment.10-15% domestic travel required to support customer and supplier visits."}