{"title":"Technical Intelligence Engineer (2021-0286-E) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL5zkmXi4gHvPMo3UUTFzDIAN2FRQq3ES5U2tZdXjYHcl1jhYHXsIl8hTeB5Cb-HL8syqEc4eScx5oaSzqMXOrv0Udq24YmCsq35bQuL-zzoy_njqJadQ2Jr7jWocb8CTJU1lZw5UFwqTkeZMx_1AJGh-Dd1zdFhpmS3AxYY4vVnTSng6jCMtY4EM_v4lyE","source":"ziprecruiter","full_description":"DescriptionMobius is an award winning, Small Business Administration (SBA) certified Historically Underutilized Business Zone (HUBZone) company and certified Woman-Owned Small Business (WOSB) providing engineering, analytical, and programmatic expertise to the Federal Government and commercial customers. Our mission is to provide innovative advanced technology solutions to customers facing issues of national and global significance. We strive to be admired for excellent people, fair and honest partnership, innovative problem solving, and exceptional performance.Come join our team! Mobius has an exciting position for a Technical Intelligence Engineer supporting an Insider Threat Program.  The candidate will identify, define, compile, document, coordinate, produce, deliver, and present technical data, briefings, reports, and assessments. Also assist, facilitate, participate, support and report on meetings, conferences, symposia, and working groups. The contractor shall perform technical data analysis on intelligence received as well as produce and present technical data, briefings, reports, and assessments.  This full-time salaried position serves onsite with the client at Redstone Arsenal, Alabama.  Responsibilities:  Executes extensive engineering/scientific support on systems, system elements, interfacing systems, components, devices and/or processes for complex developmental and operational weapon system programs  Works independently, as a team member, or leading teams/tasks to solve engineering/ scientific problems Implements system engineering \"V\" processes across a program's acquisition life cycle Research and gather technical intelligence for integration of data from intelligence documents and threat assessments into the MDA threat models to support tests and weapon development. Develop and coordinate all MDA Technical Intelligence Engineering PRs with the specific IC Agency tasked to respond to the requirement. Requirements BA/BS in STEM field  6+ years relevant to intelligence data engineering  Top Secret clearance required"}