{"title":"HVAC Sales Engineer - Mechanical Systems - Base to $120k","location":"","salary":"","description":"","term":"$100,000 to $120,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAINq--ZXOZnqv3FnMuMjA4ae0_v6uVF01aTGBMPmu3ZnNfnjr8dmkwdW3l3ISgn9NEPN7s4fl7MGRQYzoAoqn9c1mrvdWsHAuTaoFRZ27RJc3P4TWWu-jmSPZ6L8H2J7yohz-99KTF_5TZS44XYBjDvV4JvtkZCtmsHA2ttaEMT9K_FumXUzbCmpQrMJoZf","source":"ziprecruiter","full_description":"Sales Engineer - Mechanical Equipment - Facilities Solutions Provider in Orlando, FL, 15 Year Old Company. Base to $120k + Commission, Growing Company.Our client, a stable, fast-growing facilities provider handling mechanical and electrical building systems and solutions, has an immediate need for a Sales Engineer to grow their existing HVAC equipment market in Orlando, FL. Our client has been in business for 15 years and has a stellar reputation in the industry. They are a fast-growing company with multiple “Best Places to Work” awards, and they are looking to add a rep in the Tampa area who values teamwork and a competitive spirit. If you can see yourself in an atmosphere with office side bets, this is the place for you.In this very technical role, the Sales Engineer will be responsible for new business generation as well as maintaining long-term relationships with existing clientele. You will sell to contractors, building owners, consulting engineers, as well as develop relationships with current manufacturers. This position requires a decisive individual who can manage multiple priorities including marketing, specifying, estimating, influencing, closing, and executing orders of mechanical equipment and systems.Compensation: Our client is offering a solid base salary ranging from $100-120K, depending on experience, and an uncapped commission program. The company offers a comprehensive benefits package, 401k, PTO and much more. Additionally, there are other perks tied to company culture that make it a plus to work for this family-owned business!Requirements:  The ideal candidate for this position will possess a Mechanical Engineering degree and at least 2 years of proven outside sales success, preferably with experience in HVAC or another technical sale. The candidate should be independent, competitive, and very relational. They should possess strong CRM experience and exceptional customer service skills.Job ID: 17236M21"}