{"title":"Sr. Network Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI-yDHP5-cVlgsjyYcvlBQuW-sMYYsKgWyuq79t90Vu9P80sczsqpNeYoRYdo5jpCTYW19bGVlwJ7dQc1NbNn7zzKuV5uk6rXKu8eCXZnEVPc1RjJUexIQXEovyqSHxV61jMwtyFkm-nDF6dUSGFLvYouFXpMMZuakWy3S2dNa__2Ivxjjg4-9_NEGAB7En","source":"ziprecruiter","full_description":"While focused on the development of technology principles, standards and patterns that are highly reusable across multiple enterprise solutions, the Sr. Network Engineer is also responsible for responding to issues, projects, and assignments involving installation, maintenance, and support of all network-related items. These include routers and switches, utilizing MPLS, Vlan, BGP, VOIP and QOS, firewalls, servers, desktops, NAS/SAN storage solutions, virtualization projects, phone system, Audio-Video systems, Security Camera System, HVAC, clustered server environments, internally hosted Web environments, and other computer peripherals.What you'll be doing...Responsibilities include but are not limited to:Monitors systems to identify and efficiently resolve hardware, software, and operating system problemsConfigures and installs routers, switches, firewalls, servers, and other related network hardwareEnsures service levels are met for internal web sites, LAN/WAN, and equipment availabilityDefines and manages key solution portfolios - either directly or by establishing and supporting portfolio management disciplinesDefines road maps describing evolution of all enterprise solutions from current state to future stateWorks closely with the Security Architect to ensure infrastructure components fit within overall security aspects and provides the greatest security possible for the enterpriseEnsures project management or solution delivery lifecycle efforts leverage enterprise architectureMaintains documentation of network implementations and upgradesWho you are...Educated.  Degree in Computer Science or related field; or equivalent combination of education, training and experience  Experienced.  7 years hands-on experience in design and implementation, with 3 years of project solutions architecture, strategy and/or IT planning experienceKnowledgeable. Extensive knowledge of troubleshooting hardware and systems software, Windows/Unix desktop and server administration, Active Directory, Cisco IOS, Palo Alto, VMWare VirtualizationTeam Player.  Ability to work independently with minimum supervision, as well as being a productive and contributing team memberMeticulous.  Strong attention to detail with the ability to quickly assess and analyze problems and develop solutionsService Minded.  Must have a strong focus on customer satisfactionWho we are...Northwest Administrators, Inc. is an industry leader in third-party administration of employee benefits. We administer one of the largest multi-employer pension plans in the country, along with numerous large health and welfare plans. As part of our team, you will benefit from many training and development opportunities and can expect a better-than-market benefits package.If hired, you can expect...Collaborative team environmentMedical, dental and vision, and Rx401(k) with company contribution and matchPaid sick, vacation, and holidayWork-life balanceEqual Employment OpportunityIt is the policy of NWA to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, age, disability, marital status, citizenship, genetic information or any other characteristic protected by law. NWA prohibits any such discrimination or harassment."}