{"title":"Senior iOS Developer (Contractor) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKweTbPUCrrlfIBQ-QuIr0to6xHOqUfPd85WeKHnNalG_D7y67C05wm0JgXVp9J863fG5Kj8IUc2AtpRDHMaRPluHliseD4DpvnDWMYqYWbXfnDwX5EzEL7dVHhXvlcxEh-i5U4xIS913WNTFFLZU5zeDZQPL0_pL_TnWPRnb1vW2gOHlYCLbq7CXlWoeg","source":"ziprecruiter","full_description":"TE2, The Experience Engine, a division of accesso, provides consumer-facing enterprises an engine to drive personalization, recommendations and commerce for the physical world, in real-time. We believe every consumer facing business with physical locations will benefit from a machine-learning based platform that provides deep insights and recommendations for how consumers interact and ultimately spend with global brands.Position Overview Join our Advanced Engineering Services team and take on this unique opportunity to delight millions of users. Scale a growing portfolio of widely used mobile apps by leveraging reusable modules and libraries to disrupt mobile and wearable consumer experiences. Your passion and experience will enable us to deliver mobile applications used by millions of consumers.Responsibilities + Design, build, and maintain engaging native iOS applications for consumers + Drive technical design and research for prototyping new concepts and capabilities that leverage the latest iOS features + Collaborate with teams across the company to clarify designs and requirements + Deliver feature enhancements and continuous improvements to our existing suite of successful mobile apps + Refactor mobile apps to optimize performance while creating and/or leveraging reusable modules + Active participation in an Agile development process Desired Skills and Experience + 3+ years of iOS experience + Experience developing, publishing, and maintaining native iOS applications + Experience building component libraries for teams and third-party developers to integrate into their existing mobile applications + Strong knowledge of Swift, Xcode, and UIKit. + Solid understanding of CocoaPod packaging and distribution, and iOS frameworks such as CoreData and CoreLocation + Experience with RESTful APIs and parsing JSON to communicate with backend services + Understanding of proven design patterns and architectures + Ability to analyze and optimize code for performance, memory usage, CPU utilization, and battery life + Passion for product quality and attention to details + Excellent written and oral communication skills Bonus Points + Insightful opinions about developing for mobile. Attends or organizes local iOS Meetups + e-Commerce experience + Familiarity with Agile development methodologies + Experience mentoring other developers + Love of craft beer + Please include any GitHub account, App Store apps, LinkedIn profile, and any project you're particularly proud of. We would love to see your work"}