{"title":"In-building Technical Project Manager","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALsD18ajOpyTvEVHOZ-JVbkNdMykoVhvLX886w27NBGCYIMtB4DTyVCmKKCjF1M75m1hnBWB6_NbQwpAo8J7ERhND-UIvsOiOkRADaClslDpUhYg53W4jw9UpG8tTJga0yRknqemD9kLENfyOkCvWBeWHSilNDCvpkp9J5bTZOylw1-VFY_xEimWdymh0w","source":"ziprecruiter","full_description":"Role: In-building Technical Project ManagerFuture Technologies is a professional services company specializing in technical consulting, planning, design, implementation and support of innovative communications solutions focused on wireless infrastructures and their accompanying technologies for commercial and military customers around the world. We pride ourselves in our ability to hone-in on unique customer challenges and deliver best-of-breed solutions that meet or exceed expectationsWe are seeking a highly motivated and experienced In-Building (Small Cell and DAS) Technical Project Manager. The ideal candidate will have successfully executed multiple end-to-end Distributed Antenna Systems (DAS) and Small Cell deployments in various venues.The Project Manager will partner with cross functional teams and our diverse clients to deploy communication networks across vertical markets using various technologies throughout North America. Through these partnerships, the Technical Project Manager will apply PMI standardized processes as well as their wealth of experience to establish and execute project plans aligning to client objectives, budget, and timeline.Additionally, this person will support the Program Management Office to complete project deliverables and provide operational and technical support. The ideal candidate is one who thrives in a highly collaborative team environment, wants to get involved broadly across the business and enjoys the flexibility and exposure that comes in a small company.Vertical Markets:• Service Providers• Utilities• Transportation/Rail• Mining• Government• Manufacturing• Logistics• IoT Growth MarketsResponsibilities and Preferred Experience:• Managed multiple broad-scale In-Building projects delivered simultaneously across multiple regions/customers.• Projects may include stadiums, airports, corporate offices, and/or large warehouses and experience spans from pre-sales through installation, testing and “go live” service completion.• Develop and execute upon the delivery project plan, project budget, system technical performance requirements, solution changes, and all project deliverables in alignment to customer standards.• Be able to work in high visibility projects with unclear scope, and emerging customer relationships.• Communicate program expectations to cross functional teams, field personnel and customers via project reports and conference calls.• Capability to manage and develop remote delivery teams.• Construction management knowledge in In-Building systems is a plus.Ideal Candidate Attributes:• Minimum 5+ years in a telecommunications role with relevant experience deploying In-Building solutions.• Bachelor’s Degree in a technical discipline, preferred.• Project Management Professional (PMP) Certification.• Self-motivated with a “default-to-action” mentality to overcome unexpected challenges.• Excellent verbal, and written communication skills both internally and with external customers to articulate project aspects effectively.• Evergreen learner who can pivot quickly for client needs.• Ability to multi-task and work in a dynamic environment• Proficient knowledge in MS Office, including Word, Excel, Power Point, MS Project, and Visio.Location Preferences:• Dallas, Texas• Must be willing to travel to FT offices and customer sites, as required.• Must have experience working as a team leader in a remote setting.Compensation:• Salary – Negotiable• Bonus – Annual bonus based on company performance and individual contribution.• 401k – 4% match• Benefits – Medical, Dental, Vision• Personal Time Off (PTO)If you want to work in dynamic and challenging telecommunications role, with great people to create unique solutions for our clients, please visit the link below and complete your employment application.http://Jobs.futuretechllc.comThis Company is an equal employment opportunity employer. We adhere to a policy of making employment decisions without regard to race, color, religion, sex, sexual orientation, national origin, citizenship, age, or disability. We assure you that your opportunity for employment with this Company depends solely on your qualifications."}