{"title":"Product Architect Android Applications","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJqloVVqNjX2HtQogNaqWr5Z3m_CJFDycH_hYEKB9JhQ5JULkGqpvJZs5N_uj2kXj5Uwo9Cl9fgCYY-8jdYW1fz_DZOjyibuMvrjJ1qYGe-N3arsW00fzE4iecgdH6UCCbOv9l3VX1QSDpKvGyjIk1JPT2z-1jwQbpiiYiz-jm_lexYdvRQNsqHCQkGKa0","source":"ziprecruiter","full_description":"Garmin’s “Area 51” is our internal product R&D team, a select group of innovative “intrapreneurs” who have the tools and freedom to design, incubate and execute leading-edge, next-gen Garmin products.  From hybrid watches and kid’s wearables to the latest lidar and sonar technologies, Area 51 is in constant pursuit of new markets and pioneering technologies. If you’re looking for an opportunity to bring your forward-looking perspective and mobile android app development expertise to a team focused on learning and venturing into uncharted territory, this is the job for you!Essential Functions include: Utilize Android Studio and Kotlin to develop, test, debug, and deploy high quality softwareUse Git and Gerrit Bitbucket for software development modifications and code reviews Contribute in the designs for software components within a larger projectContribute as a technical leader or Lead Software Engineer for derivative software projectsPerform technical root cause analysis and outlines corrective action for given problemsServe as a mentor to less experienced software engineers (Software Engineer 1 & 2) and InternsRequired qualifications: Bachelors of Science Degree in Computer Science, Electrical Engineering, Computer Engineering, Software Engineering, Aerospace Engineering, Math or Physics or another relevant engineering/technical field AND a minimum of 5 years relevant experience OR an equivalent combination of education and relevant experience.  Other requirements include:Working knowledge and understanding of Kotlin, Java, Android Developer and Android StudioMinimum 5 years’ developing mobile applications in a work environment; outside of school and internship projectsExperience integrating and maintaining 3rd party software packages, and identifying system software security risks and developing solutions is highly preferredCreating applications and major feature-adds as part of the Software Development Life-Cycle (SDLC) is highly preferred Garmin International is an equal opportunity employer.  Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran’s status, age or disability."}