{"title":"Senior Mobile Core Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALsCjAMGYfeK0eeDYdCgNxAEFw-HX1bbOfmWQPMe-0e2eKX-D9eCkpG3gzTzzQiVIYOG_5xoe3-Ak33UIrvD6xj-QvTpqT3dd7hHoyRU3eSq9YgSVIlZzOxGQCnlN6dLm2eJayRncx9rH_2Vz2m6d_i3K4YIbFsJyAXMUJHQONr8Bl4t1kfBzSn4NHstm0O","source":"ziprecruiter","full_description":"Please Note: This role can be based in any UScellular Engineer office locationPlan, design, engineer, develop, implement, and trouble shoot infrastructure technologies on the customer-servicing network. Provide (subject matter) expertise around specific technologies. Provide (project) management for the deployment of customer-servicing projects. Act as vendor interface for support of applications and technologies. Evaluate and implement new technologies, policies, and procedures for business network operations!SupportIdentify changes needed in the customer servicing infrastructure configuration to achieve the technology organization goals. Leads the customer-servicing infrastructure strategy reviews and development by performing applicable analysis. Analyzes network & system response and figures out tuning recommendations for improving performance.Interfaces w/the vendors' senior technical staff/management on critical/escalated network & system related outages. Handle effective issue identification and resolution process; serve as the focal point for customer-servicing infrastructure-related issue / crisis resolution. Senior escalation point for all customer-servicing issues.Perform 24x7 advanced tier troubleshooting, including off-hour maintenance activities, problem resolution, and on-call Engineering Leads project management for customer-servicing infrastructure implementation projects.Implements technology and customer-servicing infrastructure changes.Lead interaction with partner organizations/departments to architect network or system solutions for our customer-servicing infrastructure Tools Define requirements in support of budget plans and make recommendations for ways to improve performance and reduce costs. Develop business cases that support changes to network/system infrastructure.Develops network and system performance tools and integrates them into the existing infrastructure. Ensure communication of process and procedure changes to key stake holders. Design an effective test plan for any new / changed customer-servicing infrastructure.Develop full suite of documentation as it relates to the (customer servicing) network infrastructure (Engineering Work Plans, Standards, policies and procedures, etc.)Support identification and collection of metrics and performance reporting processes. Identify process improvement areas and develop the improvement initiatives. Determines Key Performance Indicators and infrastructure standards!#LI-LD1Minimum 5 to 8 years relevant/meaningful work experience. Bachelor's degree in related technical / business area is preferred.Understanding of the relevant technologies and the business and industry. Experience re-engineering/process improvement. Strong (change) management skills; change agent. Strong project management experience running multi-functional teams.Excellent problem solving / analytical skills and knowledge of analytical tools. Excellent written and verbal communication skills. Excellent presentation skills demonstrated in front of large audiences. Ability to build/define metrics that accurately reflect the current state of a given process or operation. Travel requiredThe Senior Engineer is expected to demonstrate advanced technical knowledge of all of the skills listed below:Software tool: SQL Plus, Perl, K Shell, C Shell, Bash, Tcpdump, Snoop, Ethereal,Services: SMS, OTA, MMS, PTT, 1x Data, MIP, SIP, Brew, Ev-DoService Infrastructure: Packet Data Switching Node (PDSN), AAA, Home Agent (HA), FACN, Foreign Agent (FA), ADS, Multi-Media Service Center (MMSC), MMS Transcoder, Short Message Service Center (SMSC)Hardware: UNIX Servers (HP, IBM, Sun), Tandem, x86, CiscoO/S & Network: HP/UX, Windows 2000/XP, TCP/IP, Routers, Switches, Firewalls, Linux, BSD, Solaris, IOSNetwork Protocols: IS41, SS7, TCP/IP, SNMP, SMTP, UDP, Radius, PPPBusiness Applications: Remedy Trouble Ticketing, DotProjectOffice Automation: Word, Excel, Outlook, Power PointPlanning & Design: Microsoft Project, VisioCertification(s) in relevant field of expertise is helpful."}