{"title":"Lean Manufacturing Engineer - US Citizen/GC Holder NEW!","location":"","salary":"","description":"","term":"$36 to $38 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AALxVfzCBn72EMYujx9uS4CQ7AsbLk1y6q5SidObQjwwrWzH0w8uuXzFiP0J54KnOl7bVkbjo39ZEZCK1oEAcgSy9JTUXsIw5JbZMd-CJoj_HEdTcM-ksJBOdGrYLvTlGslluZBWgZAoRWoI48ysC_51Vj6ninaxR90eayvQUvx6_kJX5kzm2MRR7qaqd1sN","source":"ziprecruiter","full_description":"Description:The Lean Manufacturing Engineer is responsible for but not limited to:• Assess plant process capability.• Collect process cycle time and machine downtime data.• Analyze system throughput bottleneck and make design improvement recommendations.• Implement lean process in plant, train plant with lean methodologies, continuous improvement and problem-solving tools.Requirements: • Positions are scheduled for short-term basis of 6 months or possibly longer based on justification of work load.• Completed Bachelor of Science degree, preferred in Operations, Mechanical, Industrial and/or Manufacturing Engineering from an ABET accredited university with 1-2 years of experience. • Related technical degrees will also be considered.• MUST BE a problem identifier and not a \"doer”, perform tasks with specific guidance in a plant environment.• Strong mechanical skills with understanding of manufacturing equipment operation• Strong people skills to train, coach and develop others. • WOULD LIKE TO HIGHLY PREFER SKILL OR EXPERIENCE IN RECRUTING OR INVOLVED IN THE MANUFACTURING INTERVIEW PROCESS.• Strong computer skills (Microsoft office suite, especially Excel and Google Suite)• MUST BE willing to travel 100% of the time to automotive suppliers/plants, domestically, 2 hours within the Detroit, MI area, Dayton OH, and areas in Ontario Canada. • A company car may not be available, reliable transportation is required with a valid driver's license is required as well as a clean driving record. • This candidate needs to be dependable enough to receive limited, having strong business acumen skills, professional dress as they are representing the company at supplier locations. • Strong attention to detail work in a fast paced, dynamic work environment, professional dress and acumen.• The Lean Manufacturing - SIM (Supplier Integration Management) Specialist shall be able to participate and complete assigned improvement activities in an automotive manufacturing environment with specific elements of the supplier integration process, experience with these skills below are not required but are Highly Preferred:• HTA – Hard to Access• CILR - Cleaning Inspecting Lubricants Retighten• EWO – Emergency Work Order• SOPs• 5s5T at a warehouse• Spare parts management• Tooling shop management"}