{"title":"senior iOS engineer, Starbucks Technology","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALKovER26qEREH23e3vHuYorNPq4YfaNa4otHgOJPEQcTGAFsXkU5JjxyneI2XSLUkvRRlYV0GW3y831HlHLFRFsRWSKAROYzXPk7t8u0tZPW9oAzyie6pk0yRyKvb4wvmTDvV02mlHahzMS3hcC3ChmCxHEspSrcGKhmZlrLkt4KHWJv2ymMkjdfyOTZB8","source":"ziprecruiter","full_description":"Job Summary and Mission The Starbucks iOS application is used by more than 19 million users every month and the iOS engineering team is growing and innovating quickly to deliver the best possible experience to our users.  Come join the Starbucks iOS engineering team and help evolve mobile engineering at one of the world's most successful digital rewards and loyalty platforms.  If you are driven by innovation, purpose-driven work, technical challenges and want to be a part of some amazing, industry-leading work come join us.As a member of the team, you will participate in assessing new projects and features for feasibility, write code for the latest features and important bug xes, and work to test and release those features to the public.  As a senior engineer on the team, you will be responsible for driving successful delivery of your work and the work of the immediate team, identifying then subsequently helping to drive efforts to mature team practices and improve the native digital platform.  This role requires an effective technical collaborator who has core iOS development expertise, has built and deployed apps to the Apple App Store, and has the experience and desire to operate in a senior capacity in the iOS engineering team.Responsibilities Build, iterate, and enhance the Starbucks iOS application Partner closely with the design team and other cross-functional members of the team to co-create intuitive easy to use app experiences for our users and the business Contribute to the ongoing improvement of architecture and code reviews Optimize existing code for maintainability and testability Improve app quality with the development of unit and automated UI testsMature and evolve team testing practice and philosophy Participate in vision and strategy exercises for the teamAbout You You approach challenges and problems with a positive solution-oriented mindset You can react swiftly to changing requirements and develop and explore alternative solutions You have a proven ability to learn new technologies relatively quickly and apply the gained knowledge to address customer and business problems You have a passion for iOS and you are up to speed on the latest Swift and iOS trends and developments A strong passion for learning and adapting to new technologiesTechnical Requirements Extensive software engineering experience with the iOS platform 4 years of professional experience developing consumer-facing iOS mobile applications 5 years of software development experience Strong experience in integrating RESTful APIs, GraphQL, push notications and multi threaded applications Attention to detail, particularly around software engineering fundamentals, testing methodologies, and quality. Advanced prociency with one or more common modern mobile architectural patterns (VIPER, MVVM, MVP) and reactive programming Strong experience in Swift with some prociency in Objective-C Experience with Core Location services is a plus Experience writing integration and unit tests Strong Git experience Experience with Xcode proling tools to identify and improve app performance is a plusCore Competencies Puts the Customer First: Have a relentless focus on the customer experience.  Understands what the customer wants and how to best deliver the experience. Works Well with Others: Listens and communicates well with others, within and outside of Starbucks.  Nurtures a team environment that is positive and productive. Leads Courageously: Takes personal responsibility to do the right thing and thrives in times of challenge or uncertainty.  Adapts quickly to change and makes timely, thoughtful decisions. Develops Continuously: Continuously seeks opportunities to improve her/his/ themselves and others.  Leads with trust, honesty, and commitment to hire, coach and develop partners to achieve their potential. Achieves Results: Understands what drives overall business success and is accountable for prioritizing and delivering quality results.  Works well through ambiguity and subsequently anticipates obstacles and takes action to prevent or minimize their impact. Drives Quality Improvement: Understands the importance quality and app/ platform health; this includes but isn't limited to writing unit, integration and automated UI tests while driving improvements in code quality.  Supports the team in improving code quality and demonstrates this in their own work. Helps to identify gaps in overall efforts to improve code quality and leads team-oriented efforts to address known issues. Helps Others Succeed: Puts the needs of others ahead of their own.  Demonstrates a willingness to mentor, coach and sponsor others while helping to nurture a culture of warmth and belonging where others feel welcome. Starbucks and its brands are an equal opportunity employer of all qualified individuals. We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA , veterans and persons with disabilities are encouraged to apply. Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at 206-318-0660 or via email at applicantaccommodation@starbucks.com"}