{"title":"iOS Mobile Application Developer (Remote)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJsz8EKUg3NAy5XFQekiYkgKCNitIaV5UVx6OyaRAOjNlEpvYUtjSavORvAqgX9D1gHgsWg0zNo0yUd1CdzdAEY220iMpV9-QTI20JUOm_N4ngKJ49ZcvGdVARaOpvvtjd6cx8MeMv_IaOCNVPnGblHwdlfHxCrHu892lro5xHVw-dVEBt2yMsLZULh0bYb","source":"ziprecruiter","full_description":"Your Role:Constellation Digital Partners has created the world's first open digital services platform dedicated to the credit union industry. We're looking for a capable and motivated individual to play a key role in the technical development of the Constellation platform. Our work environment is relaxed, hardworking and highly collaborative. Applicants must be comfortable in an upbeat, evolving environment.The iOS Mobile Application Developer primary role will be the development and enhancements of Constellations platform content delivery via iOS Devices. The Mobile Application Developer will turn the ideas of the solutions team and their stake holders into high performing, scalable, and elegant code. The right candidate for this job will be ambitious and self-directed with a passion for Agile-based mobile application development. Must have prior iOS Mobile Application Development experience across the full stack including user interface, API, data, and analytics development with a thorough understand of DevOps and its supporting services and tools. In short you will take the app from creation to deployment.The contributions you can anticipate making:Developing functional and responsive iOS mobile applications.Development of mobile components of the Constellation platform across its full life cycle.Contributing to the overall architecture of the platform and its applications.Maintaining the quality, performance, and responsiveness of the platform with heavy focus on our iOS delivery.Collaborating with product managers, internal and external development resources, and other stakeholders to design, develop, and launch new features.Engaging in all aspects of release cycles, including requirements review, work estimation, design, implementation, testing, and review.Providing last-line application support to internal teams and external customers.Able to take an iOS app from development through deployment.To be successful in this role, you will need to have:A demonstrated ability to work well with people across multiple technical disciplines.A “can do” positive attitude coupled with a strong respect for others and a results-oriented work style.Proven ability to collaborate with other team members to successfully create and deliver on a product roadmap and architectural framework.Strong interpersonal skills, able to collaborate as part of a small team in a fast-paced environment.Strong communication skills (oral, presentation, and written).Ability to manage multiple priorities.Ability to take ownership of an existing codebase and become the subject-matter expert on it.Strong organization and time management skills.Required to adhere to organizational policies, procedures, standards, and controls as well as comply with all federal and state laws and regulations.Interested? Here's what we need to see on your resume:5+ years of software development experience.At least 3 years of hands-on development experience with native mobile application development in iOS (Objective-C, Xcode, App Store Connect).Knowledge and experience using Xcode Instruments to diagnose issues, improve performance, etc.Experience with Jenkins and/or Fastlane build tools are a plus.Strong hands-on understanding of industry best practices for mobile app development, including emerging technologies, network architecture and other mobile technologies.Experience working with DevOps teams in establishing automated builds, tests and deployments.Experience in Agile development methodology.Proven success identifying and applying technologies and standards to solve complex business problems.Working knowledge of architectural and IT operational concepts, strategies, standards and policies.Demonstrated knowledge and skills in application architecture and data architecture."}