{"title":"Technical Writer-MIL-STD (1054)","location":"","salary":"","description":"","term":"$51 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAIc9cetQjme82ZlWwwUt2BxiAr3_8DkmUSAn7nWb0c2ppxFnSUyCMCrNLpXZ3l4LbDQ0yUMGafFxga9znqA0GhEjhFSaur8s9qGbg56O1wqD8Llw3XPBywZegm2XRuwBFJ1UgR99qJbHPUEH_27BXk0ZdhfrTmWSyzuCxQRTZqHi-fi2ec3F67__n3lSd4","source":"ziprecruiter","full_description":"Job Title Technical Writer-MIL-STD (1054)Location Grand Prairie, TXJob Number 1054/3003Residency US Citizens OnlyClearance SecretDuration 1 Year ContractPay Rate $51.00 per hourPer diem Yes split availableOvertime Unknown details at interviewShifts Every other Friday off (9x80 shift)Notes Mix of onsite and remote work.Our client is seeking a Technical Writer to provides a wide array of technical documentation written to Military Specifications. Primary responsibilities include developing and validating Interactive Electronic Technical Manuals (IETMs), Depot Maintenance Work Requirements (DMWRs), Repair Parts and Special Tools Lists (RPSTLs), procedural art and illustrated graphics all developed to applicable Military Specifications. Candidate must be familiar with layout, design and structure of Organizational, Intermediate and Depot level Technical Manuals (TM’s)' including Operation and Maintenance, Theory of Operation, Fault Isolation Procedures, and Illustrated Parts Breakdowns (IPB’s).Required Skills*6-8 years’ Technical Writing experience in a Depot environment, writing technical content for maintenance technical manuals including installation, test, repair, and troubleshooting procedures.*Experience with XML and XSLT*Experience writing to MIL-STD-40051-1 and MIL-STD-40051-2 preferably Revision B• MIL-STD-2361C or later release*Experience with Arbortext Editor including Styler (5.4 or higher), UltraEdit or similar and Adobe Acrobat Pro*Experience producing illustrations using graphics tools such as IsoDraw, Autotrol or similar graphics tools*Experience using Content Management Systems such as Windchill*Proficient with Microsoft office (Word, Excel, Project, PowerPoint)*Must be familiar with layout, design and structure of Organizational, Intermediate and Depot level *Technical Manuals (TM’s)' including Operation and Maintenance, Theory of Operation, Fault Isolation Procedures, and Illustrated Parts Breakdowns (IPB’s). *Candidate must be willing to work overtime as required. Some travel may be required.Desired Skills*Experience with Multiple Launch Rocket System (MLRS)/High Mobility Artillery Rocket System (HIMARS) and Rockets.*Previous experience working with US Army or other Military publications*Bachelors or master’s degree in Information Technology, Electrical Engineering, Mechanical Engineering or Industrial Engineering"}