{"title":"CMM Programmer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIxzc0bXVGYyHUyDVPVEaed6SCYSgBud6lNj_hJ8eRC6LSxG357r23z6DNQS16KRgWWqUEtvF0qjRbrOpo90rgWCoGqimXTqy1gV2GCr9oZ9U4kLSHv1m1-8orHOQ8lkSnbQWeyEKdfNNc7MwneHVEAzz6JolfMUaq2_0EwWRIUMhQ-aW4kU7eGhTvAkqx5","source":"ziprecruiter","full_description":"Hiring Due to GROWTH!Aludyne is recognized as the #1 aluminum knuckle manufacturer in the world. We have over 25 strategically located facilities across the globe, with leading market shares in several key regions. With this infrastructure, we are able to serve our global customers as well as meet the needs of local demands of speed, flexibility and efficiency. At Aludyne, we aim to recruit and retain smart, inquisitive people fueled by the same entrepreneurial spirit that drives us. It’s how we deliver on the promises we make to customers, and to each other. We believe in continuous improvement for our workforce and providing them with the tools necessary to further their career while also giving them the autonomy to make a defined difference.Benefits We Offer:Comprehensive Benefits Package to include medical, dental and vision insurance, Health Savings Account with annual employer contributions, Flexible Spending Accounts, Tuition Reimbursement, Employer 401K Match, Employee Assistance Program, paid vacation and holidaysAludyne is hiring a CMM Programmer. This position provides layout information from CMM (Coordinate Measuring Machine) for new machine start-ups, capability studies and any other cause for coordinate layout. Primary Duties and Responsibilities Include:Perform any layout requirements Must be familiar with blueprint readingMust be familiar with geometric dimension and tolerance.Must be able to start, run, and program all CMMs in plantMust be able to assist troubleshooting machining issues with layout dataDevelop system to centrally locate Master CMM and Romer programs.Work with CMM I to develop their skillsets. Develop protocol for generating CSV files in Datapage.Obtain Part Models and Blueprints for prototype / new jobs.Design holding fixtures for prototype / new jobs.Primary liaison with vendors on calibration and repair of CMM machines.Assist Quality Engineering and Gage Calibration Technician on special projects as needed.Assist CAD/CAM Technicians with CNC part development projects as needed.Regularly scheduled follow up training and competency evaluation will take place annually and be included with an employee’s annual evaluation summary and maintained by HR in the employee records.Required to follow any other instructions and to perform any other duties upon request of the supervisorWhen necessary, participate in classes and training seminars to learn new technologies and techniques deemed helpful to performance on the jobDevelop PCDMIS programs for new jobs and gauges.Write the programs.Delegate to CMM I to develop their skills.Develop programs in Polyworks for 3D scanning.Write the programsDelegate to CMM I to develop their skills.RequirementsHigh School Degree or equivalent required Associates degree in CMM programming or related field preferred but not required1-2 years’ experience in CMM operating preferred but not requiredAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identification, national origin, age, protected status, Veteran status or status as an individual with a disability. All qualified applicants will not be discriminated against on the basis of a disability."}