{"title":"Maintenance Mechanic - Rotating NEW!","location":"","salary":"","description":"","term":"$26 to $29 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIbWRIlQKhqGZ-A9fQkuIBLDZwcad77F1m-7F1JCydyRb2cblyLe94YsMOvPtUU5x_gxrAByAMRumwin8qieZegsWbFTBnPFV0WLKnHamKQLyUpB7_ixcUscziKEfTRellKiKYXALk_5Mj4PodzJWxW16GdaUAHuQVqrNWd_VaT5oc75anTXA80bVsz-TZx","source":"ziprecruiter","full_description":"Madden Industrial Craftsmen is looking to fill a direct hire Maintenance Mechanic position with our client in the Kent area. The person in this position will responsible for installing, repairing and maintaining product equipment and performing routine maintenance.Night shift: 6:00 pm to 8:00 am (rotating schedule)ResponsibilitiesRepairs and reconditions hydraulic/pneumatic systems (airlines, solenoids).Maintains, repairs, and modifies extruders, pullers, calibration tables, saws, and refrigeration equipment.Repairs and maintains plant water systems.Replaces and repairs electrical equipment/components.Repairs and maintains material systems.Fabricates and welds parts for repairs, retrofits and modifications.Installs plumbing, air and electrical utilities necessary for machine operation.Ensures machine properly functions (voltage, proper operation).Observes mechanical devices in operation and listens to their sounds to locate causes of trouble.Dismantles devices to gain access to and remove defective parts.Examines form and texture of parts to detect imperfections.Inspects used parts to determine changes in dimensional requirements.Adjusts functional parts of devices and control instruments.Repairs or replaces defective parts. Installs special functional and structural parts in devices. Lubricates and cleans parts.Starts devices to test their performance.Sets up and operates lathe, drill press, grinder, and other metalworking tools to make and repair parts.Initiates purchase order for parts and machines. Repairs electrical equipment.Education/Experience3+ years’ experience.Formal training or OJT with electrical theory and mechanical applications.Strong knowledge and experience with electrical and mechanical applications.Professional work ethic and demonstrated leadership with the ability to foster teamwork.Good organization skills with the ability to effectively manage multiple on-going projects.Good adaptability with the ability to switch directions quickly and professionally.Good communication skills, both verbally and in writing, ability to read and understand blueprints desirableProficient technical and systems experience, including previous CMM systems experienceGood manual dexterity and able to lift up to 50 lbsBenefits:Health BenefitsReferral BonusesSaving BenefitsFinancial BenefitsWellness BenefitsCandidates must pass a hair - drug screen"}