{"title":"Technical Services Rep - Get off the Tools & out of the Weather!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAInKw-DX2-6gBx5nArjUe5rn3xfJMUi5T1sRhOJWuLfaqhOTB9HB2m1ER80zzj_O-3tvPAG78sK4OiIKsWop02S_VGsQOadpd0gbCt9O2kq38IOfukmiItAKpbtX0cHrfPE7DSMPeMwkKl34soxYkW2l_kHJ605m80ySqEoWK7rm6XDGlRQ0ilcaHNF3Tg","source":"ziprecruiter","full_description":"Job Description- Technical Services RepresentativeLooking to get off the tools and out of the weather? Then we'd love to hear from you! This opportunity is ideal for someone with hands on experience in Plumbing / Electrical / HVAC / Refrigeration installation, maintenance and/or repairs. This role will allow you the comfort and security of working in a friendly office environment while still using your technical skills and knowledge with our customers, staff and installation/service partners. You will be the knowledge holder and main point of contact for product, installation and troubleshooting inquiries.Opportunity - We currently have a great new opportunity for a Technical Services Representative to join Oasis International. Oasis recently became a part of the Culligan International group and are undergoing very exciting growth, allowing us to bring new talent into the team to continue growing Oasis into the future. This role will be responsible for providing technical support to Oasis customers including installation support, answering product questions and assisting with warranty claims.About us: https://www.oasiscoolers.com/ & https://corporate.culligan.comFor more than 100 years Oasis International has manufactured and distributed some of the world's best clean drinking water solutions. We are recognized worldwide as a leader in the water cooler / drinking fountain industry. We are also a prime provider of bottle water coolers, point-of-use coolers, filtration equipment and dehumidifiers for homes, offices, schools, businesses, hospitals and municipal buildings and are now a core part of the wider Culligan International business. We deliver water-friendly solutions to more than 80 countries across the Americas, Europe, Asia, Africa and the Middle East. We're known by some of these brand names: Versacooler®, Aqua Pointe®, Freshshield and Green Filter®. Today, our goal is what it has always been: to provide clean, refreshing drinking water that is free from harmful bacteria, viruses, sediments, metals and chemicals.Role Overview: The Technical Services Representative / Technical Customer Service Rep is an office-based role which will provide product technical support to Customers, company Service Centers, and the Oasis sales force using the phone, email, video calling apps etc. This will include troubleshooting problems, researching issues/questions, assisting customers with installation support, etc. The Technical Services Representative will schedule and follow up appointments made with Service Centers for repairs, assist in setting up new Service Centers, and negotiate service call pricing. This position will be based on standard office hours, Monday – Friday, 8.30am to 5pm.Key Responsibilities:Answer phone calls as they come in to troubleshoot issues with product or units in a courteous, professional mannerWill also respond to inquiries via email and live chatProvide verbal and written assistance for a variety of questions that arise regarding product info, installation assistance, cleaning of equipment, etc.Provide remote support and administration to engineering team on service bulletins, illustrated parts breakdowns, new product guides, specification sheets, etc. in the form of proof reading, advice, error corrections etc.Assist customers with determining parts needs and availabilityUnderstand and convey company warranty policies; work with customers over the phone on necessary repair or replacement of defective products following warranty policies and guidelinesWill also report any quality issues to manufacturing teamAssist customer service with processing RGA'sKey Skills and Qualifications:Experience working with refrigeration, plumbing, electrical systems, and/or HVAC products is highly recommendedAble to work independently and efficiently to meet deadlinesAbility to become familiar with products and how they function in order to analyze issues with productsExperience with JDEdwards or AS400 series preferredAble to promptly answer support emails, phone calls and other electronic communicationsSelf-motivated, detail oriented and organizedHigh School Graduate or GEDExcellent customer service skillsMicrosoft Office - Proficient in Excel/Word/OutlookBasic supply chain or logistics knowledge preferredCompetencies: To perform the job successfully, an individual should demonstrate the following competencies in this position; Judgement/ Decision Making, Independence, Team Player, Customer Focus, Organizational/Planning, Goal Setting, Accountability, Excellent Communication SkillsCulligan is an Equal Opportunity Employer"}