{"title":"Field Services Specialist Client Support","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJaeRvOEe4GUcWrFXQR9X9CRhjqwhbgG8pmYY3mp6xwyW7WukVOSfW89hMTFbhF2OBdxkfkpGL2YxjIkE7Fi92fS5NtDHJj5vlNXdzpplzb1SzIwUnzCuo-_SISVAvRXTrlzZ5bLu1G1og66Gg1taZO4eXosvwxsH5KHpRgRfbvpkWXvq0aGy0ROXinNv4","source":"ziprecruiter","full_description":"Hello,My name is Yogesh Gathe and, I am a senior recruiter working with Experis a part of ManpowerGroup. I have an excellent and long-term opportunity with a direct client of ours. This opportunity is urgent and looking to move very quickly, please apply by sending your email or forwarding on to anyone you know who might be a fit. I am looking forward to connecting with you! Job Title: Field Services Specialist Client SupportLocation: New York City, NY 10001 (Remote to start)Duration: 8 Months contract  ***This role WILL NOT sit 100% remote. The role will work out of Nespresso HQ office at: 111 West 33rd St. FL 5 New York City, New York 10001 Description:Description of Responsibilities:The job responsibilities require extensive knowledge of both hardware and software in order to provide client support which includes installation/deployment, upgrading and troubleshooting hardware, software and mobile technology solutions.Hardware: Must be familiar with HP laptops/desktops, HP printers and MFP's, air cards, mifi's, and variety of mobile handheld devices including Blackberries, iPhones and various Smartphones using tethering and mobile hotspot technology.This will include a mixture of basic and advanced troubleshooting skills of all devices listed. Knowledge of Mac's would be a plus.Software:Must be familiar with Windows 7, 8 and 10 Operating Systems. Must have skills to perform troubleshooting for any hardware/software related issues and skills to research and correct the problem.This will include but not be limited to the Operation Systems (Windows7), Office 2010 and 2013, and Office 365, Internet Explorer, SAP, VPN software, Microsoft Tools (Active Directory, Computer Management), PC-to-PC connectivity software, data compression tools, and a basic knowledge of DOS commands.Must have strong skills for remote setup /access using any internet service provider/carrier and any type of home/hotel configurations.In addition, must have familiarity with networking processes.Must be personable and able to communicate at the client level, work closely across the IT organization, and most important function well in a team atmosphere.Must have the ability to diagnose and resolve client issues over the phone as well as face-to-face.Regards, Yogesh Gathe | Talent Acquisition Specialist | Experis CORE+ Phone: 612-246-3934 Ext: 7184 OR 414-323-8455 Ext: 7184 100 Manpower Place, Milwaukee WI 53212"}