{"title":"Bridge Maintenance Mechanic","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIJOmlei9cvJZ_3bKxLW07nlQLm4ZlG8WtWFwO88p1F0Ml9TcolEIm3ZT_iQTY0Du4wAzJUxmpzJZH7S_LkULG1-urLAaiUKl7esAhKGkC7r357FwRljGNmIMxQjXvIqVl448Couz4Yev6yVM39k0_MAikMK6ZlWDtiCUyhqsBgmn5fCuum0kyELfZyLI8","source":"ziprecruiter","full_description":"Position Description Vision: Seattle is a thriving and equitable community powered by dependable transportation.Mission: To deliver a transportation system that provides safe and affordable access to places and opportunities.The Seattle Department of Transportation (SDOT) is a nationally recognized municipal transportation agency at the leading edge of multi-modal transportation.  In our quickly growing city, accessibility, safety, affordability, and reliability - are top of mind for us every day! Our core values drive our work toward creating an equitable, sustainable, and vibrant city for all. SDOT's core responsibilities include maintenance and operations of the city's transportation right-of-way, the expansion of the city's bicycle and pedestrian network, care of over 240 bridges, permitting use of public spaces and enhancing access to the regional transit system. With approximately 950 dedicated staff, SDOT maintains an operational presence 24 hours a day, 7 days a week, in all weather conditions to serve and ensure Seattle's public mobility.SDOT has excellent opportunities for two Bridge Maintenance Mechanics on our Bridge Mechanical Maintenance Team within the Roadway Structures Division. In this role, Bridge Maintenance Mechanics perform on-site restoration, maintenance, repair, and new construction of bascule bridges, tunnels, fixed spans, subways, seawalls, stairways, and associated structures. These positions report to the Bridge Maintenance Mechanic Crew Chief. You will impart your experience by training and leading less experienced Bridge Maintenance Mechanical Helpers, further developing SDOT's future bridge maintenance team! Job Responsibilities Perform skilled oxyacetylene and electric arc welding of all types of metals and alloys on bascule bridges, fixed spans, and subways.  Perform fabrication and repairs on bridge structural members, truck booms, brackets, frames, pump installations, tanks, panels, tools, shafts, steel stairways, catwalks, ladders, gear covers, and railings.  Cut, shape, and weld metal and alloy plates, parts, and structural members; prepare metals and alloys on shafts, and bits and tools for machining.  Replace and repair expansion joints; install anchor bolts and tighten existing anchor bolts; and set trans-flexors in close tolerance.  Interpret drawings and specifications and lays out work.  Install, replace, and repair new steel storm drains, water lines, pumps, plumbing, and piping associated with bridge and subway structures, and new sewer hookups.  Maintain and repair various mechanical plumbing systems such as fire suppression pneumatic and hydraulic systems.Build new traffic gates for bridges.Build forms for large structural parts, perform steel reinforcement work, patch cement curbs and railings.  Estimate materials, personnel requirements, and equipment needed for specific tasks.  Drive and operate a variety of equipment in excess of 26,000 GVW, including cranes such as fixed cab and articulating boom trucks and the Under-Bridge Inspection Truck (UBIT).  Prepare rigging; erect platforms and staging at extreme heights; hoist and place steel beams and other materials to affect repairs.  Act in a lead capacity over helpers; coordinate work activities with associated work crews.  Support departmental goals in promoting diversity, racial equity, and social justice. Qualifications Minimum Qualifications:Education:  High School diploma.Experience: Four (4) years of journey-level metal working experience.OR: An equivalent combination of education and experience that demonstrates the ability to perform the position duties.     Licenses & Certifications:A valid State of Washington Driver's License is required for employment. This license must be maintained throughout employment.A Class \"B\" Commercial Driver's License (CDL) with the airbrake restriction removed and a valid Medical Certificate are required within 90 days of employment. This license and certification must be maintained throughout employment.A complete Abstract of Driving Record (obtained at applicant's expense) from the State of Washington Department of Licensing.A State of Washington Boater Education Card or U.S. Coast Guard Marine Operator's License will be required if operating a boat.Pre-employment and random tests in compliance with the Federal Department of Transportation Drug and Alcohol Testing Program.A valid State of Washington Flagging Card, forklift certification, First Aid/CPR card, and/or a defensive driving course certificate may be required within six months of employment.NIMS training.Fall protection, lead testing and confined space training required within six months of employment.Respirator fit test program training is required within six months of employment and annually thereafter.Additional program and safety training as needed.Appropriate crane certification, as required by law, is required within six months of employment.  Desired Qualifications:Previous experience working at extreme heights, while suspended from baskets, scaffolding or safety belts.  Experience working with tools, equipment, and materials under hazardous conditions, such as on high bridge structures and or underground. Experience working in extreme weather conditions, in heavy traffic and with regular exposure to noise, fumes, dirt and dust.  Experience with and certification for operating small boats. Previous pier work performed outdoors. Possession of (CDL) Commercial Driver's License-Class A.Possession of NCCCO Crane Certification.Ability to effectively work in a multi-cultural workplace with a diverse customer base.   Other Requirements:  Work Environment/Physical Demands: Work must be performed safely and frequently at extreme heights, while suspended from baskets, scaffolding, or safety belts. Required to work with tools, equipment, and materials under hazardous conditions, such as on high bridge structures, underground, in small boats and under piers. Work is frequently performed outdoors in all weather conditions, in heavy traffic and with regular exposure to noise, fumes, dirt and dust. Required to climb, bend, stoop and lift objects weighing up to fifty pounds. May be required to work overtime, irregular hours, holidays, and weekends to respond to emergency situations. This position may be required to be on Standby Duty. Additional Information Your application will not be reviewed if these items are missing or incomplete.Hiring Process:Applications are reviewed after the posting closes. Qualified candidates must complete and submit  a NEOGOV online application to be considered.   Offers of employment are contingent on verification of information provided by the applicant as part of the application process, including potential background check, pre-employment physical and full driver's abstract.  Please note this job advertisement is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice."}