{"title":"Associate iOS Engineer, Next Gen","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL3pIw1uiKv81LfpXJfFd5TxMt2EGt8Pu0tDBP4iWxpHYK6TBxe9tM6QY3J3uwBONQVGp7-jS7wUSr01t9oUNz2fL9aJPokf37t67CM7xN07eXQTSVwsrjEEZ1h7hY7uV8woowDixorgSzlSC6GNrf4XDZLKpGUheTdEDZl20JW3kTjQMD9wW_loxnCIkg","source":"ziprecruiter","full_description":"Position Summary: As an Associate Engineer, you will be responsible for the planning, building, testing, and deployment of entirely new NBA products across the Apple eco-system (iOS, iPadOS, tvOS, and watchOS). You possess strong technical aptitude, have experience building for Apple platforms, and wish to further your expertise in software design and architecture. You'll join a team distinguished by diversity in life, vision, and previous experience while sharing an ambitious and creative world view reflecting the values of our organization. You will find an opportunity to shape and scale products to millions of passionate, engaged fans around the world, and to shape a small team of collaborative, supportive, and visionary builders alongside you.Major Responsibility: Contribute Swift code with responsibility for major product featuresCreate iterative and approachable code commits and well-documented pull requestsOwn workflow processes, automation, and integrationsLeverage standard Apple development workflows: App Store Connect, Code-signing and provisioning, Xcode, Instruments Design, implement, and maintain the appropriate unit, UI, and integration testsPerform constructive code reviews and collaborate in larger architecture and design discussionsManage workload and organization using Agile methodology and project ticketing toolsRequired Skills/Knowledge: 1+ year experience in developing software for Apple platforms Fluency in Swift 4+, UIKit, SwiftUI, Foundation and Standard librariesKnowledgeable of prevailing platform patterns, designs, idioms and a desire to respectfully debate their merits and trade-offsProficiency with standard workflow tooling for source management and ci/cdExperience with Agile development philosophies and practicesUnderstanding of the role asynchronous code plays in modern application architecturesInterest in specific domains for sports and live-sport-event technologies: Video streaming, low-latency networking strategies, etc.Education: Bachelor's degree or equivalent work experience (internships and personal projects in app-store or open-source contributions are all valid for experience consideration)."}