{"title":"Front End Engineer - iOS NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ4scyWFJtk74BjC7VBfdv9uhipYKp5y8n6cJTB82_GL_kekGr1ecMC32k9PsSWIhtLZF84dGkqMlHmO6fh5LLxCh0PDD6BefLvChHGI_HqQBtV7sY2tMqUzzjX3ze2IgTde1w_zaEbbCkYCf-Bs9fD3hyAlslpEZmWAY3QYddnpv0Sf35563LMZxnz1Ww","source":"ziprecruiter","full_description":"If you are a creative iOS Engineer with a solid computer science foundation who enjoys wide latitude in problem solving, we want to talk with you. Shopbop (an Amazon subsidiary) is looking for iOS Front-end Engineer to join our team developing a world-class mobile experience for our customers. This role will be instrumental in making Shopbop, the daily destination inspiring fashion worldwide. As an Amazon subsidiary, Shopbop teams interact with and contribute to teams across Amazon.What we're looking for:The ideal candidate for this position has a strong sense of ownership and experience delivering creative solutions for complex problems. You need a strong customer focus coupled with a passion for continuous, data-driven improvements. This job requires a commitment to teamwork, agility, strong communication skills, and being comfortable crossing org boundaries to get things done. Working in our reliable, scalable, and high-performance system requires exceptional technical expertise and a sound understanding of front-end technologies and frameworks.You will enjoy a very competitive salary, great benefits, an innovative culture, and exciting opportunities to make history, have fun and be part of the redefining how the world shops online.How do you know if you are a good fit for us? You are an iOS developer with a passion for creating features that delight customers. You want to build systems to support new business processes and reshape existing applications. You want to have a wide domain of ownership. You love owning projects from idea to production, delivering in all phases from the kernel of an idea through the implementation to quickly getting that battle-tested code into production. You are continually learning - we develop with the latest cutting-edge technologies. You create innovative solutions to challenging problems. You enjoy collaborating with your teammates who are world-class developers like yourself. You love working in agile programming environments and running fast to deliver evolution for your applications. You want to shape the future of the fashion retail industry and the future of Amazon.About Shopbop | East DaneSince its launch in 2000 as a modestly-sized online boutique specializing in hard-to-find denim lines, Shopbop has grown to become one of the leading fashion retailers in the world. Curated with a chic, modern woman in mind, Shopbop offers a comprehensive collection of designer apparel and accessories to suit every style and occasion.Called \"the editors of what's cool\" by Daily Candy, and recognized by The Wall Street Journal as having \"the best customer service,\" we are committed to staying ahead of the curve and providing a personalized shopping experience continue to be driving forces behind the company's success. A champion of new design talent and a pioneer in the magazine-meets-boutique approach to online shopping, Shopbop showcases its fashion-forward point of view in editorial lookbook features and receives frequent mention in Vogue, Harper's Bazaar, and Elle. Shopbop's Exclusives section features limited-edition pieces from top designers available only at Shopbop. We are not resting on our laurels. We have the pleasure of delighting some of the world's most passionate clothing and apparel shoppers worldwide.Amazon.com is an Equal Opportunity Employer - Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation / Age."}