{"title":"Entry Level Field Sales​ Agent (Full Time)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKv-ACwed2HBdXrqHH1c4creGU0YhJtRXPSU46ELqFko8l46tj4JfsWesysQ-9aXOqI8VYWP_3idzCVfLksJ2NZWR2P3piwpm3wtrSrHRoaP6oPHcPll9zAdMzaey41t4h98LhHfHlvXSESLl1zMD3mnLvTwaBsPHPbaDepmXMo8-BCcFBSGWMH2Rgj1OM","source":"ziprecruiter","full_description":"Axiom is now interviewing qualified candidates! *** If you would like to send a personal cover letter to support your application please send it to hr@axiommarketinginc.com​ (optional)The ideal candidate is self-motivated, enjoys working one-on-one with people and thrives in a fast paced business oriented environment.Day to Day Responsibilities Include (not limited to):Learn, understand and retain product knowledgeIntroduce products and services to customers in-person (PPE provided) Customer Retention and Follow UpWork with customers to find what they want, create solutions and ensure a smooth sales processEngaging in office based training meetings (leadership, management, business development etc.)Representing our clients with professionalism, integrity and positive energyMake a positive contribution to our vibrant team and company cultureOn any given day, you’ll work to build customer relationships, provide superior customer service, close deals, and leave a lasting impression to build a strong pipeline of future customers.What can you expect from Axiom:Having fun, innovation, and team interaction is always encouragedNo seniority policy. You perform well - you get rewarded.Personal and Professional developmentMentorship and guidance every step of the wayModern, family-oriented environmentExciting travel opportunities (always optional)Core ValuesIntegrity - Doing what’s right, not what’s easyPositive Attitude - We believe when you put out good you receive good backCommitment to be the best - We believe if you do anything you must do it to the best of your ability; because if not, why do it?This is a great opportunity to learn about entrepreneurship, business startups, the sales industry and fundamental promotional and marketing skills. You will develop and hone interpersonal, public speaking, and leadership abilities through frequent interaction with people from all demographics.Visit Us!http://axiommarketinginc.com* If you think you can be a positive addition to our growing team please apply now to be considered by our HR team for an interview."}