{"title":"Knowledge Management Software Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIeUj2CoQdyUAAJjylCh9GARrebzWDC-XWnMnr0dy8b5gjxf3_Q1GMjTSp5VWKX7-EbwNej50QiKsz6BgGgL6buQh7UaSoUBQXLAxZlh6OgfKzfWPmKGeNiuDUEmbBNibM4ZXHVep3WXwXWhq0UWSbLoFHNlQaUvZdmEa0axgDUjbV6nLzcsX1DFyY7mcE","source":"ziprecruiter","full_description":"Boecore is seeking a Knowledge Management - Software Developer to perform software engineering, software development, and development of a SharePoint based Content Management System (CMS). Provide technical expertise to design, develop and implement solutions to meet prioritized, on-time, demand for tools and applications with emphasis on collaborative web/database solutions, and produce technical procedural documentation in support CMS operations.Position DescriptionIn close collaboration with Government customer and users, perform software engineering activities to include: concept, requirements, design, analysis, development, testing, government acceptance, integration, documentation, delivery, operation, and maintenance of SharePoint software applications within an enterprise system.Software development activities also include implementation of: security controls, performance monitoring and improvement, and SharePoint templates, document sets, and workflows.SharePoint activities include: portal branding, graphics and page layout design, and training end users to update SharePoint pages and templates.Web Portal tasks include: providing support for technology enhancements, graphic support, testing, design, identification and recommendation of the latest technologies, web hosting and design, posting modifications to the web site, testing and re-engineering of existing web pages, and maintenance of web sites.Essential DutiesCollect and analyze requirements, design, develop, test, deploy and maintain SharePoint application software. Directly involved with the customer in planning of system, workflows, and development as well as responsible for meeting software compliance standards.Evaluates the interface between SharePoint and other software applications, operational requirements and workflows, and characteristics of overall system. Documents testing and maintenance of system corrections. Works under consultative direction from the on-site customer towards predetermined objectives and deliverables.Specific requirements and functional software deliverables are determined prior to each phased, development cycle. Tactfully and professionally collaborates with the on-site customer to determine, agree to, and pursue courses of action necessary to obtain desired results.Conduct requirements collection and analysis through optimistic and positive collaboration with on-site customer personnel.Analyze system specifications and translate system requirements to task specifications.Responsible for designing SharePoint solutions to meet customer requirements.Analyze, design, coordinate, develop, and maintain SharePoint based software functionality within an enterprise system.Responsible for utilizing software development tools and equipment involved in the performance of essential functions of programming.Provide assistance to testers and support personnel as needed to provide resolution to system problems.Required Skills and Experience:BS/BA and 6 years of experience; or Graduate Degree and 4 years of experienceDemonstrate high degree of analytical ability to gather, assemble, and analyze facts, draw conclusions, and devise solutions to problems which will increase the effectiveness of CMS business process.Able to independently produce technical documentation to support CMS operations to include; planning and workflows, schedules, systems checklists, operating and security procedures and training instruction.Must have or be able to obtain a TS/SCI clearance.Preferred Skills:Six Sigma Black BeltSharePoint Security Model.Current Department of Defense (DoD) software environments.Salary Range: Senior level $93k - $136kAbout BoecoreBoecore is a woman-owned small business focused on providing the Department of Defense with high-quality Engineering and Information Technology solutions at both local and national levels. Boecore is a proven leader in Software and Systems Engineering, Cyber Solutions, and Specialized Mission Operations. We offer a team-based environment where each employee can contribute to our success and be a part of our rapid growth.Boecore employees are self-motivated individuals who are recognized and rewarded for their efforts. We offer competitive salaries, comprehensive health insurance coverage, life, and disability insurance, savings plans, company paid holidays and paid time off (PTO), AFLAC, tuition, and training reimbursement, matching 401(k) program, discretionary incentive bonuses in addition to base pay and a rewarding work environment with a proven record of success for 20 years. Boecore is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, marital status, national origin, age, veteran status, disability, or any other protected class."}