{"title":"Technical Writer (Tech Specs. & Standards)","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AALgHTU06c22XTIAvYevcgJZpVDU5BdlBFVEL-dK5Lt2PbuK1COi-drEwtbp3-yRVKVUkDFbGmSWT3MzJnr3X6L_t1eYMl5zHPMhpc3AD0-ENaQkiNdjknnbBl0NpVZAfPzcT6BY7Uer2QcBmzhBw3dQl3wZvd_YOr9UKfhyzf0_uQzccMhFUaaDCXFt7A","source":"ziprecruiter","full_description":"We are hiring a Technical Writer (Tech Specs. & Standards) for a Contract To Hire position in Atlanta, GAOur client, one of the world s largest and most innovative companies, is looking to hire a technical specifications editor/writer to work with various POC Labs and Scale Pilot teams (globally) to consolidate technical hardware specifications into globalized standards for leadership approval and propagation.  Passion for sourcing vast amounts of technical specifications from various internal PoCs and Scale Pilot programs. Interfacing directly with embedded Project Manager and global support workers (Pilots) for updates and changes to technical specifications.  Exceptional written communication skills, especially regarding composition, spelling, and grammar, and including excellent command and understanding of the English language Strong critical thinking and analytical skills, including the ability to analyze current standards  Ability to present complex technical information in a clear and concise manner to non-technical people, including the ability to tailor content for varying audiences or forms of communication  Ability to work independently, including taking initiative and ownership of assigned tasks and managing competing priorities Compile technical specifications into a formalized Standards documents, and PPT presentations for review and final approval Present proposed Technology Standards to leadership for consideration of global adoption  Must be well organized and very detail oriented Ability and desire to share knowledgeRemote Work. Standard work hours Who is Calance?Calance is a global IT company with operations in the United States, Canada and India. Over the years, Calance has grown organically and has acquired numerous successful IT Services firms along the way. As a result, the company today is a mix of diverse cultures, talents and expertise that collaborate globally to bring our best capabilities and thinking to clients. Calance also offers benefits which includes Medical, Dental, Vision care and 401K.Calance - the place to grow.www.calance.com"}