{"title":"JR0160577 - Interface Application Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJwjhkRqTh707f-ge2aS6Q65u3yHFBmZ6v9uAwXDZ3LjDpfqVGOyBCQ650kbIytveXqcoiCnGlPCb6fMaRED305ZPVXNivBfn3MVwsX8t9ER5gjCYAIOF-ZsjFn_2OOhnvOGh7QDFbZ4_ngDBT2smUG4FdXoS8Bs7MQAmzPf552UxX7327NVH1DUuZjf5KT","source":"ziprecruiter","full_description":"Job ID: JR0160577 Job Category: Engineering Primary Location: San Jose, CA US Other Locations: Job Type: Experienced Hire Interface Application Engineer Job Description As part of Intel, the Programmable Solutions Group (PSG) is poised to deliver high quality timely and differentiating FPGA solutions to our customers. In line with that PSG is looking for Application Engineer with expertise in Ethernet and 5G IPs to join our dynamic and growing team As a Networking and Communication Interfaces IP Application Engineer in the Customer Experience Group you will be responsible for providing proactive or reactive technical support to Intel PSG customers and sales teams in resolving challenging customer issues for Ethernet and 5G IPs . You will act as the technical subject matter expert to our key customers in helping to resolve the challenges as they go from prototype to production. We value technical excellence, customer focus, integrity and teamwork. Your specific role will have opportunity to but not limited to the following Generate bring up of designs for Transceivers Ethernet10G/25G/40G/100G/200G/400G and 5G Ips(CPRI, eCPRI, ORAN, FEC IPs etc) Participate in interoperability testing and compliance for protocol IPs Highlight protocol IP use models and demonstrate performance to customers Create collaterals including protocol IP, user guide reference designs, technology demonstration tools and macro Collaborate with cross functional teams in issue resolution protocol validation and providing feedback on protocol IPs quality and customer experience Qualifications Minimum qualifications: You must possess the minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Bachelor's degree in Electrical or Computer Engineering with 1+ year of experience OR Master's degree in Electrical or Computer Engineering Inside this Business Group The Programmable Solutions Group (PSG) was formed from the acquisition of Altera. As part of Intel, PSG will create market-leading programmable logic devices that deliver a wider range of capabilities than customers experience today. Combining Altera's industry-leading FPGA technology and customer support with Intel's world-class semiconductor manufacturing capabilities will enable customers to create the next generation of electronic systems with unmatched performance and power efficiency. PSG takes pride in creating an energetic and dynamic work environment that is driven by ingenuity and innovation. We believe the growth and success of our group is directly linked to the growth and satisfaction of our employees. That is why PSG is committed to a work environment that is flexible and collaborative, and allows our employees to reach their full potential. Posting Statement All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance. USExperienced HireJR0160577San Jose"}