{"title":"Sr. Software Engineer - Streaming Analytics NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI6R2UZZrf8NcRzO1wUW4agkVOhpKRvCxxIMIcRJk2-9I_RimAf6OT5T6yH3ZZS0rJg_3Wt3cWT9dNucGKlQ6EApYCOFEIYtD2xOZf2CWj75HM8_0UbamGrmOnThep5xlZ7-Q8IvBZpxAn8x7a4ynLUxEhVU1LknDPTrfVWxhSYVejVclYl4zjvuxD8sNg","source":"ziprecruiter","full_description":"Join us as we pursue our disruptive new vision to make data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we're committed to our work, our customers, having fun, and most importantly to each other's success. Learn more about Splunk careers and how you can become a part of our journey!Job Description:As the Senior Software Engineer for our Machine Learning team you will be responsible for ensuring the development of our new streaming based analytics and  ML system meets all technical and quality standards.  You will work with Product Management and other technical teams within Splunk, incorporating new requirements and providing technical information related to this advanced ML Platform as needed. You will work with a team of senior ML engineers, applied researchers and security researchers, experts within their own specialty. You will set an example for this group, as well as set high standard on quality, communication and ability to deliver with deadlines. You will contribute to architecture and technical decisions while also mentor junior members within the team. You will be working in a multi-office, multi-location development environment and prior experience working with local and remote teams or groups will be a plus.While expertise with ML products and their application within enterprise solutions is highly desirable it is not required, provided you are willing to quickly come up to speed and you have some prior experience of ML technology and its application.Requirements:6+ years software development with focus on large scale distributed systemsStrong background in building streaming applications or streaming analytics platformsExpert in one of the streaming platforms, preferably FlinkSome Machine Learning application development experience, this is NOT a data scientist role, but a services/platform development role.Ability to communicate effectively in conversations with researchers and engineers from academia backgroundPassionate about building and fostering good engineering practices and processes such as continuous integration and deployment etc.Experience developing and putting into production test automation and CI/CD systemsDesirable, but not required:Expertise in developing software with container deployment and orchestration technologies at scale, with strong knowledge of the fundamentals including service discovery, deployments, monitoring, scheduling, load balancing.Expertise in developing software on a public cloud platform (e.g. AWS, GCP, MS Azure etc.)Expertise in developing software with stream processing technology (e.g. Kafka, AWS Kinesis etc.)We value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.For job positions in San Francisco, CA, and other locations where required, we will consider for employment qualified applicants with arrest and conviction recordsThank you for your interest in Splunk!"}