{"title":"Technical Writer - Level 1","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL_qdR5zfBY7enq561APJwM9lBz_3nrhzDYP35tv2sTNLoQ0NBRc1j5wIc_vbk3slYPJwQZl6A213sikgtA42UM2JNB_WVWFBy5cTZ9iG-mgp0m8e0iV8kA4V-JpQ49pN8ACvgUg6NFYLgZaKV1YvEbgcsiLBdCA2QWM9xOsmngVitCfCP2vCx3NQOoO1M","source":"ziprecruiter","full_description":"OverviewBluehawk is seeking a Technical Writer - Level 1. ResponsibilitiesStandard Characteristics Responsible for the preparation, review, revision, and maintenance of technical documents including software and systems engineering, system operations, testing, and user documentation Writes and edits technical documentation for all of the project's hardware and software to include installation, configuration and how-to documentation Creates code documentation for software; produces implementation guides and end-user guides for capabilities; provides field, data definition, and data flow documentation and formats technical publications from pamphlets, technical drawings, and consultations with technical personnel and other available resources. Capabilities and Additional Requirements Develops, writes, and supports technical staff in the preparation of a wide variety of technical documentation, from requirements analysis, design, manuals, fielding documents, and network security documents. Understand basic concepts and write technical copy for various types of documents for a program/project of similar complexity. Prepare and maintain operations documentation, user guides and manuals and technical publications. Prepare reports, responses, and briefings targeted to a wide range of audiences. Work with developers to produce quality documentation and training materials. Coordinate layout and design of documents. Work on all phases of documentation. Assist in the preparation of documents and supports the development of contract deliverables and reports. Capable of managing several different tasks from several different requestors at one time.QualificationsEducation and Experience High School Diploma + 6 years Associate's Degree + 4 years Bachelor's Degree + 2 years Master's Degree + 0 years Training and Certifications DoD 8570 compliance or information assurance certification commensurate with technical objectives and services required within the task order. Applicable software or hardware training and certifications commensurate with the technical objectives, services required and IT environment specified within the task order. Bluehawk, LLC. is an Equal Opportunity/Affirmative Action Employer//EOE Minority/Female/Disabled/Veteran/Sexual Orientation/Gender Identity/ ID2021-2033Job LocationUS-CO-Colorado Springs"}