{"title":"Technical Support Specialist Intermediate NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKoNemetFrEQXdsN0HvhDi5iyVpWsgj-QI1-aUCHncca0jHfYgL3HAZrmvieQkpiZVClJGFGQSM5FrAvsv8Bt7b8MfEIR6e5yLs6KmLRYWZhlX7fpijg5MdpHJxcdvv5FCakMYfHSlnp914vfAJQyDy9dfvwgCz200ybCvwbVQYvv2foSS5Je_czHmcvWhe","source":"ziprecruiter","full_description":"Tech Support SpecialistIn the RoleOneMainis looking for Support Specialists to join our team in Evansville, IN.OneSupportis an internal help desk that provides technical and account support toOneMainteam members. Applicants must have strong customer service experience with the capability and desire to learn the financial and technical skills required for the position. An extensive training program is provided to all new team members. This position offers excellent opportunities for career growth.Responsibilities:Resetting Passwords for Team MembersProviding basic support for technical issuesincluding:email, PC, printers, laptops, etc.Providing support to Team Members with application, account servicing and balancing issues.Other duties as assigned.Job Requirements:Strong Verbal and Written Communication SkillsProblem SolvingDetail OrientedAccepting of ChangeMulti-TaskingAbility to Work in a Fast-pacedEnvironmentFlexibility (some nights and weekends required)Hours:During the training period, the hours will be from 8 AM to 5 PM. Once trained, the hours are as follows:Mon, Wed, Thurs, Fri 7:30 AM - 7:30 PM with Tuesday 7:30 AM - 9:30 PMMinimum of 4 evening shifts amonth;10 AM to 7 PM, 11 AM to 8 PM, 12 Noon to 9 PM or 1:30 PM to 10:30 PMSaturdays 7:00 AM - 3:30 PM only the last 2 (3 where applicable) of themonth; we will not staff the 1st two Saturdays of the month.COMPENSATION:OneMainoffers an excellent compensation package including a competitive base pay with additional incentives andbonuses.Benefitsinclude medical, dental, vision, life insurance, 401K, profit sharing, holiday and vacation timeoffOneMainprides itself on internal growth opportunities through training and development as well as career growth opportunities through internal promotions. Take the first step toward a challenging and rewarding career atOneMainand apply today!OneMainis an equal opportunityemployerAbout UsFounded over 100 years ago,OneMainis America's premier personal finance company.OneMainprovides personal loans, insurance, and other related financial products to more than 2.4 million consumers in communities across the country through a network of over 1,800 branches with more than 10,000 employees. We are committed to responsible lending, regulatory compliance, and an active program of outreach to the Investment Community.OneMain Holdings, Inc. is an Equal Employment Opportunity (EEO) and Affirmative Action (AA) employer.  Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identify, national origin, age, marital status, protected veteran status, or disability status."}