{"title":"Senior iOS Engineer, Straightaway","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI_JPxhrTHRWG5falJa1BfT7DesB8evOU594otB5Eyz2Wi3yHOs9WT1bsgQAFpqfQT-xHHg0lUuegRBi1g7LZrQ3ABztVAet1e3pN1tLmY_QsKKCXjpYz9NTZGXWUWsHgK-eAi4PIgAe1LHsUkzDLiA5en0aqwS0jdbcRWpsQtkUajBioYghh-Vkb4tRp_W","source":"ziprecruiter","full_description":"At Straightaway, our goal is to get people the things they need exactly when they need them. To do this we're changing the way things move and we're starting with the people who move them.We're relentlessly focused on building the absolute best tools and technology to simplify the complexities of last-mile logistics to bring things closer together. The road ahead is long and we need people from diverse backgrounds to help us realize a shared vision for the future. If you're willing to move fast and get things wrong while committed to working hard and getting better every day, come join us.What You'll DoWe are looking for a Senior iOS Engineer to help us build better, faster, stronger. Straightaway makes a difference in people's lives and we want someone who believes in the mission, cares about the customer and is ready to do the best and hardest work of their career.You will:Plan, ideate, architect and build new functionalityIterate on existing functionalityInterface with customers to understand their use cases and give feedback/bring ideas to make a better product and experienceWork closely with partner organization implementing and giving feedback on various SDKs and productsDesign better, more effective workflowsMake key contributions to mobile architecture, code health, and development processes for building best in class software products.What We Believe are Important Traits for This RoleDemonstrated history of shipping iOS apps available on apple app  storeExperience of building iOS applications from both UI and SDK side Knowledge of software design, iOS systems and architectureExperience with testing methodologies and frameworksEnthusiasm for building components and systems with reliability and long term support in mindExcellent sense of usabilityPixel and design implementation obsessionOpen-minded to explore new languages, skills, techniques, and platformsDesire to learn and to teachExperience with SwiftUIWhat We ValueIn addition to our core values, which are not unique to this position and are necessary for Straightaway leaders:We value high-performing creative individuals who dig into problems and opportunities.We believe in individuals being their whole selves at work. We commit to this through supportive health care, parental leave, flexibility for the things that come up in life, and innovating on how we think about supporting our people.We emphasize an environment of teaching and learning to equip employees with the tools needed to be successful in their function and the company.We strongly believe in the value of growing a diverse team and encourage people of all backgrounds, genders, ethnicities, abilities, and sexual orientations to applyCompleting this application requires you to provide personal data, such as your name and contact information, which is mandatory for Straightaway to process your application. Straightaway is an EEO Employer - Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity#LI-OT1"}