{"title":"iOS Engineer II, RxSaver NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL93bfQc9al8aRNiS3w4zOU5tiq6-OYI0kYZZGw04x26pzciRAmS7-jFcFtIKtzWFcs-qSpKdpq0WznOEOEad4Lg-a6qfMqiU0MAwqv88LYMv9FMSgzzzjqwShNa-Wl4lHW54ZwgfMi6ceb3CgxLgYqo93GdVReevzkQQvvm65y33JiUxStrNGtiwJA5Wc","source":"ziprecruiter","full_description":"iOS Engineer II, RxSaverAUSTIN, TEXAS or REMOTE /ENGINEERING – RX SAVERWe are RxSaver - a team that is passionate about helping people save money on prescription medicines and other healthcare costs. We work with pharmacies and providers across the nation to find the best deals and options for our community including prescription discount cards, coupons, prescription assistance programs and more.Our mobile engineers have a desire to create impact and are excited for opportunity. They are impassioned for progress and seek to work with others who have a desire to help others. They also love to work at all layers of our applications, from networking to the UI that power peoples’ experiences. Our iOS team plays an integral role in making a genuine impact on the quality of life for millions of people. Come help make healthcare more accessible while pursuing your passion for iOS.What You’ll DoInvestigate new tools and techniques to continuously improve RxSaver’s iOS app Collaborate with product and design teams to shape features from conceptionContribute to a modern, 100% Swift codebase, and its supporting build toolsFine tune continuous delivery pipelines for frequent, low-effort releasesPursue our goals in testing through usage of XCTest and XCUITestOwn projects that have large impact to the businessConsistently deliver performant, scalable, testable, and maintainable architectural solutions About YouYou take pride in your workYou continually desire to learn and growYou value having influence in the future direction of the productYou love automating away manual tasksYou enjoy collaborating with others to deliver successful solutionsYou have 2+ years of iOS experienceYou have a Bachelor's degree in computer science or equivalent STEM field, or equivalent work experienceOur TeamCultureWe continuously cultivate a supportive team culture where everyone feels welcome; we care a lot about being happy!We are committed to creating a diverse and inclusive environment that values, uplifts, and celebrates the experiences of our employees.We are a remote-first team full of kind people.We are always willing to help out with a code review, meet for lunch, or jump into our always-open virtual coffee bar to connect.We are very flexible and committed to each team member's total well being, especially as we all adjust to current events.Our leadership and entire team are committed to transparency; we have open conversations and value all input when making decisions.ImpactEveryone has an impact - proposing change is just a pull request away.We regularly make time to pay down technical debt, invest in our platforms, and make room to implement our favorite features.We have complete ownership over our work due to our flat hierarchy and close collaboration with product, marketing, and analytics teams.GrowthCareer growth is important to us; we are able to work with all teams to forge our own path. We take time for mentorship at all levels!We value continuing education and dedicate on-the-job time to learning.We have access to a wide variety of Udemy courses, run a weekly book club, and have a budget for conferences and books."}