{"title":"Software Developer II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI6XvhBlX03Ap3PzvCy1p3-1DIEA4yLk5pxs0wGaZNEXFMl7ruwwpW1Z-8pwCZNVWdVzEarODXTwe8IFVmYW2wVp-ogB2v532MMDJ7EOuK9934-KIgpFGNmvCNqsZW6HZOz0u2WYczvf57tLEvVllrBjfHUC9Jgch4NlhOSl8f8tHCcV8Igq7zcdNIAt0Y_","source":"ziprecruiter","full_description":"Software Developer II in Bellevue, WA at APEX Systems Date Posted: 1/4/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: Bellevue, WA + Job Type:Microsoft Development + Experience:Not Specified + Date Posted:1/4/2019Job DescriptionJob #: 925742 If you're interested in the position below, please send your resume to Erika Locke (elocke@apexsystems.com)! Interested in working on a fast-paced, innovative team? One of our largest tech clients in the area is looking for a driven Software Developer to build software and services that enable development of rich enterprise applications in the cloud. As part of this team, you will have the opportunity to apply quality focused engineering practices to your daily work. Using a scenario focused engineering approach will enable you to understand the customer and apply your creativity to designs that excite customers. Applying effective object-oriented development practices in a test-driven approach will bring those designs to fruition. You will work closely with program managers and engineers and across feature teams in a highly collaborative environment. Agile and lean development practices will be used to deliver early and often with a focus on continuous improvement. Job qualifications: + 3+ years of object-oriented design, database design, algorithms, data structures and parallel programming + 3 years or more of C#, JavaScript, and SQL + Experience and/or ability to work with Microsoft Azure including SQL, Service Fabric, WebApps, Authentication, etc. + Scripting Knowledge of PowerShell, Batch programming + Ability to create reports and dashboards using SQL server, Powershell, and PowerBIJob responsibilities: This is an exciting and fast evolving engineering team focused on building scalable distributed cloud services for engineering systems. + You will play a critical role in ensuring that teams have an easy onboarding experience, improving our core functionality by addressing customer needs and acting fast to resolve any issues. + You will be using sound engineering practices, tools, and standards. + You should be willing to work in a highly collaborative environment. + Additionally, you will be part of a fun team with diverse interests and backgrounds in a supportive environment. + You will be exposed to a broad range of problems and technologies as we are rapidly evolving our service architecture to leverage cloud services. EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}