{"title":"Senior Technical Designer, Bras & Intimate Apparel - Lifestyle Brand NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJ3IzbTJ4d0yBTlOf6G_TVgYVx3AMQiEcp1DjsJBfwZLKFLtasIxYdfwLMKc_BfG_MNq-iMiIe0V3LDY7Hx7hWJ0NRKaI3oEL4UM4DFdP4PVRQoVGCSE7dQdypoWI_OzXTyahipkk1MNwz3_mehBt9667OhX7I9ozfHbXhVmcU_hMeEQD4p-k4VzaZHX5Ok","source":"ziprecruiter","full_description":"Lifestyle brand in NYC is looking for a Senior Tech Designer for Bras & Intimate Apparel to join their team. In this role, executing the design vision while achieving impeccable fit and construction standardsResponsibilitiesExecute design vision while achieving fit and construction standardsManaging and leading fit sessionsCreate tech packs including detail sketches with construction/stitching, fit evaluation comments and specs, tolerances, grading, etc.Revise and create patterns, review and advise adjustments on plastic shot/bra cup moldingIllustrate detail sketches using Adobe IllustratorCreate and maintain libraries of approved samples, construction, specs, block patterns, and style patternsMaintain thorough vendor communication and tracking to meet deadlines and ensure on-time deliveryPartner with cross functional teams and vendorsRequirementsBachelor's Degree in a relevant field5+ years of technical design experience within the intimate apparels categoryTechnical understanding of body, fit, flat specs, fabric/trim stretch and the ability to lead fittings is requiredWorking knowledge in Optitex, Gerber PDS, LectraProficient in Microsoft Office and Adobe SuiteActivewear/lounge is a plus!Please submit your resume for consideration.You can use www.workgrades.com to collect and manage your references for free and share them with us or anyone else you choose. Candidates with references are always preferred by our clients. Now is the most important time to stand out from the crowd. We suggest that you ensure you have updated your LinkedIn profile and that you start collecting your references early."}