{"title":"Senior iOs Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK0oTVKRdJeT_kAY4TKP-ZbC_Z9mEQ-nHZ6uiBzQvtILCHbQttwt5ypO0_k8nBCK8F6xuqv-BbSw487Yh2u4U4FPH6qi2nQNp508lZNe5z6TKYQRZMJVm1zmBbanyJy4aTfXlWSm7dU1lqskrsQCf2RWm_GCu6Wit_Pi9bMaMH7CN3W6kkkOUoPub6tiF8","source":"ziprecruiter","full_description":"The OpportunityWe're looking for a Senior iOs Developer , working in the Retail industry in Charlotte, North Carolina . Design and build mobile applications for iOS platform + Collaborate with the design team to define app features + Ensure quality and performance of application to specifications + Identify potential problems and resolving application bottlenecks + Fix application bugs before final release + Publish application + Maintain the code and atomization of the application + Design and implement application updatesOur ClientOur client provides agile consulting and staffing. Helping organizations fulfill their most important initiatives and opportunities. For 30 years. From coast-to-coast.Developing long-term relationships. Successfully retaining clients and placing consultants through multiple engagements.Providing you with the support, care, and attention you deserve. With advocates available 24x7 to help you with questions and concerns. This personal care together with great work has resulted in a 4.4 Glassdoor rating.Join the most talented professionals in the industry working on strategic and world-class programs.Experience Required for Your Success Bachelor's degree in Computer Science or Software Engineering + 5 years of experience in software development or systems engineering or analysis using Xcode + 5 years of experience with Objective C or Swift Programming language, Storyboards + 5 years of experience working with CocoapPods/ Swift Package Manager or similar dependency management tool + 5 years of experience in writing and maintaining Unit and Integration tests using XCUITest and XCTest + 3 years of experience with CI/CD and analytics toolDetailsThe pay range we are offering is 60 to66 per hour. This position may present an opportunity to go permanent.What Do You Think?Does your experience reflect what it takes to be successful in this role? Do the work and challenges get you excited about what's possible? Apply here .Not exactly? Join Our Talent Community (https://jobs.psgglobalsolutions.com/register) , and we'll let you know of additional opportunities.EOE Protected Veterans/Disability"}