{"title":"Senior Professional Server Support - HARDWARE","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJyBq7CDF_M6XuJRBOYcoh3kW7_xQ8E7NUuI-Rh0SNxYZYmCosX4f9mFC12t9oB3S45yd_UJw-BojV3nt6YyQKd2rb1NrThYINn2Byt6xphFlQ1XWU658tcqAIYt4SonSpseKsJPI55QcgHrabF4YmkBS2R0683v2JveCl7Zv6Cc655kPkdNzeLV0Dg_QEg","source":"ziprecruiter","full_description":"**Job Description:**As the world's leading independent, end-to-end IT services company, DXC Technology (NYSE: DXC) leads digital transformations for clients by modernizing and integrating their mainstream IT, and by deploying digital solutions at scale to produce better business outcomes. The company's technology independence, global talent, and extensive partner network enable 6,000 private and public-sector clients in 70 countries to thrive on change. DXC is a recognized leader in corporate responsibility. For more information, visit www.dxc.technology and explore thrive.dxc.technology, DXC's digital destination for changemakers and innovators.On a daily basis, complete preventative maintenance of equipment and data network devices. Operate in tight spaces, run cables, and improve physical security around their assigned data center. Engage in building projects and check utilities. Make sure the center does not overheat, they carefully examine power sources and heating and cooling controls.Must be able to be physically on the work sites. Worksites are in Clifton New Jersey. Travel to other close worksites required.**Technical duties and responsibilities**+ Troubleshoot and repair servers that have hardware and network issues. + Run hardware diagnostics and replace failing parts.Responsible for day-to-day performance and capacity management of servers. + Monitoring and maintaining operation of all network processes . + Evaluate machine temperature levels for optimal performance. + Maintain accurate work records and event logs. + Create concise virtual information reports to keep company management informed of status updates. + Install and arrange new equipment for data centers. + Physically upgrade internal system components (CPU), memory hard drives, fiber cables, copper, and more. + Collaborate with software and networking engineering teams to ensure cybersecurity and network efficiency.**Requirements and qualifications**+ Associate or bachelor's degree in a technical field or experience. + Five (5) or more years of experience + Data Center Experience (hardware) + MDS Storage experience + B22 type communications knowled + Cablign knowledge on Data Center enviroment + Preferred Certifications: MCSA, CompTIA A+, Security+, + Experience with DFARS/NIST 800-171, US Govt regulations + Experience securing systems using the RMF (Risk Management Framework) + Excellent team player and capable of working independently when necessary + Willingness to solve complicated problems and see projects through to completion. + Team-oriented attitude to help other colleagues and departments with technical problems. + Forward thinking - recommend new products and technologies as appropriate. + Knowledge in: Networking hardware (multiplexers, routers, and switches), Computer operating systems (Linux, RedHar, Unix, Mac OS, Windows), Microsoft Office Suite (including Word, Excel, PowerPoint)**Other requirements**+ Hardware repair + IT computer networking + Troubleshooting skills + Inventory management + Communication skills + Technical writing skillsDXC Technology is EEO F/M/Protected Veteran/ Individual with DisabilitiesDXC Technology is EEO F/M/Protected Veteran/ Individual with Disabilities"}