{"title":"Hydro Mechanic NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIgHNB-pv64a4kpBes7obWdlgmrU9ZHa5rb6xb9vYh9dPCasOfwbGXATTVscSQnx8A8jnXWpMB2O6gbcmgpNqgup6gyjintsPh-8rfXPFbnY6yynWgUDQRKHZKJmDnJOOOBDMjpfAH1u9AXaafmSoxZ3lMSCQPlFl5fmF_rG_7TOcuhLT1YOTEmUiSuMA0","source":"ziprecruiter","full_description":"FieldCore, a GE company, is a new, independent industrial field services company that will deliver the highest standard of field services excellence and capabilities for GE and its customers. FieldCore will bring together the field services expertise and people from both Granite Services and GE's Power Services into one powerhouse. Driven by the values of safety, quality, and integrity, FieldCore will be built to deliver operational excellence for customers in the power generation, oil & gas, nuclear, and wind power markets. For more information, check out www.fieldcore.com**Role Summary/Purpose**The primary responsibility of the Mechanic - Hydro - is to safely accomplish the installation, maintenance and repair of the heavy rotating machinery used mainly in power generation applications. Turbine Mechanics work closely with Supervisors, EHS personnel, and the Operations Department to achieve these goals.**Essential Function**+ Read blueprints, schematic drawings and technical documentation to determine proper work procedures. + Install machinery and equipment according to layout plans, blueprints and other drawings in industrial establishments. + Dismantle and assemble machinery and equipment using a variety of hand, power, pneumatic and hydraulic tools. + Perform mechanical and electrical maintenance and repairs on power tools, hand tools and training equipment. + Move machinery and equipment using hoists, cranes, chain falls and trucks. + Align machinery and equipment using hoists, squares, rules, micrometers, plumb bobs, dial indicators and/or laser alignment equipment. + Perform machining and welding operations for making various parts for lab and shop training equipment + Perform material and machine inspections using precision measuring equipment such as micrometers, rules, calipers, protractors, and torque wrenches. + Responsible for shipping and receiving all major pieces for T&DC, plus all shipping, receiving, inventory, and control of tools, equipment and supplies + Determine equipment specifications and prepare parts lists for purchasing, consisting of mechanical, electrical, and hydraulic devices as needed to complete assigned projects. + Load, transport, and unload materials, tools, equipment and supplies. + Perform other duties as assigned**Qualifications** **/Requirements**+ Bachelor's Degree in a technical subject or equivalent +5 years of experience at a Construction/installation site, preferably in the power plant or Hydro industry including various pumps, motors, fans, generators, and turbines + Experience in Hydro turbines and major maintenance procedures. + Have bolting and rigging certifications as desire. + Must have Driver's License + Must possess minimum required hand tools.**Desired** **Characteristics**+ Expert level. Able to demonstrate Project Management Skills and Team Leader Skills. + Possess expert skills and applies the fundamental concepts, practices and procedures of a particular field of specialization. + Attended in product specific training to take, record and evaluate critical clearances, carry out alignments, change Turbine Buckets, etc. + Has basic knowledge of English as per grade A2 of the European CEFR + Diverse mechanical and electrical skills (welding, pipe-fitting, electrical construction, analog and digital circuits) + Technical knowledge of equipment and tooling, plus an ability to instruct and direct inexperienced personnel. Position also responsible for shipping and receiving + Ability to instruct and direct inexperienced personnel. + Ability to read and interpret drawings. + Solid background in turbine-generator equipment, as well as auxiliary sub-systems. + Projects are associated with the interfacing of turbine auxiliary equipment sub-systems with turbine-generator control systems. + Flexible and self-reliant attitude are necessary since much of the work is done on a self-directed basis, ability to work with minimum supervision is necessary + Functional expertise with all the equipment and tools. + Ability to turn conceptual designs into completed projects, including doing all necessary work, such as specifying electrical devices, conduit, cable, pipe, and necessary hardware to complete the project. + Must work well both independently and in a team environment. + Availability to travel and be away from home for extended periods of timeWe are an Equal Opportunity Employer, including disabled and vets.For more information regarding affirmative action and equal employment opportunity click here at http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}