{"title":"iOS Mobile SDK Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ2UH4grSbZwhrBZRF7cD4rmZFBWCScMunXWT6T5DTOchV7NzeiBKOzbXiI2u9ai4ZgUmYmUrK20CIplHoeQ98Zy4eYIxngIwgOA0Xy6iEyNxXftnB-DSAmaPK5N0ktTJ95E3E-PdUrnaHeVQxmIEqVgaErWHS44vD4reO0Bf0PEh1vIxpbIjuzhj0r1je_","source":"ziprecruiter","full_description":"Introduction This position is for a mobile developer on the Pangea Map SDK team. The Pangea Map SDK is the interactive mapping library used in all of the Weather Company's flagship mobile apps as well as in the Broadcast Media Digital solutions. The Pangea SDK is used by more than 300 million consumers who depend on The Weather Channel each month to stay safe and informed. At IBM and The Weather Company, you will have access to the latest education, tools and technology, and a career path with the world's technology leader. Be part of a diverse team of thinkers and doers-people who want to make an impact, cultivate their expertise and collaborate with some of the world's top business and technology professionals. Your Role and Responsibilities Key Responsibilities Develop and support an iOS SDK that is used by other developers in their mobile applications Leverage Swift, Kotlin and / or Objective C as the base programming language Work with project leads to make sure projects are delivered on time Document development progress and resolution Ensure the SDK's API Reference documentation is kept up to date Create detailed, well-organized samples that demonstrate the capabilities of the SDK Troubleshoot and fix client reported issues Contribute to the build and release processes Professional Experience needed for Success: Experience in supporting end users on mobile platforms with technical issues Ability to learn quickly and adapt to a fast-changing environment Ability to work independently and within a team setting Strong time management skills and ability to prioritize work Strong oral and written communication skills Self-motivated and self-managed with a demonstrated analytical ability and curiosity Creativity, enthusiasm and energy with a strong customer focus Good organizational skills in a deadline driven environment Good communication and human relation skills Location: Once IBMers return to the office this will be an office based position for any IBM US location. Required Technical and Professional Expertise 5+ years experience developing iOS software in Swift, Objective-C 5+ years Object Oriented programming experience or equivalent education Understanding of common design patterns including Model-View-Controller. Experience in standard debugging techniques such as logging, LLDB, and/or Instruments to localize and correct software defects. Experience with memory management techniques (native and hybrid) Understanding of multi-threading programming (Critical Sections, race conditions, dead lock, etc) Experience with Test-Driven Development, Continuous Integration and other Agile practices A solid understanding of and experience with APIs (REST, Web services, XML, JSON, JSONP, etc.) Experience with the git version control system Preferred Technical and Professional Expertise Experience using Cocoa Touch, Foundation, and other iOS platform SDKs, iOS UX guidelines/best practice Experience with native Android development Understanding of geospatial concepts like map projections and tms/wmts tile systems Understanding of the challenges related to mobile development including battery and radio usage as well as CPU and memory constraints.  Experience with rapid prototyping, with the ability to quickly go from mockups to implementation Working knowledge of testing, from unit, to functional in a mobile context Experience in iterative software development environments (Agile, Kanban) About Business Unit IBM's Cloud and Cognitive software business is committed to bringing the power of IBM's Cloud and Watson/AI technologies to life for our clients and ecosystem partners around the world. IBM provides you with the most comprehensive and consistent approach to development, security and operations across hybrid environments-with complete software solutions for business and IT operations, development, data science, security, and management. Our experts and software capabilities help organizations develop applications once and deploy them anywhere, integrate security across the breadth of their IT estate, and automate operations with management visibility. With IBM, you also have access to new skills and methods, governance and management approaches, and a deep ecosystem of industry experts and partners. Your Life @ IBM What matters to you when you're looking for your next career challenge? Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust - where everyone has a voice? What about all of these?  If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible. Impact. Inclusion. Infinite Experiences. Do your best work ever. About IBM IBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. Location Statement IBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.  We consider qualified applicants with criminal histories, consistent with applicable law. IBM intends this job to be performed entirely outside of Colorado. Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}