{"title":"Senior Software Engineer, Data NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALgU26Sk_0HTOnsOl2s6xohZHmyNirlQfZiRtRAquZRj2UFcFUynDokUyPH5W7LHSvlAGENExJ_3etNgk_QDVdTDTRzTjcz2UK2AaCjGrgRPJX1vauBReW6vmNp646BqKVKsUjPUZQmFy4CefVNdROL8JkWCTJI0l4vtLsvpIgETFIQn2317dELXe1o9ZY","source":"ziprecruiter","full_description":"We are seeking a Senior Software Engineer with a solid understanding of relational database management systems and an interest in data engineering, to join a global team and help build a robust, scalable cloud data infrastructure in AWS. Your work will have a direct impact on the success of the business, as we increasingly integrate our data platform into our applications and use it to power critical functionality of the exchange. You will work alongside a distributed team in the US, Europe, and China, and work closely with data analysts to understand business needs and develop appropriate data models and partitioning strategies. You will help maintain our enterprise data warehouse and adhere to data security best practices while learning a ton about the crypto finance industry. What you’ll work on: Solving interesting engineering problems as a member of a distributed global team Work with AWS solutions architects to improve our existing data infrastructure Collaborate with data analysts and teams across the organization Enable product owners to make informed strategic business decisions Create the foundation upon which advanced data science solutions will be built Be empowered to drive new initiatives and make a real impact What you’ll bring to the team: Experience with a few relevant AWS services, such as Aurora, Athena, RedShift, S3, Glue, Lambda, SQS, SNS, Kinesis, CDK, CloudFormation, and Cloudwatch Recent experience programming and debugging in Java, Scala, or Python Solid SQL and relational database skills Familiarity with data security principles and best practices Comfort using Git, Linux, and Docker Ability to communicate effectively with people at all levels, from around the world Ability to understand complex concepts and explain them in simple terms Comfort shifting gears and working on an evolving product without having all the answers"}