{"title":"Senior Manager - Systems Engineering","location":"","salary":"","description":"","term":"$120,000 to $160,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAINqW5QjiC9CDwUQLU2cXa85CM0pUxcfnieRNvc7DdHdUJEMPhLt8-YB4H1MFK_0PuWkNjk2ZRZxoyNej0g4BeKMYhVLHQ1dkHwNgEZfLTfdn5cBKPlXdUmFn6OLa5LTiP3lW7gixZ3mAOH52gdY-_MHIfSfMhBLYXPnLGDoq6aZwYcTDP95PpANIDlEtho","source":"ziprecruiter","full_description":"GENERAL SUMMARY:Manages the team that provides technical, administrative, and maintenance support for complex enterprise technical infrastructure of servers, storage, backups, virtualization, and cloud services. Provides direction and leadership to technical staff and works directly with them to determine daily operational and project needs.?ESSENTIAL DUTIES AND RESPONSIBILITIES:Manages the enterprise Systems Engineering team, directs work assignments, and initiates personnel actions, including hiring, reviewing, promoting, and counseling in order to maintain a qualified and motivated staff. Develops their individual development plans and performance management reviews.Manages the engineering team to resolve escalated Tier-3 incidents and outages, implementing immediate and appropriate resolutions to critical problems including personally implementing resolutions as needed.Manage the budget and expenditures for both Operational and Capital accounts as required for the completion of duties.Participates in the development of requisitions, bids, specifications, and the negotiation, administration, and evaluation of contracts for equipment and services.Leads the evaluation, specifications, and requirements of new equipment.Develops and writes job descriptions for team alignment.Responsible for the development and implementation of standards, procedures, and processes for the Systems Engineering group.Develop long-term plans, utilizing current technologies (ex: virtualization, cloud storage) right sizing engineering systems in order to meet agency needs and equipment life cycle objectives.Participates in strategic planning, tactical operation planning, and the development of contingency operation plans regarding Agency IT infrastructure and Disaster Recovery.Develops various reports and presentations for management review.Documents all processes and standard operating procedures for the division, including disaster recovery plans.Manages internal departmental relationships and external vendor relationships to coordinate support service and problem resolutions. Leads cross-functional linked teams to address business or systems issues and production systems testing.Manages the coordination and activities of new system installations, effectively utilizing resources, budgets, and timelines to meet production schedules.Participates in scheduled change management and participates in incident management. Ensures that changes and actions are documented in change management system and service management system.Provide 5-star customer service and meet Agency service level agreements (SLA).Perform other related duties as assigned.MINIMUM KNOWLEDGE, SKILLS, AND ABILITIES REQUIRED:Note: An equivalent combination of related education and experience may be substituted for the below stated minimums excluding High School Diploma, GED, Licenses, or Certifications.Bachelor’s degree from an accredited college or university in Computer Science, Information Systems, Business or related field.Eight (8) years of system engineering experience or related environment with four (4) years of supervisory experience in maintenance and operation of Enterprise Datacenter technologies.Must have a ITIL Foundation certification.Pass a physical (medical) examination that includes a drug screen in order to operate non-revenue vehicles.Proficiency of PC software applications to include Microsoft Office or other related software applications.Must maintain all certification(s) required for this position.Must be able to work variable hours, to include emergency response to outages.Must be able to perform work from remote locations as needed.Must be able to work in an on-call rotation.Ability to be dedicated to meeting the expectations and requirements of internal and external customers. Gets first-hand customer information and uses it for improvements in products and services. Acts with customers in mind. Establishes and maintains effective relationships with customers and gains their trust and respect.Ability to be able to write clearly and succinctly in a variety of communication settings and styles. Can get messages across that have the desired effect.Ability to step up to conflicts, seeing them as opportunities. Read situations quickly. Good at focused listening. Can hammer out tough agreements and settle disputes equitably. Can find common ground and get cooperation with minimum noise.Ability to blend people into teams when needed. Creates strong morale and spirit in his/her team. Shares wins and successes. Fosters open dialogue. Lets people finish and be responsible for their work. Defines success in terms of the whole team. Creates a feeling of belonging in the team.Ability to provide challenging and stretching tasks and assignments. Holds frequent development discussions. Is aware of career goals for each direct report. Constructs compelling development plans and executes them. Is a people builder.Ability to accurately scope out length and difficulty of tasks and projects. Sets objectives and goals. Breaks down work into the process steps. Develops schedules and task/people assignments. Anticipates and adjusts for problems and roadblocks. Measures performance against goals. Evaluates results.Ability to use rigorous logic and methods to solve difficult problems with effective solutions. Can see hidden problems. Is excellent at honest analysis. Looks beyond the obvious and does not stop at the first answers.Ability to marshal resources to get things done; uses resources effectively and efficiently; can orchestrate multiple activities at once to accomplish a goal.Ability to quickly develop technical understanding; is good at learning new industry, company or technical knowledge.Analytical and creative skills to find solutions to complex interpersonal, technical, and administrative problems.Knowledge of budget development/analysis, and operational cost factors."}