{"title":"UTILITIES MAINTENANCE MECHANIC IIII-LIFT STATIONS & WATER PLANT","location":"","salary":"","description":"","term":"$19.22 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALb0dniCksG2LDu9UlUlyKsk9Q2-v9ZvK_aS_tndVLgNU4ojDv9FMgZN8JwKTsJzWzPE6bL0RycDUN9AdFIVKPWxv2HHn9FSDUcwmot_8MFvZOPPA3JZN4JGwWSN8qWsJ44OMTs6Gmgh5UklMJ4bgLoN7ZgNRdk2k-uNbdS1DS8IMA68Q0tsiPu0l5E_Pwd","source":"ziprecruiter","full_description":"APPLY DIRECTLY AT PLANTCITYGOV.COMBENEFITS, HOLIDAY PAY AND PTO OFFERED!Position Summary:This position is the crew leader responsible for maintenance and repair of lift stations, wells, reuse, and the waste water treatment plant. This position requires an extensive knowledge of electrical and mechanical trouble shooting and repairs, the knowledge and ability to work safely around high voltage up to 480v, and the experience and ability to maintain and repair pumps, motors, electrical controls, starters, breakers, relays and all appendages associated with the collection and distribution system. This position also requires following electrical diagrams and trouble shooting electrical and mechanical failures.Essential Duties and Responsibilities include the following. Other duties may be assigned as dictated by operational necessity.Supervisor and crew leader over Mechanical Electrical Division. Supervises and participates in the performance of maintenance, adjustment and repair of a variety of equipment, machinery and control systems in the treatment plants and pumping stations.Conducts preventive and scheduled maintenance on all lift station equipment, including pumps, motors, piping and structures. Repairs and/or replaces motors, pumps and all associated equipment in lift stations and any piping or structural components that require replacement according to prescribed operating standards.Diagnoses problems with lift station operations. Pinpoints problems with the use of testing equipment and based on experience and knowledge of lift station mechanics. Uses computer-generated telemetry reports on lift station systems to aid in such trouble-shooting. Makes necessary repairs; reports the need for major repairs to a supervisor. Directs and participates in major repairs on pumps, motors, and other equipment.Performs scheduled preventive maintenance and repairs a variety of water/wastewater related equipment, including: bubbler system, air compressors, sealed water pumps, generators, hydraulic valves, transfer pumps, odor scrubbers, grinders, exhaust fans, vacuum filters, various pumps (centrifugal, rotary lobe, positive displacement, diaphragm), chlorination systems and/or aeration systems in order to; minimize equipment breakdown/malfunction; identify potential mechanical/safety problems; facilitate efficient/effective operation of the treatment plant; and prolong the useful life of the equipment.Checks and maintains equipment such as motors, blowers, pumps, compressors, chemical feeders, rotary distributors and flotation units. Performs electrical, masonry, plumbing and welding tasks in repairing equipment or facilities.Fabricates or repairs products (motors, machine parts, etc.) using a cutting torch and welder.Pulls, repairs and trouble shoots motors, starters, relays, regulators, pumps, soft starts, programmable logic controllers and many other items related to utilities. Pulls, inspects and cleans lift station pumpsMaintains the Lakeland/Plant City potable water interconnect.Installs well pumps, motors, and related equipment in order to restore well to production status or bring new wells into production.Performs preventative and corrective maintenance to collection system Lift Stations, grounds and associated equipment. Inspects all mechanical and electrical items on lift station preventative maintenance check off list. Documents the repairs made. Fills out request for work requiring electrician or mechanic.Inspects pull chains on pumps and replace as needed. Inspects wear-rings and impellers on pumps. Exercises plug valves at the station. Cleans and inspects check valves at the stations. Checks operation of float switches in the station. Inspects wire ties on float and power cords and replace as needed.Washes down pumping station, assists in vacuum cleaning of station, removes rags and debris from floats and electrical power cords.Installs or replaces equipment and machinery; participates in major plant installation and equipment overhauls.Operates heavy machinery including; electrical meters, forklift, cranes, front loader, backhoe, bobcat and dump truck.Maintains 4 water storage tanks; painting, cleaning, etc. Repairs and cleans salt tanks. Maintains and repairs 8 - 2000 gallon chlorine tanks and if they cannot be repaired, orders and installs new tanks. Repairs chlorine generators, refers major repairs to outside sources.Works with concrete and performs basic carpentry work in lift station repair, and other work as required.Performs a variety of general maintenance duties in and around the wastewater treatment plant including wash downs of de-nitrification basins, oxidation ditch, clarifiers, filters, and contact basins.Maintains reports and files on lift station equipment and other data. Fills out work orders, time sheets and maintenance logs.Uses a handheld scanner for computer checks. Scans barcodes on motors, pumps, etc.Works a rotating twenty-four hour, seven-day on-call shift for emergency coverage, within 6 months.All employees will be cross-trained in water, waste water, and/or reclaimed water for equivalent positions. The employee may be directed to change positions at any time of employment without notice on a permanent or temporary basis.Minimum Qualifications: To perform this job successfully, an individual must be able to carry out each essential duty or responsibility satisfactorily. The requirements listed below are representative of the knowledge, skills, and abilities; education and/or experience; and, certificates or licenses required in order to fill the position. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of the job.Knowledge, Skills, and Abilities:Ability to work in or around moving machinery and high voltage safely.Ability to run welder and cutting torch.Ability to keep accurate records.Ability to work in a responsible manner when dealing with coworkersAbility to follow oral and written instructions including diagrams.Ability to take independent action without constant supervision.Ability to make logical decisions based on training and experience.Ability to work in or around wastewater and related jobs.Ability to operate a computer.Must have a good safety record.Must be in good physical condition working outside in the elements performing extensive electrical and mechanical repairs.Must be dedicated to providing support to other employees in a team atmosphere.Must qualify for after hour call duty and be prepared to respond if needed to handle utility related issues.Must have a good safety track record working around electrical and mechanical systems.Must be willing to work in different areas of the department or city as required.Must be willing to work different shifts and days as required.Education and Experience:Graduation from an accredited high school or possession of an acceptable equivalency diploma.Five years of experience and or training related to mechanical and electrical projects.Extensive electrical training may supplement for the lack of hands on experience.Additional training is required after employment:Training in M.S.D.S.Hand tool safetyDriving safetyFire extinguisher useConfined space entryEquipment safetyHeat stressPower toolUnderground accessC. P. R.First AidLockout, tag out procedures.Many other related fieldsConfined Space EntryForkliftFEMA IS 100, IS 200, IS 700 (within 6 months of employment)Class 3 Distribution System Operator and Maintenance Certification (within 3 years of employment)Certificates and Licenses:Valid Florida driver’s license.Certificates and Licenses:· Valid Florida driver’s license· F. E. M. A. IS-100, IS-200, IS-700. Within (6 months)· Class 3 Distribution System Operator and Maintenance within (3 years)"}