{"title":"Part-Time Chemist NEW!","location":"","salary":"","description":"","term":"Part-Time","detail":"https://www.ziprecruiter.com/k/l/AAIBLGLnmnnLzpaEvFk9maTxsXNlZV5F294gyplBQkQQT-qTdwrOTyYwcl8gNjy2u09766UISk4s91QZijP0vR8HyCJHV9HHZFGO9XbDCya-kM17j1tDaKlgXs0G9HGQxe55LF0rDTib2sAiTns0tc6ZsUGGEf-y1-G71rs2Wbc72ssb4X43wMqsjugesFc","source":"ziprecruiter","full_description":"A little bit about us... Tehama, LLC, is a tribally-owned 8(a) certified small business that delivers environmental and engineering services to federal, state and municipal clients nationwide. Tehama's specialties include environmental architecture/engineering services, environmental compliance, environmental remediation and facility engineering operations. Tehama is one of the independent businesses owned by the Paskenta Band of Nomlaki Indians, known as the Tepa Companies. These companies share a common administrative and executive management team through Tepa, LLC, to reduce client costs and improve project efficiency. The Tepa Companies offer a diverse portfolio of services, including environmental consulting, heavy, civil and vertical construction, technology and fueling systems. Based in Kansas City, Missouri, Tehama currently supports a variety of clients through offices across the U.S. Find out more at Tehamallc.com. Tehama, LLC, is an equal opportunity employer and encourages diversity in the workforce. Now a little bit about you... Tehama, LLC is looking for a part-time, on-call Chemist to support our current and upcoming projects. Job Responsibilities will include:Determining sampling procedures and sampling devices to be used in sample collection based upon the established industry and regulatory protocolsPreparing laboratory testing program/requirements to determine the chemical and physical properties of the substance, based on characteristics of the available instrumentation and techniquesValidating, evaluating, and interpreting laboratory test resultsProviding advice concerning sampling techniques and analysis plans for toxic and hazardous waste site operations to determine the presence, nature and concentration of chemical contaminants as they apply to environmental, military and civil projectsRecommending appropriate disposal or processing techniques of waste material based on the chemistry of the waste and in compliance with regulations and laws.Providing technical input, analysis, guidance and determinations to support the Hazardous-Toxic and Radiological Waste (HTRW) What are we looking for? Bachelor's degree in chemistry, environmental biological or physical sciences or engineering 30 semester hours in chemistry6 semester hours of physicsCourse work in mathematics through differential and integral calculusMinimum of 3-years relevant experience working environmental technical fields, specifically the FUDS and/or Superfund program as it relates to the PWSMinimum of 3-years of specialized experience in HTRW related workPreferred: Chemists with experience using FUDSChem"}