{"title":"Technical Writer Consultant NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI2pvM3Ut9c6DaI3QbBWfRonoYncmlsTKS-yxnepgOfQ8tTEgWRT8HoU5eVfvshXZRwOv7Hgg5z1TtBpEGW0tWE83H_7KmGwF8yooxLATid-vUnBenXPYMYUazv7vyGWXt8C8CFjuAwI1pvOdgxWayqSY3Wfagbo_3TxbmejCS_9oY5692aY8w2bJtFhSE","source":"ziprecruiter","full_description":"PATH is an international organization that drives transformative innovation to save lives and improve health, especially among women and children. We accelerate innovation across five platforms-vaccines, drugs, diagnostics, devices, and system and service innovations-that harness our entrepreneurial insight, scientific and public health expertise, and passion for health equity. By mobilizing partners around the world, we take innovation to scale, working alongside countries primarily in Africa and Asia to tackle their greatest health needs. Together, we deliver measurable results that disrupt the cycle of poor health. International development and global health represent one of the greatest opportunities for the impact of digital technologies on a global scale. New technologies, approaches and tools are emerging daily, unfortunately into a fragmented and immature digital health market landscape that currently limits their promise to transform country health systems and accelerate and amplify progress towards national and global health goals. The Center of Digital and Data Excellence (CoDE) is working on a project to support the development, documentation, and dissemination of data exchange standards for COVID-19 in coordination with WHO. Role  The consultant will develop technical documentation and artifacts to support PATH’s collaborative effort with the Open Health Information Exchange (OpenHIE) community in the design of component infrastructure that adheres to the COVID-19 data exchange standards.  The consultant will also develop Health Level 7 (HL7) Fast Healthcare Interoperability Resources (FHIR) documentation for COVID-19. Qualifications  10 years’ experience providing technical assistance for digital health interventions in lowand middle-income settings.Extensive practical experience in health information and disease surveillance systems, interoperability and international standards.Passion for PATH’s mission, as well as for broader global issues of public health, information systems, technology and international development.Fluency in English required. Activities Technical Writing: Support the project’s standards and profile development activities with Integrating the Health Enterprise (IHE) and HL7 FHIR for the continued development of FHIR implementation guides and profiles in the following areas:Support the prioritized goals set by the project (e.g., case reporting) to develop and update FHIR implementation guides, profiles, and related technical documentation.Support technical designs of OpenHIE component infrastructure to adhere to COVID-19 data exchange standards.Support other uses cases, as agreed to with the project’s technical advisors.Support the standards, development and implementation of open source client registry applications The consultant will be expected to liaise with IHE HL7 FHIR editors and stakeholders in order to track, manage, and advocate for requested changes to HL7 FHIR resources. Additionally, the consultant will produce associated collateral (e.g., guides, PowerPoint presentations) to communicate on progress and results of activities. The format of the collateral will be determined in conjunction with project stakeholders. Key Deliverables  Drafts of FHIR implementation guides, profiles, and technical guidance for COVID-19 and priority use cases as determined in consultation with project stakeholdersDocumentation, guidance, and technical specifications for assessing security, privacy, and standards compliance for component tooling that aim to implement the standardsMonthly written status update on progressImplementation guides for World Health Organization Smart Vaccination Certificates and case reporting PATH is dedicated to building an inclusive workforce where diversity is valued.  PATH is an equal opportunity employer. Every qualified applicant will be considered for employment. PATH does not discriminate based on race, color, religion, gender, sexual orientation, gender identity, genetic information, age, national origin, marital status, disability status, political ideology, military or protected veteran status, or any other characteristic protected by applicable federal, state, or local law.  *PATH has become aware of scams involving false job offers.* Please advise:  PATH will never ask for a fee during any stage of the recruitment process.  All active jobs are advertised directly on our career's page.Official PATH emails will always arrive from an @path.org or @silkroad.com email address.   Please report any suspicious communications to careersitehelp@path.org. Required SkillsRequired Experience"}