{"title":"19773- Software Engineer NEW!","location":"","salary":"","description":"","term":"$30 to $40 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAI45h_FI5Zw60t8yx98kKBrZaZFzUA-en7MM2l_K5BqMNp3-qXrNbblJJApo2w3vZFz2UYkJIVSNj2sC08B7Fefi_dDpOIwkd5IiNCb1pucEgwd4CzwqPlX3K6tU7MT-GZKpaZmLYZdZfOTWqVYmBFItT4i5VADdBE8xkQ45jhra_dwwglutJ5aMwF24Tg","source":"ziprecruiter","full_description":"We are seeking a highly motivated individual to perform software engineering in an organization that designs, developments, and tests cutting edge hardware and software solutions, including handheld, laptop, and server video downlink systems with digital video recording (DVR) and other video processing capabilities. This individual must be proficient with Linux, C/C++, Qt, OpenCV, OpenGL, and have experience performing unit and system level integration and testing and writing software documentation.This position is in a fast paced and dynamic environment requiring tasking flexibility to meet ever changing customer objectives. It will require the ability to work within a team structure as well as work independently with minimal supervision. Excellent communication skills, both verbal and written, are crucial.This position reports directly to the Director of Engineering and is located in our San Diego office.Perform unit and system level integration and testing using Linux, C/C++, Qt, OpenCV, and OpenGLCreate software documentation with little to not oversightDevelop Graphical User Interfaces (GUIs)Bachelor’s Degree and minimum 4 years of prior relevant experience or 2 years post-Secondary/ Associates Degree and a minimum of 8 years of prior related experience. Graduate Degree and a minimum of 2 years of prior related experience.Experience creating embedded software applications with Linux, C/C++, Qt, OpenCV, and OpenGLMust be able to obtain a Secret clearance and be eligible to obtain higher clearancesPreferred Additional Skills:Must be proficient with Microsoft Office Tools (Excel, PowerPoint, Visio, Word) and able to work independently and in a team environment."}