{"title":"Senior PIC Applications Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL1Xwv0Y7eUve30GKrgNn70obiawnddIzAz6_jLAuUkP3Dk8lDhtn1b6f07_9YCyTNNtC-F7WJ_jUD726f6H8apSBofwBhGZk41G0iq88HQv1NHbrzxnZY2E757n9dexgmfilw50Z-Opwru38LECBsTyr9qwAsrAWT7vazKKkt8_bj7GVzJ0IeaQzRx15E","source":"ziprecruiter","full_description":"Help us build the DNA of tech.Vishay Siliconix, a leader in the development of power semiconductor products which improves efficiency in electronic systems for consumer, industrial, automotive, medical, and military applications, is currently seeking a Senior Applications Engineer for our IC Division. This position will be located in San Jose, California.In this position, the Senior Applications Engineer will be responsible for providing technical support to the company's sales staff and customers. Work on new product developments and applications evaluation of products in development to ensure they meet the needs of the application and the customer. Support the team translating customer problems into technical solutions. May provide guidance to subordinate level Applications Engineers. Primary Responsibilities include the following:Responsible for evaluation and reference board designs, evaluation test plan definitions, device evaluations, evaluation report and development of datasheets, application notes, and field sales training materials, software demonstrations, and related collateral.Support FAE's and customers in application related issues, system debugging and design review. Interface with R&D staff to perform product verification. Support engineering and assist QA to troubleshoot customer returns. This position will work closely with our Strategic Marketing, Business Development and R&D groups to ensure our products meet the developing needs of our customers.Work cooperatively with our Strategic Marketing, R&D, & Business Development groups to guarantee that products meet the developing needs of our customers. Work with strategic marketing to define new products. Propose specific new products/features for development.Responsibilities also include technical review and maintenance of product documents.Assisting FAE's and customer's engineers in product selection.Study, benchmark and evaluate competition's products. write technical documents (Application notes, White Papers, Technical article)Propose specific new products for development.Additional duties may be assigned for special projectsEducationSuccessful candidate will have BSEE in Electrical, ElectronicsExperience5+ years of experience with working knowledge of power IC technology and application level evaluation. Experience in customer and FAE technical support in power application designs. Skills / CertificationsSystem level design experience or advanced knowledge of Power MOSFET semiconductor is a plus. Effective communications skills and analytical thinking.Vishay offers a comprehensive suite of benefit programs including health care coverage, financial support programs and other resources designed to help you achieve your personal and professional goals. With us, you'll experience unique career paths, an open and collaborative culture, a stable business that will be there for you, and opportunities to work globally and locally. Do you have the skills we need? Are you ready to power your career as you power the world? If so, apply today. Vishay is an AAP and Equal Opportunity Employer"}