{"title":"ASIC Hardware Integrity Assurance Engineer (Eligible for US Security Clearance)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL_rUk-y9qd0gmu3GZTSo8dtEk66FenBdiOXMPrlElmHxxbbsN1-6Nr3cMowvSdx3Y01lSjNhQTXO6qTdIXcx5UJrR-xNMX_K_XZmyo-9R11VzpruQSxbfmpxbRSSEu_nJsjK4aqxIrYn3ENvljYYWKrdsDqBRP9s5aNPR5I5fhDrFMMo57hEmhQundP1Q","source":"ziprecruiter","full_description":"Company:Qualcomm Technologies, Inc.Job Area:Engineering Group, Engineering Group > Hardware EngineeringJob Overview: Qualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is the Invention Age - and this is where you come in.Qualcomm's Government Technologies (QGOV) division develops special products based on its wireless terrestrial and satellite communication technologies for the military, federal, local, and foreign governments.Applicants selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information.***Must be a U.S. citizen and eligible for a U.S. Government security clearance.***Role and ResponsibilityIn this role, you will support government-sponsored research, development, integration and QGOV systems, including adaptation and extension of commercial systems to novel applications and environments, as well as internal development efforts. Successful candidates will also be looked upon as a subject matter expert on state of the art, high-volume semiconductor development processes as well as being adaptable to tackle a wide variety of problems. You will analyze all aspects of the process flow from high-level design to synthesis, place and route, and fabless production. You will evaluate Qualcomm's existing practices, compare current capabilities with customer requirements, and present to customers. At times, you will adapt and modify commercial chipsets to unique QGOV applications. Responsibilities will also include analyzing design processes and supply chain integrity. Minimum Qualifications + Bachelor's degree in Engineering, Information Systems, Computer Science, or related field. + 5+ years Hardware Engineering experience or related work experience.Highly Preferred Qualifications + 5+ years of experience in high-volume ASIC design or related work experience + Broad knowledge of fabless semiconductor design processes with expert understanding of design process flow from RTL to GDS-II + Experience with EDA and CAD tools for ASIC design (i.e. Design-Compiler, Genus, Innovus, ICC/ICC2, Calibre, etc.) + Deep understanding of SOC architectures for high-volume consumer electronics + Proficient in VHDL / Verilog / SystemVerilog + Excellent verbal and written communication + Resourceful, analytical problem-solving skills + Excels in highly ambiguous environments + Ability to effectively work with multi-functional engineering teams and present a broad range of technical subject matter in customer meetingsPreferred Qualifications + Master's degree in Electrical Engineering or related field + 8+ years of experience in high-volume ASIC design or related work experience + 2+ years' experience with scripting and programming languages (i.e., Tcl, Python, Perl, C, etc.) + 2+ years' experience with design verification methods + 1+ years' experience with supply chain integrity and security + Experience with ASIC design and fabrication threat assessments + Familiarity with eFuse and one-time programmable ROM technologies and applications + Understanding of FPGA emulation and developing design prototyping methodologyApplicants: If you need an accommodation, during the application/hiring process, you may request an accommodation by sending email to accommodationsupportTo all Staffing and Recruiting Agencies: Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.If you would like more information about this role, please contact Qualcomm Careers (http://www.qualcomm.com/contact/corporate) .Our Work Experience is the combination of everything that's unique about us: our culture, our core values, our company meetings, our commitment to sustainability, our recognition programs, but most importantly, it's our people. Our employees are self-disciplined, hard working, curious, trustworthy, humble, and truthful. They make choices according to what is best for the team, they live for opportunities to collaborate and make a difference, and they make us the #1 Top Workplace in the area. Employment Notices for US-based Job Postings Equal Employment Opportunity (https://www.eeoc.gov/sites/default/files/migrated\\_files/employers/poster\\_screen\\_reader\\_optimized.pdf) \"EEO is the Law\" Poster SupplementPay Transparency NonDiscrimination Provision (https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp\\_%20English\\_formattedESQA508c.pdf) Employee Polygraph Protection ActFamily Medical Leave Act (https://www.dol.gov/sites/dolgov/files/WHD/legacy/files/fmlaen.pdf) Rights of Pregnant EmployeesDiscrimination and Harassment (https://www.dfeh.ca.gov/wp-content/uploads/sites/32/2020/10/Workplace-Discrimination-Poster\\_ENG.pdf) California Family Rights ActPrepare and succeed Qualcomm Interview FAQs (https://www.qualcomm.com/company/careers/faqs) Employment Fraud Alert We have received reports of employment scams that seek financial or personal information from job candidates. Please note these communications are fraudulent. Click here (https://www.qualcomm.com/employment-fraud-alert) to view our Employment Fraud Alert."}