{"title":"DNS Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIXC7fHyThSDxjQcKFLqW4Y1eFu1WG2FbJZRlckgfXmz4UvwgoHbKPqWeGh4DGzI71KrOjXZzMrPFkXHoT52D71nZnDIRsXZSwGNLIuUwvVxBH7xSYCbf4TkTNQvY7T8mQpWW9xOe80FHyC0EETwfASC7MBdzm-uG5TthHbKUrQyXEGNkD2IxhVqnkRteQ","source":"ziprecruiter","full_description":"We are seeking a DNS Engineer to design and implement DNS, DHCP, and IPAM strategies for our multi-tenant hosting infrastructure. As part of Epic's hosting team, you'll keep abreast of the latest technologies and work collaboratively with experts in a variety of knowledge areas to develop and maintain a robust, reliable, high-performance foundation for some of the largest healthcare organizations in the country to access our world-class software. Desired Skills and Knowledge Areas:Background in networking fundamentals including TCP/IP, DNS, and DCHPExperience with Windows DNS console, Infoblox, BIND, or other DNS/DHCP toolsExperience with automation and scripting languages such as Powershell, Python, and/or GoMore than just important work.  Epic is located in  Madison, Wisconsin, a city regularly ranked as one of America's best places to live. Epic's environment is one of continuous learning; you'll have access to opportunities to expand your skill set and share your knowledge with others. We offer comprehensive  benefits to keep you healthy and happy as you grow in your life and career, and your merit-based compensation will reflect the impact your work has on the company and our customers. You'll also be eligible for annual raises and bonuses,  as well as stock grants, which give you an even greater stake in the success of Epic and our customers. Epic is an Equal Opportunity/Affirmative Action (W/M/Vets/Disability) employer. Please see our full non-discrimination statement at  https://careers.epic.com/EEO. Relocation to the Madison, WI area (reimbursed)5+ years IT experience required, minimum 1-2 years in DNS design and supportA history of academic and professional successEligibility to work in the U.S. without visa sponsorship As a member of the Hosting team at Epic you'll be responsible for the confidentiality, integrity, and availability of Epic Hosting. Those responsibilities include: Following policies and procedures and escalating when policies or procedures are not followedEscalating potential security incidents and providing relevant informationMeeting all security responsibilities defined in policies and procedures"}