{"title":"Senior iOS Developer - Adobe Scan","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK2PjsKP8NP0yG8K81sruHPvsVdWTRosA_1oIl0IC2pTPDF8DKrFoKGyrh5PjW-F4oyiUrXNLrffHtrPl2P3VV3dl-iO0CWCG8aOwQyNnwPAwnPYM9GgXWB9WrgCT8_Q_RyCUBuNiA8UAmPyVyow4dkXmNoGtCAhyS5VIKlkOOnyptdAuaBXDu2R9gd69I","source":"ziprecruiter","full_description":"Our CompanyChanging the world through digital experiences is what Adobe's all about. We give everyone-from emerging artists to global brands-everything they need to design and deliver exceptional digital experiences! We're passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.We're on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!The Opportunity We are looking for a passionate and exceptional individual to join the Document Cloud Mobile team, located in San Jose. We're a creative and collaborative group that builds applications used by millions of customers working with billions of documents. The accelerated transition to digital workflows that began in 2020 presents tremendous opportunities for our Adobe Scan mobile application. As a developer in this organization, you will have the opportunity to work with other world-class developers to deliver on this opportunity. Our Scan iOS mobile team is part of the larger Adobe Document Cloud, an integrated environment for working with documents across desktop, mobile, and web.A successful candidate will become a key contributor on a team with high technical standards. You will have the opportunity to own features focused on engagement, retention, and subscription sales. You will provide creative solutions and have an attention to detail, with excellent opportunity for ownership and influence on product, business, and technical direction.What you'll Do Design and develop new features and experiments that drive engagement and new revenue for the Adobe Scan iOS applicationCollaborate with product, design, and other developers to build features that enrich the Document Cloud ecosystemEngage directly with users to triage problems and understand issues they may be experiencingWhat you need to succeed BS or MS in Computer Science or equivalentMinimum of 8+ years relevant experience in software engineering (including experience developing, shipping, and maintaining mobile applications) or equivalentpractical experience Strong technical background and analytical abilities in software design, implementation, and troubleshootingKnowledge and experience in iOS development, plus experience coding in Objective-C or SwiftAbility to work efficiently and independently, solving problems and overcoming challenges as they ariseExcellent written and verbal communication skills"}