{"title":"QC Analyst (Chemistry)","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AALFWg6EDxt6gD31tyYs3AaIFXm_iE7UzDzzpQRVvM2MtEWTrgn44P0LpU3VMV2O9p188DYILrIsVQW07TIFTH4EYYQbRR1j8YkSsS02yLz-qg88vgUvGJ1enuCgWaXJ3t52mf5iIjlzMUeyI-vAyqPGymIDw06LQDzVqQWvziwg6UDR_EDxC6Zer5jCGfs","source":"ziprecruiter","full_description":"Quality Control Analyst - ChemistryFerndale, MIContract-to-Hire OpportunityMonday-Friday, 6AM-2:30PMKelly Science & Clinical has an excellent opportunity for someone with a scientific degree, looking to gain more experience! This is a great fit for someone with previous instrumentation experience that is looking to grow long-term in a close-knit, team-oriented environment.Responsibilities Quality control analysis of the products and raw materials and special inter-department projects as needed. + Analyze, approve /reject, and adjust products and raw materials based on corporate Q.C. specifications. + Use Lotus Notes for Q.C. specs and procedure information. + Calculate product adjustments and communicate to Manufacturing. Use of all laboratory equipment and instruments, such as pH meters, AA, HPLC, UV, ICP, etc. + Communicate lab inventory needs to Supervisor. + Communicate with Manufacturing and Purchasing to maintain high standards of Quality for raw materials and raw material sources. + Maintain records of test results and enter into SAP data management system. + Log and store retain samples in proper locations. + Maintain general lab safety and awareness. + Perform general lab housekeeping. Properly store and dispose of all lab chemicals. + Analyze NCMR (F8/F9) samples and provide dispositions for them. All lab duties are performed in accordance with ISO 9001 and 14001 standards.Qualifications Bachelor's degree in the sciences required , chemistry degree preferred + Experience with instrumentation such as pH meters, HPLC, UV-Vis, etc. required + 1-2 years of industry experience preferred + Quality-minded with strong attention to detailWhy Kelly **** ?Kelly Science & Clinical is your connection to premier scientific and clinical companies looking to hire talented people just like you. Every day, we match science professionals with dream jobs that fit their skills and interests-it's the way we think job searching should be. Nearly 100 percent of our science recruiters have a professional background/education in science, so we know a thing or two about the science market and how to get you noticed.About Kelly ****At Kelly, we're always thinking about what's next and advising job seekers on new ways of working to reach their full potential. In fact, we're a leading advocate for temporary/nontraditional workstyles, because we believe they allow flexibility and tremendous growth opportunities that enable a better way to work and live. Connecting great people with great companies is what we do best, and our employment opportunities span a wide variety of workstyles, skill levels, and industries around the world.Kelly is an equal opportunity employer committed to employing a diverse workforce, including, but not limited to, minorities, females, individuals with disabilities, protected veterans, sexual orientation, gender identity. Equal Employment Opportunity is The Law. (https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm)"}