{"title":"Remote Software Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALtWrAvEFweOIQZdyN4QVJY87kvuP8mH4id72oYyKHprX3jjvlkMzIjV_t13fNVrAmTIP-sJRzKR7ML60PoaAWUni5ThIbTqpuSFV_WoKATCIUaV4vDGm3fklgJKdisjDuh5Mfai0KvCd1LAry3otGTZjPdFgc49-De9hqQv8ylhQFnDeueeUw04OA66JbJ","source":"ziprecruiter","full_description":"Seeking several Software Engineers (of all levels) for an opportunity with a large Aerospace company located in Huntsville, AL. This position will be fully remote. Please apply with an updated resume.**Details:**+ Will be working on the Space Launch System for deep space exploration. + Will do a mixture of maintenance, upgrades, bug fixes, testing, development, etc. + Software Engineer will develop GUI software/middleware for Electrical Ground Support Equipment + Role will involve software development in C/C++ and an Agile process + Linux + GUI Experience (QT preferred but others are okay too) + 1553, RS-232, RS-485 or other serial communication experience (preferred)**About Aerotek:**We know that a company's success starts with its employees. We also know that an individual's success starts with the right career opportunity. As a Best of Staffing Client and Talent leader, Aerotek's people-focused approach yields competitive advantage for our clients and rewarding careers for our contract employees. Since 1983, Aerotek has grown to become a leader in recruiting and staffing services. With more than 250 non-franchised offices, Aerotek's 8,000 internal employees serve more than 300,000 contract employees and 18,000 clients every year. Aerotek is an Allegis Group company, the global leader in talent solutions. Learn more at Aerotek.com.The company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law."}