{"title":"Systems Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJYreaKqdvjlyBubZmc67upPcoYgFlvcZ2s-xdpEriXZqyAh-EdIjzUO-1IDBy-VKmTtjWCFULb8eQp9ASRj-fYf3LBReF3TZMkAAkTgG9EM3AnDL6_KNmCgBtQdnOJB1V28Y2j1JN0LExyyJvn6ujD-sMmYmdlL6TFJ4XIixuAlxQw4iEdy6N6o6Yb81a9","source":"ziprecruiter","full_description":"Cimarron is seeking an engineer with experience performing software project scheduling, planning, budgeting, and dependency management for a NASA program in Centennial, CO or Houston, TX. Key DutiesWork closely with United Launch Alliance (ULA) and other skill organizations to establish and maintain flight software development schedules and external dependencies. External dependencies include interface definitions, hardware deliveries, software deliveries, test case definitions, change management/adjudication, and other items needed in the software development effort.Work closely with the program schedule and budget organizations to ensure integration of the software development effort with the overall program schedule and plans. Participate in customer meetings and other associated activities to coordinate schedules.Work with software product owners to balance workloads and program milestones.Support customer proposal and negotiation activities.Required Skills, Experience, and EducationDue to facility security requirements, only U.S. citizens or Permanent Residents are eligible for consideration at this time. 7 or more years of experience. Prior experience supporting a NASA project or program. Experience with project management in the aerospace industry, including requirements, schedules, budgets, testing, and statements of work.Experience with avionics and software development and integration.Effective verbal and written communication skills.Bachelor's degree in an engineering discipline. Desired Skills, Experience, and EducationAbility to adapt to changing customer requirements. Bachelor's or Master's degree in Electrical Engineering, Aerospace Engineering, Computer Engineering, or Computer Science. Cimarron is an Equal Opportunity/Affirmative Action Employer, M/F/Disability/Veteran."}