{"title":"Production Chemist I","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK3fyenXMZG9YxfD_QVIXbMj5zNC6dCaH4WLBiEIGrPxlV0k9wdXLKPmCojIxnyBuyeMWk8EpZQiV4mVBh06lZfsQCWy_GiJk95ZUw7CNagISQ6TExX2crLnla8nLFEbtOIF_mt5i2uhT6q1JkMlQEbL1WzVgFr4vA5VdX9Iukd65nKXBBgwoxny37UftDC","source":"ziprecruiter","full_description":"Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries.     JOB DESCRIPTION:About AbbottThe key to successful treatment and full recovery is often fast, accurate diagnosis. Abbott's life-changing tests and diagnostic tools provide insights that enable smarter, faster decisions and transform the way the world is managing health.Our pioneering technology spans the world of healthcare operations - with medical diagnostic instruments, tests, automation and informatics solutions for hospitals, reference labs, blood centers, emergency departments, physician offices and clinics.Our location in San Diego, CA currently has an opportunity for a Production Chemist I within our Toxicology Business Unit. Under close supervision, this position is responsible for a variety of manufacturing support functions involving the operation of lab equipment and conduct of procedures/tasks according to established GMP, under the direction of senior staff. This job description will be reviewed periodically and is subject to change by management.WHAT YOU'LL DOCarry out production tasks in support of manufacturing goals and objectivesParticipates in Lean ActivitiesOperate laboratory equipment safely, as trained and directed, in accordance with established practicesMaintain records and notebooks as directed in a neat, thorough and accurate manner. Perform required data entry on company planning and materials management system. Report results to supervisorMaintain a neat and organized workplace. Ensure materials are appropriately labeled, approved for use and in enough quantity to complete required tasksRecommend and participate in document revisions to ensure accurate BOM's process descriptionsRecommend and participate in document revisions to ensure accurate NCMR and deviations Operate moderately complex laboratory equipment and perform routine maintenance/repair. Interface with contracted repair technicians as requiredFollow all safety guidelines, manufacturing policies and procedures. Operate under strict QSR compliancePerform complex formulations, component and material evaluations, equipment calibrations and maintenanceAbility to work overtime and/or on weekendsUnderstands and is aware of the quality consequences which may occur from the improper performance of their specific job; has awareness of device defects that may occur in their area of responsibility, including product design, verification and validation, manufacturing and testing activitiesResponsible for exhibiting professional behavior with both internal/external business associates that reflects positively on the company and is consistent with the company's policies and practices; build productive internal/external working relationshipsCarries out duties in compliance with established business policiesOther duties as assigned, according to the changing needs of the businessEDUCATION AND EXPERIENCE YOU'LL BRINGRequiredBA or BS in Chemistry or Biological Sciences or applicable equivalent experienceMinimum of 1-year of experience in laboratory environmentPreferredKnowledge of a variety of lab equipment and their operation is preferredDemonstrate problem-solving and troubleshooting skillsProcess orientated, Logical, analytical, meticulous, highly organized and able to analyze data & implement solutionsAbility to work in a team environment while satisfying individual responsibilities and objectives. Knowledge and ability to use MS Office and other manufacturing systemsAdaptable and willing to take on multiple new tasks and responsibilitiesIndependent collaborative self-starter with the ability to make appropriate quality-related decisions in real timeStrong verbal and written communication skillsAbility to follow detailed instructions, maintains accurate records and notes, and carries out assignments in a thorough, conscientious fashion while adhering to safe laboratory practices WHAT WE OFFER At Abbott, you can have a good job that can grow into a great career. We offer:Training and career development, with onboarding programs for new employees and tuition assistanceFinancial security through competitive compensation, incentives and retirement plansHealth care and well-being programs including medical, dental, vision, wellness and occupational health programsPaid time off401(k) retirement savings with a generous company matchThe stability of a company with a record of strong financial performance and history of being actively involved in local communitiesLearn more about our benefits that add real value to your life to help you live fully: http://www.abbottbenefits.com/pages/candidate.aspxFollow your career aspirations to Abbott for diverse opportunities with a company that provides the growth and strength to build your future.Abbott is an Equal Opportunity Employer, committed to employee diversity.Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.     JOB FAMILY:Research and Discovery     DIVISION:ARDx Abbott Rapid Diagnostics        LOCATION:United States > San Diego : 9975 Summers Ridge Road     ADDITIONAL LOCATIONS:     WORK SHIFT:Standard     TRAVEL:No     MEDICAL SURVEILLANCE:No     SIGNIFICANT WORK ACTIVITIES:Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day), Continuous standing for prolonged periods (more than 2 consecutive hours in an 8 hour day), Keyboard use (greater or equal to 50% of the workday)     Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.     EEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf     EEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}