{"title":"Senior Java Engineer (Remote) NEW!","location":"","salary":"","description":"","term":"$140,000 to $160,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIoBnQVLLgulgPCd6VirCC105_YBHDviXq9trVV44WKFNID5PQgmXq8nunXBp9WwIBQMd4k0ILUOQYLZethH7kL6GJloB7Gt9hqiPxsfrVJ5BSmBqzNX3_3v6RcMURK2WVHPqP7UcWVJRlZRow6Qe8q_yfB_GafsAvqG35q-Wz4joyS7ZfGI-nfHRsaCpQA","source":"ziprecruiter","full_description":"Senior Java Engineer (Remote) 100% REMOTE Title: Software Software EngineerSalary: $140,000 - $160,000 Requirements: 5-10+ years software development with good experience in Java and Kubernetes/Docker, etc.We are a SaaS healthcare technology company that has seen very constant growth for the past 5 years and are the recent recipient of another Best Places to Work award.We're huge on promotions, and can proudly say that we have promoted 50% of employees with over 1 year of tenure.Due to growth, we are actively hiring a senior software engineer to help us scale. This position will have a major impact and help influence company goals/direction. This person will be responsible for all stages of the software development lifecycle. If you have this experience, please apply immediately. We are actively interviewing for this high profile position.Top Reasons to Work with Us- Competitive salary ($140k - $160k)- Work w/ Industry Pros who have a few impressive exits under their belts- Full Benefits (health, dental, vision, etc.)- Strong GlassDoor rating- Have your voice be heard in and play a role in company direction- Very low turnover rate- Huge opportunity for career and personal growthWhat You Will Be Doing- Contribute to all phases of the SDLC using Java and tools like Docker/Kubernetes - Work with product development team- Work in an Agile environment- Work on complex engineering problemsWhat You Need for this Position5-10+ years of software development - Java- Microservices- Spring, Hibernate, etc.- Docker / Kubernetes- Kafka- Experience in the healthcare industry is a plus- BS in CS (or related) is preferredSo, if you are a Senior Java Engineer (Remote) with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}