{"title":"Service Bus Software Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIoKfw-2kGCTJ-ZDNsJU7jfAN_iaseoYyEkBMcOxAdRpqWYCJUOnV4nyEhHlCPFFcma8QRANJPQn0I3NmCWGZZVLkIL35Bhdr15lZBIwvuwzIZtSudbSkzcQbgEZdrvgIJs5hVHWJcMjRKNnJtqsGVr82dDt9oGEEZ06rUDbvm-R_AZj5duDpmCOTrq6i8","source":"ziprecruiter","full_description":"**If you are a current FIB employee, please apply through the Career Worklet in the Employee Portal.This position may be located at any of the offices within First Interstate Bank's six state footprint, including Idaho, Montana, Oregon, South Dakota, Washington and Wyoming.SUMMARYThe Service Bus Software Developer is to be responsible for the design, analysis, and development efforts for the Enterprise Service Bus and SOA projects and to resolve complex business problems. This includes modeling, building, and supporting the Enterprise Service Bus and supporting SOA.ESSENTIAL DUTIES & RESPONSIBILITIES include the following; other duties may be assigned.Experience using ESB (messaging), and Java technologyFamiliarity with Service Oriented Architecture (SOA), Enterprise Service Bus (ESB), API Management, etc.Integration experience with various technologies (web services, XML, ESB, SOAP, REST, messaging, etc.).Participate in the design and delivery of our SOA/ESB projects on integration with customers/clientsContribute to key phases of the development lifecycle.Identify, analyze and develop interfaces and flows.Assist in the development of logical and physical specifications.Develop solutions by designing system specifications, standards, and programming.Identify and communicate technical problems, processes, and solutions.Self-motivated with high energy, Strong technical and organizational aptitudeExcellent communication and writing skills with technical IT and team members at all levelsMust be able to work independently to meet deadlinesEagerness to contribute to a team oriented environmentLead projects within architecture. Work with Product Owner/Business Analysts to understand functional requirements and interact with other cross-functional teams to architect, design, develop, test, and release features.Develop Proof-of-Concept projects to validate new architectures and solutions.Mentor the other SOA/ESB developers.Ability to quickly adapt to changing needs, adjusted processes and ambiguityProvide quality service satisfaction by possessing strong customer service skill sets.Ability to effectively communicate both verbally and in written format.Wow us with your expertise and leadership on making technical decisions, thus delivering a platform that provides business value and meets end user goalsAbility to prioritize and work autonomously yet collaboratively when neededExperience working within agile methodologiesQUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functionsEDUCATION and EXPERIENCEA Bachelor's degree (BS/BA) from a four-year college or university in Computer Science or related technical fields. Requires a minimum of 5 years experience as a Developer in SOA/ESB Development. Experience designing and developing Software Ag WebMethods or other ESB frameworks. Experience in configuring APIs, proxy endpoints, API portals and API analytics based on technical specifications with Software Ag WebMethods API manager or similar framework. Experience orchestrating integration use cases involving multiple systems and complex business logic tying in system, process, and experience API layers. Deep understanding of REST, HTTP, MQ, JSON, XML and SOA. Strong experience in Java and C# programming languages. Experience providing technical leadership to peers, desired. Exceptional level of communication skills both oral and written with public speaking comfort.LANGUAGE SKILLSAbility to read, analyze and interpret the most complex documents and to read and interpret data. Ability to respond effectively to the most sensitive inquiries or complaints. Ability to prepare presentations using original or innovative style, techniques and make persuasive speeches and presentations on controversial or complex topics to top management, public groups and/or board of directors.REASONING ABILITYAbility to apply principles, logical or scientific thinking to a wide range of intellectual and practical problems. Ability to deal with a variety of abstract and concrete variables.PHYSICAL DEMANDSThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand, walk, and sit. The employee is occasionally required to use hands to finger, handle, or feel; reach with hands and arms; and stoop, kneel, crouch, or crawl. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision and ability to adjust focus.WORK ENVIRONMENTThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of the job.The noise level in the workplace is usually moderate.**If you are a current FIB employee, please apply through the Career Worklet in the Employee Portal."}