{"title":"Software Engineer (Python / AWS) NEW!","location":"","salary":"","description":"","term":"$90,000 to $140,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIMkDH1QsIxeNbs6gzHWeMxy3obPGI5xL_tO5J7VFqISEaAVhINpTgObiO9Sdjh7SROXZvGpTEr-JcGueaX8r8aUrFaeReBFFG2C7zmNw9DFhTMX1UM68-4eDvgdTpga-VTajDEd_BTOkllMAKR8rqCM1LLPe3ihlNk5Kp_PP-M8W54iBIVzeSmCsdTWK-m","source":"ziprecruiter","full_description":"Hamilton Porter is a national technical recruiting agency that partners with growth stage companies to help them find and hire technical talent to build their products and systems. We are currently partnered with an award-winning consumer electronics start-up that has built a robotic home automation product that is already in over a millions households across the US. Due to growth, we are looking to hire a full-time Senior Software Engineer with a background in Python & AWS to join the team and help continue the development of their proprietary IoT platform. This is a great role for hands-on software engineer that thrives in a cooperative, small team atmosphere. This is a heavily backend development focused role. Please read on for more details!The RoleYou will be responsible for ongoing mobile app and AWS IoT development, integrations with third-party IoT products, co-management of our agency partner, system debugging and more!ResponsibilitiesMaintain and expand AWS IoT environmentDevelop new features or bug fixes for backend solutionsDevelop new IoT integrations for connected hardware productsWork with design team on implementing new application designsPerform unit and functional testing to ensure the quality of your workWork with the support team to identify and resolve issuesExperiment and create proof of concept prototypes for new featuresAssist with d​evelopment of new features or bug fixes for mobile appsEducation, Experience, & SkillsBS in Computer Science or Computer Engineering, or equivalent in experience3+ years of Python development experience couple with experience developing with AWS backend services3+ Experience with AWS systems: DynamoDB, IAM, IoT Core, ECS, Kinesis, Lambda, Lightsail, PostgreSQLAny experience with GraphQL or Docker highly desiredBonus points for an AWS certifications (DevOps) or experience with IoT / connected devicesCompensation & PerksCompetitive Annual Base Salary ($90,000 - $140,000 DOE)Generous PTO plan with flexible work hoursComprehensive Benefits Package (medical, dental, vision, life insurance, disability, etc..)401k matching @ 4%We are ideally looking to hire folks that reside in the Greater Detroit area. Please apply with your resume for consideration!"}