{"title":"OSI PI Developer BHJOB6704_3551 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK1h4ZjS9ZcDp7isOaGnpcy2T2-GhhFoSj5u5s6g4iZxLk0E7WmpTgns_tGLMxdjDA9iNlbZLH5wh9OR2gEyp6_MBzob4awbpYYP-HFnNQGezWCGhkzHqB414HyIFYDoUYeAWJaNI3J78HLEve1IIGh2EswjeNPYXblZk2aZYn5qPCLPMSpUeQuHzfUte4","source":"ziprecruiter","full_description":"Job TitleOSI PI DeveloperLocationHouston, TXOur client, a very stable, mature leader in the maritime/offshore industry, is looking for an OSI PI Developer to be part of a brand-new group and initiative for enterprise digitalization. This role will be highly visible and require innovation and out-of-the-box thinking. This endeavor will transform the way the company does business.Job Summary:As a technical developer, you will be responsible for the end-to-end development of Pi solutions, including design/development and code quality. You will develop and maintain standards, policies and procedures and will utilize strong testing, troubleshooting and support skills. Additional responsibilities include translating requirements into effective solutions and cross-functional team collaboration, developing and maintaining standards, policies and procedures and utilizing strong testing, troubleshooting and support skills.Duties:designing and constructing PI systems and developing system requirements and design specificationsPI AdministrationData design and data management experience using Oracle, MSSQL Server and MySQLWork with notifications, asset analytics and event frames in PI Asset Framework Troubleshoot issues quickly, have good communication skills, Development and Setup of PI AF and PI Vision screensIngest data from multiple sources into PI Data Archive using API, UFL, SDKBe comfortable working in agile scrum environmentWork with QA team members to build testing plansRequired Skills:5+ years of experienceOSIsoft PI Product SuitePI Data ArchivePI AFPI to PIUFLPI ServerPI SDKPI AnalyticsBS Degree or equivalent experience"}