{"title":"Manufacturing Technician","location":"","salary":"","description":"","term":"Temporary","detail":"https://www.ziprecruiter.com/k/l/AAL4Sak7JLS5lpbS29J5G8UHp2XLrXKy4OMmkqmrMWhPlFLBTG5swyOBfttoQjtcGw5eiUET_2BS6j64scvEZoiwdC50lTB-sB3xbDfVhceKUQ1dE7pEjwowtXK06shrQLHpJgbaPxi75sbF30BAB5c0HQ9eu_YEEGN9_W9CuaWeirlLo1pdPCQboLd7uy8","source":"ziprecruiter","full_description":"Greetings,Hope you are doing well.Please go through the following position and let me know if you are interested please reply with your Updated Resume with contact details ASAP.Title: Manufacturing TechnicianLocation: Santa Clara, CA, 95054 DescriptionManufacturing Technicians operate complex equipment and analytical tools in a ESD environment. Multi-tasked responsibilities include, not limited to the following: Non-standard processing and problem-solving, as well as actual processing of state-of-the-art device. Primary job duties are to maximize output using constraint management Techniques while sustaining process, equipment issues, training and cross training cluster members while building a self-sustaining cluster team. Skills: Good problem solving ability is a must. Must be a self starter capable of managing own activities as well as supporting team activities. Basic math skills are required. Candidate must be flexible and capable of handling multi-task operations and attention to detail is must. Computer Systems: Computer Literacy, MS word, excel, PPT, Email This position requires the candidate to wear the clean room PPE (full Bunny suit), be constantly moving The ability to multitask is essential as there are many facets to the job. *****Must have*****Sponsor’s minimum education requirement is a Bachelor’s degree in a technical or science field or related field Education should contain the following basic information: • Degree obtained • School attended/location and field of study Working Remote #staysafe #allintogetherBest Regards,Deepak Soni Sr. Talent Sourcing Specialist – Staffing E: dsoni@compunnel.comP: 609 779 2663F: (609) 228-4161 Looking for new opportunities? Let jobs find you!Sign up at www.stafflinepro.comCompunnel, Inc. | www.compunnel.com 103 Morgan Lane, Suite 102, Plainsboro, NJ 08536, USA[We are an E-Verify and Equal Employment Opportunity Employer with adherence to EEO policy]Disclaimer: The content of this email is intended for the recipient specified in message only. Unauthorized use is strictly prohibited. Please refer to the email disclaimer page for important disclosures regarding email communication.delete it from"}