{"title":"Electrical Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALY4OJKC1EItzfdwwI6sbxoK7aEkRiMclrP6iE4arQv3ddW4G1FQm0R8oEQW22znr82N3chwisMk_c1WIjb0LSWjPK0FwWG0V_QaNxHXlZUNAA3vwH-mmRTTpmpUC-PAE_nWK9NrgoQzzul_GejDUul6H_ltdwm2NIiNR2fXU0NCxWshEdOi8HOFocgXwE","source":"ziprecruiter","full_description":"Summary of Position:The Project Engineer is responsible for designing and managing electrical engineering projects from conception to completion. He/she will apply his/her experience in: power distribution, lighting and fire alarm systems. As part of a multi-disciplined firm, he/she will be coordinating with Site/Civil Engineers, Mechanical Engineers, Structural Engineers, Architects and Construction Project Managers. He/she will be responsible for the production of electrical engineering construction documents while adhering to client requirements, code requirements and site adjustments.Essential Duties:Conduct site visit investigations and generate reports and recommendations based on findings.Produce design plans, calculations and reports with limited direction.Coordinate with sub-consultants.Provide client interaction support.Establish and maintain phase and task level budgets.Schedule project phases and tasks.Schedule production staff and lead them through tasks.Coordinate and assist with addendums, RFIs, and change orders.Assist in coordinating the work of a multi-disciplined team throughout the design development and contract document phases of a project.Other Duties and Responsibilities:Organize and maintain project files.Maintain documentation for billable hours.Demonstrate an understanding of liability issues related to design.Demonstrate an understanding of constructability and complex design.Requirements:Experience: 4+ years of experience with electrical design for buildings, preferably with commercial projects such as retail or restaurantsEducation: Bachelor’s degree in Electrical Engineering requiredLicenses: P.E. requiredTravel: Up to 20%Physical: Ability to lift up to 10 lbs.Software: AutoCAD and MS Office required; Revit a plus"}