{"title":"Software Engineer - Frostbite Schematics C++ C#","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALiv8gnwW-zYRMVD-S0Y3uejAR8gy_I12KW9xTtFwnxJJDF61b93QcAVIGFu2rr6_TJh52UfNfnytaUPjVbTtdvGSQCUk--kSbwbSptNMKKrCaHgeVwTHilYdvfPJAZRLBBNHYr5vyRbu0gyY6UWxRyGEO0yly3zEEMWS_hzXs6yx1eak17q-GUPwdO_LKx","source":"ziprecruiter","full_description":"Software Engineer, Frostbite Schematics - C++/C#FrostbiteFrostbite is EA's state-of-the-art multi-platform game development engine. Our global team empowers game creators to shape the future of gaming by developing creative engine features and outstanding tools. We are honored to have thousands of game developers all over the world using Frostbite to create some of the most amazing games and player experiences in the industry.Why join the Frostbite Team?As a Software Engineer on Frostbite, you will develop cutting edge tools and runtime technologies for game developers across EA worldwide. The Schematics team within Frostbite are responsible for the data-driven visual scripting engine that allows game creators the flexibility to craft any kind of gameplay experience. You will tackle game engine challenges across a broad range of genres and the results of your work will have a real impact on the final quality of games enjoyed by millions of players. You will help grow the team and mentor junior members, and you will be part of a team that is passionate about pushing our technologies forward while having fun.ResponsibilitiesCreate and improve workflows and data builds for complex gameplay systemsDesign and implement systems used by thousands of game developers across EACollaborate closely with game teams to enable creative workflows and maximize in-game performanceRefine usability, stability, and tool performance to power our users to create stunning gamesQualificationsBSc degree in Computer Science or related academic program4+ years working experience in C++ and/or C#Passion for solving hard problems with great peopleAbility to dive into large, complex software and be productiveExperience collaborating with large multi-domain teamsBonusesExperience in game engine developmentExperience with visual scripting languagesExperience developing gameplay systemsPassion for video games"}