{"title":"Tableau Reports Developer","location":"","salary":"","description":"","term":"$74,000 to $98,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIbO8nxNnY00ZzTD9XVqJ6CW672grwtobcYLQaH26ONqegxWYKnYl0sBYuYJXdkBLjJwsxyp9EtMtp8tuQBTebOuu_7VBQHaO37entZWm3h11-LjgKI4QXMrrIWMxP7TtxadSfdL5my1dIT0ugfm1GwvV-Jfq81m2X6_ZJJwUlGCsJa6jaSWhh01Zzin4MH","source":"ziprecruiter","full_description":"Job descriptionThe senior report developer produces SQL driven reports that are delivered to internal or external customers in satisfaction of contractual or operational reporting requirements using SAP Business Objects and Tableau. At LogistiCare, we believe that high quality reporting and project management go hand in hand. Report developers should expect to perform the vast majority of requirements gathering and scoping in addition to performing the final build itself. Moreover, report developers provide well written documentation for the final requirements of a report and can be counted on to serve as a reliable knowledge resource and owner for a report on an ongoing basis. The senior report developer’s duty also includes assisting junior report developers on the team with reports they may find challenging to execute and/or scope.The ideal candidate will work with the Director of Financial Insights, and other members of the Data Management organization, to automate the company’s legacy reporting builds. The candidate will demonstrate a willingness and ability to work with external customers, as well as a number of different teams inside the company, including but not limited to Data Management, Product, Transportation, Operations, and Finance. The candidate will also show a willingness and ability to assist the Data Engineering team make any contributions to key architecture within the data warehouse based on requirements gathering for reports and/or reporting builds.The successful candidate must have 5+ years of experience:- with excel- excellent T-SQL- with a business intelligence tool (preferably a SQL driven tool)-Tableau expertise MustThe ideal candidate would possess:- experience working to drive change using data in a data driven organization- experience with database architecting and/or analysis- experience or interest in working with a data language like R or Python is a plusWe are looking for someone who:- has strong written and verbal communication skills- is excited by challenges and undeterred by ambiguity- is always striving for process improvement- can manage ambiguity and adapt to changing priorities- works well with others - you thrive while sharing knowledge and receiving input"}