{"title":"DCYF Family Voluntary Services Specialist (SSS3) - Seattle NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJO3V_qTFtcP2nuv67BTK4VM1EXqKb0pJdUk_k4OqvNv1OdFZrqM4Eyypl3d0L2xUNizfUKCb5HyhGDTniyXA6A-mzpJ54g1IM6z71S38MuGhQVFi1c2jnCsVDyK3BHV-dE2TlwZ_w2pygBsbDUlOWCfOeI6x3ezRXRNRguDeTv_IPbCKXY2svHy_gvOF4","source":"ziprecruiter","full_description":"Description**Salary listed does not include the 5% premium pay granted to all King County employees*** *The Department of Children, Youth, and Families (DCYF) was created to be a comprehensive agency exclusively dedicated to the social, emotional, and physical well-being of children, youth, and families regardless of race, ethnicity, sexual orientation, or other socioeconomic factors. We believe our workforce should reflect the communities we serve, and are actively searching for candidates that reflect that diversity.Do you want to help families and communities safely care for their children? We're looking for a Family Voluntary Services Specialist join our Seattle King West office to protect children from harm, working toward the common goal of eliminating child and youth outcome disparities based on race and ethnicity. Our vision is that \"All Washington's children and youth grow up safe and healthy-thriving physically, emotionally, and educationally, nurtured by family and community.\"The Opportunity:The FVS Specialist provides services to a caseload of families allowing parents to voluntarily engage in services to increase their protective capacities and meet the child's safety, health, and well-being needs. This individual will also serve as a back-up investigator for the Child Protective Services Unit.**Some of what you will get to do:*** Provide therapeutic services and crisis intervention to families referred to the FVS Unit and provide service and safety plans to families. Provide assessment, service planning, casework, court and teaming services on assigned cases. Supervise voluntary placement while continuing to work with the children and parents to resolve abuse and neglect concerns. Provide monthly health and safety visits for children. Interview children, families, and collateral sources to assess risks to children and determine family needs. Assess the needs, risks, and dynamics for out-of-home placement with licensed foster care or relative resources. Prepare and counsel families through the placement process and exercise skills in crises intervention. Create referrals to appropriate law enforcement agencies, medical evaluations, and forensic interviews. Provide support services such as counseling, problem resolution, guidance, and referrals to advocacy and mediation. Provide short-term voluntary placement of children with licensed foster care or relative resources, working with families to resolve abuse or neglect. Initiate payments, document case activities, and maintain case records in the FAMLINK case management system.What we are looking for at the Social Services Specialist 3 level:One year as a Social Service Specialist 2.ORA Master's degree in social services, human services, behavioral sciences, or an allied field AND one year of social service experience equivalent to a Social Service Specialist 2.ORA Bachelor's degree in social services, human services, behavioral sciences, or an allied field, AND two years of social service experience equivalent to a Social Service Specialist 2.**Note: a two-year Master's degree in one of the above fields that included a practicum will be substituted for one year of paid social service experience.***In addition to those required qualifications, our ideal applicant will also have some or all of the following:*** One year assessing risk and safety with regards to child abuse and neglect concerns or developing safety or service plans with families.* Knowledge and familiarity with community resources and the local community.How do I apply?Complete your applicant profile and attach the following documents: Letter of interest describing how you meet the specific qualifications for this position Current resume detailing experience and education* College TranscriptsTo take advantage of Veteran's preference please attach your DD-214, member 4 long-form, or your NGB-22. Please black out your social security number prior to attaching.Supplemental Information:Prior to a new hire, a background check including criminal history will be conducted. Information from the background check will not necessarily preclude employment but will be considered in determining the applicant's suitability and competence to perform in the position.This position is covered by a collective bargaining agreement.The initial screening will be based on the content and completeness of your application and the materials submitted. All information may be verified and documentation may be required. Applications with comments such as \"see attachments\" or \"N/A\" in the supplemental question responses will be considered incomplete.DCYF is an equal opportunity employer and supports equity, diversity, inclusion and respect.Need accommodation throughout the application/interview process? Unable to apply on-line? Contact the Recruitment team at dcyf.jobs@dcyf.wa.gov or (360) 628-0114 or the Telecommunications Device for the Deaf at 800-833-6388Experiencing technical difficulties creating, accessing or completing your application? Call NEOGOV toll-free at (855)524-5627 or email support@neogov.com.General suggestions for creating a good application packet:* Read the job posting very carefully. Find out as much as you can about the position. Make sure you are very diligent in following all the application instructions. Include all requested documentation. Make sure your application and supplemental question responses address how you meet each of the required and desired qualifications. Carefully read each of the supplemental questions and respond completely to each one. Pay careful attention to each component of the question, providing examples, and thoroughly describing when and where you achieved the proficiency level, and detail the types of work you performed, the work products, etc., to demonstrate 'how'. Specifically include all of your work experiences doing the same or similar work, especially if you reference work in these jobs in describing when/where you gained proficiency level skills. Make sure your application reflects your best writing.01787Salary: $4,509.00 - $5,913.00 MonthlyLocation: King County - Seattle - Queen Anne, WAJob Type: Full Time - PermanentDepartment: Dept of Children, Youth, and FamiliesJob Number: 2021-01787Closing: 3/15/2021 11:59 PM PacificAgency: State of WashingtonAddress: View Job Posting for Agency Information View Job Posting for Location, Washington, 98504Phone: View Posting for Agency ContactWebsite:* http://www.careers.wa.gov"}