{"title":"Technical Writer II NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAK91o3BV0qsORRn3IMqlXwIZZ87jwHWZGfjMO8ThPhppAmbz3rPWxZdV8u2YKE-sI5oHbZHci-_INCMAsUwQWawH0jLuoxg48pSXvCXbgLPyTA1zaOkCrE3yzK832VZxfBhc1NBKl4jQypr-Ntp-VDvWtyQpskYIyDRUoT4JRAviItyshAoj4zZ6XPjprDf","source":"ziprecruiter","full_description":"Genesis10 is seeking a Technical Writer for a 7 month contract position with our client in the SEO industry located in Kirkland, WA.Summary:Compile existing visual/interaction designs. Identify any content that should be updated to maintain consistency. Work 1:1 with visual and interaction designers as necessary to complete the visual guidelines document. Documentation is needed for all internal-only design content as well as the content that is for external consumption (and would include all the necessary visual/interaction guidelines that an external application developer might need.) Requirements: Technical writing experience that includes producing task-oriented documentation, reference material, and online help systems. Expertise with publishing toolset (Frame maker and Quadralay WebWorks) and publishing to the Web. Verbal and written Skills. Ability to work with peopleExcellent English reading and writing skills At least 3 years of experience in an editorial or technical writing role working with English documentation Proven ability to work independently and drive projects to completion with minimal guidance Impeccable attention to detail Strong communication and collaboration skills. BA/BS degree required.Able to work as a W2 employee of Genesis10 (no corp to corp)Desired:BA/BS degree in English, communications, or equivalent practical experience Familiarity with Google Apps products, including Google Sheets Experience working closely with engineering and product management teams as part of the software development processIf you have the described qualifications and are interested in this exciting opportunity, apply today!About Genesis10:Genesis10 is a leading U.S. business and technology consulting firm with hundreds of clients needing proven talent and solutions to power their strategic initiatives. If you are a high performing business or IT professional with solid, referenced experience, we want to meet you. Genesis10 recruiters and delivery professionals are highly accomplished career advocates, who get to know you beyond your resume to position you with the opportunities that fit your skills, experience and aspirations. We have benefit options to fit your needs and a support staff that works with you from placement throughout your engagement project after project. To learn more about Genesis10 and to view all our available career opportunities, please visit us at www.genesis10.com \"Genesis10 is an Equal Opportunity Employer, M/F/D/V \""}