{"title":"Software Engineer II - Java SpringBoot/Camunda/Angular SPA Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALdtDDPK4XdjbzF2phOrr-udpCLua6D6FKS68tYBei-IujWIO4q1jRP5u3HzddrGfq9HEIi7eTW21ctUCJwejE5NdJBNTw1s8SUdT2cR7hkgDy_7Xyr68Q5koEcJ8fp5oqVwHEs4AWQ_VV_fuj1TsXLoyJ9GRRjQi9G0ZL88PHYu75XCLmjkyrRFUys5DQa","source":"ziprecruiter","full_description":"Specific information related to the position is outlined below. To apply, click on the button above. You will be required to create an account (or sign in with an existing account). Your account will provide you access to your application information. Need Help?Should you have a disability and need assistance with the application process, please request a reasonable accommodation by emailingAccessibility or by calling 877-891-2510. This email inbox is monitored for reasonable accommodation requests only. Any other correspondence will not receive a response.Regular or Temporary:RegularLanguage Fluency: English (Required)Work Shift:1st shift (United States of America)Please review the following job description:Deliver technically complex solutions. Perform system integration support for all project work. Consult and partner with the business product owners to understand the end goal and offer solutions and recommendations during the design.Following is a summary of the essential functions for this job. Other duties may be performed, both major and minor, which are not mentioned below. Specific activities may change from time to time.Truist Digital Commerce Software Development team is a highly collaborative, leading-edge tech stack development team with opportunities for continuous learning and career development. The Software Engineer will be part of an agile scrum team and function as a developer to help deliver the next-gen digital assets to enable the business. This includes developing Angular SPA, SpringBoot REST API, BPM/Workflow, SOAP, and with opportunities to learn and be part of cloud enablement.QualificationsRequired Qualifications:The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Bachelor's Degreeand four to seven years of experience or equivalent education and software engineering training or experience In-depth knowledge in information systems and ability to identify, apply, and implement IT best practices Understanding of key business processes and competitive strategies related to the IT function Ability to plan and manage projects and solve complex problems by applying best practices Ability to provide direction and mentor less experienced teammates. Ability to interpret and convey complex, difficult, or sensitive informationPreferred Qualifications:Java certification.Experience, working in a fast paced, results-oriented technology environment.Interest and ability to learn other tools and programing languages as needed.SAFE Agile development CertificationResponsibilitiesWork closely with product, design and UX to develop a new banking experienceContribute to design and refine features and functionality with the teamParticipate in code reviewsParticipate in all Agile ceremoniesMake sure to maintain high quality code using industry best practicesHands-on development to support each scrum deliverables (Java, Angular, BPM, SQL, Maven Build, Artifactory, GitLabs, etc.)Following the SDLC process and creating necessary artifactsConfigure the CI/CD pipelineUnderstanding the business requirements, and developing and executing test cases to support both SIT and UATServe as 3rd line production support to triage and resolve issues.Other Job Requirements / Working ConditionsSitting/Standing/Walking/Bending/Lifting Sitting (if checked, indicate frequency) Constantly (More than 50% of the time) Standing (if checked, indicate frequency) Frequently (25% - 50% of the time) Walking (if checked, indicate frequency) Frequently (25% - 50% of the time) Bending (if checked, indicate frequency) Lifting (if checked, indicate pounds) Visual / Audio / SpeakingAble to access and interpret client information received from the computer and able to hear and speak with individuals in person and on the phone. Manual Dexterity / Keyboarding Able to work standard office equipment, including PC keyboard and mouse, copy/fax machines, and printers. AvailabilityAble to work all hours scheduled, including overtime as directed by manager/supervisor and required by business need. Travel (Must select one)Minimal and up to 10%Truist supports a diverse workforce and is an Equal Opportunity Employer who does not discriminate against individuals on the basis of race, gender, color, religion, national origin, age, sexual orientation, gender identity, disability, veteran status or other classification protected by law. Drug Free Workplace.Thank you for your interest in Truist! BB&T and SunTrust have come together in a transformational merger of equals to create Truist, the premier financial organization in the country. You may notice references to our legacy company names, BB&T and SunTrust, in places throughout this site. All such references should be understood to refer to Truist moving forward while we continue to transition to the Truist name.EEO is the LawPay Transparency Nondiscrimination Provision E-Verify"}