{"title":"TECHNICAL SYSTEMS CONSULTANT II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALxoo_g-7ATmvMHgcKxfpjlbpglNzNemkPyvgqaN0uwQXVW06x7bw--YHRYYuJUzaV8iXiRZ-9oUyQx86XFq_fjeeGanRtS9-N3KhvJircWnVac0Vzjt6dFAyowEnMBAFVxn5eY-vzVh04aSHunuX3CLVQITMudAtEdVtJrWHjWk2ljhUobXbBpxsMRbl4","source":"ziprecruiter","full_description":"McCormick & Company, Inc., a world leader in the spice, flavor and seasonings industry, is seeking a full time IT Technical Consultant.This new hire will work at McCormick Global Headquarters, located at 24 Schilling Roadin Hunt Valley, MD. The IT Technical Consultant will report to a Hiring Manager title.With more than $4 billion in annual sales, the Company manufactures markets and distributes spices, seasoning mixes, condiments and other flavorful products to the entire food industry - retail outlets, food manufacturers and foodservice businesses. We create differentiating flavors consumers prefer with unmatched quality, science, innovation and service. Every day, no matter where or what you eat, you can enjoy food flavored by McCormick. McCormick makes every moment and meal betterAs a company recognized for exceptional commitment to employees, McCormick offers a wide variety of benefits, programs and services. Benefits include, but are not limited to, tuition assistance, medical, dental, vision, disability, group life insurance, 401(k), profit sharing, paid holidays and vacations.The IT Technical Consultant uses in-depth knowledge of technical solutions, integration tools and applications to meet the business needs whilst enhancing the alignment between business process and information technology. The incumbent will have technical and functional expertise within multiple integration areas across a range of business subprocesses. The IT Technical Consultant is responsible for identifying solutions, designing integrations and alignment with the business needs and IT architecture standards. The consultant is also responsible for driving process improvement by collaborating internally within IT and business partners. This position serves as the principal technical consultant on all projects and research connected to their area of expertise. On all but the largest projects, the incumbent may act as the IT Project Manager. This position is primarily responsible for identifying solutions to meet current and future business needs but can also involve directing the work of others. As subject matter expert, technical coaching and peer technical development is an integral part of the role. Key ResponsibilitiesLead, design and manage the solutions architecture for Application to Application and business to business integration, leveraging Enterprise Service Bus and Data Virtualization technology Define and align the global integration standards, principles, best practice to optimize the solutions used within McCormick. Serve as functional leader between Business and Technical teams regarding integrations across multiple applications and technology projects, formulating systems scope and objectives relative to business needs and project requirements, applying industry best practice.Drive continuous improvement and appropriately challenge solutions to improve performance, minimize complexity and reduce Total Cost of Ownership May act as a team lead. Maintain control over allocated project budget to ensure compliance with expense and capital allocations. Under general supervision, this position may plan and direct the work of both employees and contractors in the development and/or support of moderate to complex systems applications.Network, benchmarks and actively participate with external shared groups to gain insights into the emerging trends and potential use of new tools and/or techniques. Required QualificationsBachelor's Degree, may consider 10 years of related experience in lieu of degree in Computer Science or related disciplineAt least 10 years experience in a similar architecture role with experience across multiple system platforms. Experience of integration in a complex enterprise-wide SAP ecosystem landscape across multiple on premise and cloud hosted applications.Strong Enterprise Service Bus and Data Virtualization technology awareness.Demonstrates deep knowledge and understanding of core business functions and its implications relating to system integrations.Proven experience of architecting integrations within an SAP enterprise landscape including cloud applications.Demonstrated skills in effective project management throughout the project lifecycle. Ability to work effectively individually as well as part of a team. Strong organizational, verbal and written communication skills. Strong interpersonal skills. In-depth technical and functional knowledge/understanding of more than one business area through project participation/experience. High level knowledge of multiple business functions and can assess impact of changes requested. Has knowledge of industry trends; takes practical steps to ensure up-to-date knowledge of emerging technologies. Understands relationship between technical development and strategy of organization. May manage project budgeting process, including tracking costs of actions and decisions.Ability to develop effective working relationships. Strong communication and diplomacy skills are used to guide, influence and convince customers and 3rd parties of the preferred course of action. Solid organizational, verbal, and written communication skills with the ability to communicate to business stakeholders and across levels, up to Sr executives. Acts as a mentor and coach within team and across IT and proactively shares knowledge. Frequently interacts from peer to Director (presents to and interacts with function heads and steering committees). Performs role in a professional manner with the ability to develop effective working relationships.Proven ability and aptitude to analyze complex problems and provide solutions at speed. Preferred QualificationsMasters degree in computer science, engineering or related spaceTOGAF or similar enterprise architecture framework certificationSAP certificationPMP6sigma Green Belt or Black BeltProficient in Enterprise Service Bus and Data Virtualization CPG or FMCGSeek constant improvement opportunities and appropriately challenge technical solutions to improve performance and maximize the value/Total Cost of Ownership ratioMcCormick & Company is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion,national origin, disability, protectedveteran status, age, or any other characteristic protected by law.As a general policy, McCormick does not offer employment visa sponsorships upon hire or in the future."}