{"title":"Senior Electrical Engineer - FPGA","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKasI809-IMnyLKloJO63RSN6VzUtw7-xlgYvCnIAIOPBkJ5K2E-_qISJJBWtitQPkdTCtdVp-rVEDDyWNgan4xSYeg6ZhMFDvrm034RvkZQOi3Nk9boC4mwt-6lKMaOkPjRq-BUuhvLUp4DrD1sFcgxJCWKngfReMACCwMBWL3g99pWtlZTa3w6ZTPqA","source":"ziprecruiter","full_description":"Senior Electrical Engineer - FPGA Our company is R&D focused with 200 of the brightest minds in DC. We are made up of 40% PhD level researchers and over 100 top notch engineers to support some of the toughest contracts in the country. A majority of our research is focused in radar, signal processing within electrical engineering and also machine learning, cyber security and wireless communications. Our employees are all on a clear career track and we support those that also want to contribute or work on independent research projects.We are now looking for a FPGA engineer to join our team!Top Reasons to Work with Us1. Top Research Projects in DC2. Guarenteed Performance-based Bonus3. Company Stock sharingWhat You Will Be DoingYou will be working with a team of researchers and engineers within the fields of FPGA and signal processing. Most of the team is composed of embedded, robotics, electrical and hardware engineers and you will be a key point to the teams success.Some of what you will be doing :-Transferring radar or system level design to HDL code-Implementing and testing algorithms in either matlab, java or C-Experience using high speed ADDC/DAC and FPGA transceivers-Debugging FPGA hardware prototypes -Knowledge of signal processing theory is a huge plus!Also great if you have experience with:-Implementing radar algorithms-Board-level digital/analog/RF/power circuit design, generating schematics-Supporting advanced prototypingWhat You Need for this Position- FPGA- Hardware- Firmware- Signal Processing- HDL- Matlab- C++- High Speed ADC- DAC- JavaWhat's In It for YouYou will have the ability to make an impact on your team and help guide younger engineers to see the project to completion. You will also be working toward career goals designated by you and have one of the best benefit packages available!So, if you are a Senior Electrical Engineer - with FPGA experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}