{"title":"Technical Support Engineer III","location":"","salary":"","description":"","term":"$65,000 to $95,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALl7XmcfnBtRGAp0-0I5xsZVjfk3i8oeGYtkBUi5QaTSoFp3uCjISqji7NdHyljPg6kBcRvED7fXJ3H5_w0-7W8exiTtxeEzkCoEqVxiKm26vYJrgEssl1vfQ5y5TtdSYt0BMajsR13FmKILS64Mo384TPNN0Z2ZnV-GUyiv5qZdRDC2IAbKxhXF_2NEuY","source":"ziprecruiter","full_description":"DAWSON is a Native Hawaiian Organization 8(a) small business that brings the Spirit of Aloha to our employees. As part of the DAWSON \"Ohana\", you will be provided a best-in-class benefits program that strives to ensure our great people have peace of mind when it comes to health and wellness. For more information about DAWSON and our benefits programs, please visit www.dawson8a.comSUMMARY: DAWSON is looking for an IT Support Engineer to support the continued growth of our company. The ideal candidate will add value to the existing team and possess the verbal and written skills to provide excellent customer service.DUTIES AND RESPONSIBILITIES:The System Administrator position is located in Colorado, Texas or Utah. The duties include (but are not limited to):Provide end-user support and technical assistance to employees located throughout the United States and the PacificHelp maintain business software applications through the company IT HelpdeskImplement, install, configure, monitor and trouble shoot computers, mobile devices and serversAssist with Tier II support issues that cannot be resolved on the IT HelpdeskAssist with computer hardware supply, disposition, etc.Validate company security controls and remediate any issues.Create technical documentation in the approved format for tasks assigned.QUALIFICATIONS:The ideal candidate will possess the following:3-5 years experience in Systems AdministrationExperience in the following areas:PC Support: Windows 10Office 365 (User Management, Exchange, SharePoint, TEAMS)Microsoft Azure (Virtual Machines, Sentinel, Azure Firewall)Networking: Router configuration, Firewall configuration, Wireless configuration, Network monitoringSecurity Information and Event Management (SIEM) software (Sumo Logic)Intrusion Detection Software (Qualys)Server: Windows server 2016 & 2019, Windows Terminal ServerMust have excellent communication skills (Both written and verbal)Able to think independently, prioritize work schedules and be adept at problem solvingWork cooperatively within a team setting to provide top-tier support to the user communityDAWSON gives preference to Internal Candidates. If no internal candidate meets our qualifications, external candidates will be given consideration.DAWSON offers a best-in-class benefits program including: medical, dental and vision insurance; a 401(k) program with employer match; paid vacation and sick leave; employer-paid basic life and AD&D insurance; and a flexible work environment. Additionally, employees can choose from several voluntary benefits including: critical illness coverage; accident insurance; identity theft coverage; pet insurance; and an Employee Assistance Program.DAWSON is an Equal Opportunity/Affirmative Action/VEVRAA Federal Contractor. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law."}