{"title":"Senior Software Engineer - Operator Engineering NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKnXAy7bpjB0SIE8PwIhpZztqUL63818R47wpklAWWprD73EI7Kze9QVpHUjB4Lj_tYL88qN0-R2O3JXlv_rvWESSXhl8cR9B1VmQv6_VdI706jNts8j241EMXXu_k37qKjheCYHXmTWcn-4KWWXMHjnZ1KaXm5SKjAaS4elNBC29w3fvI69Rmbh95LjFIV","source":"ziprecruiter","full_description":"This is an exciting opportunity for a software engineer passionate about open source software, Linux, and cloud-native computing. Come build a rewarding, meaningful career working with the best and brightest people in technology at Canonical, the growing international software company behind Ubuntu.As part of the Operator Framework team, you'll be the official gatekeeper of the Python framework that allows for the creation and managing of operators - software that drives software. You'll be designing and implementing the foundation for operator software that can run anywhere, from bare metal to Kubernetes in the cloud. You'll work closely with other teams in Canonical to ensure the framework provides a reliable, easy-to-use solution that scales to production workloads and meets the needs of our customers looking to adopt cutting-edge technology. As a senior member of the team, you will be responsible for ensuring sound software architecture and enforcing best practices in software quality.What you'll doCollaborate proactively with a distributed teamWrite high quality code to create new featuresDebug issues and produce high quality code to fix themReview code produced by other engineersEngage with the community to share best practicesEncourage and shepherd high quality code into the frameworkDiscuss ideas and collaborate on finding good solutionsWork from home with global travel 2 to 4 weeks for internal and external eventsWho you areYou love technology and working with brilliant peopleYou are curious, flexible, articulate, and accountableYou value soft skills and are passionate, enterprising, thoughtful, and self-motivatedYou have a Bachelor's or equivalent in Computer Science, STEM or similar degreeYou have a history of writing modern, maintainable PythonYou have interest and experience with two or more of the following: Ubuntu Linux - kernel or userspace, Kubernetes, OpenStack, Ceph, AI/ML, QEMU/KVM, LXC/LXD, Python, Go, C, Postgresql, Mongo, Debian packaging, scalable web servicesCanonical is proud to foster a workplace free from discrimination. We truly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better platform for our users and customers. This is something we value deeply and we encourage everyone to come be a part of the world of Ubuntu."}