{"title":"Field Service Representative (New York, NY) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJwC5hf3p3S9JI0SzGfsZ6E9CqOLpSpgpRKnuhUml0hhBE_roCbq2W_xKK6Q7XN5MjJpJjeJDfkV4O0r3Z6W64M1VAYPKjMKJ_gAJj3TS_udGZTdu7GAa5SAdXgIS4dglaCvqb8uuHZZspqC1qsR0GQ-uAZioZXhBkiIYxaRHXT9e2odf01eC3SMsMq-HQk","source":"ziprecruiter","full_description":"Company Description Checkpoint Systems, a division of CCL Industries, is a global leader in merchandise availability solutions for B2B and B2C retailers, encompassing loss prevention, merchandise visibility and IoT product ecosystems that work in concert to drive profitability and enhance the customer experience. Checkpoint Systems provides end-to-end solutions enabling retailers to achieve accurate real-time inventory, accelerate the replenishment cycle, prevent out-of-stocks and reduce theft, thus improving merchandise availability and the shopper's experience. Our intelligent retail solutions are built upon 50 years of radio frequency technology expertise, innovative high-theft and loss-prevention solutions, market-leading RFID hardware, software, cloud-based SaaS, and customizable labeling and EAS antennas capabilities, to brand, secure and track merchandise from source to shelf.  Our customers include many of today's top brick and click retailers, offering an array of customizable solutions for Drug, Supermarket, Apparel, Electronics, General Merchandise and Big Box stores.  Global headquarters is located in Thorofare, NJ, and features a state-of-the-art Customer Experience Center, showcasing Intelligent Retail Store solutions.Checkpoint Systems operates in every major geographic market and employs over 4,000 people worldwide. We offer a competitive compensation package and comprehensive benefits package that includes life, health, dental and vision, 401(k), flexible spending accounts and tuition reimbursement. We care about our people as they are the key to our success. We also provide an open and friendly work environment where we empower people with opportunities to collaborate with global teams, launch innovative products, and grow professionally with a dynamic organization.  EEO AAP Employer/Vet/Disabled Drug Free Workplace Job Description Position SummaryThe Field Service Representative is responsible for installing and repairing all Checkpoint ID systems, training customers on the use of systems, and completing on-site surveys as required.Job ResponsibilitiesInstalls and maintains Checkpoint's products and systems.Maintains accurate parts inventory.Maintains daily requirements for documentation, SAP system updates and timely communications.Practices safety procedures and incorporates safety standards into all activities.Trains customers on the use of systems.Works with internal services department to ensure service and installation standards and responsiveness are met.Interfaces with customers to resolve installation and service issues.Provides site surveys, photos and related documentation for sales/services as required.Interfaces with other departments to maximize efficiencies, effectiveness and profitability throughout the installation and service process.Works with other field resources and internal departments to meet established goals and objectives while maintaining profitability within the North American Services Organization.Other duties as assigned by manager Qualifications Education2 year AA degree or BSET in electronics, equivalent military training or industry experience.ExperienceExperience with electronic test equipment and digital metersHands-on experience EASHands on experience with RFID a plusKnowledge, Skills, & AbilitiesNetwork Certification a plus.Valid driver's license in current state of residence.Ability to read and understand blueprints and technical documentation.Understanding of customer requirements.Computer proficiency (Word, Excel, e-mail).Strong verbal and written communication skills.Attention to detail and proven ability to produce quality work.Ability to work independently and in a team environment.Ability to communicate technical issues and corrective actions to customers.Strong problem solving and customer service skillsAbility to lift at least 60 lbs and 25 lbs overhead.Ability to operate a circular saw to cut floors for wire routing.Ability to work on lifts, ladders and new and existing construction sites.Ability to travel for service or installation projects (10 - 20%).A standard work schedule will be set, although some jobs may require an earlier/later shift in schedule and/or may require overnight stays Additional Information All your information will be kept confidential according to EEO guidelines.Qualifications: Education 2 year AA degree or BSET in electronics, equivalent military training or industry experience. Experience Experience with electronic test equipment and digital meters Hands-on experience EAS Hands on experience with RFID a plus Knowledge, Skills, & Abilities Network Certification a plus. Valid driver's license in current state of residence. Ability to read and understand blueprints and technical documentation. Understanding of customer requirements. Computer proficiency (Word, Excel, e-mail). Strong verbal and written communication skills. Attention to detail and proven ability to produce quality work. Ability to work independently and in a team environment. Ability to communicate technical issues and corrective actions to customers. Strong problem solving and customer service skills Ability to lift at least 60 lbs and 25 lbs overhead. Ability to operate a circular saw to cut floors for wire routing. Ability to work on lifts, ladders and new and existing construction sites. Ability to travel for service or installation projects (10 - 20%). A standard work schedule will be set, although some jobs may require an earlier/later shift in schedule and/or may require overnight staysResponsibilities: Position Summary The Field Service Representative is responsible for installing and repairing all Checkpoint ID systems, training customers on the use of systems, and completing on-site surveys as required. Job Responsibilities Installs and maintains Checkpoint's products and systems. Maintains accurate parts inventory. Maintains daily requirements for documentation, SAP system updates and timely communications. Practices safety procedures and incorporates safety standards into all activities. Trains customers on the use of systems. Works with internal services department to ensure service and installation standards and responsiveness are met. Interfaces with customers to resolve installation and service issues. Provides site surveys, photos and related documentation for sales/services as required. Interfaces with other departments to maximize efficiencies, effectiveness and profitability throughout the installation and service process. Works with other field resources and internal departments to meet established goals and objectives while maintaining profitability within the North American Services Organization. Other duties as assigned by manager"}