{"title":"CIO - Systems Engineer NEW!","location":"","salary":"","description":"","term":"$60.71 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAL4-PKpF3rTnZNmdv3ZYuvzJU63By3bid1LIXURQ94AC9GvG0Q6SNBq2P9SXR5NtRQRD3OsSXtVBNWWhi9mSdf0aEKjyihD9DmbfiBvInyoTD3CgUzndnPjHFyxEA_NdLai-fQPBOccmZOjzIF4WjVGPVKGfA00MVfTlNEOFSIGTen88gmWeeiRDxDfrw","source":"ziprecruiter","full_description":"Description:Responsible for the design and development of medium to highly complex systems. Skills include system design and analysis as well as business skills. Works with data and project managers to understand systems and consults with customers to understand needs. Developments and implements new systems, corrects software errors in existing systems, and works to improve performance through hardware upgrades. Manages computer systems in a business environment and responsible for resolving technical issues. Knowledgeable in programming, data structures, computer systems, and software engineering. Bachelor's degree in computer science, software engineering, or other related field. Ability to manage multiple assignments. Superior written and oral communication skills. 6-10+ years of experience.JOB DUTIES:Develop / Unit test / Deploy software for enterprise customer service profile inventory system. Help debug issues in various environments as needed. Coordinate with offshore development team to develop modules .MUST HAVE SKILLS:-5+ years of software development experience in an enterprise software product.-Experience with Java, PL/SQL-Experience with writing complex SQL queries-Thorough knowledge of REST, including good API design and versioning.-Good understanding of fault tolerance, multi-tenancy.-Experience in developing scalable data services, preferably mission critical databases and performance tuning.DESIRED SKILLS:-Good understanding of unix/linux commands-Good in writing View, Stored Procedures and performance tuning in DBEDUCATION/CERTIFICATIONS:Bachelors in Computer Science or related fields"}