{"title":"ASIC RF Hardware Design Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALW_uO9U9oIvngEbPDkgfL1oAIUkd-xTBgbwM2_B8Ks-uywYmoPp0-Ln9kPOFOxbZIxFGTaHccLKz2NDAGRmymzcyvJcpYN_QkClGG8-9Fd8vYZBe03fzLLd63oIXX4eLp_ozx-hiC6-3afx9nWdtK0bCVJ1t-MXAX-k2X8KoakYya1WA6SaE1-0DH9THom","source":"ziprecruiter","full_description":"Be on the forefront of a new ground-breaking technology: Cota Real Wireless Power. Spearheaded by a team of highly experienced business leaders and engineers, Ossia offers a once-in-a-lifetime opportunity to take one of the most highly anticipated technologies of our time to market. Countless devices across the globe will one day have wireless power, instead of batteries or wires. You will be on the leading edge creating the system for new and clean technology that enables IoT. Our employees are the key to our success, and we are fortunate to have found some of the best and the brightest. There is not a more inspiring team to work with and no better time than now!  The Role: As an ASIC RF Hardware Design Engineer at Ossia, you will be responsible for working with our ASIC design partners to design, model, simulate and test ICs for next generation wireless power systems. This hands-on role requires broad knowledge of several areas in RF hardware design engineering including: requirements definition, system modeling and performance simulation, and IC system performance bench-marking. This highly technical position requires solid experience in a relevant field as well as strong communication and organizational skills. Responsibilities include:Gather requirements, develop architecture and lead development of the next generation IC designs of wireless power software and hardware, guiding ASIC design partners. Work with cross-functional engineering teams on systems, hardware and software enabling on requirements, specifications and test plans.Develop IC architecture block diagrams and interface definitions, create technical documentation including IC specifications, theory of operation, and test requirements.Design and document IC functions, including compliance with interoperability specifications (standards).Fully understand IC cost drivers, scalability, reliability, testability, and power delivery efficiency trade-offs.Define, simulate, and model various key IC performance parameters.Assist in the integration and test of ICs into the final production systems.Lead and mentor other engineers and establish industry best practices in the IC team's design processes.Act as a technical focal point on ASICs for customers. Minimum Requirements:Expert in design of RF ASIC, IC architectures, process nodes, fabrication steps, design for low cost, manufacturability and high reliability. Can solve complex problems while displaying technical creativity.Proven track record of taking one or more new ASICs (ideally for consumer electronics products) from initial concept, to prototype, and full-scale production.Proven ability to quickly learn new technologies and collaborate with partners to deliver outstanding results.Excellent communication skills.Experience working on cross-functional product design teams.At least 5 years relevant experience, including RF IC design. Should have hands-on experience in initial IC bring-up and debugging, functional verification, and manufacturing support.  Education:BS/MS (preferred) in one or more relevant engineering disciplines (Electrical Engineering and/or Computer Engineering)."}