{"title":"Chemist - 3rd Shift","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK-rGEEqq73RMPEFMBJhizwCHZ-Hu4m9TxmuHVfZpbVITjELc50SbhMUoUWzNOrxozt1q8zFhnugtvPPVOFyYziWrpErpAghntDyArs_KDTweMez-a2wOpZK9RUvOqIvWGOltz1ssXw87EWc-Mb-jIkSzMKScAit-wB8MSLTmZIwky4lqeCqJ1_QBmvWTDk","source":"ziprecruiter","full_description":"Tradebe is an international leader in waste reclamation and recycling solutions managing more than two million tons of waste annually, recycling 60% of that waste. Providing environmental services since 1984 through the treatment, recovery and recycling of waste, we also serve various markets including industrial, manufacturing, petrochemical, pharmaceutical, oil & gas and more. Tradebe is committed to the waste hierarchy with our efforts focusing on Reducing, Recycling & Recovering the waste we manage. We are the waste management leader in Europe, the United States; and one of the largest global companies in the environmental sector by managing 85 fixed plants in Europe, (Spain, UK and France), the United States and Oman; with over 2,100 employees worldwide.Essential Duties and Responsibilities:Entry level wet chemistry laboratory dutiespH, moisture, oxidation, titrationDaily Processing of waste samples to include but not limited to:Fuel compatibility, bomb calorimetry, GC analysis, metals analysis Daily equipment calibrationCalorimeter, pH meter, GC-MS, GC-FIDAdditional laboratory support in the areas of standards preparation, record keeping and other general laboratory dutiesRequirements:Candidate must be willing to work in an industrial setting with limited outside exposure and be willing to handle hazardous and non-hazardous wastes with appropriate PPE.  A successful candidate will have minimum of High school diploma with strong scientific background.  College courses or degree preferred in a science related field.  Strong candidates will possess a great work ethic with the ability to work alone as well as in a group.  Why Tradebe is Right for YouCompetitive pay and benefitsStudent loan repayment assistanceGenerous vacation and sick plansMedical (including telehealth), dental and vision401k Retirement Flexible spending accounts (FSA)Health savings accounts (HSA)Agency paid, basic life and AD&D insuranceSupplemental, voluntary life insurance & AD&DAgency paid, short & long term disabilityEmployee Assistance Program (EAP)Career ladders, professional development, and promotion opportunitiesLeadership opportunitiesGreat work environment and cultureAnd MORE! EOE/M/F/Veterans/DisabledEmployment Type: FULL_TIME"}