{"title":"Full Stack Automation Anywhere Developer (Remote) NEW!","location":"","salary":"","description":"","term":"$120,000 to $125,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIH27G8VS8NM4sVs85dYsFLUFupzOxyT8PMrcJlOgFNBn47TNwv9isFaMN9gAStnB51N-ikwbg_ej_JsslkeM2mMqkjHfaa30QzCHyA_R5C5PQgV5ux7MM2gPzlJ0lYEwgUobMRgSm9jzPZoab5-kwZk21o1oADqyH5pUzC0cgaL3pTqPcBhxpvURUtdPa1","source":"ziprecruiter","full_description":"Remote Project1-year contract to hireFull Stack Application Developer –Automation AnywhereKey here is the 2nd item is the automation anywhere- this is the software package that they use for unattended BOTS, i.e- build small automaton out of websites using this package product- own programming language. Someone knows this environment/language and exp. Writing stand-alone apps in this language but integrating these into a bigger applicationLooking for US Citizens/GC HoldersResponsibilitiesPerform software coding tasks to support web UI using Angular 6 or later and C# API development (SOAP/REST, Web API)Integrate Automation Anywhere Enterprise (AAE) unattended RPA BOTS with custom C# and JavaScript applicationsSolve complex issues and challenges faced by teams adopting new and modern technologiesWorking collaboratively, a team player, able to communicate effectively, and commitment to be part of a successful teamBasic QualificationsBachelor's degree or equivalent work experienceAt least 3 years’ experience with developing and integrating AAE BOTS with custom applications. We will consider exceptionally qualified candidates with less experience.Required QualificationsProficiency in the following languages/platforms such as C#, SQL Server, .NET or .NET Core, Node.JS, Angular 6 or later, or TypeScript, as well as AAE.Required Skills:Design and development of applications in C#Recent hands-on experience with Web APIExpertise in writing, debugging and integrating AAE RPA solutions with custom applicationsEntity Framework experience including database-first and code-first3+ years of experience with the .Net platformGenerics, Linq, Linq Expressions, TPLJSONSQL Query writing skills: views, stored procedures, triggers, JSONDesired Skills:JavaScript and Angular frameworkWPF, Windows Services, Microservices experience is a plusAgile/SCRUM development process experience is a plusGit or similar source control providerEntity Framework or other ORM experience including database-first and code-firstHigh Volume Data Processing OptimizationData Modeling"}