{"title":"Production Analytical Chemist, 2nd Shift","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AAJ79ppCtex9Mv5SOnJy_OnFme0ST2htBx-ChFgV0HdMPyZ42osmSsjAg7O0dR7m-2kUGrWLv6uBfUBgL2ZbHZPBEW7yyU16UQw4fSuNEWU9qp9L-qoVNgSb62ofm2ajK-X8LK0qkNBW-oR58VHjkCpm8DGqNouEKDrIUJ2jUkfTSmOIeWiv3CVaApaeAQo","source":"ziprecruiter","full_description":"Company Overview and Values Why work at Entegris?Lead. Inspire. Innovate. Define Your Future.Not everyone who works for a global company shares the same background, experiences and perspectives. We leverage the differences of our employees to bring new ideas to the table. Every employee throughout the company is encouraged to share input on projects and initiatives. Our decision making process is truly a collaborative effort as we realize there are leaders at every level of the organization. We put our values at the core of how we operate as an organization - not just when it's convenient, but in a lasting and meaningful way. We want the time and energy you spend here to have a positive impact on your life inside and outside of the office.Entegris is a values-driven culture and our employees rally around our core PACE values: People AccountabilityCreativity Excellence The Role Come help design, deliver, and optimize the products that help produce some of the most important semiconductor devices in the world.   Be a part of a team and organization that is pushing the boundaries of chemical manufacturing and analytical chemistry! Entegris is seeking an 2nd shift Production Analytical Chemist with general knowledge of analytical chemistry and techniques applied to the characterization of complex mixtures. This knowledge is required to develop analytical methods, provide support to the Manufacturing, Engineering, and Quality groups via QC analysis.  This opportunity allows the right person to expand their technical skill set and participate on a dynamic team in a growing organization. The ideal candidate will be results oriented and an excellent team player, with solid knowledge of chemistry, materials science & physics, and familiarity with semiconductor device materials, structures, and metrology. In this role you will Conduct analysis as defined by existing work instructions on raw materials and finished goods to ensure QCDrive for continuous improvement of existing testing methodsPerform material characterizations using analytical instrumentsUse proper controls for analytical instrumentation, validates and verifies data and takes corrective action when necessaryMaintain instrumentation and performs procedures for product testing purposesTest and analyze R&D samples, manufactured materials, and in-process samples when neededWork on cross-functional teams as the analytical subject matter expert Traits we believe make a strong candidate Bachelor of Science in chemistry, physics or engineering required1- 2 years of related experience or training preferredGeneral lab instrument (HPLC, IC, GC, ICP-MS, ICP-OES) operations and maintenance experience preferred; ICP-MS strongly preferredBasic computer knowledge, including MS Office required; LIMS experience preferredKnowledge of proper safe handling/disposal of chemicals and ability to maintain a clean and safe workspace Strong independent operation skills and ability to complete lab work safely Your success will be measured by Testing and analyzing R&D samples, manufactured materials, and in-process samples when needed and in a timely mannerEnabling quality initiatives as they relate to the customer, corporate objectives, quality planning, the quality policy, process improvement and new business goals and objectives; communicating with customers, suppliers and other resources in order to achieve these objectivesUsing proper controls for analytical instrumentation, validating and verifying data and taking corrective action when necessary Conferring with process engineers, development scientists, and manufacturing personnel regarding results and research, preparing technical reports and presentations to promote learningProven ability to work in a cross-cultural and cross-language team environmentAbility to learn and become proficient at several analytical techniques What we offer: Our total rewards package goes above and beyond just a paycheck. Whether you're looking to build your career, improve your health, or protect your wealth, we offer generous benefits to help you achieve your goals.Very Competitive total compensation plans.A 401(K) plan to help you plan for your future with an impressive employer match that's all yours- no vesting!Great health, dental and vision insurance packages to fit your needs to ensure you're happy and healthy.A progressive PTO policy that empowers our employees to take the time they need to recharge!At Entegris we are committed to providing equal opportunity to all employees and applicants. Our policy is to recruit, hire, train, and reward employees for their individual abilities, achievements and experience without regard to race, color, religion, sexual orientation, age, national origin, disability, marital or military status.#LI-JL1ENT789"}