{"title":"Senior - iOS Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJZ_jH2gH2NnCsON8RPMxrHvcYgnehLVH0jJFisEABVKeUu2gGgLx9PUDEsIHA6GiT92YggMFnZfvHMmkQQURTHezjkdf5362zSDgQN-s8bUxDbtWU1S1QWbhSSUTr3qvYEGBim3fDJU9RqwVGEAXTqWehhEISBFkYTFiUcWIUyD_aSImF9QtQVJwABMbjw","source":"ziprecruiter","full_description":"Job Description:Mandatory Certificate: Java/IOS5-7 years in an Apps Development role. String Experience with Java, IOS Web Development,.Demonstrated execution capabilities in tech stack and application development using multiple development platforms : e.g. iOS: Swift, Xcode, MVC Architecture, and Android, web/Angular, servicesStrong analytical and quantitative skills; Data driven and results-orientedExperience in running high traffic, distributed, cloud based servicesSkilled at working with third party service providersExcellent written and oral communication skillsAddress a variety of responses to problems, questions, or situations by applying established criteria to directly influence development outcomes. In doing so, use the right technology to solve technical challenges required to deliver small scale features and functions and / or supporting aspects of a larger program efforts.Responsible for applications systems analysis and programming and accountable for development, design, construction, testing and implementation and write secure, stable, testable and maintainable code.Expected to operate with autonomy, while some oversight and direction may be required.Engage in digital applications development, risk technology, Middleware, Mainframe applications, Non Mainframe applications, Analytic Model Development and Application support activities to meet specific business needs of user areas and to test systems to ensure integrity of deliverables.Expected to provide sound understanding of application development concepts and principles and a basic knowledge of concepts and principles in other technology areas.Consult with users, clients and other technology groups on issues and recommend programming solutions for customer exposed systems.Verbal and written communication is clear and concise.Clearly articulate development and timeline dependencies.Have good working relationships with team members, manager, and peers.Ensure self and peers are actively seeking ways to objectively measure productivity. (i.e., SonarQube Findbugs). This will include a focus on automating code quality, code performance, unit testing, and build processing in the CI/CD pipeline (RTC, Jenkins, RLM)What's in it for you?Excellent benefits plan: medical, dental, vision, life, FSA, & PTORoll over vacation daysCommuter benefitsExcellent growth and advancement opportunitiesCertification reimbursementRewards and recognition programsInnovative and collaborative company culture \"LTI values diversity and inclusion and is committed to the principles of Equal Employment Opportunity EOE/Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity.\""}