{"title":"Electrical Engineer BS Degree (957124) NEW!","location":"","salary":"","description":"","term":"$75 to $80 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKV_H7okZ98eP6Jj07ixMmKKNbFldUlXXI6FGuApZ6qzNs0sSGA9KClheNK7ctrwAB2NXPYGtUbnobRfOnqBH-HCnOfao35_Cn8bjMJG4OFbblkgW0MxU81dn-ETaO83o86adsOMmr9fg_2Btn1Wx31N-HocHWKDxT2QH_RFKhzyoZmHORecO97S9BSG4E_","source":"ziprecruiter","full_description":"We are looking for an Electrical Engineer with Construction Management experience to join our team at TOYOTA in Ann Arbor, MIDescription:RM Notes:-3 must have skills - Powerpoint, Excel and MS Projects.Will be working on multiple projects.25 - 50% travel - Domestic travel only.Overtime is expected but not muchFacilitate electrical building system startups & commissioning activities.Provide subject matter expert assistance in review of product and equipment submittals, shop drawings, engineering design drawings and specifications, & contractor generated RFIs.Extensive knowledge of safety procedures, safe work practices, and OSHA requirements for electrical installations including but not limited to Lock-Out, Electrical Safe Work Practices, Control of Hazardous Energy, & arc flash safety.Possess extensive knowledge of prevailing building codes and professional industry standards (including but not limited to: IBC, NEC, NESC, NFPA, ASME, AMCA, ARI, AWS, ASHRAE, FM).Work with building construction contractors and equipment vendors to coordinate equipment factory testing, delivery, installation, commissioning & handover to end users.Conduct work progress inspections on a continuous basis.Support construction administration activities related to schedule coordination, quality confirmations, weekly coordination meetings, and planned utility outages.Conduct inspections and observations of electrical building systems for compliance with project specifications, quality standards, & applicable codes.Oversee work of electrical contractors for adherence to project delivery methods, schedule milestone targets, & coordination with other groups.Prepare field engineering status reports of work progress and schedule to Project Managers.Provide input and feedback to improve project technical specifications and standards.Ability to effectively communicate technical matters in written & verbal formats.Ability to multi-task, manage time, & prioritize project commitments based on established deadlines and project milestones.Requirements:2+ years in construction management.Experience in design criteria development for electrical systems. Automotive experience with engine, transmission, or vehicle facilities or similar industrial manufacturer. 5+ years in electrical design field. Good organizational skills, communication skills, schedule management skills.Proficient with Microsoft Excel, Word, PowerPoint, Outlook, Project"}