{"title":"Field Service Repair Technician - Long Island, NY ($2,500.00 Sign-on Bonus) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALlghpsZKydeOMDwEkydb6aIGLPX5w9DzBNsgEbEqniljMyH6CqLCDRZ9g6vLcvYDO8Y4HDt-x451zfs6uEk78gs8ptFRpg8-IxrIQ0nf3Crqs2c4Ofzd_G2IAxnoaggYWY4a_o3tjOTPBYWqGgCg-CYZXQtJCHC7EnNTWnMXLGAHhb91ut-EHgXL_PXti9","source":"ziprecruiter","full_description":"Up to $52,600.00/year $2,500 Sign on Bonus after 90 Days of Employment Company Provided Van Annual Company Bonus (Up to 5%)Hours: Must be flexible to anywhere between Monday - Friday 8:00 a.m. - 5:00 p.m. with OT as needed. Forward Stocking Location: Long Island, NY OverviewThis is the perfect role for any service repairman ready to grow their repair skills with provided training and support! Our Service Technicians are the face of Asurion and heroes to our customers with broken TVs and appliances! While we love technology, we love people more! The Service Repair Technician makes consumer TV and appliance repair easy and convenient for our customers. Our Service Repair Technicians travel in a fully-equipped Mobile Repair Unit (Van) and provide on-site diagnosis and repair. Our Technicians upsell our customers on additional Asurion products to allow our customers to stay connected with our products and services.  This is a full time position. Repair technicians must be available to work 7 days a week, from 7am - 9pm. Shifts will vary within that time frame. What You Will Do Traves to meet with customer in their homes or places of business. Meet key performance metrics.Confer with customers to determine the nature of problems or to explain repairs. Meet or exceed key performance indicator metrics for performance and sales goalsProvide repair and replacement estimates to customers. Masterfully repairs TVs & appliances. Disassemble equipment and repair defective components using hand tools. Maintain truck stock inventory within the prescribed company guidelines and standards.Ensure that all repairs meet or exceed quality standards.Complete all required technician training and proactively seek to remain a knowledgeable expert in the repair industry. Comfortable with travel to and from the Stocking Location (up to 60 miles) and several customers' locations throughout a designated region.Drive company vehicle safely and responsibly to and from customer locations in a variety of situations including heavy traffic and inclement weather.Duties, responsibilities, and activities may change at any time with or without notice.  If you're a good fit for the job, you'll be able to: Willing to train and receive proper certifications to effectively troubleshoot and repair technology.Offer customers a value-added experience with premier customer service through relationship and rapport building.Quickly identify and resolve technical issues.Demonstrate empathy and assurance for the customer throughout the in-person session.Utilize tools and resources to solve technical problems in a fast-paced environment. Ability to proactively adapt communication to the customers' technical skill level.  QualificationsPrior experience in service repair.High school diploma required.Must have a valid driver's license and satisfactory driving record with at least 1 year of driving experience. Able to drive your own vehicle to and from the Forward Stocking Location up to 60 miles.Able to sit or stand for long periods of time (up to 2 hours).  Able to interact with a customer's technology throughout their home. Able to interact face-to-face with Customers in their homes for extended periods of time.Able to lift a minimum of 30 pounds. Comfortable with exposure to dogs, cats and other pets that may be present in the customers' homes.  We Take Care of YouCompetitive and incentive-based pay (Up to 5% Annual Bonus)Advanced training to grow your repair skills specific to appliance repair Benefits including health, dental, and visionRetirement Savings Plan (401k with employer match)Paid time off and paid holidaysTuition reimbursement programTechline support for advanced troubleshooting care Find out more about what it's like to work here: Working at Asurion"}