{"title":"Engineering Technical Recuiter & Sourcer for Talent Acquisition NEW!","location":"","salary":"","description":"","term":"$48,000 to $64,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKoVMUIow2YUQud6lvrsTg45OD1b7XvFcBvbHbLVLd0B-EN5oVX1YzFK4HFL5lK08HCxpbivmvmrO_sedUF3oel49h2PZMR_lKjE1AN9tvItJ4Fciemn0jR0CU-wqVO8XKJwXsZ5hpX2vllkJB-RcKtbTWQJYS9YRPMDqi4mpAf_SyEpihNBI9oDsVB0zWW","source":"ziprecruiter","full_description":"By joining our Talent Acquisition team, you will have the opportunity to partner with our Recruiters to provide highly valuable strategic sourcing. Our openings include Engineering, Supply Chain, Manufacturing, IT, and more!What you'll do:· Provide recruiting assistance to the Talent Acquisition Department with responsibility for exempt and non-exempt personnel requirements.· Partner with hiring managers to understand job requirements, then create and execute a strategic sourcing plan to fill staffing requirements in a timely manner.· Understand and evaluate candidate qualifications for job fit and level, and per OFCCP regulations.· Utilize our company branding and benefits to attract and connect with candidates.· Utilize a variety of sourcing strategies to pipeline a diverse pool of candidates for each job opportunity, including a variety of electronic media and social networking.· May represent the company at local and national career fairs including college, military, diversity and clearance events.· Effectively utilize the hiring processes, understand behavioral-based interviewing, and ensure appropriate audit trail.· Maintain a regular and predictable work schedule.· Establish and maintain effective working relationships within the department, the Strategic Business Units, Strategic Support Units and the Company. Interact appropriately with others in order to maintain a positive and productive work environment.· Perform other duties as necessary.This is a six-month, temporary full-time contract position with the possibility of conversion to a Permanent position.What you'll need:· BS/BA degree in a related field.· Each higher-level degree, i.e. Master’s Degree or Ph.D., may substitute for two years of experience. Two years of related experience may be substituted for each year of education. Degree must be from a university, college, or school which is accredited by an agency recognized by the US Secretary of Education, US Department of Education.· Prior recruiting experience within a DoD or technical organization preferred.· Interpersonal and customer service skills.· A sense of urgency to fill the job positions with the qualified candidates.· Ability and willingness to learn applicable laws, regulations and procedures, and to maintain confidentiality.· Good computer skills and experience utilizing resume databases.· Sourcing and networking skills to develop a broad, diverse pool of qualified candidates for a variety of positions.· Detail-oriented approach with the ability to follow documented processes.Working Conditions:· Work is performed in an office environment.US CITIZENSHIP REQUIREDWhat are the nice-to-have skills?Prior recruiting experience within a technical organization and DoD experience preferred. (This will be a differentiator when reviewing candidates.) Experience sourcing and/or recruiting engineers (such as electrical, systems, mechanical, software, RF) and technicians. We are NOT looking for someone who has only recruited in the IT industry.Location: Westminster, CO"}