{"title":"Technical Writer 5-12yrs Exp","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJI7eTH6U9xBCgEDFQqAmIl3PKrdEFb3YixU2X3lnM_pqhnCiqSCpEA2w2XG6CxUzyBFbvuxkQMds3Ematpr3o77eXhukh3UbfN-c6wyXExRnBJI_61--GQtsiLTeuVKI7kbMyfsMz0hpYsH7NSK5xVC-uaIGMElsTt-8koPVm13_6pP7nvPiMOxcbVxnb7","source":"ziprecruiter","full_description":"Who You Are Do emerging trends like Augmented Reality, interactive videos, and customized content delivery pique your interest? If your answer is \"Yes,\" we'd like to talk to you! The MIG Technical Communication team at Cisco is looking for self-motivated and ingenious technical writers (2-6 years of experience) to join us in our journey to redefine the content experience for our customers. Who You'll Work With The MIG Technical Communication Group develops content for Cisco's advanced routing, network automation, and optical transport systems. We believe in delivering the very best product experiences for our customers, and thrive on providing cutting-edge, user-centric content that complements Cisco's diverse range of networking products and IT solutions. What You'll Do The global initiatives we're driving to transform the customer experience present a host of exciting opportunities for technical communication professionals. As a technical communicator at Cisco, you will: Use superior writing skills and extraordinary attention to detail to conceptualize, plan, develop, and write high-quality documentation. Drive innovation and experiment with new-age content formats, information architecture, and rich media. Identify opportunities to improve quality, usability, and productivity.  Gain an in-depth understanding of customer asks through internal/external connects to pilot innovative content development and delivery methods What You Need Active listening Critical thinking Ability to apply new information Superior written expression Why Cisco We connect everything; people, processes, data, and things. We innovate everywhere, taking bold risks to shape the technologies that give us smart cities, connected cars, and handheld hospitals. And we do it in style with unique personalities who aren't afraid to change the way the world works, lives, plays, and learns. We are thought leaders, tech geeks, pop culture aficionados, and we even have a few purple haired rock stars. We celebrate the creativity and diversity that fuels our innovation. We are dreamers and we are doers."}