{"title":"Lead Full Stack Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKOPixj2bGdNsKb3v-WvJO_blUQoXFRCp9J4Paz9X-IY9T5NnVRViauT_FXIcYIKKvfFl0ik8bQ5RSHOJjsgjb_KCF_sNwWLQmBRtmlGRTzry7szG1I-Oc-Md8UZ6bGseL0F5jp2aElWYUPSafuofEhhl9fa_85hJnIaIJPzKX9l42iJu2N3U6r8_ToNrOH","source":"ziprecruiter","full_description":"Lead Full Stack Developer Title: Lead Full Stack Developer - Node.js / JavaScriptLocation: Lenexa, KSBased out of Kansas City, MO, we provide both software and hardware solutions to the agriculture industry both locally and afar. Leveraging our innovative technology, we take pride in providing the most advanced data management solutions and products to ensure farmers always are in the know when it comes to everything about their product. The ideal candidate will have a passion for making a difference, is a quick learner, and BONUS if you have an understanding of API design. Should this sound like you please apply today, as we are actively interviewing to grow our team!What You Will Be Doing- Build front-end features using React.js and Typescript- Build microservice API's using GraphQL, node.js, and Typescript- Build ETL (Extract, Transform, Load) processing pipelines using node.js and Typescript- Maintain, deprecate, add features to some of our legacy systems (PHP)- Ensure our entire stack is designed and built for speed and scalability- Completing a project from conception to finished product- Work alongside our UX designers to implement features and improvementsWhat You Need for this PositionOur stack:- React / Ember.js- Node.js Graphql- AWS (IoT, SQS, RDS, etc.)- Kubernetes / Docker-Gitlab (CI/CD)-LinuxYou should want to work on:- Node.js- JQuery- Vanilla JSSo, if you are a Lead Full Stack Developer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}