{"title":"Associate SW Applications Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIIq3MPRlrU_7wx1xF9re9OTgh8i_94JGflaUXZ3ZsCc0WVDiHcBYcy2-ceAsHLdzhY4QAp46COk0OarXk3vHbLJJhkjh5vjK_fzWu0kyhKqaVicre8jDLRIkosGE28IzdDje8_rnGfJmCM7TykS_WFxV8922VnZQSVy1ucdK2j5VMKXKKyPOT_HbcqxK4","source":"ziprecruiter","full_description":"There has never been a better time to join Extreme, after three acquisitions extending our portfolio and go to market strategy, we have seen enormous opportunity and growth within the regions. Aside from being a Technology Leader in the Gartner Magic Quadrant, we also adamantly promote an internal culture that truly embraces diversity, inclusion and equality in the workplace. Having Diversity and Inclusion as part of our core values and beliefs, we're proud to foster an environment where every Extreme employee can thrive because of their differences, not despite them.Extreme Networks is searching for Associate SW Application Engineer to help develop Extreme Cloud IQ (XIQ) Network Management solution.Extreme Cloud IQ is an industry-leading and visionary approach to cloud managed networking, built from the ground up to takefull advantage of Extreme's end-to-end networking solutions.  Using innovative machine learning and artificial intelligence technologies,ExtremeCloud IQ Manages, analyzes and interprets millions of network devices, user data points from the network edge to the data center,to power actionable business & IT insights, and deliver new levels of network automation and intelligence.As a member of the team, you will have the opportunity to contribute across the XIQ product stack, ranging from cloud-based microservices to on-premises virtual appliances.What You Will DoYou will be part of an high-performing agile scrum team that designs, implements, and tests new features and functionality Extreme Cloud IQ. Development will include innovative technologies in the fields of NMS Cloud Management, Cluster, Security, Machine Learning. You will take new features from concept to delivery, working closely with team members and cross-functional partners to design and develop high-quality solutions that take into consideration scalability, availability, and performance. You will also actively participate in design and code reviews for the team.Who You Are Qualifications:Solid computer science fundamentals (data structures, algorithms, etc.)Strong knowledge in Object Oriented JavaScript programmingHands on Programming experience in HTML, CSS, JavaScript (Dojo, AngularJS, JSON, XML, REST, Bootstrap, LESS)Hands on programming experience in Java, REST APIs, Spring Framework XML, REST, JSONProficient at writing efficient and reusable UI codeExperience with HTML5, Responsive design and AjaxStrong understanding of web standards and cross-browser compatibilityExcellent written and verbal communication skillsOther Desired QualificationsFamiliarity with Artificial Intelligence / Machine Learning as it relates to networkingFamiliarity with service-oriented architecture and distributed computingYou Will Be a Great Fit If You AreA quick learner with excellent communication skillsTenacious in your approach to problem solvingHighly productive with minimal supervisionEager to learn about and adopt the latest technologies and best practices in your fieldEducationBachelor's degree in Computer Science or equivalent field*Position is located at our San Jose, CA office. Qualified local candidates are encouraged to apply. Extreme Networks, Inc. (EXTR) creates effortless networking experiences that enable all of us to advance. We push the boundaries of technology leveraging the powers of machine learning, artificial intelligence, analytics, and automation. Over 50,000 customers globally trust our end-to-end, cloud-driven networking solutions and rely on our top-rated services and support to accelerate their digital transformation efforts and deliver progress like never before. For more information, visit Extreme's website or follow us on Twitter, LinkedIn, and Facebook.We encourage people from underrepresented groups to apply. Come Advance with us! In keeping with our values, no employee or applicant will face discrimination/harassment based on: race, color, ancestry, national origin, religion, age, gender, marital domestic partner status, sexual orientation, gender identity, disability status, or veteran status. Above and beyond discrimination/harassment based on \"protected categories,\" Extreme Networks also strives to prevent other, subtler forms of inappropriate behavior (e.g., stereotyping) from ever gaining a foothold in our organization. Whether blatant or hidden, barriers to success have no place at Extreme Networks."}