{"title":"Shop Foreman","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIEkoJbZSYUzwBC3sAWhc_vsgpjAEtaoQIaWA9LrJDwrd-o2QgOqE3YRwn8x8hu7d9kH9Hb_u-vQ_ooG-Hmfb7ps6Ve0JZ8DUS2h-zWj4YDvIcJA4230YcIj1b1KXS74CULYhTztwO6kzZD1fikKR2cDifWXTDTRlqBFtqhXQiKm76gE0xfXsl5D6nIW-KZ","source":"ziprecruiter","full_description":"Shop ForemanBoulder, COAbout Clean ChemistryFounded in 2012, and headquartered in Boulder, Colorado, Clean Chemistry discovered safe, effective production and use of Reactive Oxygen Species (ROS) for water treatment and industrial applications. Using proprietary, patented approaches, this new family of chemistries represents a significant disruption to the current inefficiencies in the production, distribution and performance of oxidation and disinfection chemistry. With success in the Permian Basin exceeding expectations, Clean Chemistry is expanding its capabilities to E&amp;P operators and water management partners in the Permian and other regions where high performing, safe water treatment is a major factor in completions operations.About the RoleThe Manufacturing Manager plays a key role in Clean Chemistry’s product engineering, equipment manufacturing, and operational efforts. The responsibilities for this position fall into three main areas. The primary responsibility is the hands-on fabrication of equipment including basic electrical, plumbing, and metalworking. The secondary responsibility is managing stock inventory at multiple yards / facilities. Finally, this role will also participate in the design and engineering of new equipment including field testing and trials. The ideal candidate will have experience in fabrication, will be technically savvy, mechanically inclined and able to translate complex instructions and concepts into writing for training purposes. Willingness to learn from and work with the R&amp;D and manufacturing groups is essential. This is a versatile position ideally suited to someone who likes a challenge and wants to help bring Clean Chemistry’s technology to the next level.ResponsibilitiesFabrication and assembly of water treatment equipment and field-deployable trailersAs part of the engineering &amp; manufacturing team, participate in the design, construction, and deployment of Clean Chemistry’s water treatment equipment and fleet.Management of the daily operations of Clean Chemistry manufacturing facilities, maintaining a safe, clean and efficient work environment for all R&amp;D and manufacturing personnelMaintaining up to date records of the design revision status and the physical condition of the Clean Chemistry’s fleet, both in production and serviceDeveloping and implementing mechanical design changes and upgrades to equipment to improve efficiency and optimize chemical generationMaintain metrics to capture equipment failure frequencyMake field upgrades to deployed units, train personnel to perform upgrades and maintenance as neededWrite and update building instructions for skid and sub-assembliesMaintain active bill of materials (BOM) with vendor information, product descriptions and up to date pricingMaintain key vendor relationshipsSupply chain management of parts and equipment for manufacturing and field operationsOccasional travel (10-25%) to deploy, service and or sustain field equipmentRequirementsExperience with electrical installation and repair including low voltage AC/DC, basic wiring, and trouble-shooting, requiredExperience assembling plumbing with various materials including PVC and stainless steel piping required. Experience with water treatment equipment preferredExperience with the tools and work practices of metal, plastic, and wood fabrication Strong mechanical aptitudeExcellent written and oral communication skillsComfortable working on computers with a variety of programs. GSuite experience preferred. Strong spreadsheet skills with some familiarity with formulas and equations requiredFamiliar with inventory managementFamiliar with preventative maintenance practicesFamiliar with instrumentation including flow meters, various types of pumps, water and quality sensorsBasic understanding of test equipment, electrical diagrams, and piping / instrumentation drawingsBasic understanding of PLC and HMI and automated equipment. Basic understanding of instrumentation communication (4-20 mA, 0-5 V, pulse, MODBUS)Basic understanding of oil-field operations including water transfer, water treatment, and hydraulic fracturing operations preferred, but not requiredOrganized, detail-oriented professionalAbility to interact professionally with other personnelAbility to work independently with little daily supervisionAbility to travel occasionally to field sites in all active basins and work outdoors in all seasonsAdditional RequirementsMust be local to the Boulder / Denver Metro areaMust be able to perform frequent lifting (50 pounds)Must be able to perform frequent bending, twisting, and standingMust be able to stay awake and be alert for assigned shiftsMust pass a pre-employment drug screen and background checkCompensation and BenefitsCompetitive salary, DOEComprehensive benefits packageClean Chemistry is an Equal Opportunity EmployerRelocation not available."}