{"title":"Technical Support Lead NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKNspfSmX3dSki1QHyp_Tg0p_x58vtl-GrnVCmT-VUMVPIce5SKA6ZxD5XZIcJNoQCF730O16By9CgmnGy764OHnfYwJn_Ne5zO5qJ5ScIWX1WowcN28Beomj_BJ6pKGLy8YINx9w0HgTCBnXVFGtW4fLHRAQdskFVXk2vg4Ai_K3-mPS_EXeBipLzWC0Q","source":"ziprecruiter","full_description":"BASYS Processing, a leading software, point of sale and merchant services provider, is a family owned business that continues to experience growth year after year.  We are expanding our Deployment department and are looking for a hands on individual to manage the team. Each and every person at BASYS Processing plays an integral role in growing the organization, and for making BASYS one of Kansas City’s best small businesses!BASYS Processing is seeking a proven leader to oversee day to day activities within the Deployment department, manage people and processes, coach team members, and ensure excellent technical customer service.  An ideal candidate enjoys working with internal and external clients, natural ability for solving problems, and wants to make a difference within our organization.Responsibilities:Initial and main point of contact for Senior positions; backs up when Senior is out or when a Senior is not in place for the teamSubject matter expert in business processesAssist in design and implementation of new business processesUtilize available tools to ensure maximum coverage and adequate staffing of departmentMaintain and promote high standards to ensure 90% or more of merchants rate their experience with BASYS as Very PositiveEnsure day-to-day activities, projects, and assignments are completed by assigned team within SLAResolve product or service problems by researching and determining the cause of the problem, expediting correction, and documenting resolutionProvide escalated technical support to customers among a variety of product categoriesCoach assigned team members utilizing on the spot conversations, monthly 1-1s, monthly meetings, SMART goals, and annual performance evaluationsHere’s what we are looking for:• Bachelor’s Degree plus 3 years technical or customer support experience, in lieu of degree, may have relevant work experience • Minimum 1-2 years management experience• Ability to work well in a team environment• A self-driven individual with outstanding integrity, willing to take responsibility for his or her own actions and performance• Likes to problem solve• Excellent technology skills with proficiency in Microsoft Office, CRM, We offer a competitive starting wage, with benefits that include medical, dental, and vision insurance, supplemental insurance programs, paid holidays, PTO, 401k program with company match. This franchise is independently owned and operated by a franchisee. Your application will go directly to the franchisee, and all hiring decisions will be made by the management of this franchisee. All inquiries about employment at this franchisee should be made directly to the franchise location, and not to City Wide Corporate."}