{"title":"Chemistry Laboratory Technician","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJhHG5xC1aXdz1tjcderrk5Cz2iOb_KkTiJkE7_x4G-J4b4MMF7v7cP0eqWmkxVa2HJZ8m2_R9vVwBivbtdmUTxQ2cTMKc0zN9oFUqyA3P_G91Z7o5T1xPKjjkCh4yFipyLH8LHwXpT6cz8-WHiy57iJHwIDqiNHjtpC4B4O9EQlFa_P7xAZQeoub4y2bc","source":"ziprecruiter","full_description":"Overview Antech Diagnostics, the largest exclusively commercial veterinary diagnostic laboratory in the nation, is in search of a Full Time Overnight Laboratory Technician working out of our Lake Success Laboratory and reporting directly to the Laboratory Manager.  As part of the VCA Family, which operates the largest network of freestanding, full-service animal hospitals in the nation, Antech Diagnostics delivers state of the art testing and consulting services to practicing veterinarians.  Our diagnostic spectrum of tests in the areas of chemistry, pathology, endocrinology, serology, hematology, and microbiology enhance veterinarians' ability to detect, diagnose, evaluate and prevent disease and other conditions affecting animals. Antech Diagnostics is looking for outstanding Medical Laboratory Technicians and Technologists for night shift positions throughout our veterinary diagnostic reference lab locations. The ideal candidates will have experience working in either a reference or hospital laboratory, or have strong experience performing lab duties as a Vet Tech. Hematology, Chemistry, and Urinalysis diagnostic testing experience strongly preferred.  We are looking for candidates who specialize in one or more of the following areas: Hematology- Testing cell-related components of blood samples to enumerate and identify their cellular components, including the microscopic evaluation of blood smears and the use of automated and manual counting techniques. Urinalysis- Analysis and evaluation of chemical and microscopic components of urine samples, using automated instrumentation and manual techniques. Chemistry/Endocrinology- Testing blood and body fluids for various analytes, utilizing automated instrumentation.Immunology/Serology- Testing blood and other samples for the presence of viral and bacterial disease by detecting antibodies (AB) or antigens (AG). Parasitology- examining samples to identify parasites, utilizing fecal flotation and various microscopic techniques. Responsibilities Sets up and runs lab tests. Reads and releases test results. Performs equipment maintenance activities. Knowledge of lab equipment and procedures. Awareness of quality control and calibration. Developing knowledge of multiple specialties. Works under close to moderate supervision with limited latitude for independent judgment.Consult with senior peers on non-complex tasks to learn through experience. Applies job skills and lab policies and procedures to complete a variety of tasks.Works on tasks that are semi-routine in nature where ability to recognize deviation from accepted practice is required.Reliable and dependable attendance is an essential function of the position.  Adherence to attendance-related policies and expectations is critical to this position.  Qualifications High School Diploma or equivalent required, 2, 3 or 4 year degree in Science-related field preferred.Certification as a Veterinary Technician (RVT, LVT, CVT - Registered, Licensed or Certified through American Veterinary Medical Association accredited program-AVMA) or Medical Laboratory Technician (MLT) (American Society of Clinical Pathology-ASCP), or military equivalent a plus.Laboratory skills, with experience setting up, running and reading lab tests and operating lab instruments.General science background, including hematology/chemistry helpful. Attention to detail. Organized with ability to multi-task in a fast paced environment. Ability to work independently and as part of a team. Communication skills, both verbal and written. Positive, can-do attitude. We are a rapidly growing, stable company with excellent advancement opportunity. Medical, dental and vision benefits, plus 401(k) plan and employee pet health benefits available, too! If you are passionate about animal healthcare, are motivated by making a difference we want to hear from you!  We can recommend jobs specifically for you! Click here to get started."}