{"title":"IOS Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKL-3dOVmtMBNZpGCL9S5WZQ2WnEz4WpMmYg9TL6AB01vSnvaBu8orEBzmoXItX8YUdG15IX0-LbmQKauco5Der_kb-K4AfEpzbuKdT0VEpIYGHbL-IPaj9bF81GDT0QXZnTZU2katgKn19vBR4iLP7UsvE1TbgV6_rU3JDtx9vL2JF4xGdJItOTVY_Dg","source":"ziprecruiter","full_description":"IOS Engineer Humanity is suffering from a healthcare crisis of epidemic proportions - and it's not COVID, it's mental health. Through decades of research, we are introducing a consumer wearable  that measures a persons real time mood and uses biofeedback to help people increase resilience to any type of stress (think Fitbit for the brain). With large scale partnerships in academia and industry, we are effectively building one of the largest multi-sensor health related data sets ever that has allowed us to develop one of the first truly personalized diagnostic / therapeutic platforms. We have secured $50M in funding from reputable VC groups in the Biotech community and our next step is to bring our device into production. Our leadership consists of executives & founders who helped develop and sell Humira (the best-selling drug in the history of pharmaceuticals to Abbott Laboratories), as well as Tinder, the largest dating platform in the world which is a publicly traded company valued at ~$40B.We are scaling our operations and have an immediate need for an experienced iOS Engineer - remote welcome!What You Will Be Doing- Build the next generation of mobile apps and frameworks for our innovative new wearables and services. - Designing and implementing the customer facing app, as well as various internal apps and frameworks used daily for research and development- Laying out interfaces programmatically using AutoLayout, modular/reusable UIViewControllers, and custom views. Candidates will be expected to be able to use UIStackView and UICollectionView for implementing complex layouts on various types of devices.- Use memory management techniques, closures, and retain cycles.-Debugging code in Xcode and using Instruments to profile code performance.- Writing synchronous and asynchronous unit tests using XCTest.- Create and distriute frameworks to create clear code boundaries and modularity.What You Need for this PositionRequired:- Experience using multiple different design patterns (Delegation, Notifications, Singleton, MVC, MVVC, Coordinator, etc).- Knowledge using at least one dependency management tool like Cocoapods, Swift Package Manager, or Carthage.- Experience consuming data from remote sources (via URLSession, Alamofire, MultipeerConnectivity or any other mechanism/framework for obtaining data over HTTP/HTTPS, RPC, Bluetooth, or Wi-Fi)- Experience using at least one client-side caching/database technology including either SQLite, CoreData, Realm.- Experience encoding/decoding data over the wire using JSON and/or protocol buffers. Knowledge of both is a huge plus.- Experience writing multi-threaded and atomic code (GCD, libdispatch, locks, semaphores, etc). - Using git and the terminal for source code management. Even if a candidate is currently using a GUI for git they must demonstrate the ability to use git in the terminal since we have build tools they are expected to contribute to.Desired:- Experience compiling cross-platform libraries for the various iOS toolchains using build tools such as CMake, Make, and/or gyp.- Experience writing clean documentation.- Experience with code formatting tools such as swiftformat, swiftlint, and clang-format.- Experience with functional/reactive programming. - Experience with wearable bio sensors and the various problems that arise from using sensors on freely moving subjects...So, if you are an iOS Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}