{"title":"Field Service Power Generation Technician NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALBkB7fQNOHgwEd817IVdT1vClxcyN2_MMjfy5W12xDUZI8xceJTvmXRrVCwLLD2O3KcYeXtT6xlcNUmBjJy0-51Zv7wrbIjK0UYod7NCmil9lEGKb0N2xGj73UbJCj38NifiLYXrw9hhUW4WxNbo0h_SqmhqnSh9VeFYI3Ss0fRAEGg5jwvvJ2kKGx9WQW","source":"ziprecruiter","full_description":"Field Service Power Generation Technician Description We are looking for a talented FIELD SERVICE POWER GENERATION TECHNICIAN to join our team specializing in Power Generation for our Distribution Unit in Bronx, NY. In this role, you will make an impact in the following ways:  Completing preventative maintenance and/or basic repair activities on generators or components at the customer site with minimal direction.  Engaging with customers in a courteous and professional manner.  Applying the use of specialized tools and following documented procedures and policies to diagnose and complete basic repairs, including preparing required parts and tools.  Completing required documentation, such as service worksheets, timesheets, warranty claims via handwritten forms or business system input screens. * Completing training in line with skill and business requirements.  * Adhere to all our relevant Health, Safety & Environmental policies, procedures and legislation and reports any issues / incidents to their supervisor. Qualifications To be successful in this role you will need the following:  Broad mechanical and electrical repair and maintenance abilities.  High Voltage / Low Voltage experience.  Capable of electrical repair and maintenance with minimal supervision - hands on exposure to working on power generation products.  (Entry) Technician Level I: Limited relevant technician experience; qualified to perform work on a minimal number of products in-scope a for diesel technician at this location; primarily engaged in maintenance or basic repairs/diagnostics; requires direct supervision and review of workmanship quality. * (Intermediate) Technician Level II: Some relevant technician experience; qualified to perform work on an intermediate number of products in-scope for a diesel technician at this location; primarily engaged in moderately complex maintenance and repair; some exposure to moderate or complex diagnostics, requires limited direct supervision, may provide basic training or guidance to new technicians.  (Advanced) Technician Level III: Significant relevant technician experience; qualified to perform work on most or all of products in-scope for a technician at this location; frequently engaged in complex diagnosis and repair; requires minimal to no supervision; ability to effectively train and guide less experienced technicians of varying skillsets.  Locally valid driving permit Compensation and Benefits Base salary rate commensurate with experience. Additional benefits vary between locations and include options such as our 401(k) Retirement Savings Plan, Cash Balance Pension Plan, Medical/Dental/Life Insurance, Health Savings Account, Domestic Partners Coverage and a full complement of personal and professional benefits. Cummins and E-verify At Cummins, we are an equal opportunity and affirmative action employer dedicated to diversity in the workplace. Our policy is to provide equal employment opportunities to all qualified persons without regard to race, gender, color, disability, national origin, age, religion, union affiliation, sexual orientation, veteran status, citizenship, gender identity and/or expression, or other status protected by law. Cummins validates right to work using E-Verify. Cummins will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each new employee's Form I-9 to confirm work authorization. Job SERVICE Primary Location United States-New York-New York-US, NY, Bronx, Cummins Power Systems Job Type Shop Recruitment Job Type Technician Job Posting Jan 29, 2021, 3:22:09 PM Unposting Date OngoingReq ID: 2100009F"}