{"title":"TPF Developer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAKJIzRxtYzdCXOSW6JDLDNH8ELG0H7QxI-is2FW4W19vcSx1S0pUJMql_Z-cEXhmEUEsEndy3wshIqfPdtV8AW_CNwrLqHP1B7-7Q8XRMnOk5phN-muWjX1oyBbepR8Ky7BHcr5gLgdbTDZaHm2fxNaogq4eTOtPkjAYTRw38hSvnkwzM4sEZhouLfjhg","source":"ziprecruiter","full_description":"BCforward is currently seeking highly motivated TPF Developer for an opportunity in Fort Worth, TX 76155 Summary:· Job Title: TPF Developer· Location: Fort Worth, TX 76155· Duration: 9 Months ContractJob Description:· This position requires on-site support in the DFW area performing both enhancements as well as maintenance work for the FOS Crew applications that reside in the z/TPF mainframe environment.· A background in Airline and/or Crew Operations is a plus.· The candidate must have expert knowledge of the z/TPF platform, IBM Tool Kit, Debugger, and CVS tools. · Primary experience level must be in the applications programming area.· The individual must have the ability to perform coding in both the SABRETALK and ASSEMBLER languages, dump analysis, problem solving, general troubleshooting and testing of software. Candidate should be a self-starter and capable of working with minimum supervision. This environment requires 7x24 coverage and candidate should be prepared to provide off-hours support as needed.· 8+ years of full-time current experience as a zTPF Application's Programmer· Experience working an agile environment.· Understanding of the zTPF environment· Ability to work independently as part of an agile team· Must be proficient in Assembler, IBM TPF Tool Kit, and CVS tools· Exposure to SABRETALK language a plus, if not, the ability to learn this language quickly.· Strong analytical / problem solving skills· Good verbal and written communication skills· Must show strong initiative and follow through on various assignments with little supervision;· Must be able to multi-task· Ability to complete detail oriented tasks that require a high degree of accuracy· Ability to effectively meet deadlines and manage workload in a dynamic and fast-paced work environment· Airline and/or FOS Crew experience – a plus· Must be willing to perform all stages of the development cycle (analysis, design, coding & testing)· Must be willing to work in both on maintenance and enhancements.About BCforward:BCforward began as an IT business solutions and staffing firm. Founded in 1998, BCforward has grown with our customers’ needs into a full service personnel solutions organization. Headquartered in Indianapolis, Indiana, BCforward also operates numerous delivery centers across North America and India. We are currently the largest consulting firm and largest MBE certified firm in Indiana. Our uninterrupted growth has allowed BCforward to deliver uniquely configured IT staffing and project solutions for over years of catering to our customers’ specific needs. BCforward currently maintains a team of over 5000 global resources. With our additional brand, Stafforward, together we have the capabilities to deliver services for a variety of industries in both public and private sectors which allows us to address your most challenging needs.www.BCforward.com"}