{"title":"Technical Support","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJwTdrZFpZ2E10U7uJJYFS2TtM2kvficFuCQYqCRxwR-l09Sl348hf4y46StdYxcBTZAwbQatssG6_7cpf8mUO6mdWfy8TqoO6OBWtFPASypkyFwSIChfHWMsPXb5cGxoxcwvij3VdbpmAoJioU2bXx69EAPXG5hGjAOI0BFKiqtHesF38JHYFr5kVFbwse","source":"ziprecruiter","full_description":"We are looking for Service Desk Consultant for an immediate need. This is a client-facing role & the candidate will have regular interactions with various client managers.  Rotational Shifts  Required Skills: IT Service Desk operation in 24x7 operations Candidates earlier worked in international contact call centers in a voice support process is preferred  We are looking for L3 Support for an immediate need. This is a client-facing role & the candidate will have regular interactions with various client managers. Responsibilities:The role will support client by supporting, validating and documenting processes necessary to maintain production network architecture.  The L3 role will play a key role in supporting Cisco network switches, troubleshooting Windows 10 operating system, supporting MS Office 365 and ensuring the network infrastructure is reliably deployed and in good working order during operating hours.  This individual is responsible for documenting the processes necessary to maintain IS environment and understanding the technology solutions that are used to support the execution of these business processes.  Perform superior problem solving and troubleshooting skills at the System Engineer level (L3). Communicate technical concepts to non-technical business users and have the technical depth to also communicate effectively to other internal IS Groups Possess the ability to work independently with minimal management supervision. Requirements:Must have experience in administering windows server operating systems.Must have experience in maintaining Cisco switchesA solid working knowledge and demonstrated technical proficiency in installing, troubleshooting and resolving problems of various software on Windows 10 Operating systemExperience working with VMware vSphere.Experience installing and troubleshooting server room, hardware components, such as Rack Servers, Fiber, Cisco switches, disk drives, memory, etc.Experience or knowledge of CRAC/HVAC Units and UPS preferred.Experience working with various levels of technical individuals at remote locations to resolve problems or in implementing on new switches or Servers preferred.Experience using a ticket management system for work prioritization and daily workload managementITIL, CCNE and/or MCSE certifications are desired.High school completion is a mustWilling to work in shiftsExperience on AirWatch/iPhone support is an in advantageAbility to create clear and concise documentationGood written and oral communication skills are required. Ability and confidence in making system recommendations and providing excellent customer support. Experience and/or knowledge of PLC is a plus. Physical Requirements:Must be able to lift 50 lbs.Must be able to lift equipment for 'rack and stack' services (server, router, switch, UPS devices, etc)Must be able to assist with team lifts of up to 90 lbs.Ability to walk long distances within warehouses or manufacturing facilitiesWill often work in dirty, dusty, hot or cold (beyond average room temperature) environmentsAbility to climb stairs, ladders and/or use scissor lifts and safety harnessesSome services may require periods on hand and knees to install equipment (under desks, inside small spaces, etc.)  ***Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service. **Applicants are required to be eligible to lawfully work in the U.S. immediately; employer will not sponsor applicants for U.S. work authorization (such as an H-1B visa) for this opportunity. We are looking for Service Desk Consultant for an immediate need. This is a client-facing role & the candidate will have regular interactions with various client managers.  Rotational Shifts  Required Skills: IT Service Desk operation in 24x7 operations Candidates earlier worked in international contact call centers in a voice support process is preferred  We are looking for L3 Support for an immediate need. This is a client-facing role & the candidate will have regular interactions with various client managers. Responsibilities:The role will support client by supporting, validating and documenting processes necessary to maintain production network architecture.  The L3 role will play a key role in supporting Cisco network switches, troubleshooting Windows 10 operating system, supporting MS Office 365 and ensuring the network infrastructure is reliably deployed and in good working order during operating hours.  This individual is responsible for documenting the processes necessary to maintain IS environment and understanding the technology solutions that are used to support the execution of these business processes.  Perform superior problem solving and troubleshooting skills at the System Engineer level (L3). Communicate technical concepts to non-technical business users and have the technical depth to also communicate effectively to other internal IS Groups Possess the ability to work independently with minimal management supervision. Requirements:Must have experience in administering windows server operating systems.Must have experience in maintaining Cisco switchesA solid working knowledge and demonstrated technical proficiency in installing, troubleshooting and resolving problems of various software on Windows 10 Operating systemExperience working with VMware vSphere.Experience installing and troubleshooting server room, hardware components, such as Rack Servers, Fiber, Cisco switches, disk drives, memory, etc.Experience or knowledge of CRAC/HVAC Units and ..."}