{"title":"Wireless Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIBr1cZJoRbeqX-LOzSQZHK2vaT9OopX_ipvNoQMbfSkn9-43qIl3uoS31Qkxen_WSgrXZQ7UiEQ7y369XriFrG4D59gHpRXo_uYCrjAMy6PQgKRdYuxPSU10UPE4J6K8S3_z-IKSVVdM3snbcEmmSxwZdQNdt1rZGKmeS6PC1UDqtsWZQYNfvUlSyVtFNr","source":"ziprecruiter","full_description":"Wireless Network Engineer supporting a New England base of clients comprised of Schools, Hospitals and Medium size businesses. The Engineer will be directly responsible for assessing and helping to design and build wireless infrastructure primarily based on Cisco and or Aruba. Work with the latest tools and an experienced team of Network Solution Architects supporting and continuously deploying Wireless solutions in a variety of environments. Opportunity to apply your wireless network experience and to grow your knowledge through our education incentives and manufacturer sponsored training. We offer a dynamic environment built on more than 25 years experience supporting network infrastructure.Responsibilities:Implement, and support WLANs by performing and documenting 802.11 wireless surveys and heat maps.Support new Aruba WLAN controllers and over thousands of AP over multiple (local) locations.Use the latest analytical tools to analyze and document data to AP optimization. Determine AP placements and perform post-implementation tuning and documentation to optimize WLAN performance.Analysis and design of Routing Protocols/Technologies such BGP, OSPF, Logical Overlay, IOS-XR, MPLS VPN, Multicast.Diagnose difficult network performance problems and interact with network support teams to diagnose network performance issues.Detailed knowledge of IP Protocols including IPv4, IPv6, IPSEC, routing, and network protocolsA technical understanding of networking protocols and security mechanisms, such as SNMP, SIP, TR-069, SSL/TLS, LDAP, Radius, SOAP/XMLExcellent written skills to support required topology documentation and project task completion.Qualifications:3+ years experience with Aruba Wireless infrastructure with hands-on 802.11 implementation and problem diagnosis.ClearPass knowledge and implementation as well as design and deployment of Aruba solutions.Knowledge of Airwave or equivalent.Ekahau wireless spectrum analysis suite or equivalent to design and support WLANS.Knowledge of Core and edge switch configuration, heat maps and documentation.Hands-on experience and well versed in utilizing networking tools and applications.Active Aruba Certifications, minimum 1 of the following required: (ACMA, ACMP, ACMX, ACDX, ACCA, ACCP, ACCX, ACEAP, ACSA)Certifications preferred, minimum 1 of (CCNA Wireless, CCNP Wireless, CCIE Wireless)HUB Tech is a provider of Managed Services, IaaS and on-premise Infrastructure Design, Analysis and support. We offer a supportive team environment combined with ongoing training. We have an expansive State of the Art facility located in South Easton MA with the latest tools and staging labs. In addition to competitive Salary and bonuses we provide an extensive benefit package including Healthcare, Dental, vision, insurance, vacation and retirement plan. Most important we pride ourselves on being innovators in our field staying ahead of our competitors and offering the very best service experience for our clients while enjoying working on interesting projects with great peers, making each day one to look forward to."}