{"title":"Test Technician II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALOBMQOquxPT-YcVUbL0RG8Zh675SiRiAvskq6Ik30DpgE_SoWYje2yjonSk1AaeuQO1s2MmDAFrhVFAvu-ubRuoxya6GDIFdLQkMUwY3tRmSaRu85JYZeCeaXeBM3U-Ln429QfTzVCC66BS8dpWZ4IGxI6Y-PlmiN4llq_c5-53qGgEDWpaWwtvKo09JA","source":"ziprecruiter","full_description":"Under Supervision, performs technician duties, product testing and related project support functions for the Marine Test Center.Yamaha has an excellent opportunity for a Test Technician to join our Marine team in Bridgeport, AL. The Test technician will perform engineering technician duties, product testing and related project support functions at the Yamaha Marine Test Facility with the purpose of improving current Yamaha Marine products and developing innovative new marine products.Specific duties include, but are not limited to:Install outboard engines, control systems, electronics and marine accessories on a wide variety of applications.Apply marine combustion engine theory and marine propulsion system theory and knowledge to effectively service, maintain and diagnose marine engines, engine accessories. Operate a wide variety of boat applications in varying conditions while collecting performance data and engine diagnostic informationInstall advanced diagnostic and data collection tools and equipment for acquiring, analyzing, and reporting marine product performance data and information using Microsoft office and other computer applicationsApply marine ac/dc electrical theory as well as knowledge of CAN systems to maintain and diagnose issue with marine boat control systems and electronics and a wide variety of boat accessories.Under minimum supervision, create and execute test plans according to strict industry standards and guidelines set by marine manufactures.Maintain a safe and clean environment within all areas of the buildings, grounds and docks. Assist in performing routine repairs and maintenance on company equipment, vehicles, buildings, docks and grounds. Assist in planning and participate in field testing, market research, and market service issue investigation.Complete confidentiality is mandatory on testing activities, results and products.Qualifications:High School Diploma and some college preferred with excellent skills in math and science.Must have boat piloting capabilities up to 82 MPHMust have at least 5 years' experience in boat, engine and electronics rigging, repair and maintenanceMajor Marine Manufacturers service certifications are very beneficial.CDL is BeneficialAbility to analyze and resolve problems encountered in testing or with equipmentProficient in computer programs such as Excel, Word, Adobe, and Power Point.Must have experience operating a forklift, trucks, and towing trailers.Requires close attention to detail regarding engineering data and project results.Requires up to 15% travelMust observe all safety rules and regulations. Safe operation of all equipment.Reports to: Testing Supervisor.Yamaha Motor Corporation, USA is proud to be an equal opportunity employer.#ZR1"}