{"title":"UP TO $42/HR* Automotive Technician / Mechanic - Ken Caryl NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALqWRILjLBqsec58PcZblo7-z4herwm9ELvrkcCz58O687MjZC5Fo9tDCAZgTycPSt8l4cTWmVqOuaXjDhJxpdM7l0GYzSx1LE4o2khFKiremveOCEFPH3Bj5riA7Uw7Q7PW4KJWcMEjp1YbA-OoF5s15Ecr05pM3YrGu7JnIkIkdXzGOtKiNKOFFcnuOE","source":"ziprecruiter","full_description":"Company Description Christian Brothers Automotive - this location's Google rating is 4.6/5!America's Number 1 Automotive Repair Franchise!WE OFFER:WEEKENDS OFF!!15 DAYS PTO!!Blue Cross Blue Shield MEDICAL INSURANCE!!COMPANY-PAID ONGOING TRAINING!!EMPLOYER MATCHING SIMPLE IRA SAVINGS PLAN!!A GREAT WORK ENVIRONMENT!!Our small company culture is great and our mission is simple: to create an uncommonly great experience for customers in need of auto service and repair. Christian Brothers Automotive was founded in 1982 on the principles of honesty and integrity. Each location seeks to put customer service first. All locations are equipped with manufacture-level diagnostic equipment in the shop, with lobbies that are designed to be welcoming and comfortable for guests. We enjoy providing the highest level of customer service while maintaining those original principles. We're excited to find the team member who will provide this experience to the guests! Job Description Job Title:  Automotive Technician / MechanicLocation: 5828 South Swadley Street, Littleton, CO 80127Responsibilities include, but are not limited to:Perform a wide range of automotive repairs.Review TSB's and other service recommendations and translate to customer needs. Honestly assess vehicles and build a detailed estimate of necessary repairs.Communicate cause and correction for customer concerns regarding their vehicle. Address any concerns from customersComplete full, accurate, and honest courtesy inspections in service to our customersCommunicate with service staff and customers on their vehicle as needed.Maintain professionalism. Keep shop in clean, working order.Master MFG level diagnostic tools (MFG scantools and subscriptions provided by CBA)Technicians at Christian Brothers Automotive are set up for success, both in day-to-day operations and long-term career growth. We offer:Consistent workloadClean modern facilityFree trainingHigh volumeLarge variety of vehiclesUse of the latest factory scan toolsNewest and most advanced Hunter alignment systemFull time live technical supportAccess to our private Technical Assistance Center.....and much more!We are looking for technicians who are energetic, upbeat, and have a positive attitude. The technicians we are looking for have to seek out solutions to tough problems with a strong passion for doing what's right for our customers. Qualifications A well-qualified automotive technician / mechanic applicant possesses the following:Positive attitude.Desire to serve customers.3+ years of experience as a professional automotive technician.Capable of diagnosing and repairing all makes/models of vehicles.Ability to Flag 40+ hours per week.Aptitude for learning additional skills and processes.Prefer experience with all makes and models.Dealership diagnostic equipment experience a plus. Current ASE Certifications preferred, or a plan to achieve while working in our business.Strong communication skills Physical Requirements:The physical demands described here are representative of those that must be met by any applicant in order to successfully perform the essential functions of this job. While performing the duties of this job, an automotive technician / mechanic must:Occasionally lift and/or move over 50 pounds.Be able to work with tools on vehicles lifted above their head.Work in tight spaces as dictated by the vehicle's needed repair.Have the needed dexterity in order to efficiently use hand-tools Walk/stand for the majority of the workday.Drive manual transmission vehicles.Keep a brisk work pace in a high-volume environment.Efficiently navigate a computer. Additional Information All of your information will be kept confidential according to EEO guidelines. Christian Brothers Automotive is an Equal Opportunity Employer. Christian Brothers Automotive locations practice \"At-will\" employment practices.Qualifications: A well-qualified automotive technician / mechanic applicant possesses the following: Positive attitude. Desire to serve customers. 3+ years of experience as a professional automotive technician. Capable of diagnosing and repairing all makes/models of vehicles. Ability to Flag 40+ hours per week. Aptitude for learning additional skills and processes. Prefer experience with all makes and models. Dealership diagnostic equipment experience a plus. Current ASE Certifications preferred, or a plan to achieve while working in our business. Strong communication skills Physical Requirements: The physical demands described here are representative of those that must be met by any applicant in order to successfully perform the essential functions of this job. While performing the duties of this job, an automotive technician / mechanic must: Occasionally lift and/or move over 50 pounds. Be able to work with tools on vehicles lifted above their head. Work in tight spaces as dictated by the vehicle's needed repair. Have the needed dexterity in order to efficiently use hand-tools Walk/stand for the majority of the workday. Drive manual transmission vehicles. Keep a brisk work pace in a high-volume environment. Efficiently navigate a computer.Responsibilities: Job Title: Automotive Technician / Mechanic Location: 5828 South Swadley Street, Littleton, CO 80127 Responsibilities include, but are not limited to: Perform a wide range of automotive repairs. Review TSB's and other service recommendations and translate to customer needs. Honestly assess vehicles and build a detailed estimate of necessary repairs. Communicate cause and correction for customer concerns regarding their vehicle. Address any concerns from customers Complete full, accurate, and honest courtesy inspections in service to our customers Communicate with service staff and customers on their vehicle as needed. Maintain professionalism. Keep shop in clean, working order. Master MFG level diagnostic tools (MFG scantools and subscriptions provided by CBA) Technicians at Christian Brothers Automotive are set up for success, both in day-to-day operations and long-term career growth. We offer: Consistent workload Clean modern facility Free training High volume Large variety of vehicles Use of the latest factory scan tools Newest and most advanced Hunter alignment system Full time live technical support Access to our private Technical Assistance Center.....and much more! We are looking for technicians who are energetic, upbeat, and have a positive attitude. The technicians we are looking for have to seek out solutions to tough problems with a strong passion for doing what's right for our customers."}