{"title":"Senior Software Engineer - NYC or Southbury, CT","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKRuN5O_k0cHWAzES1WoqZ3NdL99Y0mxVSiDwcTaen1uOi3SKw_gYIO4VL6yiePSYRNpQKn8WAhJa3kdAe6lS9iFEDdTdKu3IRHkUKkVWyY5W3aeep48K3R4_CsN6yYn8yb6j0UNCt-x0b-F9Ls-tvC4EQNIQMH9sUudK6oqheab8en8_pnlslkMSyu8xnp","source":"ziprecruiter","full_description":"Senior Software Engineer - NYC or Southbury, CT Country:US State:NEW YORK City:New York Category:Software Development & Support Required Education:High School Diploma/GED Position Type:Professional Employment Type:Full-Time Contract Type:Regular Company:(0147) International Business Machines Corporation Req ID:371010BR Travel Required:No Travel Min Salary: Max Salary: Currency: Location:New York, NY US View Full Description Introduction Software Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of. Your Role and Responsibilities This role is located in the IBM office in New York City. There is no remote work option post covid. We are co-located in the office, but maintain a responsible consideration of health and safety practices - which includes ongoing support for an in-office/remote office balance during these unusual times. We will also consider highly qualified candidates to work in the Southbury, CT office. There are no relocation funds for this role so you would need to relocate at your own expense. *** IBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship. As a Senior Software Engineer you: Are experienced with client-server architectures, networking protocols, application development, and using databases. Have experience using and developing APIs. Understand user and system requirements What You'll Do: You'll work in a dynamic, collaborative environment to understand requirements, design, code and test innovative applications, and support those applications for our highly valued customers. You'll employ IBM's Design Thinking to create products that provide a great user experience along with high performance, security, quality, and stability. Design and code servers, services, applications and databases that are reusable, scalable and meet critical architecture goals. Create Application Programming Interfaces (APIs) that are clean, well-documented, and easy to use. Create and configure Infrastructure as a Service (IaaS), Platform as a Service (PaaS) and Software as a Service (SaaS) applications. Design and implement large scale systems and Service Oriented Architectures (SOA) that enable continuous delivery. Who You Are: You are highly motivated and have a passion for creating and supporting great products. You thrive on collaboration, working side by side with people of all backgrounds and disciplines, and you have very strong verbal and written communication skills. You are great at solving problems, debugging, troubleshooting, designing and implementing solutions to complex technical issues. You have practical experience in software development and programming languages. You have the ability to learn new skills quickly and use the skills efficiently. You are eager to make an impact and support projects that affect IBM across our global enterprise. Required Technical and Professional Expertise 7+ Years as a Software Developer Experience in the following backend technology areas such as Python & Django web framework or Javascript runtime environments like Node.js Ability to work with REST API development Knowledge of Database technologies - RDBMS, SQL, MongoDB, or NoSQL Understanding of front-end programming languages like HTML, XML, CSS, and JavaScript Knowledge of front-end Javascript libraries like React, Vue, Angular or JQuery Familiarization with UI design frameworks & component based libraries like w3DS, Bootstrap, Semantic UI, or Materialize CSS Have experience building and architecting full-stack solutions Experience with object oriented programming/methodologies Understanding of code versioning tools, such as Git Understanding of user and system requirements Ability to write code that is well documented as well as structured into meaningful components and modules Preferred Technical and Professional Expertise Familiarity with cloud environments such as IBM Cloud & Hybrid Cloud Experience delivering solutions using an Agile / Scrum methodology Ability to leverage web application frameworks like Express to provide clean and easy servers. Utilize automation software like Docker to deploy web applications Experience with packet managers for Javascript like npm Knowledge of MQSeries DevOps experience to support the continuous integration and delivery cycle Ability to manage multiple projects while maintaining attention to detail Comprehensive overall passion for technology and cybersecurity About Business Unit The Office of the Chief Information Officer (CIO) owns IBM's IT strategy and provides the tools, workstations, devices, and infrastructure that IBMers use to do their jobs every day. Put simply, our mission is to create a productive environment for IBM's 365,000 worldwide employees. Join us as we lead with design to drive simplicity and ease of use, engineering the systems that run the business, and innovating to transform the business. Your Life @ IBM What matters to you when you're looking for your next career challenge? Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust - where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible. Impact. Inclusion. Infinite Experiences. Do your best work ever. About IBM IBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. Location Statement IBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship. IBM intends this job to be performed entirely outside of Colorado. Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}