{"title":"Sr. Android Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKelA5ss9dRJu_LJagMqhaoPqzWM98aZipjg6H2m-90E48gV99VyEkxReuKymilD1JxV4FJ0zlOWy00laY6UcbF5uOy4OXXH0_DNWTyck3U29tJjh7eQFBUTgxrs5Rf7w2ZT77evmxomiv5nCpONVuRKUf25IKRGz_Ek6SfeSsFGhG9qGAC6xgo8lXpbXi4","source":"ziprecruiter","full_description":"We're looking for a Sr. Android Engineer with a demonstrated ability to architect, code, and maintain Android applications with complex requirements while minimizing code duplication across multiple platforms.You thrive on solving new problems with capable teams and approach software engineering as a craft, not just a job.If you've ever wanted to work on a project that blends a gorgeous consumer experience, sophisticated logistics, and scale that rivals the largest technology players, this is the place for you.Ideal candidates have:A mix of startup and large software company experienceProven industry experience in any of the following: payment systems, ad-tech, large-scale distributed systems, data warehousing, or retail operations.What we look for:Experience in KotlinExperience with Android ApplicationsB.S. in Computer Science, Computer Engineering, Mathematics or a related field or comparable industry experienceAuthorization to work in the United StatesAbout Cloutera:Cloutera is a recruiting firm that provides corporate recruiting and sourcing support for organizations seeking permanent employees. Cloutera partners with and works side by side (sometimes onsite) with our clients as an extension of their internal recruitment teams in support of their permanent staffing efforts. We are dedicating to ensuring great candidate experiences and strive to support candidates throughout the process.Cloutera is an Equal Opportunity Employer and does not discriminate against any individuals based on race, color, religion, gender, sexual orientation, marital status, age, gender identity or expression, national origin genetics, disability status or veteran status. Unfortunately, at this time we are unable to sponsor visa applicants."}