{"title":"Staff Network Engineer - Contract NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ6sjdxnuOjop6pk6ojuPAwWnSWWWELYHcmtVsBFcOuiDWrQe1VE1E5Up1QJAJzIBZWB3ZsVWNFMiKTd6INEUuqb4RGFJ3TB0pNM_qaRLTrusV_kLrOD9mOFOoZ9KL2y0pIV-iske9i7jOR9pOdVVGh-HfkyTAT-exJQrUQ95w0HHcMCtzTVv5YXgiITzA","source":"ziprecruiter","full_description":"**Please review the job details below.**SummaryMaxar is searching for someone who is innovative, curious and willing to think outside the box in a highly collaborate and fast paced environment. Are you passionate about new technologies, cloud, IaaS/PaaS and Automation? If you do and you have desire to learn then Maxar would like to talk to you. This position provides first level network engineering of the Maxar network infrastructure, LAN, WAN and AWS cloud environments along with all associate equipment at all DG locations. This position will be a key role within the Network Infrastructure development team and work closely with peers and customers to provide world class customer support. This position will take direction from the IT Network Manager.**Responsibilities**This position is primarily responsible for maintaining and sustaining the health and performance of the Maxar corporate and enterprise networks. The engineer will be responsible for responding to and resolving complex issues and determining root cause. As a valued member of the MAXAR Network Infrastructure team the successful candidate will be responsibility for working with team members identifying, owning and driving initiatives to remove potential risks to the MAXAR network.Additional:+ Identify opportunities to automate maintenance and troubleshooting tasks + Ability to determine change requirements, document and successfully execute following change policies and standard configurations. + Maintain and update associated documentation as the network changes occur. + Assist in device patching to meet ISO27001 and Security standards.**Required Skills**+ This person must possess a strong client focus and have the ability to interact efficiently with peers and customers + Ability to work in stressful situations to restore network to operational state + 3 - 5 years' experience in a network engineering / operations role + Solid knowledge of IP networking and protocols (e.g., OSPF, BGP, GRE, TCP, FTP, DNS) + Experience troubleshooting switching and routing platforms + Some experience with application load balancing technologies + Ability to adhere to the Change Management process and procedures + Experience with Word and Visio, creating and maintaining MOPs, Maintenance plans, network drawings, etc. + Be highly motivated to learn and**Desirable Skills**+ Experience with Juniper EX switching platforms and M series routers. + Familiarity with F5 and/or NetScaler load balancers + Familiarity with Palo Alto firewalls + Familiarity with wireless technologies - Aruba, Clearpass + Be highly motivated to learn and collaborate across technologies**Candidates must be:**+ Able to work across teams in a highly cross function environment. + Detail Oriented + Good communication skills (both written and verbal) + U.S. Citizen with a current DoD clearance (Secret) + Candidates must want to proactively engage the business in order to understand its challenges and deliver high-value solutions + This is a strict contract roleAdditional:+ Identify opportunities to automate maintenance and troubleshooting tasks + Ability to determine change requirements, document and successfully execute following change policies and standard configurations. + Maintain and update associated documentation as the network changes occur. + Assist in device patching to meet ISO27001 and Security standards.**MAXAR Technologies offers a generous compensation package including a competitive salary; choice of medical plan; dental, life, and disability insurance; a 401(K) plan with competitive company match; paid holidays and paid time off.**DigitalGlobe is a leading provider of commercial high-resolution earth observation and advanced geospatial solutions that help decision makers better understand our changing planet in order to save lives, resources and time. Sourced from the world's leading constellation, our imagery solutions deliver unmatched coverage and capacity to meet our customers' most demanding mission requirements. Each day customers in defense and intelligence, public safety, civil agencies, map making and analysis, environmental monitoring, oil and gas exploration, infrastructure management, navigation technology, and providers of location-based services depend on DigitalGlobe data, information, technology and expertise to gain actionable insight.DigitalGlobe is an equal opportunity employer and considers qualified applicants for employment without regard to race, color, creed, religion, national origin, gender identity and expression, age, disability, veteran status, or any other protected factor."}