{"title":"C#/.NET Software Engineer (Remote) NEW!","location":"","salary":"","description":"","term":"$90,000 to $120,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKmGgZ3-LCDt2PEIvUji5nK2QYKKpGJ5zdLbxesNNBT7US6mxH2brNVSgx4LM1t3bBgpNesEqeqVkw-lGr1_MXf-GfqindS2TgrApzmyc5wT4TuECDksXDV3dOabAi79nANPyK9KII8JbiBfajZiM-a9eJjGGey9yeItBZtGI1adM0ODVxHFmzt-K8jkBE","source":"ziprecruiter","full_description":"C#/.NET Software Engineer (Remote) --URGENTLY HIRING REMOTE SOFTWARE ENGINEERS WITH GOOD C#/.NET EXPEIRENCE!!--Job Title: Software EngineerJob Location: 100% Remote - Ideally someone within driving distance to Columbus, OH for rare company meetingsSalary: $90k - $120k DOE + Bonus + 401k/BenefitsRequirements: 2-8+ years with software development with a focus in C# / .NETWe offer payment processing software for eCommerce sites. Our automated payment solutions provide advanced fraud detection and helps companies remain current, competitive and profitable in a rapidly evolving marketplace. We work closely with our clients to solve payment processing and cash flow management problems with the goals of improving profitability and simplifying the transaction process.What's In It for You- Salary ($90k - $120k)- Established and rapidly growing technology company - Full Benefits (health, dental, vision, etc.)- 401k match- Excellent work/life balance!What You Will Be Doing- New product development using C#/ASP.NET- Contribute to all phases of SDLC- Improve and monitor existing cloud infrastructure - Be a team player / laugh and have fun / strive to get betterWhat You Need for this Position2-8+ years software development experience working with: - C# / .NET / ASP.NET- SQL- JavaScript is a plus- AWS is a plus- BS in CS (or related) is desiredSo, if you are a C#/.NET Software Engineer (Remote) with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}