{"title":"Senior Computer Hardware Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJh38vHVj4t3zWVSSOxesAO8q_JpO1POC12FDrJUXLWE8DqXKFXuh89OMuhb7zHWLc3rNxjiTGY3HlPOA0MC633SxV3D4RJgCpPd1lhwJocl87s7kpXE-ydcOq5_UKPSbStA1Ia1itNkTAqFy_sSW3f0GA6Bi8oYev-QyHhKW1IsaQIBI603oeOOs4UnwT5","source":"ziprecruiter","full_description":"Responsibilities The NAVAIR Digital Group leads the digital transformation of NAVAIR and works to accelerate and scale digital/analytic technologies and capabilities across the NAVAIR Enterprise as a means to increase speed in the delivery and sustainment of warfighting capability. The Digital Group delivers and executes command-wide strategies that align activities and provides the workforce with agile self-service infrastructure, data accessibility, visualization and analytic tools, and digital/IT services to rapidly research, create, deploy, integrate, and maintain, applications, enterprise solutions, and other digital capabilities. NAVAIR's digital transformation will require leveraging advanced digital tools to implement fundamentally different business models across all business, technology development, workforce, and mission operation domains. NAVAIR is committed to a digital culture that empowers the workforce to accelerate, innovate, collaborate, develop, and deliver capabilities to meet mission outcomes.The selected candidate will:  Research, design, develop or test computer or computer-related equipment for commercial, industrial, military, or scientific use May supervise the manufacturing and installation of computer or computer-related equipment and components  Qualifications  Bachelor's degree in an information technology related field is required, a Master's Degree is preferred Ten (10) years of related experience is required A security + certification is required An active DoD Secret Clearance or higher is required Candidate is required to pass a background investigation  Overview  Sabre Systems, Inc. is a quality driven, customer focused large business providing innovative solutions in the areas of Cyber, C4ISR, Business Intelligence and Data Analytics, and Enterprise Modernization to federal and civilian customers. Our mission is to ensure our customers have the technology, services, and expertise to overcome threats, maintain superiority, and quickly adapt to emerging obstacles. At Sabre, we're more than just a job - we're a team - and we care for and nurture our employees like family. If you want to be a part of creating and implementing enduring solutions that transform mission challenges into mission success - join Sabre!Sabre provides an excellent benefits package, which includes healthcare, paid days off, tuition reimbursement, and a 401K plan.  We respect the unique perspectives that a diverse workforce of minorities, women, individuals with disabilities, and protected veterans brings not only to our company, but also to our customers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, (including pregnancy, gender identity and sexual orientation), national orgin, age, disability or gender information.EOE: Minorities/Females/Disability/Veterans; VEVRAA Federal Contractor We can recommend jobs specifically for you! Click here to get started."}