{"title":"Automotive Service Technicians/Mechanics-Mid Level to Master Tech NEW!","location":"","salary":"","description":"","term":"$42,000 to $100,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJDnI0mUegQ2-CQ1IpzrSGzK8cav_nFgmu8g40C3ajob8KmAFeRxoCFCDc-jebaVTsO8SLf3bNFx5xqT_par_OPEV3Z-DpG4X2AMb3Z95oBpvFzVPcHfpM0Up_1a-I12Hlrz9PPxL_dSVtsMIp-JvUNkks1zjvvySFTsdhwagUGbIbJwuXL7dcertouXsc","source":"ziprecruiter","full_description":"Auto Service Technicians/Mechanics-Mid Level to Master Tech$$ We have techs earning over $100,000+/yr $$If you possess 2+ years experience as an automotive technician WE WANT TO TALK TO YOU!BUSINESS IS BOOMING at Black Chrysler Dodge Jeep RAM!We are one of NC's most progressive and highest paying auto dealers! Our service department is growing and we are NOW HIRING A & B level technicians for our service department.A/B Level Technician Candidates:-Must have 2+ years minimum previous automotive technician experience-Should possess own tools-Must have a valid driver’s license-Must be team oriented and focused on a high level of customer service-Must be on time and dependableOur benefits package includes, but is not limited to:$$$ COMPETITIVE PAY $$$-Based on Experience-Earning Potential over $100,000+/yr-Certification Reimbursement-Professional Development Assistance-Relocation Assistance Available-5 Day Work Week, and currently, every third Saturday-401k Plan-Paid Time Off (vacation, sick days & 6 paid holidays/yr)-Short & Long Term Disability Insurance-Health, Dental, Vision & Life Insurance Plans-Employee/Family Discount Plan on Products & Services-Paid Training for Continual Vocational/Career Training-Solid Job Security With A Stable Organization (Our techs typically stay with us 10+ yrs)-Great Opportunities for AdvancementAll those interested should APPLY, and you may also call 800-475-7114 to schedule an interview. ABSOLUTELY NO WALK-INS YOU MUST SET AN APPOINTMENT because we will be holding interviews at a store NEAR the new store.Black Chrysler Dodge Jeep RAM831 Salisbury Rd.Statesville, NC 28677-Drug Free Workplace-Must Possess A Valid Driver License-Must Be At Least 21 Years of AgeExperience in or as: Auto Technician, Auto Mechanic, Mechanic, Auto Diagnostic Skills, Automotive Diagnostics, ASE Certification, A Tech, Transmission Repair, Alignment, Automotive Services, B Tech, Auto Repair, Automotive Maintenance, Engine Repair, Engine Rebuild, Car Repair, Suspension Repair, Drive Train Repair, Battery, Automotive Brakes, Service Department, Garage, Automotive Lubrication, Automotive Throttle, Mechanic, Service Tech, Oil Changes, Lube Technician, C Tech, Tire Rotation, etc."}