{"title":"Software Engineer II NEW!","location":"","salary":"","description":"","term":"$75,000 to $85,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAL_73rIpJdlXLxzdaZGUZaoZLuWIPQd6LV6hISp_XiwXr-7vpQeDVyey17Se5l-LQ0fpEbgaxXepVVS4usfuw68ZCVKMmpSVIY-coG2PXEQBIHGqKZbeVlQIA4xJQLIYIXEujTztnxpOOiH8vHCDL5eEzenm1ZZIDYx5oAe0HU9IJgiVC7zoYJT5yvXrA-T","source":"ziprecruiter","full_description":"Summary Your responsibilities will include designing, developing, and delivering software on limited embedded hardware resources with high performance and quality. Working with product managers, software/hardware engineers, and test engineers you are part of a team that will deliver feature-rich products on schedule to meet our new product strategic goals.ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned.Apply technical expertise/analysis to the design and development of firmware for networking test tools.Perform system integration and functional tests of software and hardware/software subsystems.Ability to be productive in an agile SCRUM development environment.Follow agile software practices enabling quick prototyping and multiple releases to meet market windows.Estimates work at a task levelResults-oriented, with a mindset of a sense of urgency and the ability to drive daily progress, even on complex design issues.Invest in development support activities including code reviews, collaborative design sessions, project/sprint planning, and feature demos.Strong desire to write testable software with a mindset of unit testing the code that is produced.Uses judgment within defined practices and procedures but may need to consult with senior staff on more complex technical areas.Receives general instructions on routine work, detailed instruction on new projects or assignmentsBuilds productive internal/external working relationshipsRequiredKNOWLEDGE AND SKILLSProficient in C and C++ programming language.Solid understanding of computer science principles.Understands latest software best practices.Knows how to use design tools, code repository interworking and software compilation and packaging toolsExperience and knowledge in designing software applications to interface with hardware components.Understanding of Networks communication concepts and Networking protocolsEDUCATION And/or EXPERIENCEBS in Computer Science, Computer Engineering, or related experience. Minimum 2-4 years."}