{"title":"EDA/CAD Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIhZYGzLqSo-lbgpE2TYsqhW3nWiX8msjPZaOdP2ywUly6CNPV8wJIPM_kW3eW0P4lSqy3LnSR4d-l1nS0TMpLGOD8TD8UsKeZQD6CQGCr6r-jiM6Bee97JqFdIPtpd3x5JwB6MADA6ES1yXsWa2_Ytr2lkGArDm2ci1lhmf5Ne0Ipppr-cgBjHN721rJFE","source":"ziprecruiter","full_description":"Company:Qualcomm Technologies, Inc.Job Area:Engineering Group, Engineering Group > Hardware EngineeringJob Overview: Qualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is the Invention Age - and this is where you come in.General Summary Develops and applies Electronic Design and Automation (EDA) & Computer Aided Design (CAD) software engineering methods, theories, and research techniques in the investigation and solution of technical problems. Plans technical projects in the design and development of EDA/CAD software. Defines and selects new approaches and implementation of EDA/CAD software engineering applications and design specifications and parameters. Prepares design specifications, analysis, and recommendations for presentation and approval. May specify materials, equipment, and supplies required for completion of projects and may evaluate vendor capabilities to provide required products or services. Interfaces with various cross functional teams (RF, Acoustic, Module, Digital IC designers, Foundry Process Technology and Modeling, IT, Legal, Finance, Procurement, and Operations) and external vendors to drive and incorporate the latest design solutions in the production program to improve cost, operational efficiency, productivity, and time to market. This role requires: Taking responsibility for own work and making decisions with direct impact to designers and their flows. Exercising creativity to troubleshoot technical problems or deal with novel circumstances. Using deductive problem solving to solve moderately complex problems; most problems have defined processes of diagnosis/detection; some limited data analysis may be required. The responsibilities of this role do not include: Influence over key organizational decisions. Role in strategic planning.Principal Duties & Responsibilities Assists in the modification and/or development of tools and workflows that improve productivity and efficiency of design team. Knowledge of RF circuit simulators (e.g., AWR, ADS) Knowledge of RF EM simulators (e.g., Ansys, Momentum, Comsol) Fundamental knowledge of programming languages (e.g., C#, Python) to optimize features and tools. Provides timely and accurate responses to basic questions and issues from customers (e.g., design engineers), often relying on help from manager and/or project leads. Supports root cause analyses on basic customer problems to identify underlying issue. Identifies bugs in software and escalates issues to more senior colleagues. Assists in publishing (e.g., writing, reviewing, and editing) product technical documentation.IT Core Competencies Advanced user knowledge on Linux systems is a bonusMinimum Qualifications Bachelor's degree in Electrical Engineering, Computer Engineering, or related field.Preferred Qualifications 1+ years experience with Programming Language such as C#, C++, Java, Python, etc. 1+ years experience with scripting and automation environments. 1+ years experience with hardware design software such as layout, verification, schematic, timing tools such as ADS, AWR, Cadence SIP, etc. Master of Science or PhD in Electrical Engineering or related field preferred.Applicants: If you are an individual with a disability and need an accommodation during the application/hiring process, please call Qualcomm's toll-free number found here (https://qualcomm.service-now.com/hrpublic?id=hr\\_public\\_article\\_view&sysparm\\_article=KB0039028) for assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities to be able participate in the hiring process. Qualcomm is also committed to making our workplace accessible for individuals with disabilities. Qualcomm is an equal opportunity employer and supports workforce diversity.To all Staffing and Recruiting Agencies: Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.EEO Employer: Qualcomm is an equal opportunity employer; all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or any other protected classification.Our Work Experience is the combination of everything that's unique about us: our culture, our core values, our company meetings, our commitment to sustainability, our recognition programs, but most importantly, it's our people. Our employees are self-disciplined, hard working, curious, trustworthy, humble, and truthful. They make choices according to what is best for the team, they live for opportunities to collaborate and make a difference, and they make us the #1 Top Workplace in the area. Employment Notices for US-based Job Postings Equal Employment Opportunity (https://www.eeoc.gov/sites/default/files/migrated\\_files/employers/poster\\_screen\\_reader\\_optimized.pdf) \"EEO is the Law\" Poster SupplementPay Transparency NonDiscrimination Provision (https://www.dol.gov/sites/dolgov/files/ofccp/pdf/pay-transp\\_%20English\\_formattedESQA508c.pdf) Employee Polygraph Protection ActFamily Medical Leave Act (https://www.dol.gov/sites/dolgov/files/WHD/legacy/files/fmlaen.pdf) Rights of Pregnant EmployeesDiscrimination and Harassment (https://www.dfeh.ca.gov/wp-content/uploads/sites/32/2020/10/Workplace-Discrimination-Poster\\_ENG.pdf) California Family Rights ActPrepare and succeed Qualcomm Interview FAQs (https://www.qualcomm.com/company/careers/faqs) Employment Fraud Alert We have received reports of employment scams that seek financial or personal information from job candidates. Please note these communications are fraudulent. Click here (https://www.qualcomm.com/employment-fraud-alert) to view our Employment Fraud Alert."}