{"title":"Electrical Engineer II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALdr06Lpd64_Y3q6qiB6O7rB38isEkQjeq4nhPyESZF83rbBFrKDq88myAKLgBson15k7zOeAQtjHteQ8tku5X9OOGNCGrEdnZVpQQKdt_g0ZZkPUzE9GNC4GfXf5WwVjEteznRp5I48p8QAJZTuoA6I0GKFS1mrqoa4aaUH2O3bN9FIflotHju2Y8SneEx","source":"ziprecruiter","full_description":"OMNI is honored to be retained by CertTech, LLC in their search for an Electrical Engineer II to support their Kansas City and Albuquerque, NM operations. CertTech is a premier provider of test automation services, test systems and product solutions for global companies in highly regulated industries with an emphasis on government programs, military/aerospace, transportation and commercial avionics applications. This position is based in the Kansas City metro area. This position will work in a team environment to design and develop automated test equipment at the Lenexa and Albuquerque sites. This includes the collection of requirements, and design/ integration through field installation. This role will develop project schedules and cost estimates for the systems/subsystems for which they are responsible, in conjunction with the Program Manager. As part of the design team, the Electrical Engineer II will also develop operating and calibration procedures, acceptance test requirements, and perform periodic assessments of the system performance. CertTech is an ISO 9001:2015 certified company based in Lenexa, KS with offices in New Mexico, Michigan, Ohio, and North Carolina.The Electrical Engineer II contributes to the hardware design and development of products, systems, tests and automated test equipment. This position will provide advice on project costs, design concepts and design changes. They will also lead a team or individually prepare and install test solutions in accordance with project specifications and standards. This person must have a strong familiarity and experience with custom circuit design, troubleshooting and analysis skills including the use of simulation tools such as P-Spice, lab equipment, and the ability to lead the development and integration of sophisticated products and systems.  In addition to strong technical skills, the Electrical Engineer II must have good communication, project management and problem-solving skills with some responsibility for the preparation of deliverables such as planning documents, design documents, review documents, test strategy, test scripts, and reports. This role may also be required to perform training and consulting for CertTech’s clients.  Minimum 7-10+ years' relevant experience is required.Familiarity with and proficiency in the operation of standard laboratory test equipment (oscilloscope, signal generator, digital multimeter, network analyzer, spectrum analyzer).Previous experience with large system development and software engineering.Experience with National Instruments hardware and drivers. TestStand, Multisim, and Ultiboard experience.Extensive understanding of electronics, including data acquisition, signal measurement, schematics, trouble shooting, and circuit design.Proven team player capable of handling multiple assignments, with strong customer focus and excellent oral and written communication skills.Possess interest and ability to learn new technologies.Significant experience in one or more safety critical industry, including aerospace, medical, rail, energy and automotive.Bachelors or Masters degree in computer science, computer engineering, or electrical engineering is required.United States citizenship is required.Ability and willingness to obtain a government security clearance is required.Willingness to travel occasionally is necessary.CertTech Mission Statement:To be a key strategic supplier of innovative products, systems and services supporting development of advanced technology high reliability solutions. We are unconditionally dedicated to safe and reliable products where complex technologies touch humanity. CertTech Niche:Full life-cycle technical solutions to enhance customers' product quality. OMNI and our clients are Equal Opportunity Employers and seek diversity in candidates for employment. EEO Employer W/M/Vet/Disabled/Sexual Orientation/Gender Identity."}