{"title":"REMOTE Full Stack Software Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI99jfjN9tNweKwZubX53i7E6DVLvYPHdvPzLWLaefpM8QygsLWWkRHG0xJnoQ0o5bJZSd3Lftx6mfcjkY7m1LtvOY4iPDPeguCsGDPtqoc1f6StNS8gT5aFLH2KDAIXbf7N8eDxpOHy9jx0uZmYi2u-u0sePtWf4RaNzjdq-smg82Cr3tm9ayrNXqukg","source":"ziprecruiter","full_description":"REMOTE Full Stack Software Engineer Seeking a Full Stack Software Engineer to join a team of professionals who focus on the evolving cyber-security landscape, software hardening and intelligent systems, as we tackle the most challenging software issues through a constant stream of highly innovative research and commercial development programs.What You Will Be DoingReport to the Team Leader and Chief Product ArchitectDesign and implement new capabilities, working closely with other team members, delivering high-quality maintainable code. Collaborate with product management to convert customer requirements to solid designs and implementations.Work with product technical support to troubleshoot customer issuesAdopt and maintain third-party software (mostly open-source)Work with the testing team to design effective test strategiesParticipate in technical supervision of contractorsWhat You Need for this PositionBS in Computer Science or similar field, MS preferred3 years industrial experience (exceptional candidates with less may be considered)Experience with both front and back end web developmentExcellent Python skillsSolid experience with SQL; Postgres preferred.Solid experience with HTML, CSS, and JavaScript; experience with Typescript and Angular preferredExperience in an Agile/Scrum environmentProficiency with modern version control, CI/CD, and other software engineering toolsBig Plus to have:D3 and/or Vega-LiteOptimizing terabyte-scale databases C, C++, Java, and C# are highly desirable but not requiredWhat's In It for YouFor your hard work and dedication, earn a generous salary plus comprehensive benefits package and the ability to advance in your career path.So, if you are a Full Stack - Software Engineer who would enjoy working Remote, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}