{"title":"Trailer Mechanics New Competitve Wages - Military and Veteran Friendly","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJegz0fkOp7CsyFFygjLgyMHarCNVqi5IY3sfQOUPhchtSa9mdt1qpi71JSdggQ3c8vNrjblo79K_B4PUeh25WWZeN4rduGdH9mHxlvAHbMrPNL3XwUdaC42gvI2wJqraCYAjqligAeaLoL3eF6K4tfJwMWTulYY9UKcdtk5TW6VSN23X5TttubLagvDnzu","source":"ziprecruiter","full_description":"Trailer Mechanics New Competitive Wages - Military and Veteran Friendly Do you want to be recognized as a high performer? Tired of not getting the respect you deserve? Do you want to work for a company that prefers to promote its own people? Do you want to work for a stable employer? Are you tired of a work environment that doesn’t promote a team effort? Come and experience the difference with R+L Carriers. Earn 1 week of vacation after 90 days of employment Full Time, Sunday - Thursday, 2nd shift, 4:00 PM - 2:30 AM and 3rd shift 9:00 PM - 7:30 AM R+L Carriers also offers a paid training program for their Mechanics to further their career. R+L Carriers has an immediate opportunity for Trailer Mechanics at our Service Center. Responsibilities will include: Repairs and required preventive maintenance of trailers Inspect, trouble shoot, diagnose, and perform maintenance on equipment Perform safety inspections of equipment and prepares safety documents required by the Federal Motor Carrier Safety Administration (FMCSA), company and any other Federal, State or Local regulations Interpret work orders and technical manuals Repair or replace defective parts, components or systems Test repaired equipment for proper performance and to ensure that the work meets manufacturer’s specifications and legislated regulations Requirements / Qualifications: Experience in trailer PMs and repairs Must be able to lift 50lbs Must own your own tools Company Culture R+L Carriers is a family owned, privately held transportation company founded in 1965. Our business caters to the transportation and distribution industry and is designed to provide customers with superior service through efficient administration and innovative thinking. The Company prides itself in treating our employees and customers with respect and honesty. We believe each employee contributes directly to the Company’s growth and success. There are many other transportation companies capable of picking up and delivering freight. However, we believed our customers select us because of the efforts of our employees. Excellent Pay with Experience R+L Carriers offers an excellent compensation and comprehensive benefits package that includes Medical/Dental/Vision Insurance, 401(k) Retirement Plan with company matching contributions, Paid Vacation & Holidays, and free vacation lodging at our exclusive employee resorts in Daytona Beach, FL, Big Bear Lake, CA, Pigeon Forge, TN, and Ocean Isle Beach, NC. Employment Type: Full Time Bonus/Commission: No"}