{"title":"Cosmetic Formulation Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIjj9Ck6dQlcDlLMoPCNTn8VB6LuIkv4EUl4VEmH1PC5AxqS9Y4G8EjVdWYW5MVCVgKTUdDPycyVCKxfDFIG6GEYjZuo_4VuwNSl9dU2oVBWwBAv-mbWKj5tCOFjYAsE0_NtloXvbCsnIB-3jVpI3ntzPx0SvTU0zFULBTIxxIvfwVtqsgkfuRnOxu7Yeo","source":"ziprecruiter","full_description":"Enviromedica is a fast-growing natural products innovator, manufacturer and distributor located in North Austin, Texas. This is an exciting opportunity for a motivated team player to help drive the development of our natural and organic consumer products. Be a part of a growing company that is well-targeted to a values-driven community and based on integrity and product quality.Our beautiful facility includes plenty of natural light, contemporary design, and a new R&D lab with modern process equipment and instrumentation.Position Overview We are looking for a talented chemist to develop new formulas as well as optimize and/or reformulate existing ones. They should be comfortable formulating with natural raw materials and working within various natural and organic certification standards depending on project goals. RequirementsJob Duties & ResponsibilitiesCreate and develop innovative and differentiated product solutions from concept to commercialization with a focus on clean label formulations and green chemistry; modify or improve existing formulasMaintain clear and accurate records of formulations, procedures, observations, resultsOversee and direct process scale up, including manufacturing batch adjustments and troubleshootingConduct stability testing and troubleshoot unstable formulas to ensure commercial feasibilityMaintain working knowledge of raw material innovations and emerging research in the cosmetic science field by proactively researching new concepts, materials, processes, and technical opportunitiesSource and validate new raw materials according to internal standardsTrain and direct technicians in laboratory proceduresContribute to routine laboratory housekeeping and day-to-day functions of the R&D laboratoryMaintain a working knowledge of cosmetic regulations for cosmetics/active ingredient regulationsServe as a technical and problem-solving resourceSupport other R&D functions, PMG, RegulatoryOther duties as assignedRequired Skills & QualificationsB.S. or M.S. in chemistry, chemical engineering or related scientific discipline5+ years formulating experience in cosmetic / personal careWorking knowledge, and progressive understanding of natural emulsion techniques (o/w, w/o, and micro-emulsions), thickeners, surfactants, actives, preservation systemsCreative thinking, technical writing and organizational skillsMust be able to easily adapt to priority changes and able to work on simultaneous projects to meet established deadlinesAbility to work independently Please include salary requirements upon submitting a resume. BenefitsWe offer an encompassing benefits package including Medical, Dental, Vision, 401k, PTO and 8 paid Holidays per year."}