{"title":"Field Service Representative - Location El Salvador NEW!","location":"","salary":"","description":"","term":"$95 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAKW16-4Bk94j5xODN-US-k1JMn7txDPaIfEpGhhIGNS6Rdf5tKUvtRRu8VwK3qnPrfdeLemkV4IzGAJEKrViYdXVQuATGG4SLizLDho8oLMbq9wBvNxaXyr-z9z3k6PEHVU_ME5sf_1aGWsTfcutdxb3tiEPIme-p12Vyw18aWbHNwJMGGFWIEke7jhZJnA","source":"ziprecruiter","full_description":"This job requires the selected candidate to live in El Salvador for a minimum of 3 months, up to 4 months.Spartan is seeking a Field Service Representative (FSR) to join our team! As part of building partner capacities in El Salvador, SOUTHCOM has directed the employment of an FSR to El Salvador to provide training, maintenance and logistical support and training, as well as general program development, sustainment, and coordination in a temporary capacity.Required ​Qualifications:U.S. citizenshipMust speak and write fluent English and Latin America Spanish.The FSR will relocate to El Salvador for up to 4 months.Sufficient experience demonstrating successful past performance providing logistics training and support consisting of Material Tracking System operation and upkeep, keeping an active inventory of gear, the logging and monitoring of all items in possession, knowledge of best practices for controlling, transferring, issuing, exporting, and documenting material.Knowledge of and experience with ITAR / Commerce items for the purposes of shipping material.Knowledge and experience with documents needed to create shipments, Commercial Invoice, Licenses, DD1149’s, etc.Sufficient experience in deployed maintenance operations in Coast Guard equivalent near costal patrol vessels (NCPV) and other small patrol vessel maintenance (repair & preventative).Familiarity and expertise in the use of the Military Transportation System/MAC Air, the U.S. Mail System, and cost-effective commercial international shipments.Must be able to obtain and hold the required Theater and El Salvador to conduct the required duties.Proficient with Microsoft Word, Microsoft Excel, and Microsoft PowerPoint.FSR must be highly organized, team-oriented, enthusiastic, independent thinker, and collaborative.Preffered Qualifications:Prior experience with maintenance and operation of Boston Whaler, SAFEboat, Metal Shark, and other NCPV vessels.Prior coastal and maritime field service representative experience.Prior experience in coordinating with Host Nations, Government Contractors, and the U.S. Military.Previous experience in Program or Deployment Support.Previous experience working as a USG Contractor and USG Employee"}