{"title":"Software Engineering - Identity and Access Management Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK8SYvFnRfGHqz0RcO9UWzvLh93_WxcW7N1qv3pRZzRd9lR92PIaNfpqmC68K90q5ga1NBzDPnoMlH6QIfJpYdm4kqwmz1ssLHOv8cRovHDpUOZPpldOxHkF8MUSrb08uYY_THtOPGb9aFKzn8AHBYMdohShGogD-vkjpM7PgF8YklS2M1YOSJN3xcZA-g","source":"ziprecruiter","full_description":"As an experienced member of our Software Engineering Group we look first and foremost for people who are passionate around solving business problems through innovation & engineering practices. You will be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers globallyAs a Identity & Access Management Lead you will be responsible to Design and implement secure solutions on Target State architecture with new vendor products combined with chase technology to produce features to Chase customers. work with Architects and the other Development Teams to ensure that they understand the specifications to deliver a quality product to the business  and generate applicable scenarios for the technology functionality testing team. We are seeking a Senior Engineer to drive CCB customer authentication deliverables, working with various stakeholders.Typical Duties:Providing oversight on design, implementation and deployment of Identity and Access Management solutions. Assessing requirements for Identity and Access Management solutions to meet stakeholders needs. Analysis of long-term Identity and Access Management strategies aligned with enterprise requirements. Ensure Identity and Access Management solutions meet maintainability, reliability, sustainability, capacity and security requirements. Supporting the Program Management Office (PMO) and/or users to address their requests, questions, and concerns. This role requires a wide variety of strengths and capabilities, including:    BS/BA degree or equivalent experience    Min 5 years of experience in working with industry leading CIAM vendor products like ForgeRock or Ping.    Experience in implementing Mobile secure FIDO Solution using vendors like Transmit, Nok Nok or any other vendor is a plus.    Hands on Experience working with IAM products on Installation and configuration.    Must have work Experience in Architecting the IAM solution with high availability and resieliency for customer facing applications/client.    Extensive experience with Public Key Infrastructure (PKI) certificate authentication.    Experience with standard authentication protocols and frameworks such as SAML, OAuth 2.0 and OIDC.    Advanced knowledge of LDAP, directory services, application servers and network infrastructure.    Experience integrating and deploying Identity and Access Management (IAM) solutions to web-based and mobile applications for authentication and authorization.    Experience in integrating applications with SSO solution both interally and with third party applications.    Experience in Docker Container installation and configuration.    Experience in Orchestrating the Dockers using Kubernetes.    Experience in Automating the complete installation and CI/CD pipeline.    Experience in working with Python, Shell scripting in automating end to end deployment.    Experience in working with Devops tools like Jenkins, Ansible in CI/CD pipeline.    Strong knowledge on Linux/Unix.    Experience in Java/J2EE Enterprise Web Development is a plus    Sound understanding of application, data, infrastructure, and security architecture disciplines    Advanced knowledge of software architecture, design, and development principles and practices    Active participation in an Agile development process, including working closely with development and product/project managementOur Consumer & Community Banking Group depends on innovators like you to serve nearly 66 million consumers and over 4 million small businesses, municipalities and non-profits. You'll support the delivery of award winning tools and services that cover everything from personal and small business banking as well as lending, mortgages, credit cards, payments, auto finance and investment advice. This group is also focused on developing and delivering cutting edged mobile applications, digital experiences and next generation banking technology solutions to better serve our clients and customers.   When you work at JPMorgan Chase & Co., you're not just working at a global financial institution. You're an integral part of one of the world's biggest tech companies. In 14 technology hubs worldwide, our team of 40,000+ technologists design, build and deploy everything from enterprise technology initiatives to big data and mobile solutions, as well as innovations in electronic payments, cybersecurity, machine learning, and cloud development. Our $9.5B+ annual investment in technology enables us to hire people to create innovative solutions that will not only transform the financial services industry, but also change the world. At JPMorgan Chase & Co. we value the unique skills of every employee, and we're building a technology organization that thrives on diversity.  We encourage professional growth and career development, and offer competitive benefits and compensation.  If you're looking to build your career as part of a global technology team tackling big challenges that impact the lives of people and companies all around the world, we want to meet you.  So if you're ready to put your passion for technology to work in a way that makes a real difference, apply today."}