{"title":"Chemist (Consumer Products) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJiAnNZLp3Yvfx-7BGHiIJGHfv71cZBrqSaauvje7Per99SoiQDFrQEisNyPOU30Az0RywVwy2-UCfVGxzwHqwevzLji-g0MhEze0ij8OTRq_7DQU4EvsEeg2mKkb0jvKDe2KhxwR7lUjUE23mBSTzIioVoYlh1KB3AvAJM0093i8tJOQwCMGOKnllX2JmV","source":"ziprecruiter","full_description":"Company Description SGS is the global leader and innovator in inspection, verification, testing and certification services. Founded in 1878, SGS is recognized as the global benchmark in quality and integrity. With over 97,000 employees in 130 countries and operating a network of more than 2,400 offices and laboratories, we provide services to almost every industry by assuring quality and safety of products and services.Trusted all over the world, SGS is a market leader because we put 100% passion, pride and innovation into everything we do. We encourage new ideas. We welcome people who challenge the way we do things. And we will be 100% committed to helping you reach your full potential. Job Description As the Chemist you will evaluates the chemical and physical properties of various organic and inorganic substances for consumer product testing purposes. This is an entry-level role, the Junior Chemist learns to analyze and perform testing following official methods and laboratory SOP's and utilizing instrumentation. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Works under the supervision of the Senior Chemists/Chemists to perform the following job functions:With support - develops, reviews, submits, and files reports on client sample tests, correlation tests, calibration, validation, and other projects.Performs routine operation, maintenance, calibration, qualification, and ability to troubleshoot laboratory equipment/instruments under the direction of Senior Chemists or Chemists.Works with a senior team member to develop and validate analytical methods, Standard Operating Procedures (SOPs), and other operating, safety, and quality documents.Inputs and maintains technical information to support the laboratory functions/operations.Completes laboratory tasks and assignments within tight deadlines.Manages multiple projects as assigned.Maintains Laboratory Notebook.   Adheres to internal standards, policies, and procedures.Performs other duties as assigned. Qualifications Required: Bachelor's Degree in a Chemistry discipline5 years of experience as a ChemistPreferred:Bachelor's Degree in a Chemistry discipline and experience in Analytical Chemistry LaboratoryLanguage Skills: English - Intermediate level requiredMathematical Skills: Intermediate level required; knowledge of statistical analysis preferredReasoning Skills/Abilities: Intermediate level requiredComputer Skills: Microsoft Office Suite (Outlook, Excel, and Word) - Intermediate user proficiency requiredAbility to understand company Quality Management System ISO 9001 and ISO 17025 requirements in related tasksAwareness of of government, industry and other regulations, standards and methodologies including but not limited to - Restriction of Hazardous Substances (RoHS), American Society for Testing and Materials (ASTM), Waste Electrical and Electronic Equipment (WEEE), United States Pharmacopeia (USP), The Code of Federal Regulations (CFR), California s Safe Drinking Water and Toxic Enforcement Act (Prop. 65) and CONEG (Coalition of Northeastern Governors) & The Toxics in Packaging LegislationStrong attention to details requiredAbility to read and interpret documents such as safety rules, operating and maintenance instructions and procedure manualsAbility to execute detailed but uninvolved written or oral instructions  Additional Information SGS is an Equal Opportunity Employer, and as such we recruit, hire, train, and promote persons in all job classifications without regard to race, color, religion, sex, national origin, disability, age, marital status, sexual orientation, gender identity or expression, genetics, status as a protected veteran, or any other characteristics protected by law.To perform this job successfully, an individual must be able to perform each essential duty satisfactorily with or without reasonable accommodations. The requirements listed above are representative of the knowledge, skills, and/or abilities required.This job description should not be construed as an exhaustive statement of duties, responsibilities or requirements, but a general description of the job. Nothing contained herein restricts the company's rights to assign or reassign duties and responsibilities to this job at any time.If you are applying for a position within the United States and you have difficulty completing the on-line employment application because of a disability, please call 201-508-3149 for assistance and leave a message. You will receive a callback.  Please note, this phone number is not for general employment information but is only for individuals who are experiencing difficulty applying for a position due to a disability.Qualifications: Required: Bachelor's Degree in a Chemistry discipline 5 years of experience as a Chemist Preferred: Bachelor's Degree in a Chemistry discipline and experience in Analytical Chemistry Laboratory Language Skills: English - Intermediate level required Mathematical Skills: Intermediate level required; knowledge of statistical analysis preferred Reasoning Skills/Abilities: Intermediate level required Computer Skills: Microsoft Office Suite (Outlook, Excel, and Word) - Intermediate user proficiency required Ability to understand company Quality Management System ISO 9001 and ISO 17025 requirements in related tasks Awareness of of government, industry and other regulations, standards and methodologies including but not limited to - Restriction of Hazardous Substances (RoHS), American Society for Testing and Materials (ASTM), Waste Electrical and Electronic Equipment (WEEE), United States Pharmacopeia (USP), The Code of Federal Regulations (CFR), California s Safe Drinking Water and Toxic Enforcement Act (Prop. 65) and CONEG (Coalition of Northeastern Governors) & The Toxics in Packaging Legislation Strong attention to details required Ability to read and interpret documents such as safety rules, operating and maintenance instructions and procedure manuals Ability to execute detailed but uninvolved written or oral instructionsResponsibilities: As the Chemist you will evaluates the chemical and physical properties of various organic and inorganic substances for consumer product testing purposes. This is an entry-level role, the Junior Chemist learns to analyze and perform testing following official methods and laboratory SOP's and utilizing instrumentation. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Works under the supervision of the Senior Chemists/Chemists to perform the following job functions: With support - develops, reviews, submits, and files reports on client sample tests, correlation tests, calibration, validation, and other projects. Performs routine operation, maintenance, calibration, qualification, and ability to troubleshoot laboratory equipment/instruments under the direction of Senior Chemists or Chemists. Works with a senior team member to develop and validate analytical methods, Standard Operating Procedures (SOPs), and other operating, safety, and quality documents. Inputs and maintains technical information to support the laboratory functions/operations. Completes laboratory tasks and assignments within tight deadlines. Manages multiple projects as assigned. Maintains Laboratory Notebook. Adheres to internal standards, policies, and procedures. Performs other duties as assigned."}