{"title":"Field Service Engineer level- Manhattan NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJVLNgy5NvScJ9dGAjFd3tj9_uWj70MF_o1jFoqqI_nJPTRz50BkMy99uueqFyh6NwJx7oUxzZlaiWvp109xFFTM19kiuzsbNwMjaFrU0-cRRuELZiel8bF6ZJTj4gPRng3P8j6dZdAKq-2yWsGaNDTJuvJWuzR465AGb4pKKvxNoqZwnq-9ETTlRuzecA","source":"ziprecruiter","full_description":"Together, we can beat cancer.At Varian, we bring together the worlds' best talent to realize our vision of a world without fear of cancer. Together, we work passionately to develop and deliver easy-to-use, efficient oncology solutions. If you want to be part of this important mission, we want to hear from you.Copy from previous posting for NYC. 2nd shift Mon. through Friday. Must reside in Bronx NY or Manhattan NY.The Field Service Representative (FSR) is the primary contact for Varian Medical Systems (VMS) customer service and repair needs ensuring that our customers' equipment operates efficiently at all times. The Hardware FSR is responsible for troubleshooting, repairing, installing, upgrading and performing preventative maintenance on all designated VMS equipment according to instructions and company guidelines. Each FSR operates in a designated field service territory and represents VMS. This requires a high level of professional communication with their team, customers, management, sales, and other technical support.Troubleshoot, diagnose, and repair all designated VMS equipment within an assigned service territory, including preventative maintenance, installations, and upgrades per VMS guidelines.Manage time and maintain a schedule to include preventative maintenance, installations, and upgrades as well as incoming customer calls demonstrating the ability to assess and prioritize the urgency of customer requests and follow-through to completion.Understand and recognize the need to escalate incidents when necessary and/or request additional assistance from more tenured representatives.Examine difficult customer issues, diagnose and resolve the issues, and meet established FSR levels.Maintain effective territory management and expense control which includes timely completion and submission of field service and expense reports along with management of consignment and other required documentation according to VMS procedures.Develop and maintain strong customer relationships through the use of strong written, verbal, and interpersonal communication skills.Minimum Required Skills and Knowledge:Frequent use and application of technical documentation, standards, principles, concepts, and techniques in the field.Uses acquired job skills and company policies to complete assigned tasks.Sound knowledge of and professional experience with electronic and electro-mechanical engineering, testing equipment used for verification/checkout and calibration of electronic equipment.Sound knowledge of and professional technical experience with micro-computers/PC based systemsSound computer usage and debugging skills. Ability to identify and repair routine software and delivery system network problems.Identify and resolve simple imaging system defects.Performs routine maintenance, including major STBs.Proficient at diagnosing and solving moderately complex mechanical problems, including simple vacuum leaks.Able to perform vacuum system gun replacements and target replacements. Achieve certification status for C3 productsMeets all Vendor Credentialing requirements necessary to gain VMS client site access, unless prohibited by law. These requirements vary by client and may include, but are not limited to: Proof of valid identification (photo, driver's license, SSN) Criminal background checks Drug screens Immunizations (Hep B, MMR, Varicella, Influenza, Tetanus) Annual TB testing Healthcare trainingsMinimum: HS Degree or Equivalent Preferred: Associates degree, technical /vocational training or military experience with electronics and 2 - 5 years of related experienceOther Desired Skills and Knowledge:Able to handle difficult customer situations including troubleshooting while the customer is observing.Is assigned as primary support for machine accounts for which certification has been completed.Be able to understand and utilize the escalation process to Sr FSR, Management, NTS, PSE, Applications Required Certifications and Training: Has completed all required VMS training classes for C3 products Has completed VMS HW Level II and Imaging Level II certification testing.Experience Level with Business Tools: Familiar with business tools such as E-mail, Microsoft Word, Excel, and PowerPoint. Experience with HCM (e.g., Workday) or equivalent ERP product and productivity software desired.Fighting cancer calls for big ideas.We envision a world without fear of cancer. Achieving this vision takes dedication and commitment from all of us, every single day. That's why we celebrate and value the distinctly beautiful and intersectional identities of each of our employees. We are a mirror of our patient-base, which allows us to innovate. Big ideas come from everywhere, and the best ideas are fostered by our unique individual experiences. At Varian, we encourage you to bring your whole self to work and believe your bold and authentic perspective will help to power more victories over cancer.#TogetherWeFightPrivacy Statement"}