{"title":"Mechanic ($5,000 Hiring Bonus)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALr6OKfESmQTvN8TeP1LAf5P9rEaFMY45OIKqk5Twv-jxkunHhBvHT-4waDdKa0RPPMjBgtsDQK1voBI20jy8xxNU-3WktXG3ZmwsvQYeEIqSi_kYfBfi2OwEy9bH9qvlIip6LHSyO9WnJoW3ENRx96Js4z2zSmi1zj5cxEwVx90mSyQxf4pOybK3vCANKJ","source":"ziprecruiter","full_description":"Mechanic ($5,000 Hiring Bonus) - ( 2101EQ ) Primary Location : US-CO-Aurora Shift : Variable JOB SUMMARY The Mechanic will perform skilled repair and maintenance of transportation vehicles and dock equipment; inspect motorized and mechanical equipment; maintain inventory; and diagnose problems and determine the extent of necessary repairs ESSENTIAL DUTIES AND RESPONSIBILITIES 1. Repair, adjust and overhaul a wide variety of diesel and gasoline engines in transportation vehicles and dock equipment. 2. Comply with all company policies, local work and safety rules, as well as federal, state, and local regulations that govern the industry. Perform the required paperwork and/or computer records accordingly. 3. Inspect, repair, replace and modify components of engines including drive lines, transmissions, brake systems, clutches, and steering assemblies. 4. Repair or replace ignition parts, diesel injectors and carburetors. Replace faulty parts including wheel bearings, shock absorbers, oil seals, emission systems, exhaust systems, generators, distributors, lights and switches. 5. Perform routine servicing, lubricating, and greasing of vehicles.  6. Perform electronic diagnostics and troubleshoot electrical systems; repair and replace faulty components including wiring. 7. Use welding equipment to fabricate, rebuild and strengthen various equipment parts. 8. Determine serviceability and replacement needs for vehicles and equipment.  9. Maintain an inventory of fluids, parts, and equipment, and perform some physical plant maintenance. 10. Remove, repair, and mount tires and maintain the tire inventory. 11. Perform pre-trip equipment inspections, including ensuring that permits are valid and units are clean and fueled.  12. Participate in training programs; maintain and update safety skills and knowledge; keep current with hazardous material training requirements. COMPETENCIES 1. Adaptability - Maintaining effectiveness when experiencing major changes in work responsibilities or environment (e.g., people, processes, structure, or culture); adjusting effectively to change by exploring the benefits, trying new approaches, and collaborating with others to make the change successful. 2. Building Trusting Relationships - Using appropriate interpersonal styles to establish effective relationships with customers and internal partners; interacting with others in a way that promotes openness and trust and gives them confidence in one's intentions.  3. Collaborating - Working cooperatively with others to help a team or work group achieve its goals. 4. Communication - Conveying information and ideas clearly and concisely to individuals or groups in an engaging manner that help them understand and retain the message; listening actively to others. 5. Continuous Learning - Actively identifying new areas for learning; regularly creating and taking advantage of learning opportunities; using newly gained knowledge and skill on the job and learning through their application.  6. Initiating Action - Taking prompt action to accomplish work goals; taking action to achieve results beyond what is required; being proactive. 7. Work Standards - Setting high standards of performance for self and others; assuming responsibility and accountability for successfully completing assignments or tasks; self-imposing standards of excellence rather than having standards imposed. BENEFITS + Competitive pay based on experience + Employee selected medical, dental, and vision coverage for you and your family + PTO and paid holidays + 401k Retirement Plan MINIMUM REQUIREMENTS 1. High school diploma or equivalent.  2. Experience in equipment maintenance. 3. Mechanical background with a basic knowledge of equipment. 4. Effective verbal, written and interpersonal communication skills. PREFERRED QUALIFICATIONS 1. College degree or technical certification. 2. Experience in trucking, LTL or diesel mechanics. WORKING CONDITIONS Environmental working conditions vary and employee may encounter vibration, noise, odors, and extremes in temperature and wind as well as exposure to varied weather, varied surfaces, sharp edges, varied lighting and confined and congested areas and occasional exposure to petroleum-based products such as gasoline, diesel fuel, oil, grease, dust, fumes, and chemicals. PHYSICAL DEMANDS The position requires the ability to sit, stand, walk, and maintain balance for extensive periods of time. The ability to frequently lift up to 58 lbs from floor to above the shoulder and horizontally, and carry objects up to 50 feet. Occasionally lift up to 80 lbs. Seldomly lift up to 100 lbs. Ability to push/pull up to 128 lbs for extensive periods of time. Ability to perform repetitive tasks; stretch, turn, twist, and reach overhead; bend, crouch, squat, kneel and stoop for extensive periods of time. Yellow Corporation, along with all subsidiary companies, are an Equal Opportunity/Affirmative Action Employer Req ID: 2101EQ"}