{"title":"EUC Technical Support Engineer (IDM) - Opportunity for Working Remotely","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIhxWMe7wgrMu3C9F7NJEd2QOAM9t9bjnfEJhjGQzUDWmaGOlWXGccsu4ReOcdL4bItXyBmaDnEoqjgw0MjkbmC87T-NjnLahAxEETQ_YEm-FEDStJqOLkpMMK2o_qp_pM9uurZcKGY93hMqJgixGsfThv3saWMvAvIm5eCTREnRK4_bO2NpI_MShnQG2gW","source":"ziprecruiter","full_description":"**Job Description**VMware End-User Computing is empowering the digital workspace. In the age of mobile and cloud, consumer devices and application experiences are shaping how businesses drive digital transformation. Consumer experience is changing employee expectations, creating new application demands and forging new opportunities to change business processes.We are looking for an End-User Computing (EUC) Subject Matter Expert to support our continued growth in our Workspace ONE UEM Platform. This individual will help customers implement and support Workspace ONE for Access with UEM (IDM). In addition, this individual will need to have a strong understanding of Connectors, SAML with third party IDP, SSO, Kerberos, Hub Catalog and Horizon Integration. This position is a with the T3, back-line support team, helping our front-line teams. As a T3/Subject Matter Experts, you are the last line of support escalation and will be responsible for driving the most complex and critical situations to resolutions for our customers.POSITION OVERVIEW:+ Provide best practices and support for customers who have deployed Workspace ONE Access. Additionally, be a trusted advisor for all things related to Identity Management. + Driving resolution through end-to-end ownership of critical customer issues. + Collaborate effectively with other cross functional teams such as Engineering/Saas Ops/Net Ops/Deployments and Professional Services to resolve customer issues effectively. + Create and maintain documentation to support internal and external customers with self-help materials. + Set correct expectations and drive relief through effective communication. + Identify customer issue trends and pro-actively partner with relevant teams to drive improved customer experiences with our products.TECHNICAL RESPONSIBILITIES:+ Experience with App Integration, Okta, ADFS, GSuite Integration, PING Federate, Azure SAML Integration for UEM + Experience troubleshooting both SaaS and On-Premise deployments for Access + Experience with hands on labsPOSITION REQUIREMENTS:+ 3+ years of experience providing technical support/consulting services to enterprise-level clients. + Strong communication and customer management skills. + Ability to work independently and perform well under minimal supervision. + Ability to cover Eastern time zone for hours of 9a-6p (ET) + This role is fully remote and can be done anywhere in USA + This job requisition is not eligible for employment-based immigration sponsored by Vmware**Category :** Client Support **Subcategory:** Technical Support **Experience:** Manager and Professional **Full Time/ Part Time:** Full Time **Posted Date:** 2021-03-02VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what's possible today at http://careers.vmware.com.Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law."}