{"title":"Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ0XaZZP52NmfE2FXIh7-ERh9zQJS5JcwiPgykmO8HPj40IRn0GAayU_IjpXCtYmdBEhOnxMkDUAbZ65nBaG_fkAU__WYhLTr2AASG__cQ5w1DhQfN7k7XbGvtCeK9joltEc3OREA6cswsT1CqjgAsPSKYiTr80W_E_JBoSB6NV8GsEmc-hOw_txrOlytg","source":"ziprecruiter","full_description":"Join Triumph Business Capital!At Triumph Business Capital, we believe the strength of our commitment is reflected in product innovation and the strategic partnerships we've established. That's why we look for team members who work hard to make a difference in their workplace and community. Our goal is to make long-term improvements in everything and everyone we touch. We thrive on providing exceptional customer service, and we look for friendly professionals dedicated to helping customers achieve their financial goals.Position Summary:The Developer supports the Solutions team in implementing custom systems and applications aligned to business requirements. The Developer (C#, .Net Core, SQL) is responsible for the development of web and other applications through the entire software life cycle. The Developer will need to be familiar with implementing application design principles including security, performance, scalability, error logging, and testing. The primary technologies used in this position are C#, .Net Core, JavaScript, React and SQL deployed to a Linux, Docker, AWS, Kubernetes environment. Familiarity and experience with Open Source technologies is preferred.Position Description:Essential Duties & ResponsibilitiesImplement custom-developed web applications to assist internal business partners.Work with Business Analysts to understand business requirements and effectively size tasks.Analyze, code, test, debug and support new and existing applications.Maintain, troubleshoot, optimize, and improve existing applications and system.Contribute to the development of a product through the entire lifecycle of analysis, design, coding, testing, deployment, and support.Develop application code that is secure, performant, scalable, fault tolerant, and testable.Utilize analytical, process and/or technical skills to meet project objectives and deliverables that are self-directed and within project scope.Work within a cross-functional team to develop enhancements in a highly iterative fashion that involves close collaboration with product owners, developers, and testers.Communicate project issues and/or risks in a timely manner.Identify critical paths to meet business deadlines.Be able to operate in a highly regulated environment (SOX Compliance).Experience & EducationThe successful candidate will possess business operations experience and skills, analytical and critical thinking skills, and attention to detail. Additionally, the ideal candidate should possess the following:3+ years application development experience in a professional environment.Experience identifying customers business needs and providing a technological solution.Strong technical, logical, analytical, and problem-solving skills.Experience with .NET Core Framework.Understanding of modern JavaScript frameworks such as React, Redux, Angular or equivalent.Experience with Microsoft SQL Server and Entity Framework or equivalent ORM.Understanding of Bash/Linux, AWS, Kafka and Kubernetes technologiesExperience with agile implementation methodologiesBachelors Degree, preferably in Computer Information Systems, Computer Science or related field, or equivalent skills and experience.Skills & Abilities Required3+ years development experience.Familiarity with the Microsoft Web API 2.C#, ASP.NET, .Net Core and Visual Studio 2019 skills preferred.HTML, CSS, JavaScript, React or equivalent.MS SQL Server.Strong background in building scalable, high quality and high-performance application on the Microsoft technology stack.Excellent communication skills.Ability to self-direct and effectively manage time.Strong initiative and drive with high productivity and work ethic.We offer Medical, Dental, Vision, Paid Time Off, 401k and much more.Go on. Do it. Apply Today!"}