{"title":"Junior RF Engineer NEW!","location":"","salary":"","description":"","term":"$70,000 to $90,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJM7uU3bF-Jb633nhkBjtDKr0u5wf8ysoV9U2TgEoX7BbR2wj-qwHK3_o-taRct-abkmiIj4SiYvCUBBVpkuiyuo-dUUgThzetIWI_1wnOPYQlfM4Wa54T-MtCXqyRlkmf4Al2Z8-xc8VmJEUHqI9umpmtnTYLsyhP5vL-W-D8L3B2HDSIvPiNrg04fQxsC","source":"ziprecruiter","full_description":"Description: Opportunity to work with a leading wireless centric network integration firm. Position requires wireless network design support for indoor WiFi networks and Outdoor WiFi networks, to also include wireless Point-to-Point and wireless Point-to-Multipoint equipment.‪Products handled by this position All major data network equipment, to include but not limited to, Ruckus, Aruba, Cisco, Mimosa, Ubiquiti, Cambium, Siklu, and SIAE. Tasks will require wireless assessments, wireless surveys, wireless network design for Outdoor Networks and Indoor Networks, installation assistance and support.‪Responsibilities:• ‪Pre-sale system design• Some Project Management• Hardware/Software configuration and installation support• Indoor Wireless LAN Design and Site Surveys using Ekahau or AirMagnet• Outdoor Wireless Network Modeling using EDX Signal PRO program• Use Global Mapper for Wireless Network Design Services• Link Budgets calculation for Microwave Licensed and Unlicensed Links• Understanding of FCC recommendations and regulations for unlicensed and licensed bands.• Basic knowledge of Radio wave propagation principles.• Understanding of Radio antennas parameters- gain, antenna pattern,• Basic Understanding of IP Network Configurations• Channel planning for WiFi networks• Post installation support• Maintenance, troubleshooting and repair of deployed solutions• Client training• Occasional Travel‪Qualifications:• Minimum 2-4 years Experience• College or Tech School Graduate, or Certifications• Excellent Client Service Skills• Excellent Communication Skills• Ability to Organize Tasks for Efficiencies• Experience with the following hardware and software:◦ WiFi Network Hardware◦ Point to Point Wireless Network Hardware◦ Point to Multipoint Wireless Network Hardware◦ Licensed Microwave Equipment• Experience with IP network design is a plus• Experience with network switches and routers is a plus• Ability to understand and troubleshoot various hardware and software.• Ability to read and understand manufacturer documentation.• Experience and understanding of network technologies"}