{"title":"Assistant Professor of Chemistry NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIc4Ah9hgs8ME5en5LFr7LgOLiNLxCUOwI-p8KPvamXuFm8pLRDn8OPCvJNH5x_ZUzBHHzjEwWzzZBqzcQ2VpaZYrOz68o5PPwCLznkWDJrhLGM94G3-W_JLIN-HdlE6eHU5Io9SDY0hiXgI-nAurQj1mFWLIEyjT03Zx3XxapdelkAaZa0mBX5ewhV1aBk","source":"ziprecruiter","full_description":"Assistant Professor of ChemistryPrint (http://agency.governmentjobs.com/colorado/job\\_bulletin.cfm?jobID=2969259&sharedWindow=0) ApplyAssistant Professor of Chemistry Salary $51,000.00 - $57,000.00 Annually Location Pueblo, CO Job Type Full Time Department Colorado State University Pueblo Job Number GGJ-09309-01/21 + Description + Benefits + Questions Department Information The chemistry department is approved by the American Chemical Society (ACS) to offer ACS-certified degrees and stresses excellence in teaching. The faculty believe that providing opportunities for research is an integral part of an undergraduate education. The department has excellent facilities and a wide array of instrumentation to support undergraduate and masters level research. The chemistry department is a Colorado Commission of Higher Education designated Program of Excellence with a substantial array of instrumentation including FT NMR (2), GC/MS (3), GC-FID (3), AFM, LC/MS, LC/MS/MS, ICP-MS, UV-Vis, HPLC, SEM and FTIR (2). Faculty and students are active in both undergraduate and master's level research. The goals of the program are 1) to prepare graduates in the discipline of chemistry to become productive members of the profession whether they go on to industry, post-graduate education or other areas, 2) to prepare students in the verbal, written and quantitative skills that are prerequisite to advanced study or careers in chemistry, 3) to prepare students in the theoretical principles of chemistry as well as in the laboratory approach to problem solving, 4) to maintain certification of the program through the American Chemical Society (ACS), and 5) to provide a variety of emphasis areas and minors including a basic chemistry degree, an ACS certified degree, biochemistry emphasis, chemistry/teacher certification emphasis, environmental chemistry emphasis, chemistry minor, and a double major option. Description of Job **All responsibilities of faculty members at CSU Pueblo are in accordance with the Faculty Handbook. The Faculty Handbook is the authoritative guide on specific requirements with regard to teaching assignments, scholarly activity, research, and service.This tenure track, nine-month (with summer teaching possibly available) position provides teaching, scholarship and advising/service to the chemistry department. The Chemistry Department also houses the Cannabis Biology and Chemistry degree option. All faculty may have opportunity to teach courses within this curriculum.Primary Duties+ Teaching baccalaureate and master's level courses in the chemistry program in accordance with program needs. This includes preparing and presenting course materials; administering appropriate tests; evaluating student outcomes; selecting and ordering texts; preparing, administering and grading assignments; and assigning final grades. It will also include proposing curriculum changes and program modifications to the Department Chair. + Engage in scholarly activity including grant writing, preparation, and submission; scholarly work appropriate to the discipline while including undergraduate and graduate students in research when possible and appropriate; and dissemination at appropriate national, region, and local venues. + Conducting student advising and mentoring to ensure appropriate course and field work is completed to accomplish program objectives. This requires the faculty member to establish, post, and communicate to students at least five regularly scheduled office hours. Participating in student recruitment, campus meetings, University, college and department committees, University functions and other duties as assigned. Minimum Qualifications, Substitutions, Conditions of Employment & Appeal Rights Minimum Qualifications+ Ph.D. in biochemistry, broadly defined OR Ph.D. in biochemistry, broadly defined awarded by the initial contract start date.Preferred Qualifications+ Post-doctoral experience. + Previous college-level teaching experience. + Online / Hybrid teaching experience. + Preferred experience in fields of research that complement momentum in the department and university. + Successful grant writing experience. Supplemental Information All interested candidates must apply through the on-line application system. No other format of application materials will be accepted.Applicants must attach the following documents, in order to be considered for this position: + a letter of intent (cover letter); + a current resume or CV; + unofficial or official transcripts showing degree conferred or evidence of active enrollment in Ph.D. program; + three professional references with contact information to the on-line application. + Teaching Philosophy + Research Plan + Diversity StatementApplications submitted without the required attachments above will be considered incomplete and will not move forward in the selection process. Once submitted, applicants will not be able to make changes or add information to their application packet, with the exception of their personal contact and demographic information.Early submission of application materials is encouraged. Screening of application materials will begin immediately and continue until the position is filled, though all applications received by 4 p.m. (MST) on Tuesday, March 2, 2021 will be given full consideration.About Colorado State University Pueblo Colorado State University Pueblo is a comprehensive state university with an enrollment of 4,000 students. CSU Pueblo provides relevant professional coursework and superior instruction with a small student-to-faculty ratio for an ever-changing global economy. Students can choose from 35 undergraduate programs with 81 fields of study in the College of Science, Technology, Engineering and Mathematics; the Hasan School of Business; the College of Humanities, Arts and Social Sciences; and the College of Health, Education, and Nursing; and 13 graduate programs. CSU Pueblo is dedicated to interdisciplinary learning and entrepreneurship that elevates our people and our community, creates educational opportunities, fosters unique collaborations, and supports inclusion, access, and affordability as a gateway to the world. CSU Pueblo is equally committed to serving the diverse population of the region; this emphasis is reflected in the demographic characteristics of the student body. Because more than 25 percent of our students are Hispanic, the Federal Government has designated CSU Pueblo a Hispanic Serving Institution. Besides reflecting our commitment to serve this critically important and rapidly growing segment of the student population, that designation also allows the University to compete for certain federal grant funds to support its ability to better serve all students. Among its unique features, CSU Pueblo is one of seven schools in the nation to offer a degree in mechatronics, which combines electrical and mechanical engineering. The Hasan School of Business ranks among the top 15 percent of all business schools internationally with graduate and undergraduate programs in business administration accredited by the AACSB International Board of Directors. The College of STEM houses an undergraduate engineering program that was ranked in the nation's top 100 by U.S. News and World Report. CSU Pueblo has an ever-changing campus landscape that features a newly renovated Library, a new general academic classroom building, and a newly renovated and expanded student center. At CSU Pueblo, Student Life offerings have increased significantly with the transition of the campus from a commuter environment to a more traditional collegiate experience. Competing at the NCAA Division II level, CSU Pueblo is a member of the Rocky Mountain Athletic Conference and offers 22 varsity intercollegiate sports and also has active intramural and club sports teams that allow students to get involved in campus life.Colorado State University Pueblo offers a comprehensive benefits package including: + Medical Insurance and Prescription Drugs + Dental Insurance + Vision Insurance + Flexible Benefit Plan + Basic Term Life Insurance + Voluntary Term Life and AD&D Insurance + Long-Term Disability Insurance + Employee Assistance Plan (EAP) + Travel Accident Insurance + Voluntary Critical Illness and Accident Insurance + Wellness Incentive Program + Annual & Sick Leave + Retirement Plans About Pueblo, Colorado The city of Pueblo is a historically and culturally rich, diverse city of more than 100,000, located in the southern part of the state along the Arkansas River near the Wet Mountains and the majestic Sangre de Cristo range. Pueblo enjoys ideal year-round climate with four distinct mild seasons, crisp mountain air and 300+ days of sunshine per year. Pueblo attracts outdoor enthusiasts to a full slate of summer and winter recreational activities, encompassing water sports at Lake Pueblo, biking or running along Pueblo's beautiful river trail system, golfing, tennis, hiking or skiing in the mountains to the west. The region is heavily agricultural, with large and small-scale farming and ranching, and a diverse mix of service, manufacturing, and technology industries. CSU P..."}