{"title":"Field Service Agent - Long Island, NY - Bilingual English/Spanish","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALvPAY7dkOYXPJktpkx_wLlRNuoE-sqRQZd1rDKnRp3ANnwpy6s_8Jz5kyP3nB_yGMMinDAyAAVMFYBkPJjkuwfrYWIpdWZ_aIZiCZjG55L3AaGnfFVrNrtJ1PUrOBTe08Rs_9EvaNY3gaEkHa4NvAT1onTwS68cAHoHu9Nfk0ZAm1VaCkGSUvSQPPH2xX5","source":"ziprecruiter","full_description":"The Field Service Agent acts as an in-person liaison between Healthfirst and its customers. The individual is responsible for assisting customers with issues and inquiries they may have about their insurance, applications and/or claims not paid. The Field Service Agent is also responsible for receiving and addressing member inquiries, resolution of customer complaints, client education, retention of membership and dis-enrollments.Duties and Responsibilities Include:Interacts with customers in person to provide information in response to inquiries about products and services.Improve overall member experience and reduce waiting time in order to expedite traffic flowIdentify, research, and resolve customer issues using appropriate methods and tools.Effectively manage face to face encounters.Register and educate members in the HF Member portal (access online services)Handle and resolve customer complaints.Ability to navigate through information systems to analyze the customer's situation.Serves as a liaison between the customer and various departments.Serve as Privacy Ambassador in order to ensure security, integrity and confidentiality of data/protect PHI in CBOCBO Triage on the weekends: Use OnContact and product knowledge to screen walk-ins and identify who is applying, renewing, making payment, inquiring MS, etc.Customer Support: Escalate member concerns to Enrollment & Billing, MS ResolutionsOther duties as assigned by the management team.Work flexible schedules, nights, weekends, holidays, and/or overtime with limited notice.Ability to multi-task, prioritize, and manage time effectively.Minimum Qualifications:High School Diploma or GED equivalent from an accredited institution.Work experience in a face to face or call center environment.Communicate effectively verbally and in writing while demonstrating good grammar, spelling and punctuation skills.Strong active listening skillsAbility to support business needs in Long Island, NY.Ability to read, write and speak English and Spanish proficiently.Flexibility to work any shifts between Monday thru Sunday.Preferred Qualifications:Associates Degree from an accredited institution.Must possess a valid NYC Driver License and have access to vehicle transportation.Compliance & Regulatory Responsibilities: see aboveLicense/Certification: NAWE ARE AN EQUAL OPPORTUNITY EMPLOYER. Applicants and employees are considered for positions and are evaluated without regard to race, color, religion, gender, gender identity, sexual orientation, national origin, age, genetic information, military or veteran status, marital status, mental or physical disability or any other protected Federal, State/Province or Local status unrelated to the performance of the work involved.If you have a disability under the Americans with Disability Act or a similar law and want a reasonable accommodation to assist with your job search or application for employment, please contact us by sending an email to careers@Healthfirst.org or calling 212-519-1798 . In your email please include a description of the accommodation you are requesting and a description of the position for which you are applying. Only reasonable accommodation requests related to applying for a position within Healthfirst Management Services will be reviewed at the e-mail address and phone number supplied. Thank you for considering a career with Healthfirst Management Services.EEO Law Poster and SupplementAll hiring and recruitment at Healthfirst is transacted with a valid \"@healthfirst.org\" email address only or from a recruitment firm representing our Company. Any recruitment firm representing Healthfirst will readily provide you with the name and contact information of the recruiting professional representing the opportunity you are inquiring about. If you receive a communication from a sender whose domain is not @healthfirst.org, or not one of our recruitment partners, please be aware that those communications are not coming from or authorized by Healthfirst. Healthfirst will never ask you for money during the recruitment or onboarding process."}