{"title":"Level 3 IT Support Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALjfKWw9TdRVtKR4ISNcf4wZEkWXzpS7eXcXA3D4XBzMq10aei1xUs3tSM_eAjACbv6l0vavPOpW1qyWfph00jHlqIdLHbQxvdLIzvbRWi7uo-d3QPiZFZxxiTu-Dggj6J8l7fRjsGI_6XQG6IEHzOUtIHHLIhHF5uME_PST7H8ROnwOZf7e_4bTLzkCog7","source":"ziprecruiter","full_description":"ABOUT THE COMPANY: Are you a motivated individual who loves technology? Do you thrive in a fast-paced environment? Love learning new technologies? Getting hands on experience? Have a great work ethic and people/communication skills? If the answer to the above is YES! Then Global Tech Solutions is the place for you. Global Tech Solutions is a fast-growing company that is seeking energetic and motivated professionals to join the Team. We are a MSP (Managed Service Provider) with clients in more than 30 states. Global Tech Solutions, a nationwide recognized MSP is expanding again. We are looking for a few well-rounded individuals who have solid technical skills as well as great communication skills. The ideal candidate will have a positive attitude and the ability to work with minimal management in a team environment where every member is an important part of our success. This role is a critical part of our client service delivery strategy. This is the opportunity to be part of one of the nations World Class MSPs. We are looking for leaders in the industry who are excited by the thought of being part of an innovative team and growing professionally. We offer excellent pay and benefits along with training. If you think you have what it takes, then provide us with a brief summary of why you think that you could thrive in this type of environment along with your current resume.SUMMARY: The Level 3 Technical Support Analyst role is to ensure proper computer operations so that end users can accomplish their daily tasks. This includes receiving, prioritizing, documenting and actively resolving end user help requests. Problem resolution may involve the use of diagnostics and help request tracking tools, as well as require that the individual give hands-on help at the desktop level.ESSENTIAL DUTIES AND RESPONSIBILITIES:Field incoming help requests from end users via telephone, email and work orders in a courteous mannerProvide onsite and remote support to end-usersRespond to assigned tickets/tasks in accordance with SLA guidelinesRecord, track, and document the help desk request problem-solving process, including all successful and unsuccessful decisions made, and actions taken, through to the final resolutionApply diagnostic utilities and best practice methodology to aid in troubleshootingUpdate technical support documentation via KBA when requiredSetup and support mobile devices (Android, iOS, Chrome OS, etc.)Troubleshoot Windows Desktop, Windows Server, and Microsoft Office applicationsUtilize RMM and PSA platforms to maximum efficiencyReact to service outages promptly with adherence to standard operating proceduresTake ownership of tasks and follow through to ensure complete resolutionTake a personal interest in and responsibility for, the quality of work performed or associated withPerform hands-on fixes at the desktop level, including installing and upgrading software, implementing file backups, and configuring systems and applicationsTest fixes to ensure problem has been adequately resolvedAct as final point of escalationParticipate in the On-Call RotationFollow all company policies and best practices such as accurate time trackingPerform related duties consistent with the scope and intent of the positionTravel Requirements: 15% - Mostly to out of state clients with an occasional visit to local clients.WORK ENVIRONMENT: Responsibilities may occasionally require an adjusted work schedule and/or evening/weekend hours in order to satisfy customer needs and position requirementsMINIMUM QUALIFICATIONS: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.EXPERIENCE:4 years’ experience in providing IT support at an MSP or similar IT organization2+ years of experience managing/deploying Windows Server (2012/2016/2019)2+ years of experience managing/deploying network devices (IE routers/switches)2+ years of experience in VMware/ESXI, Hyper-VAdvanced networking knowledge (TCP/IP, DNS, DHCP, SMTP, SMB, VPN, VLAN’S, etc...)O365 Administration/Support for multiple businesses concurrentlyConfiguration and management of Windows server, including VMs, Terminal Servers, RD Gateways, AD, DNS, Group Policy, PermissionsPowershell experiencePHYSICAL DEMANDS: While performing the duties of this job, the employee is regularly required to communicate with and present information to others and access information using a computer for several hours at a time.EMOTIONAL DEMANDS: The employee must be emotionally mature and be able to handle difficult and complex client and work-related situations. Candidates must possess strong problem solving, conflict resolution, and interpersonal skills. They must be self-driven and possess a positive mental attitude.COMMUNICATIONS SKILLS: Excellent written and verbal communication skills are essential, as well as effective organizational, multi-tasking, and prioritization skills. Candidates must be able to read, analyze, and interpret general industry periodicals, technical procedures and governmental regulations. They must exhibit an ability to professionally write reports, business correspondence, and procedure manuals. They must be able to interpret a variety of instructions furnished in written, oral, diagram, or schedule form. They must be able to effectively present information and respond to questions from clients, vendors, employees, and the general public.Job Type: Full-timeRequired experience:IT Support: 4+ years"}