{"title":"Trailer Mechanic NEW!","location":"","salary":"","description":"","term":"$22 to $24 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKFhItSVewOHgCUAUrY-3LlNYNW_ZoVpgQx57K-8WCh9e4He4mRpBIFONTlmMqw2hoNvl6QHIypnJCb6YmzNMgKFrsI7JbCd30Gts5Zr6Mc8PBlt-gTvBPkkO_rH7GOtLD93ld4Yn9oYH9F3lTGK4Z6oPU7D1SAGUVC70mHTTQ5dPzwZRGXiJnZRq-Rwjc","source":"ziprecruiter","full_description":"Global leading manufacturer of semi-trailers has an immediate need for Trailer Mechanics at their Concord, NC location. Full time positions with company benefits, bonus eligibility, paid uniforms, great work environment, and opportunity for advancement!*These are 2nd and 3rd shift opportunities.JOB DUTIES/REQUIREMENTSStrong mechanical / electrical / welding experience.Possess a solid work history (example: attendance, quality workmanship, strong work ethics, are you a team player)Semi-trailer/container body damage repair consisting of front radius', corner caps, side panel replacement, roof, and floor decking repair/replacement.Trailer preventive maintenance / service experience (brakes, s-cam bushings, air bags, pneumatic/hydraulics, electrical troubleshooting/wiringRepair a/o replacing swing/roll-up doors, hinges, latches, lift gates, rails, etc.Accustomed to working in a fast pace environment and completing assigned duties in accordance with company safety policies / OSHA regulations, and within a reasonably allotted amount of time.HS Diploma/GEDPHYSICAL DEMANDS/REQUIREMENTS:Position requires minimum of eight hours standing, bending, squatting, kneeling, pushing, and pulling with a full range of body mechanics/movements.Regularly required to lift and carry up to 35 (thirty-five) pounds. Frequently required to lift and carry up to fifty-five (55) pounds. Occasionally required to lift and carry up to seventy-five (75) pounds.Must be able to work in an environment requiring use of ladder, stairs, heights, platforms and climbing in and out of trailers or working under trailers in tight spaces.Must have ability to operate a variety of power and hand tools safely, work with compressed air safely, operate fork trucks, spotter trucks and utilize personal protective equipment (PPE)"}