{"title":"Senior Software Engineer (Non-Profit)","location":"","salary":"","description":"","term":"$80,000 to $120,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALRcm7LlG6dXeU37kDDyPCFmeuKScn5Q9vZKlKQHC0W9EjvdmMhHzicLwS4d38_mg6oyOlqC9gkM2MfM5I-B0VdF0ZUEf_nsnAr50i7maMJic4TqJUoTO5tNnd4C6nRkmacFqx_N0WlmzkNOBcZw1ob2vpRhvRXs_IZ4EOboLUn6v5lFf-0FRmwZfIPIvXF","source":"ziprecruiter","full_description":"Senior Software Engineer (Non-Profit)  Apply today if you are a Senior Software Engineer looking for a premier healthcare technology company! This position is a direct-hire and full-time!Title: Senior Software EngineerLocation: 100% REMOTE Salary: $80,000 - $120,000/yearRequirements: Python, JavaScript, ReactHeadquartered in the beautiful city of Austin, TX, we are a premier healthcare technology company connecting healthcare services, social services, and free assistance to people around the United States! Our company was founded in the early 2010s and has over 100+ passionate individuals pushing the boundary of healthcare and technology. We have created a software that allows everyday people like you and me to research, access, and sign up on services provided by the government we bet you've never even heard before. We provide a supportive working environment for our employees throughout their professional careers with us! Come here and see what we've got to offer!Top Reasons to Work with Us- Work 100% remotely from the comfort of your home!- We offer a competitive base salary of $80,000 - $120,000!- Work with a great team for a great cause!What You Will Be Doing- Develop new code using Python/React to upgrade our software- Debug and test any new features before deployment- Document! Document! Document!- Collaborate with our Director of Engineering on technical projects- Mentor junior software engineers coming up in our companyWhat You Need for this PositionAt least 3 to 10 years of software engineering experience with some of the following:- Python- Django- JavaScript, ReactNice to Haves (NOT REQUIRED):- API, web servicesWhat's In It for You- Competitive base salary: $80,000 - $120,000- Full benefits: Medical, Dental, Vision- 401 (K) with a generous company match- Generous Paid time off (PTO)- Vacation, sick, and paid holidays- Life Insurance coverageSo, if you are a Senior Software Engineer with experience, please apply today OR e-mail me your resume at caroline.veillon@cybercoders.com! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}