{"title":"Senior iOS Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIYt_YconqAgxFhPo-YvRl_wGUI_OoBuV41wxHvh9B5UiTR39Crn4C-Jx_0opRkx6X4VZ0eq9qHr0OGeMq5YmLOkhSfliz-FIZE3dneawWTwoB9ZLfMXXY9zLuKo3vDeJ9ZIfndlauYskU5ozJeUVCdVuVaSkiy4l8lA124ErtKTj5WFqJUh6vetqU2b84","source":"ziprecruiter","full_description":"Senior iOS DeveloperYoutopia®: We're on a mission to “Make Vibrant Health and Longevity to 120 a Simple and Achievable Reality for All of Us”! If that inspires you, keep reading.Our tribe is built on the foundation of love, driven by our massively transformative purpose. We strive to be heroes to Youtopians everywhere. That starts with living a life true to ourselves and representing the company with honor 24x7x365. On our team, we strive to help you dedicate 70% of your working time doing what you do best: building amazing things with other amazing people in a fast-paced environment. (and having a blast doing it!) Your accomplishments will be measured in “people served” and progress made daily.A unique opportunity exists at Youtopia® for a self-starter with a growth mindset to join our start-up where innovation is valued. We need a Senior iOS Developer to understand business needs, scope requirements, and build responsive, high-impact features for customers and internal teams.As our Senior iOS Developer, you will: Develop and maintain iOS mobile apps that are making material impact on our world for millions of users Explore business domains with technical and non-technical members toward clarity for building the right things right Work with peers, product designers, and product managers to ensure end-to-end testing and high-quality deliverables Participate in agile cycles (Scrum, Kanban) with certified peers and leadership Help establish and adopt best practices, including code reviews and documentation Mentor less senior team membersWhat you bring to the table: Mastery in delivering and maintaining responsive and feature rich iOS apps with great, engaging UI/UX at scale Effective collaboration; great communication is key to any project Constant curiosity; constantly learning and evolvingMinimum Qualifications 5+ years developing iOS apps Published multiple iOS apps in app store Experience with Swift, Objective-C Experience with Git or similar version control system Ability to improve and adapt to rapidly evolving programming environments Minimum Bachelor's degree in Computer Science or related technical field, or equivalent experiencePreferred Qualifications Experience leveraging CI/CD with automation platforms like bitrise Experience with feature flag utilization Familiarity with Jira or similar issue tracking product Experience working in startup environmentWhy you should work with us:Unique opportunity to work with an early stage, well-funded, start-up on the path to help millions of people achieve vibrant health through the power of optimal individualized nutritionTech debt is managed so you can take pride in what you createFlexible work environmentMedical, dental, and life insuran"}