{"title":"Full Stack JavaScript Software Engineer (React/Node)","location":"","salary":"","description":"","term":"$90,000 to $110,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKzMkNHwATC_br13aH96iWW230S0_7118bnCJzv39dEcWmbu95dbW9zk3-6pZbxg3hlq0Ey2JaX6_oD_lb_DAJNElGQUs6nwOhC7MF-8YFJr8UFPb_1yFmaSybWA4jTHJ9-DHvPmcsoVPmh30Q7ctOcUzupXNWWIjF2Zu_l7DJvUDtWaM5P1LIabQa4hgA","source":"ziprecruiter","full_description":"Full Stack JavaScript Software Engineer (React/Node) Location: Brooklyn, NYTitle: Full-Stack Software EngineerType: Full-Time, Direct HireCompensation: $90K-$110K base + .5%-2% equityLocated in NYC, we are a health-tech startup that is revolutionizing the mental healthcare space! We've created a platform that allows clients to thoroughly and efficiently find the right fit in a therapist. We are looking to hire our second engineer to work directly with our Technical Lead and CEO to continue building new features and take our platform to new heights! Join a profitable startup on the ground floor, take part in major product + company decisions, and play a pivotal role in the direction of our company!What You Will Be Doing- Deploy new features to our public-facing website improving UX and SEO- Build a client portal, scheduling tool, and messaging tool for communications - Optimize backend services, increase functionality, automate workflows, etc...What You Need for this Position3+ years of JavaScript development HTML/CSS/DOMBackend APIsReact, Angular, or VueNodeJS or other server-side technologiesSQL(+) AWS (ECS/RDS/ElastiCache/Route53/Cloudwatch)(+) Docker/Terraform/CI/CD pipelines(+) MariaDB/MySQL/Redis(+) SEO/server-side rendering(+)Frontend Testing(+)Integrating third-party APIs(+)HIPAA requirements..If you are a JavaScript Engineer with experience, please apply today and email caroline.veillon@cybercoders.com with the best time and number to reach you! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}