{"title":"Network Engineer III NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIMDREsK5tIgFafFU4QtRB2DVzZffqWBxPS3ylUibyS9So5dNIWrt9RWhMl9VRwvt34gPgddF619lp9IE_seIoj1Ig8tLWbr3Wr4v9eUk5w-nnPhQVq3VUP4SR0zVyTTFPVTopT_hSOhWIXMxEPZ2llvGhS574_Rl9BqZnCC1yGyR9SJBtTCO0wccbOG-g","source":"ziprecruiter","full_description":"Business Title: Network Engineer III Posting Location: United States - Colorado - Greenwood Village Posting Job Description: JOB SCOPECharter is proud to have a network that provides service to millions of users across the country. The Network Operations team is responsible for the implementation of approved network architecture and designs. The Network Engineer III  supports the planning, forecasting, implementation and identification of resource requirements for network systems of high complexity. As a member of the team, you will support network enhancements while following corporate standards. DUTIES AND RESPONSIBILITIESLead network planning, network architecture design and engineering.Integrates communication architectures, topologies, hardware, software, transmission and signaling links and protocols into complete network configurations.Evaluates new products, performs network problem resolution.Leads in the development and documentation of technical standards and implements approved methods of procedure.Designs corporate standards and develops network enhancementsWorks on one or more projects as a team leader.Provides tier support across organizations.Acts as a mentor to junior staffKnows, understands and follows company policy.Adheres to industry specific local, state, and federal regulations, as applicable.Proactively and consistently support all efforts to simplify and enhance the customer experience.Performs other duties as requested by supervisor.BASIC / MINIMUM QUALIFICATIONSBachelor's Degree in Computer Science, Electrical Engineering, or related field, and / or equivalent work experienceMinimum five (5) years of network engineering experienceMinimum three (3) years of experience with Cisco and/or Juniper.Minimum three (3) years of Data network experienceADDITIONAL JOB QUALIFICATIONS Experience in managing optical transport platforms service gateways (i.e. Cisco ONS, Infinera DTN / DTNx / Flex, Ciena).Experience with scripting and automation (Python, SQL)Solid knowledge of related industry specifications and standards IEEE, ANSI, Physical Media (Multimode Fiber, Singlemode Fiber, UTP, etc.), bridging, switching, routing, Ethernet and transport technologies and protocolsAdvanced knowledge in network design, network architecture, protocols and network topology. TCP/IP and the OSI model.Experience and knowledge in using ticketing and software tools to support the operationsKnowledge of network designing software, such as VisioAbility to work in a team environment, perform duties in a very fast pace environment and ability to learn new technology quicklyAble to read, write and speak the English language to communicate with employees, customers, suppliers, in person, on the phone, and by written communications in a clear, straight-forward, and professional mannerKnowledge of Microsoft Office and use of personal computer and software applications.PREFERRED QUALIFICATIONSCisco Certified Network Professional (CCNP or CCIP)Industry and vendor specific certifications and training (Cisco, Juniper, Alcatel-Lucent, etc.)Knowledge of industry products and servicesRequisition #: 276552BR Job Code: ENE311 Network Engineer III Position Type: Full Time Area of Interest: Engineering, Information Technology, Network Engineering, Network Operations, Technical Operations Business Unit: Network Operations Location: 6175 S Willow Drive Suite 100, 110, 200, 300, 400, 500, 600, 700, 800, 900 FCC Unit: 13541 Account Code: V02-304-5000-541 Controlling Establishment ID: 01905 - Greenwood Village S Willow Dr. More on Spectrum: The health and safety of our employees and candidates is very important to us. Spectrum has adopted virtual mobile recruiting tools that allow us to continue meeting new candidates. We look forward to \"virtually\" meeting you.The Spectrum brands (including Spectrum Networks, Spectrum Enterprise and Spectrum Reach) are powered and innovated by Charter Communications. Charter Communications reaffirms its commitment to providing equal opportunities for employment and advancement to qualified employees and applicants. Individuals will be considered for positions for which they meet the minimum qualifications and are able to perform without regard to race, color, gender, age, religion, disability, national origin, veteran status, sexual orientation, gender identity, or any other basis protected by federal, state or local laws. Work State: Colorado Work City: Colorado - Greenwood Village Posting Job Title (Do Not Exceed 250 Characters): Network Engineer III - CBO Service Transition Zip Code: 80111"}