{"title":"Palantir Field Service Representative / Trainer (TS clearance) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL_xZZsl8LbkcFlqUenJM7_5VkDTxRn67UuqcHofXQH4qt6T9qQht5dUAb7e9lmyE0g5C2fDBVNun0OabfffCf5D-vQHzLMO7KdrHxDFg7EuR7MVtzjIDL2mbIqithg7VszZsp8TKYsnpSUA0Sl9UQcZp-uTQowjCG6kBlKP4dxIEWdNC2p5IiH7JHRDnui","source":"ziprecruiter","full_description":"SAVA, an Akima Company, helps government customers strengthen national security, improve communications and collaboration, and secure the integrity of their data, information systems and networks. Our personnel enjoy competitive benefits packages and challenging roles in work environments committed to innovation, diversity and opportunity for career growth. As an Alaska Native Corporation (ANC), 100% of our company's profits go back to our more than 14,000 Inupiat shareholders that have resided near and above the Arctic Circle for more than 10,000 years. Our business helps support their way of life and contributes to the survival of a culture that has thrived in a challenging environment. Job Summary: We are looking to hire someone who is a seasoned user of the Palantir Gotham product to join our team.  This person will be someone who has used the Palantir program and understands its base capabilities and is able to translate that knowledge needed to support the customer needs.  This is a high energy team that is use to making things happen, so we welcome those willing to make a difference and join us. Responsibilities:Provide support for Palantir Gotham in a secure customized environment.Support will be via help desk means or travel to locations and interaction with customer.Minimum Qualifications: Active Top Secret with SSBI.3 years of progressive experience in a technical support position in a Windows-based IT environment.2 years of Intelligence Community (IC) operations, platforms, functions, and terminology experience.Demonstrated experience using OR supporting Palantir Gotham.Demonstrated experience managing integrated workflows including phone, chat, email, etc.Experience implementing standard operating procedures and technical documentation.Experience developing, facilitating, and implementing training plans on the use of IT software/system.Intermediate level experience in Microsoft Office Suite (Outlook, Word, Excel, PowerPoint, etc.).Experience performing data analysis and presentation using Excel statistical methods, charts and pivot tables.Travel Requirement: The candidate will be available for travel Sunday through Saturday, including Federal holidays, to locations within the United States.Travel to training locations will be reimbursed in accordance with Federal Travel Regulations.Desired Qualifications:  Bachelor's degree in computer science, information sciences, or a related field, is strongly preferred, but may be substituted with specific experience related to job functions.The duties and responsibilities listed in this job description generally cover the nature and level of work being performed by individuals assigned to this position.  This is not intended to be a complete list of all duties, responsibilities, and skills required.  Subject to the terms of an applicable collective bargaining agreement, the company management reserves the right to modify, add, or remove duties and to assign other duties as may be necessary.  We wish to thank all applicants for their interest and effort in applying for the position; however, only candidates selected for interviews will be contacted.  We are an equal opportunity employer. All applicants will receive consideration for employment, without regard to race, color, religion, creed, national origin, gender or gender-identity, age, marital status, sexual orientation, veteran status, disability, pregnancy or parental status, or any other basis prohibited by law.   We are committed to Equal Employment Opportunity and providing reasonable accommodations to applicants with physical and/or mental disabilities. If you have a physical and/or mental disability and are interested in applying for employment and need special accommodations to use our website to apply for a position please contact, Recruiting Services at job-assist@akima.com or 571-353-7053.   Reasonable accommodation requests are considered on a case-by-case basis. The dedicated email and telephonic options above are reserved only for individuals with disabilities needing accessibility assistance to apply to an open position using our website.  Please do not use the dedicated email or phone number above to inquire on the status of your job application. In order for our company to stay compliant with government regulations, please apply on line. Please DO NOT email resumes or call in lieu of applying online unless you have a physical and/or mental disability and need assistance with the online application."}