{"title":"Sr iOS developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIvIRlK1WcmA-D0DE0JqjMeGiTekZoH8bnOkmgHos50ZWo6HNXkVg7n6VkKX2vXgoBPykrNuU0r2Ngj24VDqZHuyCX4s4kYVlYkRxNemxt2EzQPvVspQuDZqQ8Y7S9N2oKhV3Nxbmq_2Ra93QpGY-EuKtbEf9yuXETLhXXKDyucO8WCqymuBcUzCIP2vOWK","source":"ziprecruiter","full_description":"Position: Sr iOS DeveloperLocation: Auburn Hills, MIDuration: Full Time Job Description: Experience in Angular JS, Javascript & PHP Experience in HTML 5 and CSS Experience with integration to REST and SOAP web services Extensive experience developing mobile applications, service development and integration Experiences with telematics solutions Experience with iOT platforms including messaging bus, MQTT, etc… iOS design patterns and coding conventions as well as Apple's official guidelines or  IOS: Senior level Swift experience IOS: Objective-C IOS: Siri integration IOS: Core Services IOS: Media and Cocoa Touch frameworks IOS: Developer tools (Xcode 4+) and workflows IOS: Design patterns and coding conventions Familiarity with Kuberneted, Docker, AWS, etc.. Worked in Agile/Scrum methodology Experience in Java and Python programming Collaborated with cross-functional teams to define, design and ship new features Big Data experience Experience with AI Experience with Alexa, smart home, etc Experience in security of data on devices and in transit Knowledge around continuous and automated deployments of mobile solutions Strong knowledge of Swift's Codable protocol Knowledge of 3rd-party library SnapKit is preferred, but not required Understanding of how certificates, provisioning profiles, schemes, and configurations all fit into an app's build process Disclaimer:E-Solutions Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. We especially invite women, minorities, veterans, and individuals with disabilities to apply. EEO/AA/M/F/Vet/Disability."}