{"title":"Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ6D2twgESoQbqd6Wkwe0lOJW8czy3nsqXV8-V2CeV_F8eCgWxGwPOVggty2AicIHx8LrQhBwMykx03VzMh02RMYy3Er-zlFr1peZzecZa9gacslKHytvJZR0Xfs9l6zcuMDDCtN9quFAOr2bZK7RHqSrbokc_Z3XAP66fcAHczVX36Ikf7IBwo2yhFRfmW","source":"ziprecruiter","full_description":"Classification:SalaryJob Description:Are you looking for a new challenge? Passionate about innovation? Want to work for a company that values integrity, teamwork and loyalty?At LATICRETE International we are driven to be a top ten construction chemical company that still values family, diversity, collaboration and invention. We've been in business for over 60 years, family owned/operated for three generations and are available in 100 countries. In 2017, The Hartford Business Journal named us one of Connecticut's Top Family Owned Companies!We don't just make innovative, industry-leading products. We strive to connect with, engage with and improve the lives of our employees, our customers, our partners, and the global communities in which we operate.We are seeking passionate and ambitious employees who want to make a difference not just within our organization, but within their communities and the world. If that sounds like you, then what are you waiting for? Join the family and expand your horizons!Just some of our benefits:MedicalDentalVision401kTuition reimbursement12 paid holidays in addition to paid vacation and sick timeFlexible spendingLife Insurance, AD&D and Supplemental InsuranceCovid-19 Precautions:At all of our facilities we are taking additional precautions with temperature checks, deep cleaning, testing, and work from home opportunities.Overview:Formulate products in the field of cement, resinous and emulsion (dispersion) type chemistry. Qualifies new raw materials and evaluate competitive products. Assist with development of new quality control methods for new or existing products.Under direct supervision, responsible for performing accurate formulation and analytical tests in accordance with established company, ANSI, and ASTM procedures and/or other accepted methods, conducting simple chemical studies, experiments on organic/or and inorganic compounds and materials, analyses and tests. Requires basic technical knowledge and techniques in projects regarding organization research, production, or operation. Typically requires a Bachelor's degree in Chemistry and up to three years of experience or a Master's degree in Chemistry.Essential Job Functions & Responsibilities:Formulate products to meet specified requirements with minimal supervision.Devise and conduct experiments to achieve product requirement targets.Work with and contribute to multidisciplinary teams.Responsible for accurately documenting all lab work via approved methods.Process, analyze, and interpret results.Communicate results within R&D and cross-functionally as required.Present ongoing work, findings, and methodologies as required.Attend and participate in field trials.Interact with end-use customers and contractors to understand product usage, limitations, and needs.Contribute to scale up activities.Write batching formulas for the production department based upon completed and approved laboratory formulations.Determine QC parameters for product testing.Maintain a clean working laboratory environment as well as properly working equipment. Ensure that all instruments that require periodic calibration and validation requirements are carried out per laboratory calibration/validation procedures.Document all lab work continuously according to standard practice.Summarize all project work in a formal end report.Comply with all laboratory, company, state and federal laboratory safety regulations.Other related duties as instructed by the supervisorJob Specifications/Skills:Zero to three (0 - 3) years' experience working in a laboratory environment preferred.Strong analytical ability, well organized, detail oriented, and systematic in documenting results.Team Cooperation - Maintain cooperative, professional attitude with all LATICRETE employees and customers.Strong verbal and written communication skills in order to write reports and present results.Must be a self-starter and able to multi-task.Computer skills: Intermediate to Advanced knowledge of Microsoft Office (Word, Excel, PowerPoint), Outlook. Bending and reaching - ability to lift/move up to 50 pounds. Minimum Educational Requirements:BA/BS in a physical science required. Chemistry highly preferred. Industrial laboratory experience a plus.Travel:5-15% domestic with international as required. Must possess or be able to secure a passport and Visa."}