{"title":"Hiring Pool - Chemistry & Biochemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJcHLE6CW9qXjbkXzSdjwzp3AVRvhL79AthGvkj_J37NKcKBOxyiGxPCnJp6655BxYPQz4nFArBt-tc-cK14tIBhg2bikApqzVVHYZjDnSD_ri3QqSm1JI0VUyURXNxTSbXn6i3zhjE-AFtDwpFeev7PghOvOEIRoInEdfQH9GRqC1p5Me1pWfIq0ikKR39","source":"ziprecruiter","full_description":"Position Title Hiring Pool - Chemistry & Biochemistry Department Chemistry & Biochemistry FTE .49-1.0 FLSA Exempt Job Type Part-Time Job EEO Category Faculty Physical Demands n/a Job Summary Candidates are sought to form a hiring pool for temporary positions in Chemistry and Biochemistry. Requires teaching on-campus, off-campus, and/or online undergraduate courses in the program. Minimum Qualifications This position requires a master's degree in Chemistry, Biochemistry or related fields (such as Natural Science), or meets the Department's Tested Experience Policy. ABDs and candidates with 18+ hours of coursework in a Chemistry, Biochemistry or related field will be considered. The successful candidate will be expected to demonstrate potential for teaching excellence in traditional and online settings. The ability or potential to mentor and support students from diverse backgrounds is preferred. Preferred Qualifications  Posting Number F00471 Position Number FP9993 Desired Start Date 08/17/2020 Open Date 07/24/2020 Close Date Open Until Filled Yes Special Instructions to Applicants The hiring pool may be used to fill vacancies for Summer 2020 through Spring 2021. Screening of applications is ongoing and will continue until positions are filled. Interested persons should apply online at https://careers.unco.edu and select \"Faculty Job Openings\", then choose \"Hiring Pool - Chemistry and Biochemistry\". Application documents to be submitted online include: 1) a letter of application stating your qualifications and the instructional areas or courses for which you would like to be considered, 2) a resume or curriculum vitae, 3) unofficial copies of graduate school transcripts, and 4) names and contact information of three references. Salary and Benefits Salary is commensurate with qualifications and experience. Benefits available include health, dental, vision, life and long-term disability insurance, as well as a selection of several defined contribution retirement plans. Dependents and spouses of UNC Employees who are employed at 0.5 FTE or above are eligible for undergraduate dependent tuition grants of up to 50%. These tuition grants will cover in-state tuition charges. Further requirements may exist. Other benefits may be available based on position. Additional Requirements Satisfactory completion of a background check, educational check, and authorization to work in the United States is required after a conditional offer of employment has been made. The successful candidate must submit original transcripts within one (1) month of hire."}