{"title":"Network Engineer (CCNA) (Wireless/Cisco Voice/PM experience) (Job ID: 588008) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALaU-Dz-qIvsYAXtbI8htf6BFVLEimyC2QDTo9mpgBlyVuHxuoSPD_RabcuEKY47yjtZ12ycxjqln5qAsOrmAs6pTlFRo1szuLC1TPwJbQnwdXkKFVsHoUt9Go6I-IBx0amkI-JDilEfi0DTokCjSxumrOs4dR1yJu9wUEAex1YefmLwqdO3NoSGmBliTA","source":"ziprecruiter","full_description":"Network Engineer (CCNA) (Wireless/Cisco Voice/PM experience) (Job ID: 588008)+ 608 W Allegan St, Lansing, MI 48933, USA+ Full-timeCompany DescriptionComputer Consultants International, Inc. (CCI) is an IT Consulting Firm with more than 18 years experience providing effective, expert-level services in industries such as Construction, Technology, Finance, Healthcare, and Government. CCI focuses on building long-term relationships while completing projects from design to delivery. People are CCI's key component for success. Recruiting utmost-quality individuals for our clients, CCI fields a workforce of individuals who are selected not only because of their technical qualifications but also for their achievements as substantial, contributing human beings. In government work and in the commercial market, high standards of ethics and accountability are critical. Therefore our people are chosen for their integrity and ability to maintain relationships, as well as expertise in their field. To learn more about CCI, visit us online at www.cci-worldwide.com.Job DescriptionThe Consultant(s) will work closely with technical teams in the Network and Telecommunication Services Division to provide a consistently functioning, managed IP network, support IT and business initiatives and perform high level problem resolution for multiple State departments and agencies. Manage or coordinate installation, upgrade, or deployment projects, create and update technical support documentation, utilize scripted installation techniques for large deployments. Assist network engineers in troubleshooting difficult or time-sensitive problems. Demonstrate strong experience with Cisco Network and IP Telephony equipment and configuration. Other system experience may be required (e.g. with Checkpoint Firewalls and/or F5 Load Balancing equipment). Demonstrate experience utilizing network management systems and network tools (e.g., SolarWinds NPM, Cisco Call Manager, IP Control, etc.) and an understanding of SNMP. Possess expert knowledge of IP and application protocols (e.g. TCP, UDP, HTTP, SSL). Expert knowledge of the OSI model. Dynamic Routing protocols - EIGRP, OSPF, BGP. Layer 2 protocols - LACP, LLDP, CDP, MPLS, STP. TCP/UDP/ICMP operation and troubleshooting. Application protocols - HTTP, SSL, DNS, NFS, CIFS. Excellent communication, organization and project management skills. CCNP or equivalent knowledge and hands on experience. In-depth knowledge of IP Telephony technologies. Above average ability to interpret and apply technical instructions and guidelines to job performance; extreme attention to details is essential. TASKS:Submit Request for Change Hardware refresh IOS update Submit Request for Change NAC configuration Implementation Complete documentation ADDITIONAL DETAILS: This is a traveling role. This person will be traveling all over Michigan about 80% of the week. These will be 40-hour work weeks and will have flexible hours due to shifts. There will be night and weekend work. Expected to be at home base in Lansing on Fridays. The rate is an all-inclusive rate and traveling expenses will come out of that per state guidelines (meals, lodging) This person will be given a State company car and will not be required to pay for fuel. QualificationsExperience with large project implementation. Required. 5 Years CCNA level experience. Required. 5 Years CCNA Certification. Desired. 1 Years Wireless and Cisco Voice experience. Required. 5 Years Demonstrate experience utilizing network management systems and network tools (e.g., SolarWinds NPM, Cisco Call Manager, IP Control, etc.) and an un. Required. 5 Years Possess expert knowledge of IP and application protocols (e.g. TCP, UDP, HTTP, SSL). Expert knowledge of the OSI model. Dynamic Routing protocols. Required. 5 Years Excellent communication, organization and project management skills. Required. 5 Years Above average ability to interpret and apply technical instructions and guidelines to job performance; extreme attention to details is essential. Required. 5 Years Candidate must have their own vehicle and pay for transportation costs when traveling to Lansing only. They will be utilizing a company car otherwise for travel. Must also have valid state ID, driver's license, or passport for badging. Face to face or phone interviews will take place February 21 and 22 only. Additional InformationFor immediate consideration, please send your resume to hire(at)cci-worldwide.com with \"588008-MI\" The subject line.Job Location"}