{"title":"Automotive Technicians, Mechanics - $23 Plus per Hour NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJdAuEe8xuU4KluFsuGNuackDMwq-fZmkcCnOg8__EywaZ_lUvj2OAyqKuPdxgkgHZCINqiWFoAcnCxcIBoC3ZYqMwJLO7r__xkQd2ff3YtLzOPiYgerK0GYcREyBFwyBsXD1d9V1pU3lNgpaVoQV5ghEmaGiioDl7U9g-XmzpL1gRQLVkXHonFh0vJ52M","source":"ziprecruiter","full_description":"22240 S Tamiami Trail, Estero, FL 33928AUTOMOTIVE SERVICE TECHNICIAN / MECHANICTop Pay Starting at $23+ /hr. PLUS Bonuses!HIRING NOW | All LevelsPrevious Experience Required. Honda Certified a Plus!Coconut Point Honda is hiring NOW for skilled Service Technicians / Mechanics to join our growing organization! Ideal candidates will have 2+ years of experience as a service tech/mechanic. This is a great opportunity to work where your efforts and hard work are appreciated and rewarded, and you have plenty of room to grow!Coconut Point Honda is a part of the Hanania Automotive Group dealerships. We believe culture makes a difference and we strive to build lasting relationships with our employees, customers, and the community! Upload your resume and complete online assessment for immediate consideration!We offer:Top Pay Plan in the area – Hourly Pay starting at $23 or MORE /hr. based on experience. Tell us about your experience at your interview!Performance bonuses! Income ranging from $65K - $110K+!Ongoing training to enhance your skillset!Health, Dental & Vision Insurance401(k) retirement planPaid vacation and holidaysFlexible schedules make for excellent work/life balanceFriendly, team-oriented work environmentGreat opportunity for a successful careerResponsibilities - Service Technician:Inspect vehicle and diagnose problem(s)Perform quality repair/maintenance work that meets dealership and manufacturer standards including engine, transmission, electrical, steering, suspension, braking, air conditioning, etc.Provide estimate of time and parts needed for repair/maintenanceLearn new technical information and techniques in training sessions to stay current with rapidly changing technology.Keep shop neat and account for dealership owned toolsOther duties may be assigned according to skill level and certificationQualifications - Service Technician:Dealership service department experience is requiredHonda Certification is a plus but not required!ASE preferredValid driver's license with acceptable driving recordFlexible and focused on maintaining a high level of customer serviceGood work ethic and problem-solving skillsA positive attitude and works well as part of a teamResume must be uploaded, and online assessment completed for immediate consideration.Must be authorized to work in the U.S. without sponsorship and be a current resident.Must pass pre-employment testing to include background checks, MVR, and drug screen.We are an equal opportunity employer. All qualified applicants will receive consideration for employment regardless of race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."}