{"title":"Research Associate, Library Production - Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI0UQj9AldpYrLhW2_ajo0iD-NhCvKckpyiPWFYlXf9HMiVxuVq69WOUXCeRoKVsIcbxuMB196bHYydPy8jjPRB4DlrMYKAh6E443BXfJ6Cj4JXoKT0oVg67QZ_HwRjlQir7lQB3YIYcfLDlDVMru9XZogbpXW9tFcifqV_dcFavaZw8V6pLoqO3oOf4_9S","source":"ziprecruiter","full_description":"Plexium is a San Diego-based targeted protein degradation drug discovery company whose purpose is to discover and develop impactful therapies changing the course of human disease. We are a close-knit team of drug discovery and engineering experts using pioneering platform technologies to discover and develop transformative new drug modalities. Plexium has an open work environment with a positive, friendly, and collaborative culture. We are committed to fostering innovation and encouraging cross-functional collaboration and supporting the growth and development of our team members.We are seeking a Research Associate, Chemistry to be part our library production chemistry team, preparing libraries of compounds using solid-phase one-bead-one compound technology. The successful candidate will have:Experience in the safe handling of chemicals and reagents, following established synthetic protocols (preferably involving solid phase organic synthesis), reaction monitoring, reaction work-up and product isolationAn understanding of, and experience in, following established synthetic organic chemistry reaction protocols to produce libraries of compoundsA good grasp of organic chemistry principles and good basic chemistry problem-solving skillsThe ability to discuss and clearly communicate the chemistry they are undertaking to other members of the teamExperience with DNA-encoded library production would be beneficial.RequirementsQualification prerequisites MS degree or BS degree in organic chemistry plus at least 2 years of lab experience in an industrial chemistry environment (e.g. the biotech or pharmaceutical industry).Skills/Knowledge Required: Following established synthetic chemistry protocols to produce solid phase one-bead-one-compound libraries of compoundsUsing knowledge of organic chemistry and experience to be able to independently conduct library production, monitor reaction progress, work-up and isolate productsOrganize own work and lab tasks to be safe and productiveFollow priorities and working to deadlines set by supervisorOutstandingExcellent organizational skills and attention to detailBe able to clearly communicate about own work to supervisor and othersBenefitsComprehensive medical, dental and vision coverage401KGenerous vacation policystock options"}