{"title":"SENIOR PROJECT MANAGER (PROFESSIONAL ENGINEERING SERVICES) NEW!","location":"","salary":"","description":"","term":"$45 to $50 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AALePNNsUtfcVAoTEQRw9oHgeO6EMpTHr2ARcRiTBPZqdbD6FxJAUzqmSGTKReGamjqi0dlFIqy5A7HT9lSFesIX2TEaCohMfJkunpkmx28YOo0IsdwEQWwV-SgBnkW4b2VN7DYY0bkv2hhQfMU-AM_fOfYvlnmHrCMvnwgrswmO8GpySjqyJQDPJw5ocifQ","source":"ziprecruiter","full_description":"The Senior Project Manager will support and manage the full software development life cycle associated with Engineering Services initiatives. The Sr. Project Manager will be the central point of contact for customers, vendors, developers, and internal leadership, and is responsible for software / services project deliverables, schedules and compliance to established processes and quality standards. As a servant leader, the Sr. Project Manager ensures execution is smooth and all activities, communication, and coordination is tightly managed to protect scope commitments and manage risk, actively tightening budget and schedule.The Sr. PM will partner with the Technical Lead as part of our Operating Model, to ensure technical delivery is managed within project boundaries, while providing a superior customer experience.§ Manage software / services development project activities for multiple projects across all project phases, including initiation, planning, execution and closure.o Integration Management - Create, manage, and track project artifacts, including, but not limited to:§ Pre-Sales Scope and associated ROM Estimates§ Executed Statement of Work§ Requirements documentation§ Project plan· Resource plans· Budget· Schedule Timeline§ Risk Management Plan§ Project deliverables (licensing, target, etc.)o Scope Management§ Work with sales, product engineering and engineering services to develop resource-loaded Microsoft Project planso Risk Management§ Identify, prioritize, and manage risks that will impact the quality and delivery of product.§ Identify and create mitigation plans to Risks before they ariseo Stakeholder Management§ Identify and communicate with internal and external customers to develop effective engagement plano Communication Management§ Provide ongoing project plan/status reporting for use by the field application engineers, clients and management§ Central point of contact for the customer and project team§ Conduit between Project Lead and Customer to manage technical issues, boundaries and delivery issueso Schedule Management§ Manage performance against plan schedule, tasks, milestones and deliverables, making necessary adjustments to ensure timely communication and corrective actionso Resource Management§ Negotiate the use of resources, schedules, and scope creep with customer and management§ Make recommendations to Resource Manager about schedules, prioritization, and resource allocation with input from team members§ Work collaboratively with Technical Leads to support software engineers, lead architects, quality analysts and leadership.§ Excel at administering and coordinating groups of diverse individuals by promoting teamwork, delegating tasks, resolving conflict, setting goals, and evaluating performance§ Coach and train project team members on Agile principles and tools as well as Altia’s development processes and best practices§ Use creative problem-solving skills and powerful negotiation strategies to bring alignment and agreement to conflict§ Work with Sales Representatives to further customer involvement in the product development lifecycleRequired Education, Experience and Competencies:§ B.S. Degree or higher in Business or related field§ Project Management Certificate or Degree§ 7+ years in a direct Project Management role within a technology environment§ Knowledge of PMI Process Groups§ Demonstrated experience in leading cross-functional project teams§ Experience with Project Management scheduling and tracking tools like MS Project and JIRA§ Understanding of the software development lifecycle§ Strong written and verbal communication and interpersonal skills§ Ability to adjust and set priorities to meet deadlines§ Experience managing projects following the software engineering V-model§ Strong persuasion and negotiation skills, including conflict resolution skills§ Self-starter with strong personal work ethic, integrity and a “whatever it takes” attitude Preferred Additional Qualifications: · Certified Associate in Project Management (CAPM), Project Management Professional (PMP) Certification or PRINCE2· Professional Services experience· Experience within small company start-up/ramp environment· Knowledge of Agile Development Methodologies· Experience using Confluence and JIRA· Previous experience developing and successfully managing requirements· Familiarity with Automotive Software Process Improvement Capability Determination (ASPICE/ISO 15504) or other Process Improvement methodologies (e.g. CMMI)· Familiarity with Functional Safety Requirements (ISO 26262)· Understanding of the automotive industrySKILLS AND CERTIFICATIONS [note: bold skills and certification are required]Project Management Degree or Certification (CAPM, PMP, PRINCE2)SCREENING QUESTIONSDo you have proven success coordinating groups of diverse individuals by promoting teamwork, delegating tasks, resolving conflict, setting goals and evaluating performance?Are you a successful, creative problem solver with strong negotiation and conflict resolution skills?Do you have significant experience in a direct project / product management role (preferably in a professional services organization)?Are you a certified Project Manager, with knowledge of Agile Development Methodologies and PMI Process Groups?IDEAL CANDIDATEWho we want: A highly motivated self-starter is a must for this role. This position requires a seasoned, proactive and problem-solving project manager experienced with large, complex projects and customer environments. The candidate will have the capacity to manage through customer interaction to produce positive outcomes while protecting the development team from distraction and wasted effort. The candidate will need to be comfortable leading a large team or multiple smaller teams in a growth environment where infrastructure and processes are in development. This role will support and participate in the development of PMO processes and quality standards."}