{"title":"Sr. Electrical Engineer","location":"","salary":"","description":"","term":"$90,000 to $120,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAITkw1nyQm0O1NHh9tjepRaf7FxWOHUEU5hmNqmWq3HkMezzUzbx8jkXfcKR4SAoy3HkiaYzjBziChzyb5r0deWofJu3pUz6fELhdw3GPaLSYpjlZ1K0HstN-mNVW1cPg0Blg5C8yq_mySGA8d61I8x9QhBJEspUaDVn2dXhjlIV56efPM7fO7QbDd1bkVg","source":"ziprecruiter","full_description":"We have 2 positions currently. Position #1 is for a Manufacturing Plant Electrical Engineer, Position #2 is for a Machine Controls Design Electrical EngineerPosition #1Electrical Engineer (Machine Controls Design)This position will develop or redesign electrical controls for new or existing company products. Individuals in this position work from order requirements or other specifications and arrive at final control circuitry and program logic utilizing software and engineering calculations as required. Senior Controls Engineers provide technical expertise to less experienced engineering personnel and may lead a team of Controls Engineers and Cad Designers.Key DutiesDesign control architecture and logic for high speed production systemsDesign electrical controls/control systems for company products.Write PLC, HMI, PC and other control programs using various softwareCreate Sequence of Operations, Control Schematics and Control Panel layout drawings using CAD software for use in customer proposals and manufacturing.Create bills of material and routings for use in cost estimates and manufacturingCreate owner’s manuals, test procedures, and other engineering deliverables as requiredPerform electrical computations for sizing electrical componentsProvide technical support to shop personnel during manufacturingProvide field support of Company products as requiredRequirementsBachelor’s Degree in Electrical EngineeringTen plus years experience preferredWorking knowledge of NFPA 70, National Electric Code, and NFPA 79, Electrical Standard for Industrial MachineryAbility to troubleshoot electrical control circuitsProficient with AutoCAD Electrical and 3D CAD software, preferably SolidWorksGeneral working knowledge of PLC, HMI, and PC based control hardware and software.Position #2ELECTRICAL ENGINEER (Machine Controls Design)Requirements:Knowledge of Rockwell development software used to program PLCs. Knowledge of Autodesk AutoCAD Electrical software.In depth understanding of applicable North America electrical codes and industry standards used in equipment design including but not limited to UL, CSA, NFPA, NEC and IEC.Understanding of CE Machinery Directive and applicable standards is preferred.Ability to design electrical circuits and panels for industrial equipment and perform electrical design calculations including those applicable to safety circuit ratings.Knowledge of multiple technologies, products and applications applicable to industrial equipment such as PLCs, VFDs, proximity switches, safety devices, and HMIs.Experience:B.S. Electrical Engineering from an ABET accredited program or Associates Degree in science or engineering with a minimum of 3 years electrical and controls experience.Minimum of 3 years electrical and controls design and development experience including experience using Rockwell software, designing electrical and controls for industrial equipment, and using AutoCAD Electrical.Responsibilities/Accountability:Design, develop, and support equipment including improvements to existing equipment designs and developing new equipment designs.Provide technical accountability and leadership within the electrical and controls engineering staff through the collaborative development of concepts and designs, review of electrical designs and engineering documentation, problem resolution, and troubleshooting of new and existing equipment.Ensure compliance with engineering procedures and guidelines, industry standards and practices, and governmental regulations applicable to electrical design of industrial equipment that is designed, developed, and manufactured.Works closely with customers, Sales, Manufacturing, Purchasing, Aftermarket and Project Management with minimal oversight to achieve project objectivesManages engineering design budgets for equipment orders and product line maintenance and development projects. Provides accurate forecasts for completion of work."}