{"title":"Mechanical Engineering Technical Support Specialist - (Hourly) - 2nd Shift Seymour, Indiana NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIqOi6qWytVlO6WUKJ1eOn3Lbm6P6tTzGsQNpwGYZmm1lZ4WPKGneb3mH-1oY3NaV0uDI28LIfk6wKzrDvPN9gS-En08Q8TiJ02rlgB_ieZOkaJqAcuIveC88TQVqIM4Geah0yw_xf-Gokt81ng1Z5BdZ-hO51RzMg9V3MYmQ8Z5mj1YQ40JK0d7H9j1pSQ","source":"ziprecruiter","full_description":"Mechanical Engineering Technical Support Specialist - (Hourly) - 2nd Shift Seymour, Indiana Description Our culture believes in POWERING YOUR POTENTIAL. We provide global opportunities to develop your career, make your community a better place and work with today's most innovative thinkers to solve the world's toughest problems. We believe in flexibility for you to explore your passions and make an impact through meaningful work within our diverse workforce. That's how we're living our best #LifeAtCummins. This is a 2nd shift position. Monday-Friday 2:30 - 11:00PM Starting salary: $18.50 to $21.00 an hour plus $1.00 shift premium This is a mechanical position working at the Seymour Technical Center. MTSS at STC are primarily responsible for building engines and changing of hardware for PSBU products in either the engine build areas or in engineering test cells. Engines normally worked on at STC vary from QSK19 to QSK95 (Diesel or Natural Gas). Fabrication experience is a plus as would be useful for building intake / exhaust / coolant plumbing and or brackets for prototype testing.  Prepares test articles for test, including initial build and final teardown. Responsible for installing instrumentation into test articles per relevant engineering standards. Assists in testing in accordance with established test procedures and methodology.  Prepare test articles and associated fixtures, rigs, and equipment for testing. Demonstrates an understanding of the function of test equipment and the contribution of the test equipment to the validity of test results. Demonstrates knowledge of the functioning of the product under test to assess the contribution of the product to the validity of the test results.  Performs test stand installation, troubleshooting and setups and the upkeep and maintenance of laboratory equipment. Performs other duties as required. Diversity Statement At Cummins, we are an equal opportunity and affirmative action employer dedicated to diversity in the workplace. Our policy is to provide equal employment opportunities to all qualified persons without regard to race, gender, color, disability, national origin, age, religion, union affiliation, Qualifications Education, Licenses, Certifications High school diploma or certificate of completion of secondary education or equivalent experience to the extent such experience meets applicable regulations. This position may require licensing for compliance with export controls or sanctions regulations. Experience Requires some work experience and intermediate level knowledge obtained through training or on-the-job experience. Job ENGINEERING Primary Location United States-Indiana-Columbus-US, IN, Seymour, Cummins Industrial Center Job Type Experienced - Exempt / Office Recruitment Job Type Office Job Posting Feb 2, 2021, 2:05:46 PM Unposting Date OngoingReq ID: 210000FI"}