{"title":"Network Engineer 1 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJQwV8UxP7iTA2XGK26EWL3fTIuaUgj9Cq8PZj_C9qI39cU8B3XtURfqc-GVoOwt3ARqyNiogtNYXtgiKHf_kcBxsGiP_pUh3MRJIAIHslqlXy7rrpgoH35mL_ycUlfkY98eYeZa3ucQcayv3tn7CSEqz8Q54kmjIlZH62xGrftgSUCFqCyaod9_Rhl7ac","source":"ziprecruiter","full_description":"Client Name : Select Group/Charter Communications Job Title : Network Engineer I City : Greenwood Village State : ColoradoMust be able to work the following schedule: Sunday to Wednesday, 10:00PM to 9:00AMNETWORK ENGINEER The Select Groups' TOP telecommunications client is seeking an experienced Network Engineer to bring on their team in Greenwood Village, Colorado. NETWORK ENGINEER REQUIREMENTS:Bachelor's degree in Computer Science, Engineering or related field, and/or equivalent work experience.Minimum one (1) year of network engineering experienceMinimum one (1) year of experience with Cisco and/or JuniperMinimum one (1) year of Data network experience.Must be able to work the following schedule: Sunday to Wednesday, 10:00PM to 9:00AMNETWORK ENGINEER NICE TO HAVE SKILLS:Cisco Certified Network Associate (CCNA)Basic knowledge of related industry specifications and standards IEEE, ANSI, Physical Media (Multimode Fiber, Single mode Fiber, UTP, etc.), Bridging, Switching, Routing, Ethernet and Transport technologies and protocols.Basic knowledge of in-network design, network architecture, protocols and network topology, TCP/IP and the OSI Model.Ability to use ticketing and software tools to support the current operations.NETWORK ENGINEER RESPONSIBILITIES:Integrates communication architectures, topologies, hardware, software, transmission and signaling links and protocols into complete network configurations.Works on projects/systems/issues of varying complexity surrounding network planning, configuration and optimization.Evaluates new products, performs network problem resolution.Assists in the planning, forecasting, implementation and identification of resource requirements for network systems of basic complexity.Assists in the development and documentation of technical standards and implements approved methods of procedure.Contributes in designing corporate standards and develops network enhancementsHands on involvement in network planning, network architecture design and engineering.Provides tier support across organizationsKnows, understands and follows company policy, also adheres to industry specific local, state, and federal regulations, as applicable.Performs other duties as requested by supervisor."}