{"title":"Field Service Representative","location":"","salary":"","description":"","term":"$18 to $20 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALi6q8Mdu3LsiXHbwy9ukeACSKzLRHIsXugMOqstDXbvbQddTTxG8WmK-ZymB1z7vSrJH1O1ehoZ9fpIG9BGQTWkCZI3edf-tZ2FAJfPtFpBeu0KrMzeH_7rgx3IulD-McFlsnGOU4U3KnxM3bcStPkJKbuYvdzVjYM4pYrLGmnVdBBkUe-dI_PCkb0fLA","source":"ziprecruiter","full_description":"Medical Delivery Representative At Kreg Therapeutics, we are committed to providing the best quality customer service. The Medical Delivery Driver position is responsible for the delivery, service, and pick-up of Kreg Therapeutics’ rental medical equipment. Our Medical Delivery Drivers work face-to-face with hospital staff and patients to ensure the comprehension of our specialty beds and support surfaces.The perfect candidate demonstrates compassion for others, works with a sense of urgency and a high level of integrity.Responsibilities of Medical Delivery Driver:Ability to pass a DOT physical.Accurately complete daily reporting requirements.Become skilled at testing, troubleshooting, repairing, operating all Kreg Therapeutics products.Clean and disinfect rental equipment in accordance with Kreg Therapeutics policies and procedures.Deliver, service, and pick-up medical equipment from facilities.Initiate and maintain positive interactions with all customers.Maintain communication with central dispatch at all times regarding customer orders.Maintain company vehicles in a clean and orderly manner.Meet all competency and safe driving expectations to operate a 26-foot box truck.Responsible for completing orders in the designated time frame.To be successful at this job, we are looking for the following requirements:Ability to pass an extensive background check, 10-panel drug screen, and DOT physical.Ability to work a non-traditional work schedule, which may include extended hours, weekends, and participate in on-call duties.Must be 21yrs of age to operate 26ft box truck.Possess a High School Diploma or GED.One to three years of previous customer service experience.Possess a current valid driver’s license."}