{"title":"Sr. Android Developer","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAKNaNG0BjQLM1zKrdYpVk1Sx2ZDxtRmA3I9JhYbC_xaeiYlaPlzdRf9zTiMXFbpV8xqqgOm9c5-shvITEwJaCSjaHwK0izEelQP_NRp_aW_BK5a52WFem5NdswIAYA3J4xK3hDH7mICiT4u3qPi0WE92ntPB177JCo3ACYHZWrNg5oXotIQWAhL1fZdFNtj","source":"ziprecruiter","full_description":"Sr. Android DeveloperGavinHeath is partnering with a client in Denver, CO looking to add multiple Android Developers to their team. The role is a contract position. DescriptionThe wireless device engineering team is seeking a Senior Android Software Engineer to work on mission critical projects contributing to our commitment of building and expanding intelligent WIFI capabilities. As a member of the wireless engineering organization, you'll be required to work in an agile team environment where professional respect and communication is key. Because we work on the cutting edge of a lot of technologies, we need someone who is a creative problem solver, resourceful in getting things done, and productive working independently or collaboratively. You must be fun, energetic, outgoing and willing to gothe extra mile for your teammates.ResponsibilitiesThe Senior Software Engineer will own the design, development, documentation, and troubleshooting of our Connection Manager and Analytics SDK in addition to new technology projects involving Android. You should have a real passion for the latest technology trends and be willing to share new technology opportunities with the broader team. Write clean, concise code that is stable, extensible and unit-tested appropriatelyCommunicate frequently and effectively with other developers and quality engineers on the team in addition to our product owners, scrum masters and project managers.Diagnose complex issues, evaluate, recommend and execute the best resolutionImplement new features within our Agile delivery methodology while following our established architectural principles and practicesWrite code that meets the production requirements and design specifications and anticipate potential errors/issuesREQUIRED QUALIFICATIONSExtensive production experience with native Android application development Strong knowledge of Java, Kotlin, Gradle and the Android SDKKnowledge of using RESTful APIsSome working knowledge of Telecom technologies like 5G, CBRS, 4G, LTE is good to haveProficiency building large scale, complex, Android applications optimized for both UX and performanceExperience working on large scale mobile projects having some experience with architectural patternsWorking experience in Agile software development and leveraging continuous integration and deployment practicesFamiliarity using test-driven development frameworks or automated testing tools for mobile developmentWillingness to mentor and advise other engineering team membersExcellent written and verbal communication skillsSolid analytical and troubleshooting abilitiesRELATED WORK EXPERIENCE 5+ years Android application development experience7+ years overall application development experience 2+ years web services development experience using REST, JSON, XMLGavinHeath provides equal opportunity (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, age, disability, or protected veteran status. In addition, to federal law requirements, GavinHeath complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities or otherwise operates. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}