{"title":"Entry Level Mechanic NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALx0CwUKGjHeHYnQIfVRZz6HhbfoOLR3wmg3YbtoRk4U_QbspNi2WSN5yjZlXFM4esIqXB8c_eugeRQgvd86vccQWRSujYu76MWnBebizzEagfKadIVuwS6cK7cI9QRk2AcaII3SwzFJ7VLEcos0maIwIghvZlO_Ufb8VKGFbQiX8mTWGAKJzPP_coM5lsz","source":"ziprecruiter","full_description":"Summary/ObjectiveThis position is for an entry level technician. We will provide the necessary training for someone who wish to work on buses and big transportation equipment. Please read below for the things you will be eventually doing.An entry level Service Technician performs minor diagnostics, repairs, and overhauls/rebuilds, including vehicle inspections, in a timely manner; ensuring quality, time standards, customer expectations, cost guidelines and reliability goals are met. This position demands high mechanical skills on med/heavy duty trucks and buses with considerable knowledge of methods, material, tools and techniques used in vehicle repair and maintenance. Skills in the use of power and hand tools, use of diagnostic equipment, acetylene and electric arc welding, and the operation of vehicles and equipment for diagnostic purposes. Highly detail oriented and organized in work. Ability to drive and operate a variety of equipment under varying conditions. Ability to work cooperatively and collaboratively with a customer service focus with all levels of employees, management, and external agencies to maximize performance, creativity, problem solving and results. Must have initiative and the ability to act and to operate independently with minimal daily direction from manager to accomplish objectives.Essential FunctionsWorks under minimal supervision and selects from written instructions and established procedures to accomplish assigned tasks.Must demonstrate advanced analytical and repair skills in vehicle maintenance.Team player who is focused on overall Dealership success.Ability to multi-task in a fast-paced work environmentPerforms repairs and assigned preventive maintenance services.Performs inspection, diagnosis and repair of electrical, hydraulic, suspension, brake and air conditioning systems on vehicles and equipment.Utilizes vehicle computer electronics systems to interpret failure modes to initiate assigned repairs.Advises Service Writer of estimated repair time and materials needed.Performs all work within Standard Repair Times (SRTs).Performs service calls for emergency breakdowns.Conducts safety check inspections on vehicles.Identify warrantable repairs and document on repair orderCompletes required paperwork utilizing fleet maintenance software program associated with repairing vehicles, documenting parts usage, and accounting for repair times.Reviews, completes or assigns repairs identified on Driver Vehicle Inspection Reports.Maintains a clean, safe work area in compliance with Corporate Standards, and performs all work in accordance with established safety procedures.Ensure that all repairs are completed as assignedUpdates job knowledge by participating in education opportunities, reading technical and regulation publications.CompetenciesStrong organizational skills.Strong communications skills both written and verbalBasic computer skills as used for Repair order completion.Exceptional time management with strong desire to meet deadlines.Must own tools required to complete assigned work."}