{"title":"Hardware Engineer II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALkIrbi20wpmwQ0OEYaAL-nfugXjZQl6_UcYuNVNj_xjRCcgCFNrXOXt5YExdAc6yp8aXtzQQTgDFZXgrq2cx2xp873UA7G5JoSezMghqWsv7OXTbAUb5kIjSyKoFzoMGopqATV5VUj-3NPFoWDWCxIRkDVLg9r0RcZ2QVd98aWcoWa9Ak7yKFPWHl5RtO4","source":"ziprecruiter","full_description":"The future is what you make it. When you join Honeywell, you become a member of our global team of thinkers, innovators, dreamers and doers who make the things that make the future. That means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars. Working at Honeywell isn't just about developing cool things. That's why all of our employees enjoy access to dynamic career opportunities across different fields and industries. Are you ready to help us make the future? Be part of a team that uses test equipment and instrumentation to test product designs. Key Responsibilities+ Apply prescriptive methodology to project tasks+ Collaborate with various engineering functional teams+ Perform reliability predictions + Hardware design+ Communicate any non-compliance incidents to pertinent parties+ Hardware testing+ Use computer-assisted engineering and design software and equipment+ Execute project subtasks in order to meet customer specifications (designing, testing, etc)+ Identify areas for technical improvement using engineering knowledge and principalsYOU MUST HAVE+ Bachelors degree in Electrical or Computer engineeringWE VALUE+ Capability to apply broad knowledge of one professional discipline or advanced knowledge of specific technical/operational practices+ Self-motivated and able to work with little supervision+ Capability to update or modify working methods in your role by following defined procedures+ Interest and skill to collaborate with engineering functional teams+ Ability to consistently make timely decisions even in the face of complexity+ Dexterity to evaluate and recommend technical solutions based on standard or accepted technical practices+ Certification in Reliability Engineering Honeywell is an equal opportunity employer. You will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status. Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status."}