{"title":"PLC Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJV-qUw1b3a2_8j_-iAAhb-hxe1s9r59MUzb9Ije5U1-E9I7pNvc5zzV7Kq_hsP9XnvoUwrhu6tfBOmjtLSyZ7fGF8wwDOpKLhvCazwWPPhWq-C2c7Cm_ajnbMsKisOuE-_ygs3P2oJym0cqM6RUzGOHm334T0Mpg9mXg9pJenAv4N4ZhldjsAApOSir2E","source":"ziprecruiter","full_description":"All applicants must be a US citizen pursuant to government guidelines: As an Automation/ Process Engineer, you will be responsible for providing engineering and automation support for customer operations.Job Responsibilities + Supports manufacturing readiness and it's customers; provides process equipment design including mechanical, electrical and control systems.+ Provides control hardware, software and programming as specifically directed for ink manufacturing.+ Design/build/program/Allen Bradley control PLC.+ Trouble shoot plant or equipment down conditions quickly consider outside resources if necessary. Works with Maintenance and Engineering departments.+ Provides technical support for other departments and customers as directed by the engineering manager.+ Considers safety in design, work practices, and plant operations.+ Develops and adheres to project timelines to achieve targeted business goals.+ Acts as a Foreman/Project Manager to on site Electrical contractors. Will purchase or supply electrical components to the contractors or sub project as needed.+ Design/size/select/install/troubleshoots Variable Frequency Drives.+ Will program new projects or make programming changes according to a written narrative or instruction from the engineering manager.+ Other duties as assigned. Requirements + Degree in Mechanical, Electrical, Computer/Control Engineering is desired. Consideration will be made for a Mechanical / Electrical Technician or extensive training and experience in PLC process controls.+ Successful candidates must be a motivated self ?starter and take a ?hands on approach.?+ Demonstrated ability work with others in a close knit team environment.+ Interested in and have an aptitude for liquid processing.+ Have a good understanding of mechanical and electrical components such as valves, pumps, relays, controller, PLC, motors, starters, pilot valves, piping, hose and fittings. Be able to understand the importance of each and every component within a processing system. Be able to timely order, stock, inventory and release any component down to the nut and bolt level to fabrication."}