{"title":"7181 - Member of Technical Staff- Technical Support - Ai/Cloud","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIsQvX4S1LZX5X7GP5-mLHgrL1xjWlbFToHdwGQ4r2zchjdl0hED2b5fMypkd_CeSBUC-n__kSbRMwZ1zTe39kBujX42fYTG3yl783oK2ImM8F-D_OcE2Krs-YFp8eIKD20U2UNHraaeSpVQx6uLzklFz2cMM4im2fsHSm_erWmVoay7H6zH9NHAkqDRDHu","source":"ziprecruiter","full_description":"Description Position at Wind RiverMember of Technical Staff - Technical Support - Ai/ CloudThis person may be based in Alameda, San Diego, Hunstville, San Antonio, Washington DC, Denver, Seattle, or San Jose, Costa Rica, or Ottawa, Canada. Wind RiverIn a world increasingly driven by software innovation, Wind River is pioneering the technologies to accelerate the digital transformation of our customers with a new generation of Mission Critical AI Systems in an AI-first world with the most exacting standards for safety, security, performance, and reliability. Success will be determined by our ability to innovate with velocity and sell at the solutions level.ABOUT THE OPPORTUNITYIf you're a curious and collaborative engineer, someone excited about tackling hard problems and finding innovative solutions, you will love being part of our group. Our customers use Wind River Systems Products (on-prem and SaaS) to develop cutting-edge IoT and embedded system devices that will enable the next generation of technology user experiences on IaaS platforms like Azure. Experience in developing and supporting SaaS environments and applications is required. Candidate should have experience in Dev/Ops, automation, Ai/ ML and build and deployment for SaaS with a firm grasp of emerging technologies, platforms, and applications. Wind River Systems products include Ai/ ML suites which assist with digital transformation, you are expected to be able to use and support these suites along with Azure services.This position works closely with end-users, stakeholders, and developers within Wind River customer support operations to assess, troubleshoot, and solve complex multi-layered issues (hardware, software and everything in between). The ideal candidate will have strong technical background with leadership and communication skills and the ability to train and influence engineers within and outside the team.ResponsibilitiesSupport customers who are encountering problems on Wind River's products.Provide world-class customer service throughout the entire lifecycle of customer adoption.Work independently or as part of a team on engagements with customers to ensure customer retention and to drive customer value realization.Be able to drive and increase visibility of escalated support issues for strategic accounts as needed.Develop and maintain Azure-related standards, policies, and procedures and train other teams/ team members.Provide friendly, courteous, and quality systems support to all users (internal and external).Ability to manage multiple clients and projects.Exceptional communication (written and verbal, internal and external) and presentation skills.Communicate effectively with customers to resolve their problems.Communicate effectively with account teams on customer issues.Handle customer and defect escalations.Document customer issues and resolutions accurately and thoroughly.Participate in support process improvement activities and support offerings.Mentor local and global Customer Support Engineers.Provide support and training to internal customers.Considered as expert in many areas of products.May need to provide on-site support and training to customers.Proactively contribute content to the various Knowledge Bases within Wind RiverDocument Problems for Knowledge Base so that customers may solve similar problems on their own in the future.Be available for after-hours duties in case if there is need for 24/7/365 coverage.ABOUT YOU6-8 years' experience required with 3-5 years of customer facing role experience preferred.Understanding of cloud vs. on premise computing. Solid understanding of fundamentals of cloud computing.Familiarity with Virtualization concepts and virtual system administration.5+ years' experience working in development and production operations supporting a cloud-based environment.5+ years' experience in Microsoft Azure Platform and architecture. Experience with other IaaS provider a plus.Strong knowledge around IaaS, PaaS, SaaS Services, especially expertise in following areas is sought:Azure IoTAzure ARCAzure Security CenterAzure Data Services including SQL, PostgreSQL, Stream analytics, Data LakeAI Cognitive services, Bot FrameworkAKSMicrosoft/ Azure or AWS certification (architect level) is a plus.Experience in Artificial Intelligence and Machine Language.Experience with RTOSes like VxWorks and Linux and familiarity with Wind River Systems product a plus.Extensive knowledge of Linux based operating systems environments (CentOS, WR Linux are preferred) including Hardware, software, networking and storage.Experience in developing Test Strategies, Test plan, Test Report documents, working in Agile environment, CI/CD pipelines using Jenkins, GIT.Experience in shell scripting and typeScript-based application framework like Web stack.Experience in troubleshooting and debugging issues with Device Drivers, BSP, HW design, Networking and other technologies used in embedded system applications.Familiarity of major processor families: PowerPC, Intel and ARM and RISC-V, including multi-core.Understanding of networking applications, Core TCP/IP, Multicasting, Routing, etc.Bachelor or Masters degree in Computer Science, Electrical Engineering, Data Science, Math, Physics, or related technical field.BENEFITS & PERKSPet Friendly EnvironmentPet InsuranceChristmas, Thanksgiving & July 4th Soft Shutdown periodsBirthday and Volunteer Time off401K + Company MatchCompetitive Benefits PackageVirgin Pulse Wellness programManagement TrainingWind River is an equal opportunity employer."}