{"title":"Tier 3 Technical Support Specialist 1","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKYqXHtxgJggxz1mMI1oVU4PLNZX9I7MwnAjHFkkXS64ezRi4LZfHYEOb2XkiNblt0eDbadzsj-REmGUb2JyMpw7NOc6q7zgnW5vYIPkYyHDp0_fDcYAfyikBeNRNLWdihjoXK6pWgeciwG42RPjnXJUkR_K5ly1-ZP8D5HH7EKxubXvhufrsWbBdj_u1wU","source":"ziprecruiter","full_description":"Please note, this is a Telesystem opening.The Tier III Technical Support Specialist I is a position of significant relevant technical experience responsible for providing the technical expertise necessary to build, monitor, upgrade and troubleshoot the company’s internal and external core network infrastructure as well as all transport and access equipment deployed in support of Telesystem customers.ESSENTIAL JOB FUNCTIONSThe Tier III Technical Support Specialist I is accountable for:Trouble resolution and project management in accordance with priorities set forth by the department or the company.Contribute in the testing, development of training material, Methods of Procedures (MOPs), and Standard Operating Procedures (SOPs) associated with new products, services, and equipmentContribute in the testing, and deployment of new market network segments. This includes test plan creation and documentation, test plan execution, and test result documentation. This also includes the creation of MOPs and SOPs associated with all network changes.Provide escalated technical support for Tier II and Installation Technician personnel.Prewire and test new circuits within the Operations Centers (OCs) and work with Installation Technicians during new installs and cutovers.Ensure that trouble tickets and outages are responded to and resolved in accordance with Service Level Agreements (SLAs).Monitor, maintain, and Report on SLA’s for customers and ensure the requirements are met.Turn-up new equipment and Software in Telesystem OCs, HUB sites, and other designated equipment sites according to departmental and company standards.Collaborate across Block Communication Inc (BCI) companies to ensure network elements are configured correctly for presenting Simple Network Management Protocol (SNMP) based information to various EMS and NMS packages. This includes, but is not limited to, SNMP traps and port/link-based utilization.Perform and maintain routine backups of all Telesystem network elements.Perform preventative maintenance for all Telesystem network elements.Continuously document and review recommended best practices to aide in continuous improvement and decreasing Mean Time to Repair (MTTR).Analyze trouble ticket and network statistics to provide recommendations on ways to eliminate any developing negative trouble ticket or network trends.Manage trouble tickets within the Telesystem trouble ticketing system providing accurate and relevant information via ticket updates and direct communications with Telesystem customers.JOB REQUIREMENTSEducation and ExperienceHigh School Diploma/GED—RequiredAssociate Degree – Major in IT, WAN/LAN, Telecommunications, Engineering or related technical degree.OR3 years prior telecommunications or networking experience.ANDJuniper Networks Certified Associate (JNCIA) or Cisco Certified Network Associate (CCNA) certification - requiredCertification must be kept current and the learning track applicable to the requirements of the position. Any questions regarding applicability should be brought to the attention of department management.If successful candidate does not have certification, it must be obtained within one year of hire date. Hired employees will have 1 year from their hire date to earn an associate level certification and 2 years from their associate level certification date to earn a specialist level certification.Working knowledge of all layers of both the OSI and TCP/IP networking models. - requiredWorking knowledge of routers, switches, firewalls and other security appliances. - required"}