{"title":"Associate Technical Writer for Security & Cloud Engineering","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL6mR4GWZlGNF-hVVXuuj0UBgEUIw597w3IiswEtd0EWfcI9ydQd28YZXybYhN9_9cxKAWtGran6YUxL_6bdJzkdqc_Gpn3P4Vy1rr2-KNunw9V7YI6BgbVoLdokc8RTtJ1XYqwHMkg3wN3kdpjvI42TyaA4FMJgPE_2c1KSGRIJaIIP3QDUVRxYMZDO3gK","source":"ziprecruiter","full_description":"Unqork is the no-code platform that's pioneering a new way for companies to build, deploy, and manage complex enterprise-grade applications. At this moment, Fortune 100 companies are using Unqork to create and deliver software without writing a single line of code.Gary Hoberman, former CIO of Metlife, founded Unqork in 2017 with a team of hand-picked industry professionals. Together we're creating a massive paradigm shift in the way software is built. If you want to have a hand in defining the future of application development, we want to hear from you.The Opportunity:As the Associate Technical Writer for Security & Cloud Engineering, you'll work alongside the team to create new content for the Security, Cloud Engineering and Sales Enablement teams. You'll be embedded within this vertical to allow for seamless flow of information and a deeper knowledge of your various projects. All documentation must align with regulated market requirements in the public sector, finance, healthcare and insurance requiring compliance with FedRAMP, HIPAA/HITRUST. Working with subject matter experts and stakeholders on the Security, Cloud Engineering and Sales Enablement teams, you'll use the technical writing process to deliver a best-in-class experience for our customers.This role will report to the Senior Technical Writer. What You'll Do:Own entire user guide-type writing projects from start to finish. This includes actively expanding the technical writing curriculum. You'll plan, research, develop, organize, write, and edit writing projects as needed for your individual vertical. Grow your technical aptitude and proficiency to effectively write about the Security, GovCloud, Public Sector, and Public Enterprise products.Successfully work in a team and KPI-driven setting.Liaise with developers and clients as needed to gather pertinent data and offer support for process improvement.Work with internal teams related to your vertical to understand documentation requirements.Create strong content that fulfills company standards and audience goals.Contribute straight-forward tooltips and user interface text as needed.Apply a variety of media forms; this includes images, GIFs, and charts as needed. Analyze documents to maintain continuity of style of content. You'll manage improvements, updates and revisions to Unqork's technical literature.Contribute to our comprehensive library of technical terminology and supporting documentation.What We're Looking For:Prior experience documenting solutions in AWS GovCloud or Azure Government clouds.Experience in a growing organization with minimal structure.1-3 years experience with technical writing in B2B/B2E industries.1-3 years experience with technical writing in SaaS, PaaS, IaaS products on public or private clouds.Prior experience with Madcap Flare and Central a plus.Current and active security clearance and/or the ability to obtain additional clearance(s) a plus.Unqork is an equal opportunity employer and proud to be committed to diversity and inclusiveness. We will consider all qualified applicants without regard to race, color, nationality, gender, gender identity or expression, sexual orientation, religion, disability, or age."}