{"title":"Construction Manager NEW!","location":"","salary":"","description":"","term":"$50,000 to $60,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKapU5GsYDoqRDCW9quUxAqqZBoQ4ZkpT0n3EDH-Yzn62QL9k25FRR_wPu4b9cre5USNqhCQ2dCn-a5fHAADDf46eM-iKGVvQgGwuqt3YmDmreYrwxM3ox60BJatRzUBSyWojPaopFcURUMknERKAvcWRLJEG1KpD7K73qgbJB54Ycgn0xaL527J9D6Qg","source":"ziprecruiter","full_description":"Construction ManagerThe Field Service Manager is responsible for coordinating all aspects of the installation projects between the customers, vendors and our company for multiple projects at once in teh assigned territory.Job Responsibilities:Coordinate installation project with customer.Approve and submit subcontractor invoices/draws for payment.Anticipate and resolve customer issues.Build and maintain constructive relationships with customers, sales, and administration.Maintain strong visibility on job siteKey Competencies:An understanding of carpentry, building, and contracting is preferred.Self-motivated with strong interpersonal communication skills.Problem solving and organizational skills.Great customer service.Proficiency in MS software.Project management and planningFlexibility in approach to different types of business problems and a willingness to change course to avoid project setbacksAble to create and establish structure and process across cross-functional teamsExperience working independentlyCollaborative, Adaptable, Creative, Honest, PositiveRepresent Republic Elite with pride and integrity.Provide a favorable customer experience from initial contact through installation.Promote and enable constructive communication between departments.Follow all safety and environment regulations.Valid driver’s licenseCollege degree required.Ability to travel up to 50%.*Physical RequirementsWhile performing the duties of this job, the employee is regularly required to conduct inspections and visits to the construction job site (i.e. stand, walk, sit, climb or balance, stoop, kneel, crouch). Ability to lift and/or move up to 50 lbs.Employment Type:Full-TimeCategory:Construction/Skilled TradeCompensation:50,000.00 - 60,000.00SalaryAddress:123 Main St, Houston, TX 77001 USABenefits: Medical InsuranceDental InsuranceVision Insurance401KLife InsuranceWe are an Equal Opportunity Employer – M/F/Vets/Disabled#ZR"}