{"title":"Fiber Engineer NEW!","location":"","salary":"","description":"","term":"$40 to $48 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAJj94BNoEgi8EcVUa-M0YoY46UAe7lyoHfa4efsNpkTFidD6-lATwSiLOHwGBT7beAli5yDQCjVJLmKeaj9d1ud59BOBxVPw4OEnbWXfotbilmOYeQe_Zcp4pJ5R4OoazPerjAfXXiNmI5lpjgss0DWWtsmyOjWNvqF3okDdcYFimaWm28i3W7F4QRe6dg","source":"ziprecruiter","full_description":"Job Responsibilities:• Attend Kick-Off meetings if new backbone, lateral, and / or riser fiber is required.• Review sales engineering design and determine backbone fiber route.• Obtain necessary circuit identifiers from groups; or create as required.• Create a Fiber DLR in Netcracker for A-Z fiber locations. (Note: New sites require the site survey form completed, submitted, and entered in the system prior by Fiber Construction.)• Design fiber route and create all necessary splicing prints and work orders for vendors performing splicing work within the active backbone.• Provide fiber assignments to Construction Team for lateral fibers to last demarc panel if new lateral is required. Construction to handle MPOE splice & demarc splices on new lateral builds only. Coordination of fiber cable count & demarcs will need to be obtained from Construction.• Fiber Engineering responsible for all backbone splicing & end/end testing. (Note: Splicing can be managed by Fiber Construction where requested.)• Obtain Quote/Bids from contractors for all backbone splicing & end/end testing.• Create Requisitions for Purchase Order approval and payment to vendors.• Participate in on-call rotation providing Fiber engineering Support after normal work hours.• Manage vendors / contractors during splicing & testing of circuits.• Submit all necessary Change management notifications and adhere to field activity policies and guidelines.• Provide Operations / Provisioning with final DLR’s & test shots for closeout• After completion close out tasks in CRM.• Approve all vendor invoices for the project in ReqLogic.Education/CertificationsHigh school diploma or equivalentMinimum 2 year technical degree or equivalent work experienceBS/BA (preference to Civil, Construction, or Electrical, Engineering Degrees) or equivalent work experience preferredA valid driver's license requiredOther Skills/Abilities - CAD experience a plusPreference will be given to candidates with BSCE, or equivalent work experienceExcellent organization/administrative skillsStrong project management skills with attention to detailsStrong interpersonal skills with a high level integrityStrong Microsoft Office (Excel, Visio, Word and Powerpoint) skillsAbility to thrive in a dynamic problem solving environmentAbility to multitask in a fast paced environmentStrong Communication skillsBasic telecommunications experience/knowledgePMP certification a plusA positive attitude and desire to deliver exceptional results for our customersPersonal commitment to safety, integrity, and continual professional development"}