{"title":"Web developer_Cincinnati |OH NEW!","location":"","salary":"","description":"","term":"$65 to $70 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAJ-Ep2Vv0Zm-gGp0SlRHYT9dKPGr5MRfZ7YLc9OG-7F-EpRdQnMkZtYcNJJBlSuEA4CbGUMjwK-W5ptILguSK0MIvp5U1Ws2m8Bs-cK1UQ1A1sRJXZaGwtuWMxrh6r0eEdz_uShSpTuUlrwdslwgd02jMUOloBnMFH1JM0NhxURWol4xuU_TrWJ63UZDyrH","source":"ziprecruiter","full_description":"Hi,I Hope you are doing Good! This is Rajesh from BCforward. We are in immediate need of the following resource, if you are interested please respond with an updated resume toWeb DeveloperLocation: Cincinnati, Ohio (Remote for now, onsite after COVID)Duration/Mode: 6 Month Contract to HireTop Skills: Javascript, Web Development, React, DevOps, NodeJS, TDD, Several of the skills in “Tools”Project name : Digital Core Fiscal 2020 – New Feature InitiativesPreference is for somebody willing to relocate. But will interview great talent even if they want to stay full-time remote. AMP stands for asset management platform not accelerated mobile pages.Supports the ongoing enhancements, scale, and maintenance for the Content & Page Builder product line using AMP's dynamic data and UI platform as a wholeParticipate in the application technical design process. Develop programming specifications. Design, code and unit test application code using SDLC best practices. Complete estimates and work plans as appropriate for design, development, implementation and rollout tasks. Create technical system documentation and ensure that this documentation remains current throughout all phases of the SDLC. Communicate timely status, including any potential risks/issues to the appropriate teams to ensure that assignment releases are managed appropriately and that completed assignments are of the highest quality. Support and maintain applications utilizing required tools and technologies. Provide support for applications, including involvement with the Support Center, NOC, Infrastructure teams, and vendors as appropriate.Tools:HTML5 & CSS3JavaScript ES6 / ES2015+TypescriptReact and ReduxWebpackNode.jsMongoDBVS Code, IntelliJGIT, Gitlab, TeamCity, JIRA, Confluence, MS Teams Minimum Technology Qualifications 5+ or more years experience with JavaScript and web development3+ years experience with modern web stacks using ReactJS2+ years experience with NodeJS building backend servicesExperience with DevOPs, TDD, and the SOLID principlesThanksRajesh317--588-8639"}