{"title":"Maintenance Mechanic - HST","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJtjRvzSM0ytbQmrMkTel3Mwplnq5J2yIcoCuDm607IJThNZFCF5mjBMmYUvfeQY5cUCRVKgPy1_Uk9QMJBi2MDCqsy4IC2Ioe6cLqhIGKJEzAJyJF4uW4pXNqu7phaLkmxXvogRaKw8w6_BC50cEL9svuQ5XrE7Ub4ANBZ5nuvCwlalvngETp76l_UDy0","source":"ziprecruiter","full_description":"Performs various general building maintenance functions in a variety of skilled and semi-skilled craft trades to support mechanical and electrical heating, ventilating, and air-conditioning machinery.Has the ability to plan, lay- out and complete installations, modifications and repairs, in addition to being responsible for instructing other personnel in general mechanic positions.Major Duties: Minor building maintenance tasks which must be performed to proficiency are listed herein by example, but they are not limited to the following:Makes minor adjustment and repairs to HVAC, plumbing, electrical, and sewage systems; architectural and structural building components; interior and exterior entrance doors; all door locks, windows, floors systems, roof systems, roof gutters, downspouts, window and floor coverings.Performs minor painting chores consistent with preventive maintenance functions and minor repairs.Performs minor preventive maintenance functions which include, but are not limited to: Changing filters; cleaning cooling towers, heating and cooling coils; cleaning floor drains, grease traps, roof gutters, downspouts; and changing fluorescent tubes and other light bulbs where needed.Performs miscellaneous functions which include, but are not limited to: remove and install signs and picture frames; assist in relocating furniture and computers; and performs other similar duties.Required SkillsQualifications:Must have practical working experience with a variety of different skilled craft trades and be able to understand written and oral instructions to perform the required work. Must have a basic knowledge of each craft trade which performs the individual functions for building operations, repairs, and preventive maintenance activities. These include electricity, HVAC, carpentry, plumbing, and communication systems.Carpentry skills preferredPhysical Effort and Working Conditions: Have the ability to make repairs and installation from ladders, scaffolding, and platforms. Works with systems and equipment in hard to reach places requiring standing, stooping, bending, kneeling, climbing and working in tight and uncomfortable positions. The incumbent frequently lifts, carries, and sets up equipment that weighs up to 20 pounds. Occasionally, may lift and carry items that weigh over 50 pounds. The work is done inside and outside, and is usually dirty, dusty and greasy. Sometimes may be required to make installations and repairs when bad smelling fumes are present. There is frequent exposure to uncomfortable heat conditions and to the possibility of strains, cuts, scrapes, bruises burns and infections. Welding involves exposure to flying sparks, glare of torches and heated materials.ADDITIONAL QUALIFYING FACTORS:As a condition of employment, must pass a pre-employment drug screening, as well as have acceptable reference and background check results.The Tatitlek Corporation gives hiring, promotion, training and retention preference to Tatitlek shareholders, shareholder descendants and shareholder spouses who meet the minimum qualifications for the job.As an equal opportunity employer, The Tatitlek Corporation recognizes that our strength lies in our people. Discrimination and all unlawful harassment, including sexual harassment, in employment is not tolerated. We encourage success based on our individual merits and abilities without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, disability, marital status, citizenship status, military status, protected veteran status or employment. We support and obey laws that prohibit discrimination everywhere we do business.This position is subject to the terms and condition of the Collective Bargaining Agreement between Tatitlek Technologies, Inc. and The International Union of Operating Engineers, Local 99-99A, AFL-CIO.NATIVE PREFERENCE APPLIES"}