{"title":"Hardware Engineer Ground Systems Associate Manager - United Kingdom","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALnU0bJCslV2xP2qrLa-ay9lJ9Tim-AERHBcHIa-l89izg_Ckv5HGr24Uyd_AemF7DXXadF9CRhoKCPH8lWdxng-PUTE5aqug_cBk93us2sV03pXBqFldg_DQccgDwPC_WohF_WCNFd5boxgFWCClQV5kEU4Dx6KduVprKuCNtLRnquG7j1fJeJhT6DIQPx","source":"ziprecruiter","full_description":"Description:At Lockheed Space Systems Company (SSC), we are driven by innovation and integrity. We believe that by applying the highest standards of business ethics and visionary thinking, everything is within our reach - and yours as a Lockheed Martin employee. Lockheed Martin values your skills, training, and education. Come and experience your future!An LM OCONUS program in the UK is seeking an Associate Manager to oversee both Hardware Engineers and Operations personnel. In addition the candidate will be expected to maintain a technical role on the program. Candidate must be able to perform system level troubleshooting and troubleshooting to the component level for non-LRU equipment. Be able to perform diagnostic testing on offline equipment and perform preventative and corrective maintenance actions. Implements approved modifications to the site hardware under the direction of site engineering. Document all preventative maintenance actions, troubleshooting efforts, repair and related daily activities using established logs and databases. Have experience in the design, development and testing of COTS or custom built equipment and the installation of equipment systems. Candidate will be required to directly interface with customers on system problem resolutions and be able to provide solutions that reduce mission outages. Provide on-call 24/7 emergency anomaly response to collect diagnostic data and support restoration and repair.Basic Qualifications:*Demonstrated Full Spectrum Leadership behaviors*Understanding of RF, digital, and analog technologies*Able to effectively troubleshoot and repair PCBs to the component level*Familiar with the use of lab test equipment such as oscilloscopes, logic analyzers, spectrum analyzers and network analyzers. *Understanding of electrical and mechanical systems associated with heavy ground terminals, air conditioning and heating systems, drive motors, gear and bearing mechanical systems*Strong verbal communications skills and proven ability to work as a member of a diverse teamCandidate and accompanying family members to this UK location will required to undergo medical and psychological exams, results of which must be approved by the site medical department prior to relocation.Desired Skills:*Must have active TS/SCI with poly*Previous supervisory or managerial experience*Direct program experience in the UK.Qualifications: *Demonstrated Full Spectrum Leadership behaviors*Understanding of RF, digital, and analog technologies*Able to effectively troubleshoot and repair PCBs to the component level*Familiar with the use of lab test equipment such as oscilloscopes, logic analyzers, spectrum analyzers and network analyzers. *Understanding of electrical and mechanical systems associated with heavy ground terminals, air conditioning and heating systems, drive motors, gear and bearing mechanical systems*Strong verbal communications skills and proven ability to work as a member of a diverse teamCandidate and accompanying family members to this UK location will required to undergo medical and psychological exams, results of which must be approved by the site medical department prior to relocation.Education: *Must have active TS/SCI with poly*Previous supervisory or managerial experience*Direct program experience in the UK.Employment Type: TS/SCI w/Poly"}