{"title":"Front-End Java Developer (some UI\\UX) NEW!","location":"","salary":"","description":"","term":"$55 Hourly","detail":"https://www.ziprecruiter.com/k/l/AAIkpu7ZJwCvM4Yl9p7x_rxrNQ8uMX9g-bVPviyvFn4ilcZVO_gpXuryIrem5FaWnkwBqiYrnChux83XzwsBKLG55siqN5Q4E_rUNC1onAzNvfWXHu-RFeEoo748lECUseUDqMIetNWhWLoztosNOsEWPTll6TZG8pTGhZHtwYi3KYcNlCUpyDOReTjHEA","source":"ziprecruiter","full_description":"Front-End Java Developer (some UI\\UX) Type – Temp – To possible- HireDuration –Temp duration estimated for approximately 5+ months (may end shorter or extend longer per Client request)Rate – $55.00/hr**no benefits, no paid time off, no holiday paid time offLocation – Irving, TX 75063Start – immediateNo C2C** Pre-employment criminal screen, drug screen, completed degree/education verification and employment verifications are required to pass before clearing to startJob Description:· We are using some of the following technologies like for next generation success… Java, Angular, Hibernate, Spring Boot, Pivotal Cloud Foundry. We are looking for a strong front-end developer with some UI/UX experience. We are also eager for you to bring new perspectives, experiences, and ideas into the fold. We are looking for that person who is agile and retrospective with an entrepreneurial spirit. Come join us at an exciting time and be part of the future of real estate agent tools while working in a fun inclusive positive growing environment.Job ResponsibilitiesLead UI\\UX front-end development team effortsDesign, code, test and debug complex software while developing new functionality, and enhancing existing functionality, in order to satisfy business requirements.Design work that encompasses a broader project/system scope. Work is assigned via broad guidelines.Work includes developing detailed specifications from which applications will be written, designed, coded, tested and debugged.Consult with product owners/business partners to define requirements and software design. Evaluate feasibility and make recommendations, considering things such as customer requirements, time limitations, system limitations.Mentor less experienced team members in learning this process.Assist team members on area(s) of expertise and provide technical guidance.Collaborate with TPM, QA team, and other developers.Support, maintain and document software functionality.Makes recommendations on and influences engineering processes and methods.Provide operational support on complex/escalated issues to diagnose and resolve incidents in production systems.No C2C***"}