{"title":"Backend Engineering Manager/Lead NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIWCxC6J_zLIz5ZEv1019WwjSRGzaDbroMvSHttedfFcqnLVuTizO-i1hcDcnUa2XZgqnJZ1e1kWR7uhW1-g_Sz0V-k2qN7i8-Uo0TkT-8ak-dYaUJF7jwc_D2x8c2jCCsHIImnR6r6sUwSvauLMX4k8MBWybAZD1EVIjm-QhSlX8wKocB_b4yv6OYHy3Y","source":"ziprecruiter","full_description":"Backend Engineering Manager/Lead Location: Work 100% REMOTE!Salary: Market rates base plus HUGE bonus + strong benefits (see below)Skills: Python, Cloud, leadershipWe are a Series C startup which has raised over $50m to date. A great opportunity to work in AI products for the sports/fitness/health industryTop Reasons to Work with Us- Rapidly growing startup so lots of opportunity- Strong benefits package- Great time to join as we build a new and cutting edge architecture!What You Will Be Doing- Lead a small team of back end engineers. Provide mentorship and help them be their best. - Hands on coding with Python, microservices, AWS & Azure for distributed applications- Design and architecture- Develop best engineering best practicesWhat You Need for this Position6+ years in software development with skills including:- Python- Distributed applications- AWS and/or Azure- Microservices2+ years leading other engineersWhat's In It for YouCompetitive base, HUGE bonus, 100% paid healthcare/dental/vision premiums for you (and 65% paid for your family), 401k, flexible/unlimited PTO policy, mobile phone reimbursement and more!So, if you are a Python Backend Engineering Manager/Lead with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}