{"title":"Quality Control Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJgtribsAEE0eG16iS1yZt84QtQVxe7ZqRPIRgT3FBV1RVrG6Q53K2Ht2aNghttbSogrrakHtZ-Sav1pTgbaOSVEVfEOKHrEr4yK8Vpbs1h7GIqQabldnE4DPa6Qez31tZovp9JNIWW0G79KjDOqsQn6---QRw6_3-N7pbZCP3-GT8ZQQSDOxlSLUoPRmQ","source":"ziprecruiter","full_description":"PURPOSE AND SCOPEThe purpose of this procedure is to provide a means of establishing the functions and relationship of this position at RICCA Chemical Company. This applies to all employees having earned this position through their educational background or work experience.REQUIREMENTSEducation: The Quality Control Chemist I should have a minimum of BA/BS degree in Chemistry or a science related field.Experience:Three to five years of experience in quality control analytical laboratory or regulated manufacturing environment preferably in the chemical or pharmaceutical industry. Experience in handling and operating laboratory glassware and equipment for testing purposes. Working knowledge of ISO9001:2008 standards, cGMP/GLP regulation, and laboratory sample processes. Knowledge of ISO 17025 standard is a plus.Physical Requirements: This position requires a person to be able to speak, write and conduct business in English. This person shall also have sufficient eyesight to read business documents and properly fill out appropriate Quality System Records and Forms. This person may be required to occasionally lift up to 70 pounds.Mental Requirements:This position should be able to understand and then follow written and verbal work instructions and quality system procedures without direct and constant supervision after the initial training period is successfully completed and documented. This position should have sufficient mental capacity to accommodate and successfully implement changes in work tasks and quality system changes when required.Working Conditions:The Quality Control Chemist will be working primarily in the Quality Control Lab area of RCC where central heat and air is provided. There will be times when work is required to be conducted in the warehouse areas where exposure to heat and hazardous materials is likely. Appropriate personal protection and safety equipment must always be worn and/or used.TASKS AND DUTIES• Act responsibly at all times to ensure the health, safety, and well-being of self, co-workers, visitors, neighbors, and property. This includes compliance with all RCC safety policies and procedures, and a working knowledge of government regulations, particularly hazardous material regulations.• Schedule and assign daily testing based on the company’s planning schedule to utilize available skills, knowledge and experience, labor hours, and lab equipment.• Ensure that all assigned testing of finished products is conducted according to specified procedures and in a timely manner.• Performing routine and non-routine analyses without supervision.• Collect data and calculate Measurement Uncertainty Budgets for specified testing.• Competently perform at least 95% of the types of analysis/testing.• Make detailed observations, analyze data, and interpret results.• Read and record data quickly and accurately and avoid perceptual errors in performing computations.• Prepare Certificate of Analysis reports without errors.• Review of data obtained for compliance with specifications and report abnormalities; including measurement uncertainty budgets for specified testing.• Compile data for OOS investigations, documentation of test procedures, and abnormalities.• Assist in technical complaint investigations and development of new methods and technologies.• Participate and satisfy requirements for inter-laboratory round robin testing as well as ISO 17025 Proficiency Testing as required in order to maintain accreditation.• Troubleshoot, calibrate and perform preventative maintenance on laboratory instruments and equipment and document events as required.• Ensure inventory levels for laboratory supplies are kept current and are accurate.• Stay abreast of ISO 17025 requirements and follow all RCC Standard Operating Procedures with special attention to those pertaining to the laboratory processes.• Act responsibly at all times to insure the health, safety, and well-being of self, co- workers, visitors, neighbors, and property. This includes compliance with all RCC safety policies and procedures, and government regulations.• Other duties as assigned."}