{"title":"Developer I, Data & Analytics Software Solutions | Forensic & Litigation Consulting","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAImzwDiZZKFfoNAmB1QE8TAURmL8jhrR-y_1UB_fAQb6-O7T2dvTOCYSViZsh8S4E0QXMozh53V7sYM29FBsMiQO4_D0yAdEVMH9A23EWr6_HW8ftw6cT87eUheDMH6CnR9GCYV5EY74Af6XAEnUehVzPVMn_dGlPQRsAo9n9_-Se-KDMx9F0ZJYCyCdg","source":"ziprecruiter","full_description":"About the Role We are involved in complex, global and high-profile litigation, arbitration and investigations combining end-to-end risk advisory, investigative and disputes expertise to deliver holistic solutions for our clients.A Developer-I at FTI Consulting will provide support and web application development as they relate to litigation, dispute resolution or financial investigations. A Developer-I will assist businesses, government entities and law firms in complex application development requiring the understanding of relationships between various information sources, complex modeling or information sharing. What You'll Do As a Developer-I, you will develop in-depth knowledge of your clients' objectives and challenges in order to design and implement innovative strategies to assist them through their current difficulties and prepare them for the future. Designing, creating, and implementing client centric web applicationsAnalyze, code, and test simple to moderate modules (both new and changes to existing programs) from design specificationsLearn existing applications and design new tools to improve processesIdentifying the relationships among multiple sources and types of data, and organizing this information to facilitate effective data analysis How You'll Grow  This is an excellent opportunity to join a collaborative team that provides real value to clients, while also having the freedom to innovate, work on a variety of interesting projects and grow professionally.  Qualifications & Experience Bachelor's degree in related field1+ years' experience with Agile web application developmentExperience with the full stackExperience with TypeScript/Angular, TypeScript/NestJS, Python/Django, PHP/Laravel or equivalentExperience or demonstrated interest in DevOps, Docker, security, cloud/AWS, automated testingAble to work in a team as well as independentlyAble to adapt quickly in handling multiple/evolving tasks as a result of new engagements and/or re-prioritized deadlines                                                                                                                                                                                #LI-SC2                   Our Benefits   Apart from the well-structured career path and excellent team environment, our employees enjoy a variety of perks and benefits. Our benefits include, but are not limited to: Competitive salary and bonus plansGenerous paid holidays, time off and parental leaveFull package of benefits plansCompany matched 401KAnnual paid volunteer hoursCorporate matching for charitable donationsPotential for flexible working arrangementsFree snacks and drinksUpscale offices close to public transportationPet insurance   About FTI Consulting   What makes us unique? With more than 6,250 employees located in offices in every corner of the globe, we are the firm our clients call when their most important issues are at stake. Regardless of what level you are, you will have the opportunity to work alongside and learn from top experts in your field on high-profile engagements that impact history. Our culture is collaborative, and we value diversity, recognition, development and making a difference in our communities.   FTI Consulting is publicly traded on the New York Stock Exchange and has been recognized as a Best Firm to Work For by Consulting magazine and one of America's Best Management Consulting Firms by Forbes. For more information, visit www.fticonsulting.com and connect with us on Twitter (@FTIConsulting), Facebook and LinkedIn.   FTI Consulting is an equal opportunity employer and does not discriminate on the basis of race, color, national origin, ancestry, citizenship status, protected veteran status, religion, physical or mental disability, marital status, sex, sexual orientation, gender identity or expression, age, or any other basis protected by law, ordinance, or regulation.  Additional Information Citizenship Status Accepted: USA Citizenship, Permanent ResidentExempt or Non-Exempt?: Exempt"}