{"title":"Sr. NOC Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJIO7xSSeG0J0QTTZ40HsgYgcGsXvTqGOhxqfAAe3YqArV8DKrtd5MNV9xpVmtwbypyN92KKft2fmxDunMmAbfWzSYAojUw3dLVpKEyYfXmziwifJM-thxqizSuBgYcSe0ysrzkRc4ImCv20MugozJ4p9GstpJ5ga_az4QYEOVG8ZNXAo9xq3hHL4f4tcQ","source":"ziprecruiter","full_description":"Leading network service provider seeks a highly talented Sr. NOC Engineer to join a growing Cloud Management Team. Will provide production systems health monitoring, event management, escalation handling, and communication of all Incident and Change Management. Successful candidates must be able to multi-task and prioritize system events according to severity and escalation procedures. Must be comfortable communicating quickly and accurately in the event of production emergencies, both with internal and external groups. Monitor customer infrastructure for events, address and resolve a wide variety of incident tickets and customer service requests with a high sense of urgency.Provide monitoring, orchestration of outage issues, and incident resolution in support of the daily operation of a NOC. Identify, troubleshoot, escalate and resolve issues affecting customers infrastructure.Work with other tiers and team members to draft and update relevant SOPs and documentation.Provide Level II support for Networking Layer 1, 2 and 3 for hardware and software problem determination and resolution efforts.Triage tickets, troubleshoot incidents, and escalate issues to management, Tier 3 level Network Engineers or other teams.Monitor tickets to ensure they do not exceed SLAs and contain timely and complete updates.Perform changes at a network level to avoid impact of planned vendor maintenances/outages.Take ownership of and follow up on escalated tickets to ensure compliance within SLA.Work with Engineering to improve Tier 1 and 2 troubleshooting while providing permanent solutions to chronic issues.Provide and validate root cause analysis for major and minor network outages.Coordinate vendor activity for the various Layer 1 platforms used across the network.Identify chronic problems and take action to identify and resolve them.Ensure that all changes and maintenance are in compliance with Company’s Change Control policy and Change Management processes.Assist with weekly and monthly maintenance activities as required for external support vendors or internally requested maintenances.Participate in network disaster recovery tests for the production network.B.S. degree in Telecommunications Engineering, Electrical Engineering, Computer Science or equivalent skills developed industry experience5+ years industry experience in a Network Operations Center (NOC) or Network Engineering role for a large enterprise or service provider environmentStrong working knowledge of the following Layer 1 platforms: Ciena 3500, 5200, 6500, Cisco ONS15454, Turin Traverse 2000In-depth knowledge and troubleshooting of OTN, SONET, DWDM, Carrier Ethernet, T-carrier, Private-Line and CPEWorking knowledge of network transition language (TL1)Ability to identify, correct and update circuit layout records.Ability to lead and direct 3rd party vendors during problem determination/resolution effortsExtensive knowledge of data communication concepts and technologiesRouting protocols and related technologies: OSPF, BGP, EIGRP, MPLS and VPLS  Experience on L2 switching and spanning tree technologies troubleshooting  Working knowledge of Cisco and Juniper IOSCisco CCNA or Juniper JNCIA certification is preferred.Ability to learn and respond to demands in a fast-paced highly technical environmentAbility to manage multiple projects and responsibilitiesStrong organizational, time management, interpersonal, and service delivery skillsStrong customer service and communications skills (written and oral)"}