{"title":"Analytical Develpment Chemist III","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALedelPaSe4ED0QTXUyZ18OeR0FAvBHO90j60dWZL6Di_SA-hPtMAa1vhAi6YVZ1uxOKgBAqvJRCVSHmoO5hdWytq3RM6DyWuw-lCjaXV0j_27t7mKQzZm8wHfNElMRJXMtmOkwgRjMFFVEHkSihWBiySitH5qRyeHegcgF4BYqxS86Pv5DS7Uxcd2QMDgM","source":"ziprecruiter","full_description":"Job Summary:The Analytical Development Chemist III performs various analytical activities to support development of multiple new drug products. Participates on cross functional teams and applies a variety of analytical methodologies to support testing of API and drug products. Works under supervision. This is not a lab position. Job Duties: Takes an active role in supporting analytical development strategies such as method development and stability study initiation for new drug candidateReviews technical documents that support product development, including but not limited to test methods, method development reports, method validation protocols and validation reports. Evaluates data and related documents generated from analytical testing at Contract Research Organizations /Contract Manufacturing Organizations (CRO’s/CMO’s), including Certificates of Analysis (COA’s) and analytical reportsProvides input on phase-appropriate stability protocols for API and drug product in accordance with regulatory requirements and as needed to support clinical trials and regulatory submissionsContributes to the design and planning of analytical testing studies at Contract Testing LabsGenerates, evaluates, and maintains summaries of stability data of building blocks, intermediates, drug substances, and drug products; provides statistical analysis of analytical data, using computational predictive tools, modeling software and data visualization tools where appropriateMonitors the supply of reference standards and critical material across testing sitesContributes to investigations and resolution of out-of-specification (OOS) and out-of-trend (OOT) testing resultsReview studies to ensure that they are in compliance with specific regulatory guidelines, e.g. ICH, FDA, and EMA. Supports analytical sections of regulatory filings for US, EU and ROW to include: tables and summaries, product specifications, and product stability in INDs, IMPDs, and later NDAs, and other documentsComplies with all applicable policies regarding health, safety, and environmental policies Job Requirements:BS in Chemistry or related area and at least 5-8 years of experience working in analytical development in a biotech or pharmaceutical industry; or equivalentSolid understanding of analytical methodology and instrumentation used in testing and characterization of pharmaceutical ingredients and productsWorking knowledge of one or more of the following detection techniques: UV, PDA, CAD, MS Hands-on experience in HPLCWorking knowledge of regulatory guidelines as it applies to analytical procedures and criteria, including: FDA, EMA, GMP, WHO, and ICHExperience in analytical development and the use of published literature and external experts to extend his/her understanding Team oriented; ability to work collaboratively with internal colleagues and vendors Demonstrates solid communication skills [presentation, interpersonal skills, and written] Experience in Microsoft Office (Word, Excel, PowerPoint). Ability to create tables and graphsMust be flexible and able to multitask, prioritize, and meet deadlines in a fast paced environmentMust be detail-oriented and organizedSome travel may be required domestic and international [less than 10%]INDSJ2021Powered by JazzHRqRJTmHQjVC"}