{"title":"Software Engineer, Sr NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK19IjTsfzRUS3LG2i9SlIrf7HZqzGyqa5ZCYPWZYndF71Wz84J8KZh1GDVY4FGYhFwo5gN5q5BJxJ4uZpr1RXZpsccFS8NNMGtseTumq_kXIxpjfhUK2AUeD45ChtLGxfrz0Mu8p-gFYi6ia3m8AXuzKpVVip5lnZ9KdCLZFktt4ldHBrTl4ZNH6lP1bc","source":"ziprecruiter","full_description":"Software Engineer, Sr Aurora,CO,US Chantilly, VA, USA Apply + Be you+ Be Booz Allen+ Be empowered+ Learn MoreJob DescriptionLocation: Aurora, CO, USJob Number: R0073012Share job via: Share this job: Share Share Software Engineer, Sr with FacebookShare Software Engineer, Sr with LinkedInShare Software Engineer, Sr with TwitterShare Software Engineer, Sr with a friend via e-mailSoftware Engineer, Sr The Challenge:Are you looking for an opportunity to not just develop software, but to build a system that will have a positive impact on the intelligence community (IC)? As a full stack developer, you can solve a problem with a complete end-to-end solution in a fast-paced, agile environment. We're looking for a developer with the advanced skills needed to build computer software from vision to production-ready system.This role is more than just coding. We need a full stack developer who will use their passion to learn new tools and techniques, identify and implement system improvements, and mentor teammates. Using Java and open source software technologies you'll build distinct product hardware. You'll analyze the needs and the environment to make sure the solution you're developing considers the current architecture and operating environment, as well as future functionality and enhancements. Join us as we build systems to change the IC for the better.Empower change with us.You Have:-4+ years of experience with full stack development, including Java and open source software technologies expertise-2+ years of experience with Linux-2+ years of experience with web application, service, or back end development experience-2+ years of experience with the database persistence layer-Experience with Agile software development methodologies and tools, including Git and Jira-Knowledge of user interface (UI) technologies, like React or AngularJS-Top Secret clearance-BA or BS degree-Security+ CE, SSCP, CCNA-Security, or GSEC Certification or the ability to obtain within 6 months of start dateNice If You Have:-Experience with Open Systems Architecture design principles-Experience with automated testing and DevOps technologies-Ability to work in a team environment-TS/SCI clearance with a polygraph preferredClearance:Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Top Secret clearance is required.Build Your Career:A challenging and dynamic work environment isn't all we have to offer. When you join Booz Allen, you can expect:- access to experts in virtually every field- a culture that focuses on supporting our employees- opportunities that provide stability while offering varietyYou'll also be exposed to a wealth of training resources through our Digital University, an online learning portal featuring more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, onsite boot camps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We'll help you develop the career you want, as you chart your own course for success.We're an EOE that empowers our people-no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, veteran status, or other protected characteristic-to fearlessly drive change."}