{"title":"Network Administrator","location":"","salary":"","description":"","term":"$60,000 to $70,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKT8qiGHpx0cPPl4jr7DDfjipHD7ZgEoZtPYDTswpd20taYb6Jd8BoUlDzZ29dGN0XPgO0mKu3rqWLqFC8doJtsYV11NrCSj--CAViuisqKo8Ee8QAjbwoRuCDypd8C-PGU7-ZrpWCp0E1Sfmt-z_f7DzQHQh4DGO337bd1UqaNWu29gN33FLJ7_0VTvp5f","source":"ziprecruiter","full_description":"SummaryResponsible for the overall systems infrastructure including engineering, implementation and integration, and technical services and support. Designs, implements/installs, maintains, and administers infrastructures including hardware, software, and various configurations. Analyzes and resolves problems associated with server hardware and server application software. Detects, diagnoses, and reports problems on all hardware and software systems. Performs a wide variety of tasks in software/hardware maintenance and operational support.Essential Duties and Responsibilities:The following duties are normal for this position. These are not to be construed as exclusive or all-inclusive.Responsible for developing and maintaining the technology architecture of the company, including but not limited to hardware, software, networking, systems and support processes and procedures.Work with various security concepts, products, and vendors. Assists with annual Information Systems General Controls audit as well as other audits.Monitors overall performance to proactively identify potential issues and tune appropriately.Administrate cloud technologies such as m365 and Azure Active Directory.Provides support to all company locations on problems and issues related to hardware, software, networks and business applications.Responsible for configuring, documenting, implementing and troubleshooting the following products; Microsoft Server Operating Systems and Email Systems, Backup products, Anti-Virus products, VMware systems, Firewalls, Cisco routers & switches and Remote Access methods.Responsible for network data back-up integrity, availability, inventory of both on and off site vaults. Services the installation of any updates in backup software and directs regular backups.Assists with disaster recovery / business continuity processes and procedures as it relates to the network infrastructure.Required Education and Experience:Three to five years’ experience in Network Administration, including Windows servers and Active DirectoryEquivalent combination of education / certification and experience will also be considered.Preferred Education and Experience:Bachelor’s degree in Information Technology or related field.At least one year experience with Information Technology in the banking/financial services industry.One to two years’ experience with VMware and Veeam Backup and Replication software.Additional Eligibility Qualifications:Pre-employment screening required including employment reference, criminal background check, credit check and possibly skills testing."}