{"title":"Technical Operations Support Representative","location":"","salary":"","description":"","term":"$30 to $40 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAI9RZbfZ_jTvXG70kYDa-dRJuvqaLJeg7JBorjsf8_XY16IATi_FAOxTkinaZN3rCScrB1h_axs_tlkT9l_g5_7cdwhV1TfgeVS6vLN9NVwwsS9WzixY3EH9BwpvBbkoDnI3gtj6xMkiRcBjyvH7vf0GpJQ-4Vin0IN2htnkn8RRnqcy4VDGw86HCy0-i8","source":"ziprecruiter","full_description":"Technical Operations Support RepresentativeThe purpose of this position is to support the users of provisioning services. Work requests are received from operations staff, customers and other internal staff. They troubleshoot issues encountered and work with the development team to find solutions. Additional responsibility will be maintaining sets of meta data using tools built by the development team, and Community provisioning. They collaborate with many groups in the organization including support teams, other development teams and operations teams. Responsibilities include researching and answering questions Monitoring the provisioning mailbox; responding to new provisioning requests, monitoring CIAM customer queues and microservices. SSO, PCI and User Manager setups and implementations. Maintaining metadata for roles, allow lists, integration testing Projects and other work as requested, including Community and other Provisioning Ability to understand the data, technical issues and impact on . projects; and effectively communicate these issues and impact to other project stakeholders Self-motivated problem solver; approach problems and issues in a logical/systemic manner; research issues to the lowest level to secure answers and resolve issues decisively This is a remote contract role to start for a Charlotte NC based healthcare client - The candidate MUST be local to Charlotte for when they go back onsite – The hourly rate range is $30-40 /hour pending statusWe are looking for a problem solver, team player, driven for results, adaptable, self-mastery with EXCELLENT interpersonal and communication skills/personalityRequired Skills:SQL skillsDatabase knowledgeMicrosoft OfficeIntermediate/Advanced level of comprehending intangible or abstract concepts, and the ability to understand and diagnose issuesIntermediate/Advanced level of understanding of standard data formats; proficiency in data manipulation and analytical tools; and an understanding of data and fields in the warehouseVerbal and written communication skills including communicating complex and technical information in a clear, concise mannerExhibiting patience, is even-tempered, and not easily stressedNice to Have:Knowledge of Provisioning, Identity and Access Management Key Words:Customer ServiceTechnical SupportSQLPhone SupportDatabaseData fieldsBachelor’s Degree Requirement: Yes"}