{"title":"Semi Skilled Mechanic II (JFK)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIw4OlWDBngHa4Ohkc2_SLyIyuPy2bfzUNr6CLMzSJxOlKieleNhk4t6NE7mebhLEpqYCfZrvOZJCZCf6UZnTwqgsHdNSavcFtDg1OcVjIdfGJp11eGUYwTIy6VzTVvEqJyJdy1akD0Tozk0r2D0S47iOYgHBc0pYZCr4Vvk8xxjnp51f5Z77-tDG543S4","source":"ziprecruiter","full_description":"Semi Skilled MechanicLAUNCH Technical Workforce Solutions is seeking Semi Skilled Mechanic for an opportunity in jfk.Responsibilities: The GMM works as a semi-skilled mechanic in maintenance of Ground Support Equipment (GSE). This position is responsible for utilizing appropriate tooling, equipment and material to accomplish maintenance functions including but not limited to the following: inspections, minor troubleshooting, repairing, removing and replacing components on all GSE functions. The GMM will be responsible for working on stationary equipment: water cabinets, loading bridges, air handling systems, baggage conveyor systems, and 400 Hz gate power. The GMM may also assist a Ground Maintenance Lead Technician or a Ground Maintenance Technician on stationary ground support equipment as needed. Summary of responsibilities (not comprehensive of all tasks): • Performs all routine and non-routine maintenance on passenger loading bridges (interior, exterior, console, and dock lights) and interior and exterior painting. This will include bulb and lens replacement. Any electrical issues such as ballast and or fixture replacements will be reported to GSE Supervision. • Performs all routine and non-routine maintenance on air handler hoses, adapters, air filters, condensate pans, and indicator bulbs and lenses. Any inoperative units need to be reported to GSE Supervision. • Performs all routine and non-routine maintenance on gear boxes, bearings and shafts, roller replacements, belt re-lacing and belts replacements. • Staffs baggage handling system (BHS) control rooms as well as reconciling bag jams to keep BHS flowing. • Performs all routine and non-routine adjustment of ground power cables and associated clamping/saddles. Reports any inoperative units/retract reels to GSE Supervision. • Performs all routine (PMI’s), non-routine, emergency, and heavy maintenance of the water cabinets. Any electrical issues such as inoperative motors, switches, heat strips and or light fixture replacements will be reported to GSE Supervision. • Performs small component repair and build-up of non-specialized components on specialized equipment; the components include but are not limited to: air conditioning adapters, water cabinet adapters, baggage carrousel bumpers, and dock light controllers. • Practices safety-conscious behaviors in all operational processes and procedures.Qualifications and requirements:        • High School diploma, GED or High School Equivalency        • Must have a minimum of 6 months experience and/or training in industrial powered mechanical environment and have a basic understanding of mechanical, electrical, hydraulic and pneumatic disciplines as they apply to industrial powered systems.       • Must be authorized to work in the US.       • Must have a valid driver's license.       • Must be at least 18 years of age.       • Must be able to read, write, and speak English fluently.       • Must be able to work a flexible schedule including fixed or rotating shifts, both indoors and outdoors, include traveling, overtime, nights, weekends, and holidays.       • Must be able to pass an extensive criminal background check (all information provided will be verified). Any discrepancy will result in immediate disqualification; must also successfully pass a drug and hearing test (audiogram) in addition to successfully passing a background check.       • Must achieve a satisfactory score on entry tests structured to determine ability to perform required tasks.       • Must be able to read, comprehend, and apply information found in technical documents and manuals.       • Embraces diverse people, thinking and styles       • Consistently makes safety and security, of self and others, the priority.Must have reliable transportation to and from the job site.Must pass pre-employment drug screen, audiogram and background check.All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or veteran status.Why Choose LAUNCH?A team of aviation staffing experts leads LAUNCH. We understand the challenges of finding the top aviation jobs and we focus on linking you with the best openings in the most sought-after locations.LAUNCH provides you with a real benefits package, including access to company-sponsored medical/dental insurance and a 401k program with a company match. Plus, you join the LAUNCH Loyalty Club on your first day, earning you extra cash bonuses, apparel and safety rewards.If you’re ready to LAUNCH your career, you've found an employer that can take you to new heights."}