{"title":"Field Marketing Manager","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKeWbLAFOzQngx81CuLRVtKPetD3rY0UpYHRrKTqpU_6yZ_s0kPhLeN6VxT7DGct_-hFpqJSZ60USMscwz5tzTo_e_pR1hxUi6I1Wa65oGaE2CwGevvaiE0yQkRdEhgGbyT126oHfzDCGDelkVE8kbE7RqA0l8c2m956rNAYmvvYSktI3kOIUo8R6O84rY","source":"ziprecruiter","full_description":"Western Forest Products is looking for a Field Marketing Manager to join our Sales and Marketing Team based in Dallas, Texas.With the overarching objective of Defining a Higher Standard, the Field Marketing Manager (FMM) will drive sales and marketing support for Western Forest Products (WFP) branded products in their designated region to create demand that can be funneled back to our key distributors and ultimately increase sales for WFP. The FMM will manage all incoming leads for their designated region and develop them into sales.Key duties for the FMM will be to increase revenues based on marketing activity and demand generation in the serving area. The candidate will develop, manage and build an opportunity pipeline (ideally in a CRM) for ease of communication and hand off to our distribution partners and their customers. The FMM provides marketing and sales support to our strategic partners and will be our key contact for all downstream relationships in targeted geographical regions (ie. Architects, Regional and national builders, contractors, pro-dealers/lumberyards, and other key decision makers).RESPONSIBILITIESDrive market awareness, education and branding for Western Red Cedar (WRC) and WFP branded products through target audience – i.e. downstream customers, architects, associations, designers, influencers, developers.Identify project opportunities, work directly with decision makers, get WFP branded products specified and hand off opportunity back to our distribution partners to close the sale together. Will be proficient in creating, moving through the pipeline, and closing opportunities.Identify new product opportunities of scale and develop market opportunities.Uncover marketing opportunities to help drive objectives.Market WFP and products through educational presentations (certified AIA CE courses), product knowledge sessions, trade shows and analyzing and participating in branding opportunities in assigned region.Build out a detailed map of the supply chain in targeted region; identify WFP distribution partners’ customers they are selling too, working with, or currently influencing to clearly identify areas to work within and opportunities to create. Know who is buying and using WFP product and who is not.Align local strategy with regional partners’ strategy and collaborate consistently with ride-a-longs, customer visits, product knowledge sessions, marketing events, etc.Ensure product experience and branding is present at store level; merchandising and instore training will be required.Provide market intel and insights on a frequent basis and offer corrective solutions to strategy if required.Assists all customers with sales and technical support for assigned products. Collaborate with sales to resolve all customer service issues related to assigned product.Collaborate with sales on developing sales solutions and competitive pricing strategies for assigned product(s).Understand and monitor regional codes and specifications related to WFP products.Other duties as required.QUALIFICATIONSEDUCATION AND EXPERIENCE5+ years’ experience in the building materials industry in either sales or marketing related rolesBachelor’s degree in relevant field or equivalent industry experienceExperience in the forestry industry is strongly preferredSKILLS, KNOWLEDGE AND REQUIRED COMPETENCIESWorking knowledge of assigned product line, customer support/service, market analysis, sales forecasting, products, market pricing, and product positioning.Possesses well developed consultative selling skills, negotiation and communication skills.Ability to speak to market prices, provide market updates, prospects, evaluating current and potential sales.In-depth knowledge of marketing in the building materials industry; knowledge of the forest products industry preferred.Experience in working with architects, designers, builders and other specifiers; asset if the candidate comes with a database.Interpersonal skills – must be able to communicate and collaborate with WFP and our partners.Creative and outgoing personality.Pro-active, self-driven and able to operate with little supervision.Business development experience.Strong presentation skills.Proficiency using Microsoft Office, CRM, and relevant sales systems technology.Ability to travel overnight when requiredBENEFITS & COMPENSATIONCompetitive salary with a pay for performance philosophyGenerous medical/dental benefits and 401(k) benefits.Opportunities for cross-training and advancement.Active safety, quality and environment programs.CAREER ADVANCEMENTWe strive to support our people in reaching their full potential. We provide a variety of on-the-job training and continuing education in many areas at Western to ensure you have the skills you need to succeed. Our promote-from-within culture recognizes high performance, and we offer diverse career paths across the organization for those with the talent and will to advance."}