{"title":"Electronic Assembly Technician","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKjyYMnf4-rTIg7pWFPNAzLEqGaQ15KkDPsjyzsteerTdyIxKT0y_9_llaoFtIuOO1TZaM3TPYi-SImGTzHhAOhCQQOO14r7vrVWA25ayTynN9RxwMPeO26C4Ou0GFpZNFLk3GKvn7vIbKrEtPAyeQEW-KiAiiSrZOyTl9rGUbpW3NB1Wi_-0YOEbhXYss","source":"ziprecruiter","full_description":"ROSEN is a leading privately owned company that was established in 1981. Over the last 4 decades, ROSEN has grown rapidly and is today a worldwide technology group that operates in more than 120 countries with almost 4000 employees.ROSEN offers sophisticated and highly innovative products and services to the oil and gas and other engineering industries. ROSEN is an extended team of people with a passion for technology and innovation. We are always looking for young professionals as well as experienced employees.Our ongoing organic growth results in career opportunities and gives our employees chances for further development and added experience.For more information about ROSEN go to www.rosen-group.com.ROSEN USA, based in Houston, TX seeks to employ an Electronic Assembly Technician to test, repair, sensor test and perform basic wiring of ROSEN USA’s in-line inspection tools.Responsibilities:The Electronic Assembly Technician will be responsible for the following:Repair and test electronic components and wiring of in-line inspection tools in accordance with documented work procedures, technical instructions, drawings and parts lists.Verification of the external sensor components of the in-line inspection tool.Ability to identify parts and sensors that may need to be purchased or manufactured for the tool.Work in close cooperation with Field Service Technicians regarding electronic and sensorial affairs.Work in close cooperation with Mechanic Assembly Technician for final tool testing and assembly.Qualification or Skills:2+ years of relevant electronic assembly experience.Associates or Technical degree with emphasis in electronics.Wiring, soldering and assembly experience in a manufacturing environment a plus.Ability to use a variety of hand and power tools.Must be able to lift 50 lbs. or more.Must have experience interpreting and working from schematic diagrams, specification sheets and manuals.Must comply with established Health and Safety regulations.Excellent written and verbal communication skills and capability to communicate with all levels of the organization.Good time management and organization skills.A self-motivated, pro-active individual who is able to work independently as well as in a team environment.Basic skills with Microsoft Office products such as Word and Excel.OUR OFFERROSEN USA offers an exceptional working environment, salary commensurate with experience and incredible benefits package."}