{"title":"Client Care Coordinator NEW!","location":"","salary":"","description":"","term":"$17 to $19 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALxakWSockTAT4jFdHfXN3z8AJYZupOeLYD2b_0OCDycPjNXp6336WDc1gWBcY4rMpm3G8CJ2ikDd13gXmMpB9Bjwra9TvQYJ_g7tqnZev7Ap6UdYqgv3BodI-4g4ZFaSyisGelfO_5dntZPyLNJo3zjIg2_UcnGjPur-Iabl3GihN8nUtH3sreA4ou17Z_","source":"ziprecruiter","full_description":"RestorePro is seeking a Project Coordinator position to join our team. The coordinator is responsible for consistent communication with our clients (property owners), providing updates on the status of projects & the next steps, as well as helping guide them through the insurance loss process. Additionally, the Coordinator oversees file compliance, provides administrative support to managers, and handles generation and submission of invoices to clients.Specific Duties:Perform all DASH online and webinar training and prove to be a proficient user of the software.Thorough understanding of the individual phases involved in the Restoration Process - EMS, Mitigation, Reconstruction, Contents and other Environmental work.First point of contact for the restoration needs.Review and enter all information possible/available from project into DASH (job management software).Prepare all documents for field file from DASH including pertinent information missing and required to be obtained for this phase.Track missing details and follow up to get any other homeowner and insurance/mortgage information not obtained on initial call - setting action items for self and Project Manager in contact with the client.Ensures Date inspected and other relevant dates, notes, photos and documents are in DASH (from both PM, subcontractor and internal crew visits).Client Care Calls - ensure constant, most often daily, communication with the customer. Responsible for obtaining verification of work completed, advisement of what will scheduled for the next day, and gauging the customer's satisfaction.Ensure notes are entered in all open jobs, contacting relevant participants and escalating to the department manager as required.Requirements:Must be a team playerHigh School Diploma RequiredMinimum 3 year experience in administrative role/office environment, focus in customer interaction/service a plusExperience in the property insurance claims/restoration industry preferredProficient knowledge of web-based software platformsMicrosoft Office Suite requiredKnowledge of insurance claims process preferredQuick books knowledge is a plus, but not necessary.Legally authorized to work in the United StatesAbility to successfully pass a background check & pre-employment drug screenRestorePro Reconstruction is an equal opportunity employer.Job Type: Full-time, non-exemptCompensation: Commensurate with experience, hourly compensation plus bonus structure after 90 daysJob Type: Full-timePay: From $35,000.00 per yearBonus opportunity"}