{"title":"Field Service Technician II - Brooklyn, NY","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIxa13UgHHRy1j7UuG1Avye7xF3kt8bs3g6_d1KlLDk1a_4s5_s6UfXAIbuWtc1Rjs0sblBC0M4HYlomXaD_S2ZCKAKijl53SvR9U_lKWujLZ27njAk96hubC10SXqc7GLJ0zQZtcKPGGSYOPQM2Ud9Jy2plcBniDuy6IzOC9YYo2NkofI_DTJ_blXuN9a6","source":"ziprecruiter","full_description":"About NCR NCR Corporation (NYSE: NCR) is a leading software- and services-led enterprise provider in the financial, retail and hospitality industries. NCR is headquartered in Atlanta, Georgia, with 36,000 employees globally. NCR is a trademark of NCR Corporation in the United States and other countries.TITLE: Field Service Technician IILOCATION:Brooklyn, NYRole Description:As a Field Service Technician, you are part of our services support team and your passion for providing exceptional customer service contributes to our world class high level of customer satisfaction. Acting as a first line response to customers on-site in your assigned territory you will communicate in an open, helpful, and engaging manner with your focus being finding the right solution with each customer.You will connect with our customers to address questions and resolve various problems on-site (some uncommon), knowing when and who to turn to for support. You will organize, triage customer issues, and even handle some problems before they start. No matter the situation, your formal training (provided through NCR) will allow you to provide customers what they need when they need it. Additionally, you will always be on the lookout for preventative measures you can take, escalate issues, and serve as an ambassador for the NCR brand. Your goal is to keep our customers completely assured and satisfied through your technical expertise and consistent and constant communication.Job responsibilities include but are not necessarily limited to:Responding to customer installation, maintenance, and service calls promptly and effectivelyServicing electromechanical equipment like ATMs and self-checkout systems within an assigned territoryOverseeing hardware maintenance, installation, network management, multi-vendor maintenance, and software supportUtilizing your technical skills on products like peripherals, large system printers, plotters, enterprise level servers, communications equipment, networks, and item processing sorters (for example, Ethernet, Token-Ring, StarLAN, NetBIOS, X.25, etc.)Performing maintenance repair and system overhauls (like modular swaps and unit replacements)Managing everything from network faults and traffic, to configuration, security, and remote system accessCapturing customer information to complete invoicingLogging all customer calls and activity and tracking all expenses incurred in the delivery of servicesJob requirements and basic qualifications:Knowledge of systems architecture, database management systems, and network/system managementFamiliarity with large servers, mainframe computers, and imaging softwareA+ Certification, CompTIA, N+ Certification, PC skills, basic electronic skills, and some specific hardware and operating system familiarityOne to three years of related experience (but more than that is always a plus)Working knowledge of Microsoft Office Suite, Windows XP, and Windows 2000Local candidates strongly preferred (this position is not eligible for paid relocation and candidates must be available to begin work promptly in the assigned geographic territory)High School Diploma or GED (Associate Degree or higher preferred)Must be authorized to work in the U.S.Must be at least 21 years of ageMust have a valid driver's license and driving record that satisfies NCR fleet requirementsAbility to perform essential functions of the job with or without a reasonable accommodationEssential functions of this position include prolonged travel with driving several hours per day, rotating and weekend shifts, carrying and lifting tools, parts, and equipment weighing up to 50 lbs without assistance, bending, squatting, walking, standing, sitting, reaching, working with your hands, and repetitively grasping and manipulating objects of varying size and weight requiring fine motor skills and hand-eye coordination for prolonged periods of timeThree weeks of job-related training will be provided within the dedicated NCR Facility, but foundational knowledge and experience in these areas are key. Benefits* 7 Paid holidays* Paid vacation* 6 Paid floating holidays* 401K savings and retirement plan* Medical insurance available immediatelyIntrigued on why this role is like no other? Please click the apply button or link to find out more.Offers of employment are conditional upon passage of screening criteria applicable to the job.Full time employee benefits include:Medical InsuranceDental InsuranceLife InsuranceVision InsuranceShort/Long Term DisabilityPaid Vacation401kEEO StatementIntegrated into our shared values is NCR's commitment to diversity and equal employment opportunity. All qualified applicants will receive consideration for employment without regard to sex, age, race, color, creed, religion, national origin, disability, sexual orientation, gender identity, veteran status, military service, genetic information, or any other characteristic or conduct protected by law. NCR is committed to being a globally inclusive company where all people are treated fairly, recognized for their individuality, promoted based on performance and encouraged to strive to reach their full potential. We believe in understanding and respecting differences among all people. Every individual at NCR has an ongoing responsibility to respect and support a globally diverse environment.Statement to Third Party AgenciesTo ALL recruitment agencies: NCR only accepts resumes from agencies on the NCR preferred supplier list. Please do not forward resumes to our applicant tracking system, NCR employees, or any NCR facility. NCR is not responsible for any fees or charges associated with unsolicited resumes."}