{"title":"Technical Support Engineer (Linux, DevOps, AWS, LAMP) NEW!","location":"","salary":"","description":"","term":"$40,000 to $60,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ0P_dzB-OWVIiOb0gpOThQOT-tIu0UvuX5NwzkQLqOp_Z7qFPBW1KfAmsLOZTIzgmS3PRvhFf3W9qD6ReoZdqVkykQZY9orOKosaxkKY_2nHqPMF04Fe7qxflgjVRokTK5Qv47DnYZF131G8Sr855xWimWHLw4VocoaSwm6YBxgy10ztCRYVEXj3yg4IY","source":"ziprecruiter","full_description":"Technical Support Engineer (Linux, DevOps, AWS, LAMP) Located near Fort Myers, FL, we are a long-standing, full-service, digital marketing firm providing clients with expertise such as SEO, PPC, content marketing, web design, social media marketing, etc.. We are actively interviewing for a Technical Support Engineer who has experience supporting Windows and macOS systems, AWS Linux Servers, and websites using LAMP.Top Reasons to Work with Us- $40-60K/year DOE + room for growth! - Health Insurance - Paid Time Off- Full-time, stable work environment!What You Will Be DoingWork with & help choose leading-edge software + technologiesAdvise & support internal resources/systems ( Windows and Macintosh-based)Outlook mail and services administration Administration of LAMP servers and configuring new serversWriting shell scripts to automate common tasks using shellDebugging and resolving issues with any of the infrastructuresConfiguring and monitoring firewallsSetup and administration of a CDNWhat You Need for this Position3+ years of experience Linux distributions CentOS & UbuntuWHM and cPanelLAMPMySQLAWS, S3Ability to perform backups and restoresPHP and Magento a plus!..So if you are a Technical Support Engineer with IT/Linux/AWS/DevOps experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}