{"title":"Social Media Specialist Entry Level NEW!","location":"","salary":"","description":"","term":"$35,000 to $45,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAINzgIS2PiqUPwRogM9-GcPIDRVldUW_yN6eqtDk24QfnWyT2Cyl_tVEVsmqzDn9bNivSUEADR7SaZc-HsFREAMFCTgRUz4dyKAi8B5SIE1_jFLF6B_nztPmCMRVRb1PsK53NyUAjSMlGzTPJJtvJLI1nm4OhXIEoiyRLFFGra6vZhTGl0HOeqog7ajREeu","source":"ziprecruiter","full_description":"Ultara Holdings, Inc. has been building a culture of excellence since 1995. We are a diverse company with business activities ranging from both retail and wholesale distribution and product development and manufacturing. We are an international company with headquarters in Dallas, Texas and our operations are spread across 9 US states and 2 Canadian provinces. GeoShack, Inc., our largest subsidiary, distributes state of the art technology that’s changing the way the world works in construction, surveying, agriculture, landfill, mining and many other fields. GeoShack, Inc. is the largest Topcon dealer worldwide and we pride ourselves on providing the best solutions in positioning and machine control products, installation, support, training, and service to our customers.As we continue to grow in the marketplace, we are looking for a driven Social Media Specialist to attract and interact with targeted virtual communities and networks individual users to join our corporate office in Dallas, Texas. The goal is to gradually achieve superior customer engagement and intimacy, website traffic and revenue by strategically exploiting all aspects of the social media marketing roadmap.The ideal candidate will have a solid understanding of how each social media channel works and how to optimize content so that it is engaging on those channels. You will be responsible for joining relevant conversations on behalf of the brand and “soft selling” the products by providing support to current and prospective customers. The position has a lot of variety and requires someone who is knowledgeable, patient, and pays careful attention to details.Responsibilities:Build and execute social media strategy through competitive research, platform determination, benchmarking, messaging and audience identificationGenerate, edit, publish and share daily content (original text, images, video or HTML) that builds meaningful connections and encourages community members to take actionSet up and optimize company pages within each platform to increase the visibility of company’s social contentModerate all user-generated content in line with the moderation policy for each communityCreate editorial calendars and syndication schedulesContinuously improve by capturing and analyzing the appropriate social data/metrics, insights and best practices, and then acting on the informationCollaborate with other departments (customer relations, sales etc.) to manage reputation, identify key players and coordinate actions.Design graphics for use in media and multi-media products.Develop concepts, graphics, and layouts for product illustrations, company logos, and internet website pages.Update and maintain company internet websites as needed and required.Assist in managing all brand assets as it relates to external and internal marketing materialsQualifications/Skill Set:Proven working experience in social media marketing or as a digital media specialist.The ideal candidate will possess 3+ years of design work.Experience transforming creative concepts into deliverablesExcellent consulting, writing, editing (print/photo/video/text), presentation and communication skillsDemonstrable social networking experience and social analytics tools knowledgeAdequate knowledge of web design, web development, CRO and SEOKnowledge of online marketing and good understanding of major marketing channelsExpert in Adobe Creative Suite including, InDesign, Photoshop, Illustrator.Positive attitude, detail, and customer oriented with good multitasking and organizational ability.Fluency in Spanish or French is a plusBS in Communications, Marketing, Business, New Media or Public RelationsProficient in MS Excel and WordBenefits:Competitive SalaryGroup Medical, Dental and Vision Insurance401(k) Retirement with Company MatchEmployer Paid Life InsuranceEmployer Paid Short-term and Long-term DisabilityPaid Time-off and Holiday"}