{"title":"Chemist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKoAWR58hzQxuIhcfFxdoUCg-US1Q2c-S3lsPSTfaYNjF7B3D98GUGZ1DQnHd73Wxt5mwEqn6LbEcmhgAXE6eKNeIy9xnHkCz9FXwWI2iJsXRVn_2w32S8W08sWtc1R6SYb3rrL6FFLVPTS08lZ660RlfMuL_DojS-L7zxIIJzYhzhcZT2M5oaCzrfCimpO","source":"ziprecruiter","full_description":"Company Description ProSidian is a Management and Operations Consulting Firm focusing on providing value to clients through tailored solutions based on industry-leading practices.  We help forward-thinking clients solve problems and improve operations.  With a reputation for its strong CONUS/OCONUS practice spanning six solution areas, ProSidian services focus on the broad spectrum of Risk Management, Compliance, Business Process, IT Effectiveness, Energy & Sustainability, and Human Capital.Launched by former Big 4 Management Consultants; our multidisciplinary teams bring together the talents of nearly 190 professionals globally to complete a wide variety of engagements for Private Companies, Fortune 1,000 Enterprises, and Government Agencies of all sizes.  Our Services are deployed across the enterprise, target drivers of economic profit (growth, margin, and efficiency), and are aligned at the intersections of assets, processes, policies, and people delivering value.ProSidian clients represent a broad spectrum of industries to include but are not limited to Energy, Manufacturing, Chemical, Retail, Healthcare, Telecommunications, Hospitality, Pharmaceuticals, Banking & Financial Services, Transportation, Federal and State Government Agencies.  Learn More About ProSidian Consulting at www.ProSidian.com. Job Description ProSidian Seeks a Chemist (Contract Contingent) in Charlotte, NC / Remote to support an engagement for an independent agency of the United States Federal Govt. that is primarily responsible for the development of Occupational Health and Safety Guidelines and Administration.  The Agency's Development Objective is to ensure safe and healthful working conditions in covered workplaces throughout the United States. This is accomplished through the development of workplace standards, regulations, and guidance that address significant safety and health risks to workers. All rules and guidelines consider feasibility, economic effects, paperwork burden, affected industries, and impact on small businesses, as required by the OSH Act, the Paperwork Reduction Act, the Regulatory Flexibility Act, the Small Business Regulatory Enforcement Fairness Act, and applicable executive orders.. The ProSidian Engagement Team Members work to The ProSidian Engagement Team will provide technical support for standards and guidance development for the Occupational Safety and Health Administration's (OSHA), Directorate of Standards and Guidance (DSG). This is a Blank Purchase Agreement with call orders in the following areas: rule-making and guidance development support; economic analyses; and literature search and information management. Specific task items include risk assessments, industry exposure profiles, information management, organization stakeholder and focus group meetings, population at-risk estimates, and developing training materials.Chemist Candidates shall work to support requirements for PR0001 Communications And Knowledge Management Support and work with subject matter experts to:Provide a high level review of current policy and public commentsCompare observed health effects, injury and illness data, and industrial hygiene and safety practices among several industry sectorsIdentify hazards in the workplace, provide the services of recognized experts in subjects relevant to OSHA standards and guidance productsAnalyze various recommended strategies for reducing risksIdentify the most effective strategies, and assessing the limitations of control methodsDesign and implement workplace processes and procedures that help protect workers from potentially hazardous work conditionsDevelop information, strategies, research needs, issue papers, testing protocols, or regulatory and non-regulatory options in the areas related to standards and guidance conduct training on a variety of topics related to health and safety guidelines.The Chemist will require knowledge of OSHA guidelines and will be responsible for managing a team of analysts to provide qualitative and quantitative analyses of current policies, address gaps in current policies, develop and conduct training. Role specific duties include conducting site visits and industry studies to collect information on current exposures and effective control strategies, appearing and testifying/presenting information at rule-making hearings, and comparing observed health effects, injury and illness data, and industrial hygiene and safety practices among several industry sectors. Qualifications The Chemist shall have consecutive employment in a position with comparable responsibilities within the past five (5) years, Must be able to use a computer to communicate via email; and proficient in Microsoft Office Products (Word/Excel/Power point) and related tools and technology required for the position.  Work products shall be thorough, accurate, appropriately documented, and comply with established criteria. The candidate shall ensure that duties are performed in a competent and professional manner that meets milestones/delivery schedules as outlined.To perform this job successfully, an individual must be able to perform each essential duty and responsibility satisfactorily.  The requirements listed below are representative of the knowledge, skills, and/or abilities required:  Master's degree or  equivalent from an accredited college or university in a relevant field with at least 6 years of experience with demonstrated understanding of program management, education, facilitation, and site assessments.Bachelor's degree required; Masters degree preferred in a relevant field or related subject.At least 6 years of experience providing communication, education, and knowledge management expertise.Experience in data collection, analysis, and written reports summarizing data collected.Ability to coordinate multiple projects simultaneously, work well under pressure and meet deadlines.Ability to work effectively both individually and as a member of a team.Candidate must have strong attention to detail and organizational skills.Demonstrated ability to propose possible resolutions to complex managerial or operational problems.Demonstrated expertise in knowledge management.Demonstrated proactivity, attention to detail, working within deadlines, and ability to juggle multiple priorities in a fast-paced environment.Excellent interpersonal skills, English verbal, written, editing, research, and verbal communication skills.Excellent project management and organizational skills.Familiarity with Section 504 and Section 508 disability requirements and accommodations.Proficiency in MS Office Applications (Word, PowerPoint, Outlook, Excel)Relevant work experience may include, experience as a Senior Level: Health Scientist; Safety Professional ; Toxicologist; or Chemist. Experience and familiarity with OSHA Guidelines and Regulation is highly preferred.TRAVEL:  Travel as coordinated with the technical point of contact and approved in writing by the Contracting Officer in advance, is allowed, in accordance with Federal Travel Regulations.  LOCATION:  Work shall be conducted at the Charlotte, NC / RemoteU.S.  Citizenship RequiredExcellent oral and written communication skillsProficient with Microsoft Office Products (Microsoft Word, Excel, PowerPoint, Publisher, & Adobe) Additional Information As a condition of employment, all employees are required to fulfill all requirements of the roles for which they are employed; establish, manage, pursue, and fulfill annual goals and objectives with at least three (3) Goals for each of the firms Eight Prosidian Global Competencies [1 - Personal Effectiveness | 2 - Continuous Learning | 3 - Leadership | 4 - Client Service | 5 - Business Management | 6 - Business Development | 7 - Technical Expertise | 8 - Innovation & Knowledge Sharing (Thought Leadership)]; and to support all business development and other efforts on behalf of ProSidian Consulting.CORE COMPETENCIESTeamwork - ability to foster teamwork collaboratively as a participant, and effectively as a team leaderLeadership - ability to guide and lead colleagues on projects and initiativesBusiness Acumen - understanding and insight into how organizations perform, including business processes, data, systems, and peopleCommunication - ability to effectively communicate to stakeholders of all levels orally and in writingMotivation - persistent in pursuit of quality and optimal client and company solutionsAgility - ability to quickly understand and transition between different projects, concepts, initiatives, or work streamsJudgment - exercises prudence and insight in decision-making process while mindful of other stakeholders and long-term ramificationsOrganization - ability to manage projects and activity, and prioritize tasks----------- ------------ ------------OTHER REQUIREMENTSBusiness Tools ..."}