{"title":"Senior Protein Chemist - Fermentation NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI8UbzZ3EGNyP0YIh_9pEeyeRsypSRZSvtLrQEiAelRthqSfXOltIN4X_PJf6m_rDJdzxo_EV301LJ8M5BWroZY07bB-MKoy1lPpqOXDAkhVC5WqGpMsEWScGwKeDmlwdC6iqD4B07MqzVu-SBLMeN7IPhgGjl2mycwVz7mhdN9pLRjAFKY7F330bLsPWha","source":"ziprecruiter","full_description":"Role & ResponsibilitiesWe are seeking an experienced Protein Chemist to participate in our protein purification operations in the Reagent Protein Manufacturing Department. The ideal candidate should have prior experience in gram level recombinant protein purification.Key Responsibilities:Perform all downstream processes for protein manufacturing, including, but not limited to, buffer preparation, cell resuspension, cell disruption, clarification, column packing, chromatograph, TFF, and formulation.Perform in-process QC, including SDS-PAGE, and HPLC-RP.Perform operations in compliance with SOPs, batch record, and all applicable guidelines and safety regulations.Knowledge and experience in writing, editing, and reviewing manufacturing, process, and equipment documentation.Consult regularly with supervisor and manager to adjust team goals to align with the latest company developments.Able to record, summarize and analyze data; discuss and be able to present results.Must be flexible to work varying schedules and hours as needed.Provide training to manufacturing associates as appropriate.Required ExperienceEssential Skills:Requires a B.S./M.S./Ph.D. in Molecular Biology, Biochemistry, Bioengineering, Protein Biochemistry, or other related discipline.Requires a minimum of 3 years of hands-on experience in all scale of recombinant protein purification.Previous experience with Cytiva(GE) AKTA Pilot/Unicorn 7.X is highly desired.Demonstrated proficiency in the use of scientific laboratory techniques, equipment, and materials.Knowledge of biochemistry and molecular biology techniques required.Must possess excellent communication and interpersonal skills to facilitate interactions with an interdisciplinary team.Courage to make an impact, along with creativity of thought and mindset.Thrives in a dynamic and fast paced environment.Passion for success."}