{"title":"Research Chemist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL_a1PU4LECLmhLB2yvqyQlT3IHC2Q1RzkRxuaAZH8YT_AwG2yTetFDmg2475OO3TMlApjlpoJrgyRuUFMgLOtyhzJ-5I4eTvj7dG9XcX4S1LD4zSLW9YjOB5o-kvSl2BF4TlT1uw6P0rHVcyDydio8uNM6v7loIR1LCebSslqnnbCck0MwUFpDS3i7ABrN","source":"ziprecruiter","full_description":"Research Chemist – Near Gary, Indiana. Our client is looking for a chemist to work in the area of development and applications of catalyst formulations and application methods for a large manufacturer of catalytic emissions treatment systems. Position is in the lab/pilot area adjacent to manufacturing in a large plant. Short version: design testing and piloting programs for catalyst-based emission control materials. The position works closely with the Technology Director; so general knowledge of analysis, formulation, chemistry, process is necessary – to do:Development of new catalyst formulations given general guidelines. Team with operations and engineering to address issues with existing formulations as part of the continuous improvement program. Design bench-top and then pilot experiments and tests to reach given objectives of performance, costs, methods, etc. Formulation, performance testing bench-top and pilot, analytical testing Laboratory:Ensure proper analytical work is completed on raw materials through product: testing – metals, physical testing, anions/cations, etc. Set up and iteratively change bench and pilot runs to either/both reverse engineer a product or improve/manufacture a productCharacterization and testing of raw substrates and performance of substrates post-coating. Responsible for day-to-day laboratory safety program Documentation of methods, new processes/changes to processes, steps, etc. Able to use or put together SOPs. Required/preferred:Good understanding of inorganic chemistry, slurry processing, instrumental/elemental analysis, ceramics and metals4 year (or more) degree in chemistry (or very similar)Has worked in lab (necessary!) and plant (would be good to understand production) Personable and effective individual and chemist that can do the technical work and then communicate effective as well as work well with, people! Able to work in an industrial plant setting Salary: Approximately $55,000 - $65,000, bonus, etc. Excellent benefits."}