{"title":"Mechanical Quality Inspector - Morning Shift NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIvNOBdXiF_sdViWuJRnJleAqJ57kToP6HAjhtdv51eLyiYIAVqllkyzwcIKG5VmCWpWrHbdaUdQqaID-b6gXqEHoIqC46KM--3MFQF1xZwYftIy14lGwqyJsYpALlr6cw8qEUHBsRy63iyGp5FlXkn83JZ9O7hGYY6R3h5y8spQqIqFZUQKpBf5lC5L-g","source":"ziprecruiter","full_description":"About this PositionSeeScan is currently seeking a Mechanical Quality Inspector to join our team during the morning shift. In this position, you will be responsible for inspecting parts and assemblies to ensure that they meet quality standards. Our ideal candidate is a detail-oriented individual who will support us in our mission to provide our customers with the highest quality plumbing diagnostic and utility locating equipment.ResponsibilitiesPerform and document inspections for components and assemblies according to specifications and proceduresPerform and document First Article InspectionsPerform Final Tests on finished products as requiredCommunicate with Engineering, Purchasing, and MRB to resolve quality issuesClearly document non-conformances and improvement opportunitiesEnter information into ERP systemParticipate in Quality and Productivity Improvement projectsTrain other inspectors on the use of mechanical measurement toolsQualificationsAbility to read and comprehend drawings, specifications, and proceduresAbility to properly choose and use mechanical measurement tools (i.e., micrometers, gage pins, CMM, height gages, etc.)Ability to set up on surface plate to conformed GD&T specifications, measuringdevices such as height gages, calipers, micrometers, depth gages, universalprotractor, index fixture, v-blocks, angle blocks, 1-2-3 blocks, Deltronic pin gages,bore gages, thread gages, sine plates, etc.Competence in basic math, oral communication, and written communicationProficiency in Microsoft Office applicationsDesire to work in a team environment as a contributing member of the entireorganizationMust be able to lift 25 lbsExperience3+ years in Mechanical Inspection or equivalent vocational trainingWe OfferA position within an established company, growing from humble beginnings in our founder’s garage to a team of over 300A culture of transparency, growth, and innovation – read more about it below!Medical, dental, and vision coverageTraditional and Roth 401(k) investment options, with a current company matching contribution of up to $50 per paycheck (biweekly)Flexible Paid Time Off plan with no cap or “use it or lose it” requirementIf this application is of interest, please apply online at https://careers.seescan.com. In your application, please include your resume and a thoughtful cover letter explaining why you are the ideal candidate for this position. We are looking for a long-term, in-house team member to join us, not a contractor or consultant.About SeeScanModern life depends on the infrastructure that brings water, electricity, gas, and communications to our homes and businesses. SeeScan’s mission is to deliver the highest quality products that protect these vital services. We are an original equipment manufacturer in San Diego, CA that builds diagnostic and utility locating equipment from the ground up, from initial product conception to prototyping, testing, and final assembly.What is it Like to Work at SeeScan?Working at SeeScan is unique. We have the stability of a larger company—we’ve been in business for over 30 years!—but our company culture has a small family feel that thrives on transparency, collaboration, and innovation. Our mission is to create the best products in our industries and continue our growth – not to line shareholders’ pockets.There is a reason why our turnover is so low. We know that SeeScan is more than a collection of facilities, technologies, and products. SeeScan is a community of people. Working here, you’ll be part of a group of people who take pride in their work and their community. We’re passionate, but there’s more to it than that. We have a sense of ownership of SeeScan’s success and a shared commitment to continuous improvement. You won’t just be a cog in a corporate machine here – you’ll be our most critical investment, and we’ll do our best to empower you with the tools you need to find success at SeeScan.NotesNo recruiters, contractors, or consultants, pleaseNo relocation assistance or visa sponsorships available for this positionSeeScan is an Equal Opportunity Employer"}