{"title":"Systems Engineer-FedRAMP","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AALGSZA6TpW1DnZumFThIsCWuKnhCgsgUoyX3_RiBPXou9-ZHH83CfRpA9NCo_y-pnGWJzKvLBLwtzxc-2Zry7wqATZy6Qvyg5id_V2Z62F7lNuaZmanfbiYsWyjL1c-SMBwIhznmmM9AaEwsbVU3XUIQuqjal-ednMFhZ3Bptqhtl_9AqFzctQKg8Tc_tTy","source":"ziprecruiter","full_description":"Define, design, and implement network communications and solutions within a fast-paced, leading edge database/applications company.Perform performance trend analysis and manage the server/network capacity. Propose client configuration and implement technical solutions to enhance and/or troubleshoot the system. Work with others to define, coordinate vendor purchase needs. Responsible for support documentation as well.Job duties are varied and complex utilizing independent judgment. May have project lead role. 5 years of related experience in a medium to large network distributed and computing environment. BS in Computer Science or related field.*This is a remote/office based position which may be performed anywhere in the United States except for within the state of Colorado.Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.Systems Engineer - FedRAMP**Midshift - 3:00 PM to Midnight*Country: USAOffice: Work-from-home/RemoteWe are currently recruiting a Systems Engineer for our FedRAMP business, and only US citizens or US persons should apply. The current platform features Linux and Microsoft OS servers and Microsoft SQL, PostgresSQL, and RDS (Amazon) database technologies hosted on the Aconex and public cloud services platforms. The candidate will be responsible for promoting changes and releases to Production infrastructure and maintaining the service platform in support of continuously reliable and efficient running of Oracle's global SaaS platforms. The FedRAMP standards adhere to NIST 800-53 control policies and procedures, with regular self- and external-audits to verify compliance.*Your main responsibilities will include**:Deploying changes and releases to Production and pre-Production environments using: Puppet Ansible Chef Capistrano Jenkins Terraform Manual deploymentsOperating and provisioning into cloud environments: Oracle Cloud (OCI) AWS AzureOperating and contributing to our monitoring and alerting stacks: Nagios Prometheus App Dynamics/Relic Logfile parsingYou will work either the evening or midnight shift, and you will be required to carry a pager for on-call duties on a rotational basis.To be successful in this role you will possess the following skills and experience: Familiarity and experience with FedRAMP or other Federal/USDoD systems. The ability to install and configure hardware and storage devices including SAN. Extensive experience and knowledge of the Linux OS, preferably Oracle Linux. Experience running large Java/Python/Ruby applications. Virtualization Experience with VMware ESX, or Linux based solutions. Golang, Python, Shell and other programming language skills an advantage. Exposure to system management monitoring and alerting tools:o Nagioso Prometheuso PCP Modern source control practices including Git and merge request flows. Experience with the Microsoft Windows Server Operating System and Microsoft SQL Server. Sound knowledge and experience of TCP/IP networking. Experience with Linux based firewalls, routers, and IPSEC VPN systems. Exposure to Cisco switches and the IOS operating system. Good analytical and trouble-sectionalization skills. System and Network security practices and disciplines need to be demonstrated. Willingness to proactively engage in continuous process improvement. Ability to listen and communicate clearly with different areas of the business. Be a self-starter with the capability to work autonomously.*/At Oracle, we don't just value differences-we celebrate them. We're committed to creating a workplace where all kinds of people work together. We believe innovation starts with diversity and inclusion./*https://www.oracle.com/corporate/careers/culture/diversity.htmlJob: **Information Technology***Organization:** **Oracle***Title:** *Systems Engineer-FedRAMP***Location:** *United States***Requisition ID:** 200010X3"}