{"title":"Diesel Mechanics $2000 Sign-On Bonus Starting up to $33.41 hr","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJRFj78F8E4v1uSknKvy3KS1Iih9uhPUvAkPjgHN-x5VJ38O9Jr67DtTYUjRt_7PEKzYCmPh7Oki70pV6JYDBTqyh4PD2mufLnzpy1wIqEENM9gddwpKQb5MZr2dv368j3nKZc3qP6812zGtzz3cDN9xIv1atsBtSfySau8e1IxJT3MebNPWfIgbe8OJFqi","source":"ziprecruiter","full_description":"Diesel Mechanics $2000 Sign-On Bonus Starting up to $33.41 hrDo you want to be recognized as a high performer?Tired of not getting the respect you deserve?Do you want to work for a company that prefers to promote its own people?Do you want to work for a stable employer?Are you tired of a work environment that doesn’t promote a team effort?Click here: https://www.youtube.com/watch?v=GsJUih5XCPk&feature=youtu.beCome and experience the difference with R+L Carriers.Earn 1 week of vacation after 90 days of employmentFull-Time, Various ShiftsR+L Carriers has an immediate opportunity for Diesel Tractor Mechanics. Responsible for day-to-day equipment maintenance on the fleet equipment consisting of preventative maintenance and minor to major repairs to Class A Trucks, trailers, and forklifts. Diesel engine experience is required. Experience in maintaining trailers, overhead doors, lift gates, dollies, welding, and working on forklifts is preferred.Requirements / Qualifications:2+ Years of Diesel Mechanic experience preferredExperience in preventive maintenance of Cummins & Detroit enginesExperience with AC and ElectricalMust be able to handle major repairsExperience in both Tractor and Trailer PMs and repairsHave the ability to lift 50lbsMust have own toolsExcellent Pay with ExperienceR+L Carriers offers an excellent compensation and comprehensive benefits package that includes Medical/Dental/Vision Insurance, 401(k) Retirement Plan with company matching contributions, Paid Vacation & Holidays, and free vacation lodging at our exclusive employee resorts in Daytona Beach, FL, Big Bear Lake, CA, Pigeon Forge, TN, and Ocean Isle Beach, NC.Please click \"APPLY NOW\" for consideration!"}