{"title":"Full Stack Software Developer NEW!","location":"","salary":"","description":"","term":"$100,000 to $150,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJmYkPBPnd8TGE-wOj-qhRboQo8c5h1raNQ1vhWsbKVXnFIAwDyocIJQ-Ug57Jtya9sEe7pmbqKtMzXZCJj-tyap5WrRHwTuWRL_sCS1A85iP98McNYf6ZFlvTR7aILJbYoO_75U6mbXqTteVOCxooCkTuOka0i_OS_URquSybIq5xHQR4H0ZibW9Wr4jw","source":"ziprecruiter","full_description":"Full Stack Software Developer Based in Charlotte, we're a profitable and stable fintech software company who's built a game-changing platform for charitable endeavors which handles the allocation of billions of dollars and manages relationships with donors, and clients.If you are a Full Stack Software Developer with ReactJS or Python experience, please read on!What You Will Be Doing- Have a massive impact on the growth of our software platform- Use Python and ReactJS to Develop and Advance our Existing Systems- Expose yourself to Information Security and Data Protection principles and Technology- Work with a Brilliant Team all fighting for the same objectiveWhat You Need for this Position- Full Stack Software Development- Python or ReactJS- Responsive Design- RESTful APIs- Agile Methodologies- Continuous Integration- SDLCWhat's In It for You- Base Salary Depending Upon Experience Between $100-150k- Strong Benefits Package- Competitive Vacation and PTO- Work/Life BalanceSo, if you are a Full Stack Software Developer with Python or ReactJs experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}