{"title":"Manufacturing Chemist l","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKQQmNjy45Q5UU8OSL3NyLmWeA5gQNIyAtfEnLgg72qvPWJNpKgdxatY2oMdQkoOMMuw4LmObToulotZk-OD3HMccPfWbP_Ms5jEXlIMJwXoG40wWuz4JmZnuB2jbR2wIBhn1fw3njX5veSs1Eq_7yb0UFDZsh48GHPShuHON4l4YDRc7zur16MAiqGD0aW","source":"ziprecruiter","full_description":"Overview Antech Diagnostics, the largest exclusively commercial veterinary diagnostic laboratory in the nation, is in search of a Manufacturing Chemist working out of our Manufacturing Divison and reporting directly to the Manufacuting Director. As part of the VCA Family, which operates the largest network of freestanding, full-service animal hospitals in the nation, Antech Diagnostics delivers state of the art testing and consulting services to practicing veterinarians.  Our diagnostic spectrum of tests in the areas of chemistry, pathology, endocrinology, serology, hematology, and microbiology enhance veterinarians' ability to detect, diagnose, evaluate and prevent disease and other conditions affecting animals. Responsibilities Build products but not limited to, manufactured IVD assays, reagents, controls, and processes Assist in sample collection for validation / QA studies Maintain positive interaction with all areas of the company. Participate in oversight of all QA/QC activities in manufacturing facility Investigate reasons for testing problems Perform Inspection of manufacturing department Ensure compliance of SOP/BPR (Batch Production Record) Participate in continuous improvement projects Maintain accurate records with internal database. Performs other duties as assigned We share a collaborative obligation to ensure that we conduct ourselves in the utmost ethical manner and that we hold each other accountable to the values and standards of the organization. Every employee has the responsibility to ask questions, seek guidance, and report concerns and/or violations of company policy or ethical standards. Antech Diagnostics has several processes in place to communicate with leadership and expects that employees will have a commitment to integrity and uncompromising values. Qualifications High School Diploma required, Associate Degree Preferred in Science related discipline.Experience with general laboratory equipment a plusExperience handling hazardous chemicalsAbility to communicate effectively with all departments and levels of personnel.Excellent problem-solving capabilities and high performance standards with regard to work quality and quantity.Basic computer skills (Excel, Word).Experience with precision filling/printing equipment a plusExcellent verbal and written communication skills We can recommend jobs specifically for you! Click here to get started."}