{"title":"Dynamics Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKp8uf_OpEGn6hP_n-fy8gkcx3Go35l37m119N5i_7a7Y5dRxiVn97qHkjTShwxXBMcCS_qmFxXn0f1Ad94x0xUMLpo3whHYKHrCU1LJyvgEwo0_Wa32VRPSEpla4dL8fJ0PDYpG9ExPnwlYTnkJZx-TB5UJrawyT17qvPc2lVSR_CCnZ7Ke8pO6X83mnGr","source":"ziprecruiter","full_description":"ispace Technologies U.S. located in Denver, Colorado is looking for a highly motivated and talented Dynamics Engineer to join its new team.   We are small, agile, and highly determined to go the extra distance to pave the way for a new frontier. Working at ispace will require the ability to thrive in the unknown, an eagerness to be a pioneer in a new industry, and a willingness to work in an international, intercultural, and interdisciplinary environment. Motivated, talented, and hardworking people: we invite you to join us for an exciting new challenge! While you will be an instrumental member of a small team in the U.S., you will join an international team and be expected to work with colleagues from around the world. Teamwork is a must. Strong interpersonal and organizational skills are necessary. You must be self-motivated and comfortable making decisions within a fast-paced environment, as well as have excellent communication skills, both verbally and written.  Success will require strategic balancing of the technical and business aspects of a lunar exploration company. We blend aerospace engineering best practices with rapid iterative development methods and the dynamic workplace culture of a startup. Customer-focused from the beginning, we are determined to lower costs to accelerate the development of the lunar ecosystem.  Join us on this exciting and once-in-a-lifetime opportunity to be a key part of expanding human life into outer space and establishing a new reality where the Earth and the Moon are part of one ecosystem.  To conform to U.S. Government aerospace technology export regulations (ITAR and EAR), applicant must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State. ispace is an equal opportunity employer and we value diversity. All employment is decided on the basis of qualifications, merit and business need. Responsibilities Develop loads and vibration levels for Lunar Lander components and payloads using empirical, experimental, and analytical approaches, as requiredDefine and execute loads analyses for each phase of the mission profile(s), modal testing campaigns, flight data analyses, and other relevant loads activitiesBuild internal tools to develop and communicate loads to the hardware engineering teamSupport responsible hardware engineers to ensure hardware meets dynamics requirementsPerform analyses using commercial codes as well as write new simulation code Basic Qualifications (Required Skills / Experience) Bachelor's degree in engineering or related technical field5+ years of experience with structural dynamics (aerospace preferred)Experience solving complex dynamics problems on integrated vehiclesProficiency in Python, MATLAB, C/C++Familiarity with project management tools, including Atlassian Preferred Qualifications (Desired Skills / Experience) Demonstrated professional experience in launch vehicle and/or spacecraft coupled loads analysis, component mode synthesis, random vibration analysis, and NASTRANAbility to solve complex problems in a fast-paced collaborative interdisciplinary team environmentCapable of working both independently and in a team environmentStrong coordination, organization, teaming and communication abilitiesExperience with hands-on testing to validate loads predictions and models Additional Requirements Ability to work in a fast-paced design and development environmentSchedule may vary depending on program development needs; flexibility requiredWillingness to travel domestically and internationally as requiredWe kindly request that resumes are a maximum of two pages, thank you."}