{"title":"Assistant Operations Chemist","location":"","salary":"","description":"","term":"$20 to $22.75 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALiXy6kdNCsdYnXcd1WF9Bc0FVYDlevIBL2XMEjV3dcigr9zoz92cQXBgLjdCgRNMsx3MgMRwe_WLhNQjJuRSPuPHY2Af27Fil-bEha-2n5qMCLaBVa7QkabhEHBN1eiaYqXFfGcZzg_zye6jWABOtzBH0YKSVcV06wF7_6CaH73hq_sayQ76X2coKNq0X8","source":"ziprecruiter","full_description":"SUMMARY Progressive trainee positions responsible for assisting with the safe manufacture of pharmaceutical chemicals and intermediates in the potent drug and GMP labs, while progressively learning job functions. Perform and interpret in process control checks. Maintain appropriate level of equipment, supplies and raw materials. Assists with maintaining status reports, ordering material and preparing equipment for maintenance. Displays ability to set up and follow procedures leading to a simple reaction. Maintains a high level of housekeeping. Displays initiative in completing training and the ability to retain training. Displays high level of attention to detail. An Assistant Operations Chemist performs the following duties and responsibilities with oversight of a higher level Operations Chemist and/or supervisor. ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned. Shifts are a rotating 7-day schedule with 24 hour coverage but may include a modified 4 – 5 day schedule as needed to meet requirements of the project. Meet potent drug or GMP Lab production goals through hands-on operations of lab process and equipment. Learn all production process steps and complete according to the Potent Drug Lab and GMP Lab SOPs and batch records. Maintain high level of housekeeping. Assist in trouble shooting the process and equipment. Assist the installation, qualification, and startup of new processes and equipment. Responsible for properly managing the generation and accumulation of hazardous and non-hazardous waste. Responsible for ensuring required training gets completed, within required time frame. Responsible for retention of training. Performs some necessary functions on the Corden Emergency Brigade.  LEADERSHIP & BUDGET RESPONSIBILITIES This job has no supervisory responsibilities.SAFETY & ENVIRONMENTAL RESPONSIBILITIESEvery individual is personally responsible for the safety and environmental aspects of his or her activities in the workplace. Each employee is expected to perform their job duties in a safe manner utilizing all of their knowledge, training, ability and experience. QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. EDUCATION and/or EXPERIENCE Associate's degree (A. A.) or equivalent from two-year college or technical school; or minimum of one year related experience and/or training; or equivalent combination of education and experience. LANGUAGE SKILLS Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports and correspondence. MATHEMATICAL SKILLS Ability to calculate figures and amounts such percentages, area, circumference, volume, and mass. Ability to apply concepts of basic algebra and geometry. REASONING ABILITY Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form. CERTIFICATES, LICENSES, REGISTRATIONS Fork Truck Certified – training will be provided by Corden Pharma. PHYSICAL DEMANDSThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to stand and work with hands. The employee frequently is required to walk; stoop, kneel, crouch, or crawl; and talk or hear. The employee is occasionally required to sit, reach above shoulder height, and climb or balance. The employee must occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, color vision, distance vision and depth perception. WORK ENVIRONMENTThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is occasionally exposed to moving mechanical parts, fumes or airborne particles, low levels of toxic or caustic chemicals, outside weather conditions, extreme cold, extreme heat, risk of electrical shock, and vibration. The noise level in the work environment is usually moderate. Able to engage in all forms of labor necessary for the completion of construction/demolition projects to include awkward and repetitive manual tasks that could require forceful exertion. Required to wear basic PPE during work (hard hat, safety glasses, safety boots and uniform.) Occasionally required to wear full PPE (i.e., respiratory protection and chemical resistant garments, confined space vessel entry, etc.)  CORE COMPETENCIESThese are the specific areas of knowledge, skill and ability that are important for successful job performance. They must be job related and consistent with business necessity. Knowledge of production scale and/or lab scale pharmaceutical manufacturing. Computer skills-LIMS, SAP, Outlook, WORD, EXCEL, etc. Attention to detail and the ability to work independently as well as working within a team. Mechanical aptitude. Ability to apply creativity and innovation to identify new approaches and solve existing problems. Ability to understand and implement company policies and practices, including regulatory compliance. Organized, flexible, responsive, and proactive. Strong interpersonal skills, high motivation, and energy to coordinate a number of functions across an organization. Ability to forecast work, identify potential conflicts, develop and communicate potential solutions.SALARYThis is a non-exempt position. Salary based upon the successful candidate’s qualifications and level of experience."}