{"title":"Technical Writer - 1 Year Contract - Houston, TX","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKZ9qB4EyKFzAQc-hgmNOetmrIzKqkgHEDvyKpsbEvrGljK1ujK3wydmOVubnBaHhuy_4D-G9q24Qbws2PzYIBE5ql4IX_OB2eLvV52R-jX_sq1VBSk-qRHhKN9aBbvX42DJNyvw0hjWsbNNp6O55itpJKW9ogbXVvxZkwe9DE9dfPY5f-NSU6Rd9dq6TA","source":"ziprecruiter","full_description":"This position is a 1 year contract role located in Houston, TX. Oil and Gas or Engineering Marketing experience supporting technical writing for brochures, manuals, and technical documents is highly preferred. The pay for this position starts at $30/HR and increases DOE. The work is remote currently, until otherwise decided.Job Title: Marketing Content and Technical WriterPurpose The Marketing Content and Technical Writer will conceptualize, structure, write, and present strategic and compelling content for internal and external audiences.FunctionsESSENTIAL Create content that is engaging, accurate, and appropriate for various audiences in the form of customer success stories, technical articles, awards nominations, banners, brochures, data sheets, presentations, etc. for a range of diverse channels Lead proofreading, fact-checking, and editing processes for various marketing and internally-distributed materials Interview Subject Matter Experts to fully capture technical details and stories related to products and services Contribute to department organization of company marketing collateral by keeping up-to-date records Facilitate interaction between multiple stakeholder groups through use of superior interpersonal skills Maintain relationships with local stakeholders to ensure region-specific marketing requirements are met and communicated to the larger Marketing and Communications team Collaborate with stakeholders to develop and maintain proper messaging, branding, and consistency for the company, internal employee communications and marketing campaigns Demonstrate ability to meet tight deadlines to respond quickly to marketing opportunities and requests Understands when decisions could impact other interrelated aspects of the projects or work groups. Determines and delivers key technical content to influence selected stakeholders on issues related to products, processes and methodology. Fully proficient individual contributor. Makes decisions on complex and difficult situations independently. Broad knowledge of own professional discipline, and general knowledge of related disciplines. Builds relationships within and across teams and delivers key technical content to influence stakeholders.Reporting Relationship This position will report to the Global Communications Manager.QualificationsREQUIRED Bachelor’s degree in Marketing or related field with emphasis on writing and communication skills At least five (5) to seven (7) years of solid marketing and technical writing experience required or equivalent combination of education and experience. Must have portfolio showcasing diverse technical writing experience including technology-related stories as well as case studies, customer success stories, customer testimonials, and/or case historiesDESIRED Have working knowledge of Microsoft Office, Google Apps, WordPress, or equivalent Experience in the oil and gas or energy sector is essential Proven ability to quickly learn complex product features and turn them into concise but thorough documentationAbout Advantage Resourcing Advantage Resourcing is committed to providing equal employment opportunity for all persons regardless of race, color, religion (including religious dress and grooming practices), sex, sexual orientation, gender, gender identity, gender expression, age, marital status, national origin, ancestry, citizenship status, pregnancy, medical condition, genetic information, mental and physical disability, political affiliation, union membership, status as a parent, military or veteran status or other non-merit based factors. We will provide reasonable accommodations throughout the application, interviewing and employment process. If you require a reasonable accommodation, contact us. Advantage Resourcing is an E-Verify employer. This policy is applicable to all phases of the employment relationship, including hiring, transfers, promotions, training, terminations, working conditions, compensation, benefits, and other terms and conditions of employment. All employees are directed to familiarize themselves with this policy and to act in accordance with it. All decisions with respect to employment matters and other phases of employer-temporary employee relationships will be in keeping with this policy and in accordance with all applicable laws and regulations."}