{"title":"Airplane Mechanic NEW!","location":"","salary":"","description":"","term":"$23 to $35 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ7hI5gI7B3QK_WePw0h0MxPyYcCXQdZOSdoFghfgCfG776P_M1COTAvnAMGjZaTZI1aQFD86jLOmDH7gxi0k-i3m5dLYCusL32vNbI3d6OYhnmgYl9at_mDWMD3rcHBni0sNAJR4abEKupxxPfcsZZZ95dAKsPpEDcjrhgPGaivedhHYQtmZybc-dmVMw","source":"ziprecruiter","full_description":"Pilot’s Choice Aviation, Inc. is a FAA approved Flight School that is an affiliate school with Liberty University and VA approved. We maintain a fleet of 12 aircraft including Beech Duchesses, Piper Archers, Warriors and Tomahawks. We are now looking for long term mechanic who can perform annual and 100 hour inspections and repairs as required. Looking for a dependable, detailed oriented individual, who can work in a fast-paced environment while safely maintaining quality work.Responsibilities:- Troubleshooting, aircraft maintenance including 100 hour inspection & annual inspection, and repairs in accordance with applicable regulations, manufacturer’s instructions, and company policies and procedures.- Ensure consistent, accurate aircraft maintenance records by properly documenting & completing required forms, computer entries, and logbook entries- Follow all policies and procedures- Keep a clean and orderly work environment- Perform job duties in a safe manner- Ability to understand and interpret aircraft technical data- Ability to successfully work with others as part of a team to achieve established goalsQualifications:- A&P Mechanic Certificate Required & Inspector Authorization would be a plus- General Aviation Maintenance Experience Preferred 3+ years- Have previously worked as aircraft mechanic / general aviation line mechanic / general aviation maintenance / aircraft maintenance technicianPay depending on experience (IA Certificate)Job Type: Full-time Pay: $23.00 - $35.00 per hour depending on experienceBenefits:Employee discountPaid time offHealth InsuranceSchedule: 8 hour shift or can be flexibleEducation: High school or equivalent (Required)Experience: General Aviation Maintenance: 3 years (Required)License/Certification: A & P Certificate (Required) IA preferredWork Location: Georgetown, TexasCompany's website: www.pilotschoice.comContact: Beth Jenkins, PresidentPilot’s Choice Aviation, Inc.512-869-1759"}