{"title":"Medical Technologist II Chemistry Full Time Days 7.5K Sign On","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL-GTR5XosfShYmaHz9lWMxylr9jtBNfCJu16pcB6hZlcUQr93JqHbERdFGgvjV2IZ45hra2JJ_QY9NNcmmWjhiMOHG9uf6eUkfr4jmDj7nY86j_FjFEZVtLXocnSHx7sZJl3A3VxiW1aQk719s7kYIDz-aLD-5azvfhXjZzd0xEhF1UO4mDz3o6RhpRfDs","source":"ziprecruiter","full_description":"SummaryProcesses and tests all types of laboratory specimens. Reviews and reports lab results. Performs operational duties, maintenance and advanced troubleshooting of laboratory instrumentation and equipment. Acts as resource to other laboratory personnel. Additional responsibility includes: Assisting with new equipment validation and implementation; Employee training and competency assessment; Regulatory compliance responsibilities for CAP, TCJ, AABB or other agencies, quality assurance, quality control and instrument maintenance.ResponsibilitiesProcesses and tests all types of laboratory specimens; reviews and reports lab results.Reviews and reports lab results.Performs operational duties, maintenance and advanced troubleshooting of laboratory instrumentation and equipmentActs as resource to other laboratory personnel.Additional responsibility includes: Assisting with new equipment validation and implementation; Employee training and competency assessment; Regulatory compliance responsibilities for CAP, TCJ, AABB or other agencies, quality assurance, quality control and instrument maintenance.EducationRequired: Bachelor's Degree from an approved college or university and/or graduate of an accredited school of medical technology ExperienceRequired: 2 or more years as a medical technologist in acute care facility with demonstration of increasing responsibilities, primarily Chemistry experienceFull Time Days, including some weekend hours  CertificationsRequired: Florida Medical Technologist Licensure Candidates in unit have priority based on unit seniority  ..."}