{"title":"Digital Factory Engineer NEW!","location":"","salary":"","description":"","term":"$95,000 to $110,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKf_8eG-N8rnv3lIwErizWoNMp_cAQE3YLqzyqzFZwRXrl0JMg0lKGGuToFkxRrXDEGwWMgZfMsOrzrFbNYdrmDbtil53havQ_HEZCvSbxTaon8jG-zgRCHPcG36NuARnqpqA_1G36Bv-rS76SV1wfr4cd33rqspaUF6P8mpjJiz5tMXiymWkGnxy9J--U","source":"ziprecruiter","full_description":"We are looking for a Digital Factory Engineer to join our team! You will be responsible for overseeing marketing policies and programs, as well as identify areas of improvement to increase brand awareness.Looking for a Digital Factory Engineer with Python and Tableau programming experience to fill a full-time position. The ideal candidate will spearhead projects at the plant level introducing and implementing Industry 4.0 technologies within the company as assigned, work to make sure assignments are completed within budget and on schedule, and communicate effectively with team members on project status and needs.Responsibilities:Spearhead projects at the plant level introducing and implementing Industry 4.0 technologiesComplete all programming projects (control logic, HMI screens, etc) accurately and in a timely manner.Design and implement the use of Andon smart technologyAssist with on-site start-up and troubleshoot, as needed.Assist the Department Manager in the development of programming standards and library functions.Proactively coordinate with project managers, engineers, field technicians, and clients.Qualifications:Tableau and Python programmingExperience with PLC programming and ladder logic3D/2D CAD (Solidworks / AutoCAD)Create project timelines and manage project budgetsPreparing capital equipment justifications and requestsExperience with advanced manufacturing techniques and the latest technology advancesProficiency utilizing operations/computer simulationKnowledge of SAPKnowledge of Allen-BradleyKnowledge of Microsoft Power AutomationKnowledge of smart factory programmingKnowledge of Rockwell FactoryTalk, Ignition softwareAbility to work across multiple teams to build consensus and drive decision makingProject management skills to define, manage and deliver projectsAbility stay current with current technologies and industry trendsExcellent interpersonal and communication skills.Strong technical and analytical proficiency with the ability to multi-task effectively and thrive in a team environment.Additional Qualifications To perform this job successfully an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions:"}