{"title":"Sr Android Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIY3gZheOZHqvqVm2l9gPQe2i4pxcnENdqTqNdMqh0X5EyLzOT9-wF0Xvr0vqnJioryI0NniVe9RzP9pOos18EYMbGz7W24-KFIdGCYH03N3Wy8oKuvcFx-2S9zAmQEGMnExOSjkHC30AL-YRndC5GC3ANHG2fJ3wE3cCvQsNYKCc_RSeRXgstjydsmYXw","source":"ziprecruiter","full_description":"Role Needed: Sr Android EngineerRequired Skills: Android Development & Support 100% RemoteApprox. Role Start: March 15th Approx. Role End: July 2021 with possible extensionApprox. Time Commitment: Full-time 40 hrs/weekBrief Job Description:Strong Android developer needed to provide support for the mobile device app for a US motorcycle manufacturer. Work may include supporting backlog tickets or building enhancements. Strong experience building a mobile product for a connected device AND working with maps (Here Maps) is strongly desired.Need to have experience with HereMaps SDK and premium version plus know the API's.By integrating HERE SDK into your apps, you can give users advanced location services that support their journeys: customized maps, truck routing, in-car navigation, a map designed for fleets, historical traffic patterns and beyond.Available for both iOS and Android, HERE SDK comes in four editions:Lite Edition: quick way to integrate location features and customized maps into applications built for devices with limited ROM capabilities and rendering needs.Explore Edition: access to a smooth map experience and highly performant map rendering tailored for high-end devices, with features such as multiple map view instances, controlling draw order of map layers, 3D camera control and integrated tool chain for map customizationNavigate Edition: access to all the features that come with the Explore Edition plus turn-by-turn navigation capabilities.Premium Edition: the most feature rich SDK; provides everything found in the previous packages, plus access to offline capabilities and other location features such as navigation for cars, trucks and pedestrians; electronic horizon, toll cost calculation, advanced data sets like speed limits, inclines, curvature, and moreGood coverage during the US timezones needed, strong communication skills, and ability to work well within a larger team desired."}