{"title":"Sr. Mobile iOS Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAImHqQy4Zk9Q_rxbZ_Zr12Bc3BaLDHa2Er_xuKCgnqBRhKCIF5OR8xlWSRYQXEC5NQ7xFbZ4ZjkFtXvbvqw3Aa7I3xLAAQt4T9ZpfkNiXRKj1_E5bRT-0e1dB2scfgKf7wVIvW5AV3OsdmCirEXM7sixwswnrCjvSCOIaQC69Q8AZpiYn3U00aPEamxZT7x","source":"ziprecruiter","full_description":"Veyo is using its platform and app-based transportation services to reinvent the medical logistics world. Our company is using technology to pioneer new operational models to help make transportation more powerful and more reliable for the healthcare industry. When you work at Veyo, you're helping to solve one of the nation's growing healthcare challenges -- ensuring patients get to and from their medical appointments, safely and on-time. We are using smart design and innovative technology to make patient transportation safer and more connected. In the process, we're transforming the entire industry. Primary Responsibilities: Help shape the strategy and direction of the company and an industry.Work with our product, design, QA, and consultant teams to improve processes, extend and implement APIs, and create efficient, long term solutions used by real passengers and drivers every day.Investigate, design and present solutions to the team. Implement and build applications for the iOS platform.Ensure the performance, quality, and responsiveness of applications.Collaborate with a team to define, design, and ship new featuresIdentify and correct bottlenecks and fix bugs.Help maintain code quality, organization, and automation. Our ideal candidate will have some or all of the following: 4+ years of experience developing native iOS applications.BSc in Computer Science or comparable experience.Experience with Objective-C or Swift programming and debugging skills.Proficiency in the following areas: offline storage, threading, Core Data, MapKit, UIKit, Performance tuning.Git workflow experience is a plus.Solid understanding of object oriented design, data structures, algorithms and core computer science concepts.Working experience with networking and messaging protocols.Must be a self-starter, curious and motivated to find solutions.Android experience is preferred, but not required.We like the following personality traits:  Friendly, social, outgoing, positive, passionate, cool under pressure, detail-oriented, deadline oriented, quick learner, multi-tasker, great sense of humor. We're looking for people that love the opportunity to be involved in strategy and management at the top level, but also aren't scared to get their hands dirty and do what needs to be done to make things happen! We move quickly, and our team doesn't know the meaning of \"not my job.\" We want people that want to get things done and can check their ego at the door. We thank all applicants for their interest and effort in applying for this position. This position is only for candidates legally allowed to work in the US. EOE. Veyo is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.  Additionally, Veyo participates in the  E-Verify program  for all locations."}