{"title":"Network Engineer (Level 3 or 4)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALoi2uN-arQCBFR1cSlLh-Smu4yPLSw7VeygHLB_kirAS630nag_5xJGSv6rCeSl7Mqe61npN1dBmyLB-7WCx2q2odbdUCtSl0_Z9gV-wI-xGUjh6bs3KSLg5LyEAtrFWrTGP46p5Q2xT7d3NfVcasXxpvB0ZmVJMi9Z76WTDktyrWJgOcBoDzCzmn1ffia","source":"ziprecruiter","full_description":"Boecore is seeking a Principal/Sr Principal Network Engineer (Level 3 or 4) to support the Ground-Based Midcourse Defense (GMD) program in Huntsville, AL.Responsibilities:Responsibilities include all aspects of the product design, development, integration, test, and implementation through the Product life cycle for incorporating changes identified by Program personnel. This includes analysis of change requests and requirements for new or upgraded Product capabilities, systems design, COTS/GOTS integration, and procedures needed to meet and mitigate requirements changes. Additionally, the candidate is expected to be able to resolve technically challenging issues and proactively contribute to the evolution of the Product. Tasks will include, but not limited to:Design, develop, configure, integrate, install and test network systems primarily consisting of Cisco, UNIX, Linux and Windows based LAN/WANsDerive system-level requirements from architectural guidelines and project objectivesDevelop detailed designs with supporting implementation, test and transition plansUsher proposed system changes through the Configuration Management process to successful implementation and delivery to the Customer/OperatorDevelop and maintain documentation supporting the Product through development, integration, deployment, and delivery to the customer/operatorWork within and across teams to support and coordinate daily integration activitiesCreate and update Visio drawings of network and rack elevation diagramsExecute root cause analysis to troubleshoot and resolve complex network system issuesSupport UNIX, Linux and Windows based networked systemsWork with vendor support for hardware issuesInterface with DISAApproximately 10% travel will be required for this position including supporting product installation and checkout at operational and test locationsMinimum Qualifications:Principal Network Engineer requires 5 years’ experience with Bachelors;4 additional years of experience in lieu of degree; 3 Years with Masters; 0 Years with PhD; 4 additional years of experience in lieu of a degree.Sr Principal Network Engineer requires 9 years of experience with a Bachelors; 4 additional years of experience in lieu of degree; 7 years with a MastersMust have an Active DoD Secret Security Clearance.Hands-on experience with TCP/IP networks (copper and fiber)Hands-on experience with Cisco routers, switches and firewallsHands-on experience with network evaluation and troubleshootingPreferred Qualifications:MDA experienceGMD experienceHold or be able to obtain a current industry recognized certification such as CCNA.Must possess or be able to obtain DoD 8570 Certification for IAT Level II or higher within two (2) months of starting (GSEC, GICSP, SCCP, Security+ CE or CCNA-Security) Experience with network design, virtual environments and cyber systems designExperience working in SCRUM and AGILE environments highly desiredExperience with cross-platform applications on various OSsExperience with Agile and Scrum methodology, understanding of development release cycle and operations, Source Control and Version toolsHold a current industry recognized certification such as CCNP, CCIE or JNCIEExperience working with DISA, local and long-haul circuit vendorsExperience working with MILSAT/COMSAT systemsExperience with network design, virtual environments and cyber systems design is preferredExperience with communicating / coordinating highly technical requirements with team members is a priority due to competing priorities and demanding deadlinesExperience with vigorous change management environment and the ability to document and test all changes prior to implementationExperience with performing technical, operational, and security risk analysis for new changes and technologies and the ability to articulate risks in a succinct manorExperience with all layers of the OSI Model and configuration of networks with routing protocols, packet captures, ACLs, firewalls and securityAbout BoecoreBoecore is a woman-owned small business focused on providing the Department of Defense with high-quality Engineering and Information Technology solutions at both local and national levels. Boecore is a proven leader in Software and Systems Engineering, Cyber Solutions, and Specialized Mission Operations. We offer a team-based environment where each employee can contribute to our success and be a part of our rapid growth.Boecore employees are self-motivated individuals who are recognized and rewarded for their efforts. We offer competitive salaries, comprehensive health insurance coverage, life, and disability insurance, savings plans, company paid holidays and paid time off (PTO), AFLAC, tuition, and training reimbursement, matching 401(k) program, discretionary incentive bonuses in addition to base pay and a rewarding work environment with a proven record of success for 20 years. Boecore is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, marital status, national origin, age, veteran status, disability, or any other protected class."}