{"title":"Software Developer-Mid Level","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALbE_4b--Z0RB4R7nn9C7JECUx-4mLg_vckIfqCW1hfR45fLADlfqDFOnwi-pybhOvYjYKEtZzTfQHb6hWx0HOAP4nqpHqokbR0Z5kIRoXMptNM0nLgg6LSBd4a4VO5kRM3t7yMHTr-z4e9AqSpBXPxyrTWHO21yb0Q3TcvKxHGLQoQMLeBEZpLhw0BdlU","source":"ziprecruiter","full_description":"Overview i3 is seeking a mid-level Software Engineer to support the next generation of the Army's friendly force tracking system. The position will support Joint Battle Command - Platform (JBC-P) operations. The position supports Systems, Simulation, Software, and Integration (S3I) on Redstone Arsenal located in Huntsville, AL. Responsibilities The Software Engineer will perform tasks related to development and maintenance of components and applications in Android and Linux operating environments that make up the JBC-P platform. Duties will include software design, implementation, testing, and documentation covering the entire software engineering life cycle. The software engineer will also be required to participate in major program reviews and support stakeholder meetings across several levels. The software engineer will work in a team environment and will interface with multiple disciplines, program management, and customers to help produce a complete solution. Qualifications Requirements Include:Bachelor of Science Degree from an accredited academic institution in a relevant technical discipline with a minimum of 3 years of relevant technical experience. This may be substituted with an Associate degree with a minimum of 7 years of relevant experience or 9 years overall relevant technical experience with a High School diploma.Demonstrated knowledge of Software Development and Development life cycle.Familiarity with Android development.Good written and oral communication skills.Candidate must be a US Citizen and possess, or be able to obtain and maintain, a Final Secret Clearance.Desired Knowledge/Skills:Wind River Linux familiarityC++JavaPostgresqlAndroid Open Source Project (AOSP)Knowledge of Source Control work flow with Git or similarProficiency with Microsoft Word, Excel, and PowerPointKnowledge of Atlassian tools such as Jira and ConfluenceFamiliarity with VMwareLinux Containers with LXC"}