{"title":"Mobile Platform Tools Developer - Javascript NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALKFDctkQ_EU1b2LOqShdERTmFeEnGEvWPwIdI4iJF6FK5i9ShEfzViWk0vDxKT9DqNHs2rMnfjpDQUmHZl4X6Yw5aDDu_dLabh6QRhW5K7LwUkj827TQ_Woo-d3kxrk1Gem8aImeWAUUqqdJvcTJUQJGNqhOWvliFforNrXVmkcE3wf72qWgtfu9vP0fcQ","source":"ziprecruiter","full_description":"To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.Job CategoryProducts and TechnologyJob DetailsTitle: Mobile Platform Tools Developer - JavascriptThe Salesforce Mobile Platform Enablement (MPE) team is building the tools and resources that guides and simplifies mobile development of Lightning Web Components (LWCs) for the Salesforce platform. Our tools integrate with VSCode to allow developers preview and debug LWCs on iOS and Android emulators using the mobile browser, the Salesforce application emulator build, and with enough flexibility to integrate into any custom application, We also support best practices through reference samples and real-time code verification. As Salesforce rolls out LWC support for mobile-native functionality, MPE will ensure that developers be able to integrate and debug those features with confidence.In this role, you will combine building the tools that you want to use as a developer and melding those tools into best practices that provide the greatest benefit for our customers: the developers who build Salesforce LWCs for mobile. You will straddle the web and mobile worlds writing plug-ins for VSCode and hooking them into mobile applications. You will get to learn the intricacies of moving between mobile-native functionality, V8, and the mobile browser and then get to make this seamless for developers. The best part is that you will be part of a team of like-minded, results-oriented software engineers who create software that is used by some of the world's biggest companies.Basic Requirements:Bachelor's degree required in Computer Science, Software Engineering, or Electrical Engineering3+ years professional software development experience using JavaScript or TypeScript. Node.js experience is a plusExcellent understanding of functional programming, JavaScript / TypeScript best practices, APIs, and common librariesKnowledge of professional software engineering best practices for the software development life cycle, including coding standards, code reviews, source control management, continuous integration / continuous delivery, build processes, testing, and operationsDemonstrable experience with real-world JavaScript / TypeScript projects.A commitment to writing quality codeExperience with agile development methodologies (e.g. Kanban, Scrum)An eagerness to learn new things and to help others do the sameExperience in communicating with users, other technical teams, and project management to understand requirements, describe software product features, and technical designsExcellent organizational, verbal, and written communication skills.Good understanding of globalization, internationalization, and localization issuesPreferred Requirements:Master's degree in computer science or equivalent experienceExperience developing mobile applications for iOS or AndroidStrong customer relations / customer management skillsPrior work on any developer tools is a plusOpen Source contributions are a plusFor Colorado-based roles: Minimum annual salary of $121,800. You may also be offered a bonus, restricted stock units, and benefits. More details about our company benefits can be found at the following link: https://www.getsalesforcebenefits.com/*LI-YAccommodations - If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.Posting StatementAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesfore.com or Salesforce.org.Salesforce welcomes all.Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records."}