{"title":"Core Camera Hardware Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKyRQF1dE7-4AKkOXqked_vpt5zEBwj6Qr1xVUAGEg9xme5Gva3z-QKxdLcyUTG983kBofhEN7_sFTTt3_REivGaAwHO951KkjqlmqcU32EqjGRS78joLtN-EiaFF7EjcWXcWWLuqgt4SlJ5JvptrzkO-ie1J9Zk6gANwFoG4Jp8i8ENJno22t-O2KEnpg","source":"ziprecruiter","full_description":"44379BR Job Title:Core Camera Hardware EngineerJob Description & Qualifications:At Ford Motor Company, we believe freedom of movement drives human progress. We also believe in providing you with the freedom to define and realize your dreams. With our incredible plans for the future of mobility, we have a wide variety of opportunities for you to accelerate your career potential as you help us define tomorrow's transportation.Do you have what it takes to make smart vehicles for a smart world? Join the Ford Product Development team. Utilizing Design Thinking and User Experience methods, you will work to deliver breakthrough products and services that delight our customers. We are seeking forward-thinking, laser-focused professionals with a passion for bringing innovative, exciting and sustainable ideas to life. We have opportunities around the world for you to contribute to such advancements as autonomy, electrification, smart mobility technologies and more!What you will be able to do Join us and help bring advanced engineering concepts to life. You will be a key member of the team that is designing and developing hardware and functional models that deliver best-in-class behavior for features like adaptive cruise control, automatic emergency braking, cross traffic alert, active park assist, 360 camera systems, and interior camera system. You will be responsible for the creation of new sensor and ECU hardware, which may include LIDAR, a driver-monitoring camera, an infrared camera or a central active safety ECU. You will: Develop technologies and specifications for new interior and exterior camera hardware + Develop and oversee test methods and plans + Comply with Robustness Engineering Disciplines (e.g. Functional Safety, Quality History, P - Diagram, FMEA, etc.) + Apply six sigma and 8D issue resolution processes + Conduct validation testing on components and subsystems on bench and at the breadboard and vehicle level + Support the Sourcing Process (e.g. investment, piece price, tooling cost reviews, etc.) + Release parts through the product life cycle + Support Change Control meetings + Identify validation, durability and functional tests + Define and verify engineering prototype requirements at part level + Review/manage program design change requests + Support prototype and vehicle launches + Provide suppliers with technical assistanceThe minimum requirements we seek Bachelor's Degree in Electrical Engineering, Mechanical Engineering, Aerospace Engineering or Control Systems Engineering + 3+ years of combined experience developing complex hardware and cameras + 1+ years of combined experience with engineering specifications, design validation and problem solving (e.g. failure mode analysis, 8D and/or six sigma) for the automotive industryOur preferred requirements Master's Degree or PhD in Engineering + Experience in safety systems + CAD packaging experience + Experience in CATIA and Team Center + Operational knowledge of desktop productivity and CAD software + Understanding of production processes + Exceptional communication and interpersonal skills + Ability to champion issue resolution + Knowledgeable about camera functionality + Understanding/experience with the design and development of automotive electrical features + Knowledgeable about signal transfer and mechanical-electrical interfaces + Understanding of vehicle electrical systems and electrical design/development process + Understanding of circuit design and worst case circuit analysis + Familiar with FPDLINK III, GMSL, CAN networking tools, diagnostic protocols and trouble shootingWhat you will receive in return As part of the Ford family, you will enjoy excellent compensation and a comprehensive benefits package that includes generous PTO, retirement, savings and stock investment plans, incentive compensation and much more. You will also experience exciting opportunities for professional and personal growth and recognition.If you have what it takes to help us redefine the future of mobility, we would love to have you join us.Visa sponsorship may be available for this position.We are an Equal Opportunity Employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.For information on Ford's benefits and compensation, click here: https://corporate.ford.com/content/dam/corporate/us/en-us/documents/careers/2021- benefits-and-comp-GSR-sal-plan-1.pdfAuto req ID:44379BRCompany:Ford Motor CompanyFunction:Product DevelopmentSkill Team:Product Development (PD)Sub-Component:EESE CoreState:MichiganLocation:Dearborn"}