{"title":"Electromechanical Field Service Engineer / Technician NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI6BIfdiZOGFgoOlTZCOhejtCTOOQcQKjZ9KJQAT_itf5YXBiNb7LG7uuzvlSFmiDEI4bKULixPb28vkLwQVa6II0VCeh_o0pFQly2Bmmv0iNi-FxZIrujA0KlNaLV9VgBuxktf_alaxWydoGCuC9K8Jz7j5HaSfUxOI0be3YUJNCwkhB5zUr5ScYa75IBC","source":"ziprecruiter","full_description":"Westerville, Ohio office is seeking a Field Service Engineering Technician who will work closely with our customers, building strong relationships through effective communication and exceptional, proven, support.We build custom machines for some of the premier companies in the world. We look for strong machine based knowledge and electro-mechanical troubleshooting skills. Electrical and electronic control experience are needed for this position. The right candidate will have a positive attitude and be able to present themselves in a professional manner, communicating confidently with customers and be a team player who works well with other employees. We need an individual who is self-motivated, organized and good at managing their time well. The position will primarily involve routine and emergency service, advanced troubleshooting, Installation of machinery, and training of customers as well as some machine assembly work at our Westerville, Ohio assembly plant when not performing field service work.Requirements70-80% potential travel throughout North America, Dominican Republic, and CanadaStrong Electro-Mechanical troubleshooting aptitudeAbility to communicate effectively with customers and co-workersCommitted to quality work and detail-oriented excellenceStrong decision making skillsA proven history of strong mechanical experienceAbility to complete service and expense reports and manage administrative tasksHave the initiative and drive to grow within the companyCapable of contributing new ideas, designs and methodsAbility to read electrical and pneumatic schematics or willingness to learnPLC, machine control, and ladder logic experienceCommunication savvy -computer, phone, and internetMS Suite: outlook, excel and wordAble to perform engineering level analysis and employ advance troubleshooting techniques including redesign of machine components and programming changes.BSME, BSEE or equivalentIn addition to technical skills, you must be able to maintain a customer centric mindset and demonstrate a high level of motivation to sustain our status as an industry leader.SalaryDetermined upon qualifications"}