{"title":"Development Research Chemist ( LC - MSMS / GC - MSMS )","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALzbR7rD9B1kch_X5CaWmpA602u49ADojO11Vk5_dZMhax9F3vzB-ictutd8hefV3_IDOx52cTARENeZW_hEKZ9PUV9XMkFnuWt9VVi1_817Yak3YMtxTa2Xj41OajzK00PeQ9n6HPbDscK7RZtu8yle5s3d7Ob7q5XaxW5cCp-eFocc6SuQvyfmKLqbC4","source":"ziprecruiter","full_description":"Food Safety Net Services (FSNS) is the leader in food safety and testing. The FSNS national network of ISO-accredited laboratories offers an expansive scope of microbiological and chemistry testing services specific to the food processing, consumer products, and nutraceutical industries. FSNS Chemistry analyzing and testing capabilities include fat and water soluble vitamins, contaminants, allergen testing, meat speciation, proximate testing, additives, carbohydrates, sweeteners, minerals, metals, heavy metals, fats, oils and rancidity. JOB SUMMARY Responsible for the development, optimization, validation and troubleshooting of analytical methods for use in the testing of foods, ingredients, intermediates, active nutraceutical ingredients and final products. Responsible for supporting analytical laboratory processes including technology, methodology, laboratory proficiency measurements, research, and scientific processes. This position will have routine contact with the company’s client base and will assist with all aspects of the company’s special projects and research initiatives. ESSENTIAL RESPONSIBILITIES Expertise in advanced analytical technologies notably GC-MS/MS and LC-MS/MS. Experience in pesticide testing a plus. Investigate and develop new methods and process development to ensure the company offers the latest testing to its customer base. Function as a technical resource in all areas of analytical and food chemistry. Integrate functional expertise with business objectives to identify critical testing needs and timing. Excellent customer service skills and the ability to understand and resolve scientific issues, answer questions and gain customers confidence. Ensure newly validated methods are appropriately transferred into the Quality group for use in routine testing. Fully and clearly document method development process including method validation protocols, development and validation reports, and required technical documents. Interpret data and present findings with appropriate documentation, references and supporting material to the food and other associated industries Chromatographic data interpretation and correlation back to process, materials or contamination issues Maintain a high degree of technical competence by reading scientific journals, attending professional workshops, and being aware of food and associated industries regulations, issues and trends. Assist technical team to coordinate and prepare scientific reports, technical proposals and presentations. Willingness to support all other departments in the lab as needed based on business demand. Use expertise to mentor junior chemists and lab technicians. Provides training to lab personnel or methods application. Assisting with managing priorities and schedules such that individual goals as well as team goals are achieved with encouraged participation in the Food Safety Net Services Team. Responsible for the safety of oneself and others working within their area. Responsible for the completion of required training. SUPERVISION May take the lead role with two or more employees in the department Carry out responsibilities in accordance with organization's policies and applicable laws Responsibilities may include interviewing, training, directing work, and appraising performance MINIMUM QUALIFICATION PhD in Food Chemistry or related field preferred. Minimum education requirement is a Masters in Chemistry/Food Chemistry, or equivalent combination of education and experience. Familiarity with ISO 17025, GMP, GLP, AOAC, FDA, USP and Compendium methods and procedures and OSHA guidelines. Three or more years’ experience in an analytical lab, commercial food-testing laboratory preferred. Must have a strong analytical chemistry background and have working knowledge of GC, HPLC, LC-MS/MS, ICP-OES, ICP-MS. PHYSICAL DEMANDS Dexterity of hands and fingers to operate a computer keyboard, mouse and to handle other communications/computer components Potential exposure to odors, fumes, airborne particles, hazardous chemicals, and microbiological pathogens Noise level varies from quiet to loud Temperature varies from hot to cold Color vision and depth perception Interactive and fast-paced team oriented tasks Overnight Travel may be required at the discretion of management Occasionally lift and/or move up to 25 pounds. Employment Type: Full Time Years Experience: 3 - 5 years Salary: $60,000 - $85,000 Annual Bonus/Commission: No"}