{"title":"FPGA/Digital Hardware Design Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJvwtQuq7zRFUkHw0GNJOCq8KBGmPls5h6_azi_jI6mfu_qfxMaK3z_cmzYSF0RaP2GCExvRdPoHJlGFOJr-9RiN2OZplvxkuo-0AA6l-qQw1HSzPJR3rNLglfu3QE9g12UwZoGmgk3h4hj9zuTh-EmdE4KrhlSN03YBU7Yq1zZGOcX-VRO864V3dRdOysT","source":"ziprecruiter","full_description":"Company Overview Teledyne LeCroy is a highly innovative New York based high-tech corporation with a hardware design research and development site in Chestnut Ridge, NY.  We are currently looking for a FPGA/DIGITAL HARDWARE DESIGN ENGINEER position responsible for designing verifying and debugging a wide range of digital designs.  Position Summary and Responsibilities Design, implementation, and verification of complex logic circuits and systems used in test and measurement equipment for data acquisition, processing and display.Document design and work closely with our software team.Debug and validate design.Provide technical support to the production team.  Qualifications MS Electrical Engineering Degree or equivalent 3+ years of experience in FPGA logic design and general digital design. Highly proficient in Verilog / System Verilog. VHDL knowledge is a plus.Experience with scripting languages such as TCL, Perl, or Python.Good knowledge of the FPGA design flow. Questa, Vivado/Quartus.Understand timing constraints SDC/XDC.Direct experience implementing full design from source to bitstream.Debug experience using lab equipment like oscilloscopes, signal generators, protocol analyzers and FPGA debug tools (ILA). Understanding of signal acquisition system (ADC, JESD204, memory interface)Experience with PCie Express protocol.Knowledge of JESD204B/C protocol.Experience with industry-standard protocols (USB2/3, SPI/QSPI, I2C etc.) are plusesKnowledge of high speed design both from a logic and signal integrity standpoint is a plus. Teledyne is an Affirmative Action/Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race,color,religion,religious creed,gender,sexual orientation,gender identity,gender expression,transgender,pregnancy,marital status,national origin,ancestry,citizenship status,age,disability,protected Veteran Status,genetics or any other characteristic protected by applicable federal,state,or local law. If you need assistance or an accommodation while seeking employment,please email teledynerecruitment@teledyne.com or call (855)479-1480. Determinations on requests for reasonable accommodation will be made on a case-by-case basis. Please note that only those inquiries concerning a request for reasonable accommodation will receive a response."}