{"title":"Sr. Software Engineer with Automation expertise 29878-1 NEW!","location":"","salary":"","description":"","term":"$68 to $75 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAJgEMO50cBEqs_ZblqRZtygJpGSgalPq1xmwQChmlvmQ0POUNEU3q3m26WwnuUXSd3Dfh8WWxLTqAOPX6v4WPJKkwPVEnnaAb07rMARHkxFLaZrgAtIU4gMrC3qFN-Rdw3HQOS1MVqKG9gjwA-yHVvsFJUnvgK8TsbzKZhwO1-ao46Df67j2fhnyfeSgJg","source":"ziprecruiter","full_description":"This is for our direct Airline client in Dallas, TX. This would be for a REMOTE positiion through the end of the year, but if ever they need to have the person come in for partial onsite after the January of 2022 the person would need to be in Dallas.  This is a 12 mos project but the Hiring Manager said that she sees this going long term. This Airline in Dallas is an AWESOME place to work. We need this person to be on our direct payroll. We need someone with very good communiation skills and someone who works well in a team environment.We are looking for a Senior Software Engineer with Ansible, Chef and puppet with HEAVY Scripting experience. We need this person to be an AUTOMATION expert.Python, Java are really a must have for this project. If the person has Active Directory that would be very helpful, and also ServiceNow experience.We need this person to support and leverage DevOps principles​Application development, scripting and automation development (Python, Flask, Django, Bash, PowerShell and Unix like tools). is needed in this role.WORK ACTIVITIES/CONTEXT:Must be able to meet any physical ability requirements listed on this description.May perform other job duties as directed by Leaders.Mentors Engineers on responding to production program issues and coaches on resolution.Expert lead on production and testing to identify defects.Leads testing and implement system enhancements using techniques that preserve system integrity and drives a results-oriented environment.Develops, tests and operates end-to-end software solutions using machine learning, related optimization, and knowledge systems.Ensures that systems are functionally appropriate, technically sound, and well integrated.Defines procedures, standards, measurements, accountability, and promotes quality and quantity of work.Subject matter expert level influence for scope of solutions.Remains abreast of industry trends and develops business cases for changes.Measures and defines parameters for transitioning of features into a production environment.Leads consistent forms of communication within teams while facilitating Tech sessions for updates and idea sharing.Partners, leads, and collaborates with all levels vertically from team-members up to Senior leaders.Communication with external parties and industry consortium to enhance knowledge and identify opportunities for teams.Leads team to find best solution and offering thought leadership while ideating and challenging group think.Embodies Agile best practices and continuous improvement.Level of escalation to identify problems, performs root cause analysis, investigates information, performs impact analysis; formulates and executes plans to develop solutions. Mentors on solutioning.Identifies strengths and weaknesses of solutions while researching pros/cons of alternative options.Understands and can estimate efforts and value for solutions accurately and consistently.WORK EXPERIENCE:5 Years Work experience as a Software Engineer or equivalent role required.Fluency in at least one programming language such as Ruby, Java, JavaScript / Node.js, Python, Bash, Perl preferredStrong familiarity with UNIX and Linux preferred.Experience with monitoring/alerting tools such as AppDynamics, New Relic, Grafana, and Graphite preferred.Experience using the tools jbehave, Selenium, or Jenkins preferred.Experience in Infrastructure as a Service (IaaS) modeling including infrastructure as code development (Terraform or similar) or infrastructure engineering at enterprise scale , automated configuration management (Chef, Puppet, Ansible) preferred.Experience with APM tools such as AppDynamics or Dynatrace preferred.Working knowledge of open source tools such as Sensu, Grafana, Logstash, and Elasticsearch preferred.Experience with log aggregation tools such as Sumologic, FluentD, ELK, and Splunk preferred.AWS administration experience / training including provisioning EC2 instances, VPCs, Elastic Beanstalk, Lambda functions, RDS databases, S3 storage, IAM security, ECS containers, Cloudwatch metrics & logs preferred.Experience operating large-scale, distributed systems running 24/7/365 preferred.Solid understanding/experience of containerization services such as Docker and Kubernetes preferred."}