{"title":"Mobile Developer - iOS","location":"","salary":"","description":"","term":"$40 to $65 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AALCTP0cXqmgD6ZV7iTOeXxw4Fs-lROsbyDDO-IMgvZRW4BR55acV6Hh3kGBU1Byg3H7fmwl6MTZc_7jLJQWIW0V2a_KGqJQIxzLQb5QTc8HuGCnHj3BnbTFKCxjdhjympDKOaYWq04NVh5hIkdxrjTcbKuBJ-8LLzymAEicFyRWv86JGBM3ot50BH9Tjio","source":"ziprecruiter","full_description":"We are looking for qualified Mobile developers to join our Engineering team. You will be working with our end clients engineers to develop and maintain high quality mobile applications. If you’re passionate about mobile platforms and translating code into user-friendly apps, we would like to meet you. As a Mobile developer, you’ll collaborate with internal teams to develop functional mobile applications, while working in a fast-paced environment supporting the growth of a fortune 50 retailer.iOS Developer• 5 years of experience in software development or systems engineering or analysis using Xcode.• 3 years of experience with CI/CD tools like Bitbucket, Jenkins, Fastlane, Xcode, Crash reporting and analytics tool.• 5 years of experience with Objective C or Swift Programming language, Storyboards.• 5 years of experience working with CocoapPods/ Swift Package Manager or similar dependency management tool.• 5 years of experience in writing and maintaining Unit and Integration tests using XCUITest and XCTest2-5 years Core IOS DevelopmentJenkinsCICDReporting Tools5 years of experience in software development or systems engineering or analysis using Xcode.• 3 years of experience with CI/CD tools like Bitbucket, Jenkins, Fastlane, Xcode, Crash reporting and analytics tool. ( Nice to Have) • 5 years of experience with Objective C or Swift Programming language, Storyboards.• 5 years of experience working with CocoapPods/ Swift Package Manager or similar dependency management tool.• 5 years of experience in writing and maintaining Unit and Integration tests using XCUITest and XCTest ( Must Have) Contract to Hire preferred will accept Visa candidates"}