{"title":"Quality Assurance Inspector NEW!","location":"","salary":"","description":"","term":"$14 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AALEAWQzxUkzIAxx14IYJ3UWQujIfsJtOlTMnQYtRquSJrh1ldaGtf1m13bqqBGuZxGDROQ7SIcDjAjpqT4ITygUylypRxO_8gnhdTAvnjJmxY9XWtk2u1y4Gl_ipluc0dWAJU5wCEO1z-vEE2sHGKAFxacfG_-dYLGWqkb2q4XYZwuhcVZxJE7StQUw0xwm","source":"ziprecruiter","full_description":"Morales Group is looking for a Quality Assurance Inspector in Dallas, TX: Responsibilities of Quality Assurance Inspector:Perform in-process quality testing procedures and techniques accurately and thoroughly. Record required data. Coordinate with Operators and Maintenance Techs to correct quality problems. Follow established quality procedures and make recommendations for improvements. Provide solutions to a variety of technical/quality related problems of basic scope and complexity. Participate in ISO internal audits as scheduled.  Ensure rejected material is properly labeled. Refer questionable issues to Manager Quality/Safety Flexibility to perform other duties as assigned.Requirements of Quality Assurance Inspector:High School Diploma required. College is a plus.1 to 3 years of experience in the quality field. Basic computer skills necessary to operate word processing, spreadsheet, and web-based applications. Ability to successfully complete the in-house ISO 9001 Internal Auditor training program. Understanding of ISO 9001 concepts a plus.Ability to learn process improvement methodology and application. Working knowledge quality and manufacturing principles, theories and concepts.Interpersonal and communication skills necessary to establish and maintain effective working relationships with co-workers, management, customers, and suppliers.Leadership skills to make decisions with sound judgment and guide day-to-day operations successfully.Ability to communicate effectively both verbally and in writing.Ability to read blueprints, drawings, and interpret customer requirements and specifications. Shift:6:50am-2:30pm Monday-FridayPay:$14/hour"}