{"title":"R&D Engineer, Hardware - Intermediate - G10810","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIEdNF1mkTA8C42mbqJA1v0Kx0DQow585cIIgb5kP7Oqs8lKvUkykzJqk7y1Z-9JItyCLS8K3FKgAbk7H5fLVSdjqLENFvdsGNZtMrD4JiEmw8gD1NHE2xfzI3REZc2vrc8w12xddVE2rs20m8V-SbCV6iX4Ajn3lX_1QCebXpGl5YPdIevsg5QkLKZVQUu","source":"ziprecruiter","full_description":"Job Description Designs Keysight products and specifies the components that make up the products. Designs and develops products, components, processes, and systems using broad engineering concepts and research techniques. Documents research and design specifications. Solves complex and high impact design and development problems including customer application issue of varying scope and complexity. Uses product and customer applications knowledge to determine, define, develop and validate design concepts and methods. May facilitate transition of product design and enhancements to full production/delivery. May lead product definition/system design for complex features orKeysight Technologies is the world's premier electronic test and measurement company. A global, diversified technology company focused on high-growth markets in communications, electronics, and instrumentation. The technology we invent today enables the world's technological innovations of tomorrow. The Digital and Photonics Center of Excellence design team located in Colorado Springs, Colorado at the base of Pikes Peak is looking for a highly motivated individual to join our team. Qualified candidates will have the skills necessary to take ideas from concept to shipment and work side by side with the software team and other hardware designers at the leading edge of measurement technology. You will be part of a team that analyzes requirements, designs, prototypes and tests new products. You will also work with our manufacturing, purchasing, and marketing departments to transform your designs into shipping products.Although you'll be part of a team, you will also be working independently and setting your own priorities. The scope and complexity of your projects will be based on your existing knowledge and capabilities as well as how fast you can acquire new skills. We offer a challenging and dynamic working environment with opportunities to make a substantial contribution in exciting new product development.Principal Activities include: Field programmable gate array (FPGA) design, simulation, verification, and debug.coordinate a small group in feature development and integration. Disciplines:Hardware: Designs, develops, simulates and debugs hardware products. Specifies new product functional requirements; designs, tests and integrates components to produce final design. Designs, develops, executes and evaluates validation testing and product specifications.Works on research and development assignments with broadly defined objectivesSolves straight-forward issues, challenges and problems within field of specializationJob Qualifications RequiredNew College Grad with MSEEExperience with Verilog or VHDLAbility to design, verify, and debug synchronous and asynchronous digital circuitsUnderstanding of circuit theory, transmission line theory, and high-speed signal fundamentalsExperience with CAD/CAE design toolsGood analytical problem-solving skillsAbility to work independently and tackle challenging tasksAbility to function effectively in a team environmentAbility to quickly learn new technologiesDesiredExperience designing, verifying and debugging analog and digital circuitsJob Function R&D           Shift:                       Day Job                        Schedule:                        Full Time (F)                        Travel Required:                        < 25%             Duration (Temp Positions Only):Not Applicable   Colorado Pay Range:US Employees may be eligible for the following benefits: •  Medical, dental and vision•  Health Savings Account•  Health Care and Dependent Care Flexible Spending Accounts•  Life, Accident, Disability insurance•  Business Travel Accident and Business Travel Health•  401(k) Plan•  Flexible Time Off, Paid Holidays•  Paid Family Leave•  Discounts, Perks•  Tuition Reimbursement•  Adoption Assistance•  ESPP (Employee Stock Purchase Plan)  ___________________________________________________________________________________Careers Privacy Statement ***Keysight is an Equal Opportunity Employer.***Keysight Technologies Inc. is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other protected categories under all applicable laws.Candidates can be considered to work from the following locations:Americas : United States : Colorado : Colorado SpringsJob ID : 39765"}