{"title":"Android Developer-Digital Streaming","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAISceK6juYDrmbLzYcy59EVgRYMQDvJ6smt3Cxf5IqlaYqnRbNGl4XDFwu9lsz8VGIJdP7Ru9ufJwYPW3s5Ys1-6VYSBt0UqS6lioLuPBrphEptcyGN6tHK0kQx98yVtfU7KSQCWwhPVpEc3NRK8-VOFXqnmAxiXy-r6cToqj4PLDQlYGgAlaOMp4aBKmS7","source":"ziprecruiter","full_description":"Company: Midwest Tape is dedicated to delivering applications and engaging content to libraries through innovative interactions. Midwest Tape is unique in that it offers a very diverse set of content to libraries further engaging their enthusiast's needs. hoopla is a leading digital media streaming provider to public libraries. We have tremendous growth opportunities and our mission is to help libraries serve their communities better with easy to use technology and great content. hoopla digital is a category-creating service that partners with public libraries across North America to provide online and mobile access to thousands of movies, TV shows, music, ebooks, audiobooks and comics. There is growth opportunity for this service in the international market, as our digital products are becoming a global brand. Position Summary: The Android Developer will join our expanding engineering team to focus on front-end mobile app development. We have great ideas for where our technology can go next and we need to add mobile developers to make that happen. The Android Developer is responsible for writing technical stories, technical specifications, coding, peer reviewing, designing solutions new and improved mobile applications while maintaining and improving existing features on existing applications. Developer ensures the quality of the application, fixing application bugs, maintaining code and implementing application updates. Success in this role will involve delivery of high quality Android based front-end mobile application. Success also includes efficient and timely communication to technical and non-technical team members, proactive coordination, love of new technologies, a strong desire to learn, curious nature, and a passion for removing inefficiencies.Primary Duties and Responsibilities:Develop mobile applications for the Android platformCollaborate with software developers to integrate existing technology into a mobile applicationResearch, design and implement web application development best practicesBuild prototypes of creative and interactive ideasIdentifying areas for modification in existing programs and subsequently developing these modificationsDetermining operational practicalityDeploy software tools, processes and metricsWork with other engineers to share knowledge of tools and applicationsSkills:Knowledge of general mobile landscape including architecture, trends, & emerging technologiesProficient with full Android development life cycleProficient with Java and Kotlin CoroutinesFamiliar with JIRA, Confluence, Visio, and Microsoft Office applicationsFamiliar with SQL or similar database language and ability to write complex SQL queriesKnowledge of mobile app testing & securityKnowledge of mobile and cloud-based applications. Strong interpersonal, written and verbal communication skillsAbility to work in an agile environment with a focus on continuous integration Preferred Education Requirements: B.S., M.S., in software engineering, computer science, or related area. Preferred Experience:Minimum 5+ years developing Android mobile applications3+ years of UI & UX design experience 3-5 years’ experience using git, including branching, merging, etc.2-3 years’ experience with video and audio playback using Exoplayer2-3 years’ experience working with REST API and GraphQL servicesFull stack development experience Physical Requirements / Work Environment: The work environment characteristics and physical demands described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Ability to regularly sit for extended periods of timeAbility to control emotions under various levels of pressure, stress and fast paced activitiesAbility to occasionally bend, twist, stoop, and crouch. Perform repetitive motion type tasks"}