{"title":"Research Intern, Polymer Chemist (PhD)","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AALLr5lbtekdJN7aRo0jiXTJhHihUyZFH5W5GXSNtpWuoXdp7zCLGEA0_sGmh70IV8VZbMvsb5qi6GhESkeP09-CiHVJenoBV3cFThK7pPqRzzvriQlYstZxEv350rVDDryEIHa19W1HUykyMrOl4jsMVVYF030_jqunhCrxVw8vRQuJ0Gr9HjJCIXib7FYr","source":"ziprecruiter","full_description":"**Intro:**Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started. **Summary:**The Facebook Reality Labs (FRL) Research Team brings together a world-class team of researchers, developers, and engineers to create the future of virtual and augmented reality, which together will become as universal and essential as smartphones and personal computers are today. And just as personal computers have done over the past 45 years, AR and VR will ultimately change everything about how we work, play, and connect. We are developing all the technologies needed to enable breakthrough AR glasses and VR headsets, including optics and displays, computer vision, audio, graphics, brain-computer interfaces, haptic interaction, eye/hand/face/body tracking, perception science, and true telepresence. Some of those will advance much faster than others, but they all need to happen to enable AR and VR that are so compelling that they become an integral part of our lives.Our internships are twelve (12) to twenty four (24) weeks long and we have various start dates throughout the year. **Required Skills:**1. Develop new polymer formulation and characterization for AR/VR applications 2. Understand fundamentals in the formulation, chemistry, physics and characterization of the new material for AR/VR applications 3. Collaborate with the larger Facebook Really Labs Research team and provide creative leadership on display and imaging technologies. 4. The type of work should be publishable research results in top-tier journals and at leading international conferences. **Minimum Qualifications:**5. Currently has, or is in the process of obtaining, a PhD degree in the field of polymer chemistry or polymer science. 6. 3+ years experience with experimental materials/process and conducting laboratory work (i.e., demonstrated ability to construct proof-of-concept systems and to evaluate performance) 7. 3+ years experience with polymer formulation and characterization 8. Experience of lab work of radical polymerization or block copolymer 9. Experience of polymer mechanical performance testing 10. Interpersonal experience: cross-group and cross-culture collaboration 11. Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment **Preferred Qualifications:**12. Intent to return to degree-program after the completion of the internship/co-op 13. Strong polymer physics background 14. Experience with in acoustic or optical materials 15. Proven track record of achieving significant results as demonstrated by first-authored publications **Industry:** Internet **Equal Opportunity:** Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}