{"title":"Software Engineer, Enabling Tech RD","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIuLN4WoOZhNooixv9pYqKVQyPT2lycS2n4WwxHofSMoxuSCV1_KxiMMtyhsyD1-vytGHTijDq4IdcmUt43iIuHslOvZab_JxkdcqpOuSJIUirXyjomqwq6a0QmqAR-lpsUjC3LjpGGW5r_eg8Y36e5YILcRSbBDJwg0qBZB0Sptt5vA3tsOHjDgHw1NSIl","source":"ziprecruiter","full_description":"DePuy Synthes, a member of the J&J Family of Companies, is recruiting for a Software Engineer - Enabling Technology R&D that will be located in Warsaw, IN. DePuy Synthes Companies of Johnson & Johnson is the largest, most innovative and comprehensive orthopaedic business in the world. DePuy Synthes Companies will offer an unparalleled breadth and depth of products, services and programs in the areas of joint reconstruction, trauma, spine, sports medicine, craniomaxillofacial, power tools and biomaterials. The Software Engineer, Enabling Technologies R&D will be a key supporting role in the team on the forefront of digital technology for the orthopedic medical device industry. This role will support the Enabling Technology R&D team with all aspects of the product development process. The candidate for this role is a strong collaborator that takes the time to understand the project scope in order to drive product improvements and efficiently generate technical documentation. In this role, you will lead and execute various Enabling Technology and Digital Surgery projects. Emphasis will be on delivering projects on-time, within budget in a compliant and reliable manner. Responsibilities:+ Use standard methodologies for building Software as a Medical Device (SaMD) technologies under Design Control procedures + Efficiently translate requirements into application features and document architecture and designs decisions. + Design, develop and debug software for sophisticated, multi-process systems. + Design and implement client-side, server-side and database software. + Design and implement interfaces for data exchange with other systems. + Build and supervise technical aspects of the project. + Analyze and evaluate new technologies and recommend improvements to existing products.QualificationsRequired:+ A minimum of a bachelor's degree in Computer Science or Computer Engineering or Electrical Engineering (or similar degree) is required. + A minimum of three (3) years of hands-on experience in Software Development is required. + Experience working with C++ or C# is required. + Experience with SQLite, TeamCity or Jenkins and DevOps is required. + Experience with WPF and ClickOnce is required. + Experience working with cross functional new product development teams required. + Ability to effectively communicate critical design/project information to customers is required. + Familiarity with high-quality software practices (test-driven development, documentation, software review processes, and cross-platform support) is a plus.Preferred:+ Experience with user-interface design and web design is preferred. + Experience with software development for medical devices preferred. + Python, and/or Javascript programming experience is a plus. + Experience with .Net Standard, .Net Core, Apple provisioning and app deployment is a plus + Experience with Xamarin, Obj-C or Swift experience with iOS is a plus + AWS experience with EC2, S3, SNS and other AWS services is a plus + Experience with FDA QSR/ISO9000 design control regulations is a plus. + Experience in the process of conceptualizing, designing, implementing, and testing small to medium engineering software applications is helpful + This position is located in Warsaw, IN and may require up to 20% travel. Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability. Primary Location United States-Indiana-Warsaw-700 Orthopaedic Drive Organization DePuy Synthes Products, Inc (6149) Job Function Info Technology Requisition ID 2005867845W"}