{"title":"System Administrator NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK3amK7Oz2kJ48ayPYv8MUbnPsGbwPANCa9bTRogCNlkaU_iDtPAv1yNG-vCPccxPIEfmUwiqcV71sCzl_CJKYWUPzhTN1dEozvfuVlaVphj-NFskk3RVEieRUO9BE8mheTfBketbrWxjKOL6ZIfb-4-yMwY-yg6quV-5EfECwSpsvrPAnEEBZaVeT0OGc","source":"ziprecruiter","full_description":"Required:Please submit a resume and cover letter that includes all relevant work experiences, current contact information, and references. Your cover letter is the key to getting our attention.About This Position:Atlas Networks is a Seattle based telecommunications company founded in 2008. Atlas is committed to providing the Seattle community with the fastest and most reliable Internet service available. We offer speeds up to 10 Gbps while avoiding unnecessary fees and bandwidth caps. Along with Internet, we specialize in Unified Communications as a Service (UCaaS), VoIP, TV and managed services such as cameras.Atlas Networks is seeking a specialized System Administrator to design, operate and maintain server infrastructure, in support of both company and customer services and operations. This position in particular will work primarily at a customer location nearby our offices, and also partially at our offices. Areas of responsibility and expertise include MacOS and iOS devices, wireless networks, printers, cable management, and general office IT. System Administrators oversee hardware, software, and wetware elements, from physical deployment and cabling tasks, to routine software and OS updates, to supporting end users (employees and customers). This role will rely on strong teamwork and collaboration with the Network Engineering, Software Development, and Automation team members, and in addition to technical skills, requires great communication and documentation. Atlas System Administrators will frequently engage in project work (both onsite and remote) to deliver managed services to Atlas customers, and may (post-COVID) spend significant periods of time at customer premises and vendor facilities.The responsibility of this position is managing specialized work efficiently, with confidence and competence. This position requires above average attention to details, concern for the exact correctness of work, and strong commitment to tasks completed on time. A successful person in this position will take work seriously, have a strong sense of duty, and is highly disciplined while having a conservative, careful, and cautious approach. A somewhat faster-than-average pace will be the norm for this position with detailed, specialized work as the major focus. While this position will generally be task oriented, independent decision making and larger scale reasoning will allow candidates to thrive in their daily duties.Core Responsibilities:Direct Linux Experience is STRONGLY preferredOversee the operation of company servers and other datacenter assets ensuring stability and reliability.Meeting response time to customers within SLA.Competency in de-escalation, empathy, work prioritization, technical writing, and documentation.Ensure systems are kept to current software, utilize minimum-exposure firewall rulesets following a defense-in-depth approach, and that all hardware is in good repair.Work with the rest of the technical team to monitor load and availability, and make/implement recommendations on infrastructure improvements.Utilize physical datacenter access to perform duties, including server-racking, cable management, documentation updates, reboots, etc.Maintain accurate equipment, configuration, and software documentation, along with a running changelog for each system.Act as part of an on-call rotation and respond to outages as needed.Additional duties that may be assigned by management as part of the day to day operations of the company.COVID-19: temp usageAtlas Networks is considered Critical Infrastructure during this crisis and is recognized by Washington State as an essential service. However the majority of our team members are working from home in compliance with the stay at home order. This position is required to be available in the field to support our customers and networks. Please review our website for our latest response - https://gigabit.io/covid-19 .Benefits:PTO/Sick LeavePaid holidaysMedical, Dental & VisionCell phone stipendCommute reimbursement stipendA kick-ass group of people to work with"}