{"title":"Hardware Engineer TS/SCI with Polygraph","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKSHKmkzGrQGhNeNkZfBkg7lIma55uz8Pm8VJbCjrmF2K2272IREijn3GTWeExmi7ZBeQakGtoWUzYonLWAodLPnDJ8o2tDyl1K3gUpnXFzU1V5r5Ct8kAtPyCtOSJRtGLCmRvwDPCISD8QjfEd5kHPxQHGUZEgoU0z1Ho1TowF3pv1m2ybia9lMVcBrkJd","source":"ziprecruiter","full_description":"Do you like to challenge the status quo? Does curiosity feed your soul? Are you interested in working in a dynamic environment that offers opportunities for professional growth and new responsibilities by helping clients drive alignment with their business, advising through critical and complex issues, while allowing you to develop personally and professionally? Then consider a career at TMA/ NS2. We have grown into an industry leading provider of technology services to the IC, DoD, and U.S. Government.TMA/NS2 is actively seeking to add a mid-level Hardware Engineer to our Team in Fort Meade, Maryland with proven technical troubleshooting and performance tuning experience, and a passion for maintaining backend systems/hardware that improved sustainability and operations. This highly visible role must include fluency in at least one scripting/coding language such as Shell and Python, coupled with racking, stacking and configuring new hardware including kickstarting and automation of building physical servers using tools such as cobbler, forman, etc. With exceptional analytic capabilities, our selected candidate will bring basic UNIX system administration skills entailing configuration, troubleshooting, and automation using CentOS and RedHat to this role. U.S. Citizenship is required as is an active TS/SCI with Polygraph ClearanceOur ideal candidate will have the following in their toolbox:Required Skills:Proven experience configuring and/or utilizing monitoring/logging solutions for operations such as: Nagios, Collectd, Kafka Solid knowledge with conducting root cause analysis on production issues with other engineers Excellent interpersonal and communication skills Expertise entailing the understanding of virtualization solutions including Openstack, Docker and Vmware BA/BS in Computer Science or related field, or equivalent experience  Highly Desired Skills: A strong sense of ownership, urgency, and drive Experience with the security accreditation process Knowledge of the following:Familiarity with Cloud hosting services and orchestration technologies like AWS, Azure, Kubernetes, RancherNetwork security experience SSP experience as it pertains to hardware Threat model development Vulnerability assessments/STE requirements If you are seeking a role that creates lasting impact for our clients through critical and complex issues, working in a dynamic environment that offers opportunities for professional growth and new responsibilities, consider a career with TMA/NS2. With us, you'll discover a culture of curiosity and collaboration that will have you Defining Possible from the day you start. TMA is an Equal Opportunity/Affirmative Action Employer committed to employing and retaining a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, among other things, or status as a qualified individual with a disability. US Citizenship is required as this position requires candidate to obtain and/or maintain a government security clearance. EEO Employer Minority/Female/Disabled/Protected Veteran."}