{"title":"Co-op - Chemistry (Fall 2021 - August Start)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIbvK_KS5f3dqMTpK2Mtv7Rbewb6dukbZwoLoTh6sEsXxtDojAa_o2aVFg_HntQpfPY7If8vkY7wQthibns1xncn4PFVW0wMna_-GM-WBElQhUXMx7pv0chu8N5UAjIGWssokJN874yXyhI7a0VJyxIjAw5Hwclp5kCArI5F970I2iTrvFvkdvZZwZovPU_","source":"ziprecruiter","full_description":"Why Emerson? What to Expect in our Co-op Program: Expand your technical and professional skills in a real-world setting. Emerson co-ops are given meaningful work, support, and mentorship from experienced managers and key business leaders. There is the potential to gain knowledge and experience in a variety of ways by exploring opportunities associated with your major and rotating through multiple departments.What We Offer: Competitive compensation, flexible dress code policy, paid holiday  Housing stipends for eligible students and a list of nearby housing options for relocation  Access to our newly renovated fitness center, workout classes, and wellness program  Even opportunities through our social and professional development co-op committees Our co-ops are a key talent pipeline for full-time employment opportunities after graduation at our many locations. DescriptionPerform a variety of analytical tests to evaluate the condition and performance of oils and materials associated with the HVAC and Refrigeration Equipment industry as well as assisting in preparation of samples for follow on testing.   AS A CO-OP FOR CHEMISTRY, YOU WILL:Perform basic laboratory experiments   Carefully handle trace contaminants for analysis of customer issues Understand beginning Engineering aspects of heat transfer technologiesOne of Emerson's core values is: Support our People.  Employee development is a top priority for Emerson. Employees receive opportunities for professional development, further education, training and individual career development. Emerson encourages both lateral and vertical movement within the company.REQUIRED EDUCATION, EXPERIENCE & SKILLS: Undergraduate Student currently pursuing a Bachelor's Degree in Chemical Engineering, Chemistry or related field Cumulative GPA of 2.75 or higher. Ability to work 40 hours a week (Monday - Friday, 8:00AM-4:30PM) during the scheduled semester Legal authorization to work in the United StatesPREFERRED EDUCATION, EXPERIENCE & SKILLS:  Undergraduate Student currently pursuing a Bachelor's Degree in Chemical Engineering or Chemistry Strongly prefer a GPA of 3.0 or higher.  Sophomore or higher class standing.  Strong oral and written communication skills, analytical and decision making skills, and PC skills including Microsoft Office.  Completion of courses in Machine Design, Thermodynamics, and Heat Transfer.  Familiarity with 2D/3D Modeling, Visual Basic, and HVAC System.  Prior Co-op Experience with Emerson or another company. Benefits Emerson places a high value on ensuring that employees have a good work-life balance. We provide access to a competitive benefits package, including the following: medical insurance, dental and vision coverage, 401k participation with a competitive immediate match, fitness center, tuition reimbursement, parental leave, and an online wellness rewards program. Immediate vacation and holiday leave available, including a shutdown from December 24 through New Year's Day. Employee resource groups, including a very active Diversity and Inclusion committee, ensure that the Emerson values are incorporated into everyday employee life. Why Work in the Greater Miami Valley Area Our facility is located in Sidney, OH which is conveniently located within driving distance to several larger cities, such as Dayton, Troy, and Columbus. The area's generally low costs of living, excellent school systems, and low crime rates create a family-friendly environment. The area is home to several growing communities with restaurants, festivals, shopping, and arts scenes that make them exciting places to live and work. Our success is measured by the positive impact we make on people, our communities and the world in which we live. Learn more about us!.  About our Location The newly renovated Sidney campus has 1M square feet of manufacturing floor with an additional 120k square feet of leading-edge lab facilities. This location is the headquarters for the air conditioning and cold chain businesses. Through our 30 years of scroll compressor expertise, our air conditioning related products help bring comfort and convenience in commercial, industrial and residential spaces. The cold chain business helps ensure that food safely and efficiently travels from farm to fork. Approximately 1600 employees work in Sidney, who all support a multitude of business functions. With the blend of businesses and functions represented under this one roof, there are many opportunities for advancement within the Sidney location. Our Commitment to Diversity & Inclusion At Emerson, we are committed to fostering a culture where every employee is valued and respected for their experiences and perspectives. We believe a diverse and inclusive work environment contributes to the rich exchange of ideas that inspires innovation and brings the best solutions to our customers. This philosophy is fundamental to living our company's values and our responsibility to leave the world in a better place. Diversity and Inclusion at Emerson is about welcoming, respecting, and valuing the differences each employee possesses. Inclusion is creating a real sense of engagement, belonging and connection for all employees. Learn more about our Culture & Values and about Diversity & Inclusion at Emerson. Work AuthorizationEmerson will only employ those who are legally authorized to work in the United States. This is not a position for which sponsorship will be provided. Individuals with temporary visas such as E, F-1, H-1, H-2, L, B, J, or TN or who need sponsorship for work authorization now or in the future, are not eligible for hire. Equal Opportunity EmployerEmerson is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, age, marital status, political affiliation, sexual orientation, gender identity, genetic information, disability or protected veteran status. We are committed to providing a workplace free of any discrimination or harassment. If you have a disability and are having difficulty accessing or using this website to apply for a position, you can request help by sending an email to idisability.administrator@emerson.com"}