{"title":"iOS Engineer - Innovation Project","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIZjTHmrjbeL7SIBhECvtf9VqBr46ovzwyc8SqgqNO0IPihojtVbnEAE3o4ahvtFVULB6nvxY1QIN5lgfPaQVlmNRH_TlA0co4S8WQqyX5FeuQM7TjOpn6RFUzZGMfl9RqnIfaqWacdSltCGfJ6uJduX-MTCIZezdrjc6W0t9rQO54R2mlU9Fp_prKbYa7T","source":"ziprecruiter","full_description":"Spotify is looking for an experienced iOS engineer to join an innovation project within an unexplored product domain.  You will be part of a brand new, small, agile, and constantly evolving team, working to identify and execute upon growth opportunities that meet our ambitious commercial and user experience goals.  Innovation projects inside Spotify run like mini-startups within the company, so responsibilities will vary frequently. We want someone who's excited about this type of environment. With a team split between New York & London, the working location for this position can be based in the US or Europe. What you'll do: Build groundbreaking iOS app prototype and feature solutions that bring brand new experiences to Spotify usersImplement these solutions for our iOS client, adhering to iOS development best practicesWrite clear, maintainable code that will eventually scale across a number of projects and distributed development teamsCollaborate closely with other engineers on a small nimble team.Become a valued member of an autonomous, cross-functional team. Who you are: You know how to write readable, idiomatic, and maintainable Swift and are willing to follow already defined coding guidelines and workflows. We also expect you to know how to write objective-c in a similar way.You are experienced with a variety of iOS frameworks.You have a deep understanding of Cocoa design patterns and API design.You care about quality and you know what it means to ship high quality code.You have released at least one app on the App Store or have a project in the works that you can tell us about.You are comfortable working in an agile environment and are comfortable challenging yourself and your team to improve their ways of working.You care about the user experience and know how to build user-friendly  applicationsYou care about mobile technologies, exploring data, user experience and design (and music and podcasts!)You have excellent analytical and problem-solving skills, and can communicate your ideasValues team success over personal success. You are welcome at Spotify for who you are, no matter where you come from, what you look like, or what's playing in your headphones. Our platform is for everyone, and so is our workplace. The more voices we have represented and amplified in our business, the more we will all thrive, contribute, and be forward-thinking! So bring us your personal experience, your perspectives, and your background. It's in our differences that we will find the power to keep revolutionizing the way the world listens. Spotify transformed music listening forever when we launched in 2008. Our mission is to unlock the potential of human creativity by giving a million creative artists the opportunity to live off their art and billions of fans the chance to enjoy and be passionate about these creators. Everything we do is driven by our love for music and podcasting. Today, we are the world's most popular audio streaming subscription service with a community of more than 345 million users."}