{"title":"Automotive Technicians, Mechanics - All Skill Levels","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIvkWyEwJ91K3mb07Rp07IbjBG_ndEclMpnSBduF5a4BZ2Oww1AME4L4asPnapER8u-EO5_k24y_oD7BYQThaYBg_NDNU4VyKnfgLHZd-qg5HGDa4qwozv7lZUo2VucCIjyouly16d2f246zvBbfELeqnIdNuoWEAhqUSTxk0HUQsWMEIZMV4BnLzdW4vo","source":"ziprecruiter","full_description":"17909 HWY 99, Lynnwood, WA 98037Automotive Service Technicians/MechanicsAll Levels Needed including Lube Techs!Flat Rate or Hourly Pay!Tool Relocation!40-Hour MinimumMultiple Bays Available!Ability to make multiple hours plus! Must be punctual and responsible!Need experienced techs, the more you know the more you get paid!Plenty of work!Walk-in Applicants are Welcome!Seaview Buick GMC is hiring Service Technicians / Mechanics of all Levels NOW to help our busy shop keep up with customer demand. We value our employees and invest in their success!Seaview Buick GMC is a family owned and operated dealership with four generations in the people business! We believe that culture makes a difference. Our company’s core focus is building relationships that last. That means relationships with our employees, relationships with our customers, and a relationship with our community. We place customer satisfaction as our highest priority. We feature two of America's favorite automotive brands: Buick and GMC. We have an excellent relationship with customers in the Lynnwood and Edmonds WA community and have been serving them for over 30 years with stores in 2 locations.We offer:Flat Rate Pay! Tool Relocation! 40-Hour MinimumMedical, Dental and Vision insurancePaid Vacation!Career advancement opportunities!A Professional and Respectful working environment!Work in an award-winning Service DepartmentNO SUNDAYS!Responsibilities - Service Technician:Inspect vehicle and diagnose malfunction(s)Conduct thorough vehicle inspectionsEstimate the parts and time needed for repair/maintenance workPerform quality repair, reconditioning and maintenance work that meets dealership and manufacturer standardsDocument repair recordsTest vehicles both before and after repairFollow all company safety policies and proceduresKeep shop neat and account for dealership owned toolsOther duties may be assigned according to skill and certificationsQualifications - Service Technician:All Levels neededA positive attitude, good work ethic and problem-solving skillsMust have own toolsHigh school diploma or GED equivalentValid driver's license and good driving recordResume must be uploaded, and online assessment completed for immediate consideration.Must be able to work in the U.S. without sponsorship and be a current resident.Must pass pre-employment testing to include background checks, MVR, and drug screen.We are an equal opportunity employer. All qualified applicants will receive consideration for employment regardless of race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."}