{"title":"Sr Technical Support Specialist NEW!","location":"","salary":"","description":"","term":"$50,000 to $55,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKNUDPLf0mKXcQZ8MA1dNfgRILcVlM-uSU4Uv6zXVpgLUQPPlkya2Trp-ftq8WVbeGjVNGpthCUn3fRud0UD3PPs4YHQKeUmcVA-Y9_Rh9X1ffSxhan--YFGezZxn4a-e7YIXNM6lS15CCxMAIeVzFu6j0v3so2DlKa0U1-va3dC3aXY4isdBgwdQS50Tw","source":"ziprecruiter","full_description":"This position is full time and includes both day to day support and project services for small to medium clients. Responsibilities include: service desk support, workstation repair, network setup and troubleshooting, server maintenance, server builds, cloud services implementation and support, Microsoft domain model troubleshooting, virtualization support, backups support, and other support requests. Training will be provided as required, this is a great position to grow towards management.Position duties· Phone and e-mail support as required· Systems maintenance· System documentation· Workstation troubleshooting and repair· Cloud services support and maintenance· Client training· Network troubleshooting and repair· Server hardware and software troubleshooting and repair· Systems rollouts· Third-party software supportPosition requirementsA qualified candidate must be eager to work directly with our clients, must be self-motivated, and have excellent interpersonal skills. It is required to practice detailed documentation and must have a drive to always put client needs first. A four year degree or equivalent experience is required, and industry certifications are strongly preferred. Relevant certifications include A+, Net+, MCP, MCSA, MCSE, CCNA, VCP and similar industry certifications. Training funding and associated compensation increases available after 90 day evaluation period.Compensation and benefits· Compensation varies based upon current skillset and industry standards· Vehicle mileage covered at current federal rates· Stipends are provided to cover cell phone and home internet costsCompany laptop and other technology will be provided"}