{"title":"Flutter Mobile Developer (Remote)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI-eBUHl_QgBU8-y_lP3a74ZsqrplkG0PolGhG6-4FJNZPfUM5zFa2CVlVw-V6etS7DasDNPIacRRLb-ootqpwEgFKkO466YEWH_xi1LNpvvOPH3aknj5cfFbExhccVQh3Pr0JcgJH6eddN210pI1DsLhdCN8wwSIjv9YDDhkCGLsmF6sMFofLYR49dwgWU","source":"ziprecruiter","full_description":"Our company is looking for a Dart Flutter developer to become a full-time member of our software development staff. Successful candidate will be responsible for creating a hybrid application for both iOS and Android using Google's Flutter development framework. This individual should have deep experience contributing to and managing full-scale production applications. The ideal candidate must display excellent written and oral skills with demonstrated interpersonal and organization abilities and must be able to work in a varied, fast-paced product development environment. In addition, the ability to self-manage and work independently is a must as this role is a remote role. Candidate must be available during the 8am - 5pm EST timeframe. Responsibilities Deploy software in a well-planned manner with complete coordination with all end users Consistently meet timelines and maintain awareness of schedules Interpret business technical and functional requirements and design solutions to meet those requirements Work effectively in a team environment and balance individually assigned work Perform modifications to complex, multi-user systems Job Requirements Must have at least 2 years of experience in Dart software development Must have at least 2 years of experience in C# development At least 3 years of commercial experience in development of mobile apps (Android or iOS) Proven ability to write readable code and create extensive documentation Familiarity with API Development (REST, Web API) Have proficient experience working with version control (Git preferred) Solid knowledge in building and deploying moderate to complex Flutter applications Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies Working knowledge with Dart programming language Experience working in an Agile environment Prior experience working and collaborating remotely Must be able to work 8am - 5pm Eastern Standard Time Available Benefits Medical, Dental, Vision Insurance Employer-funded Health Reimbursement Arrangement (HRA) Company sponsored 401k Paid Time Off About TCC Founded in 1996 in Indianapolis, IN, The Consultants Consortium (TCC) is an innovative solutions provider committed to designing and delivering high-value, cost-effective IT consulting services and application technology solutions for both the private and public sectors. With a team of more than 200 IT and business professionals, TCC serves clients nationwide, from state and federal government agencies to commercial sector customers. TCC is committed to providing the most cutting edge solutions, and with that, ensures they stay up-to-date on crucial certifications and affiliations. Among these are the highly accredited Microsoft Certifications. TCC holds multiple MS Certifications, including a Gold Certification level in both Application Development and Hosting, as well as a Silver Data Center Certification. In addition to Microsoft, TCC is also a Registered Partner with Amazon Web Services (AWS), and a Capability Maturity Model Integration (CMMI) Level III assessed development organization that utilizes the Information Technology Infrastructure Library (ITIL) standard processes for IT service management that focuses on aligning IT services with the needs of business. To maximize these practices, TCC encourages staff members to gain ITIL certifications, and even offers study courses and material in-house."}