{"title":"Lead Glass Mechanic - Building Envelope","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ4FXAN01zTqc8L_rxTBptz4bkZscOJ4rezuOc266sNQUqn6OjM3EOJI4HhnH3jEXxXGvSXnT4hacyoNW9fmS-pgYQTxSuvlFHDilwVLiiNm48WWcU1etzFoCd5cVNIcteh_VdcLCs7439HIYG2kJ1_IMvE6fj5Y2MzOXOVbkbpiNTeSdyaNknUAsAlI8b6","source":"ziprecruiter","full_description":"DC | Tyson | Virginia ***IF YOU ARE INTERESTED, PLEASE GO TO KENSINGTONGLASS.COM AND CLICK ON \"WORK FOR US\" TO APPLY.*** Kensington Glass Arts (KGa) in Maryland is seeking Lead Glass Mechanics (Building Envelope) to work on projects in the * * Lead Glass Mechanics will be working on projects in the Washington DC, Tyson (VA), Gaithersburg & Frederick areas ** ** Lead Glass Mechanics will be working on projects in the Washington DC, Tyson (VA), Gaithersburg & Frederick areas ** Kensington Glass Arts (KGa) specializes in high-end interior glass work, typically for law firms and organizations with very upscale office interiors. The company is unique in that we manufacture and install architectural glass products. KGa's single source capacity provides for a unique capability to control the destiny of our projects from beginning to end. We offer a comprehensive benefits package including medical and dental insurance, life insurance, long and short-term disability, and a 401(k) plan. ***IF YOU ARE INTERESTED, PLEASE GO TO KENSINGTONGLASS.COM AND CLICK ON \"WORK FOR US\" TO APPLY.*** GENERAL SUMMARY: The Lead Installation Mechanic is responsible for effectively executing all aspects of the installation process, including planning, layout and measuring. Provides oversight and training of Glass Helpers. It is a more senior position to the Glass Mechanic and has additional responsibilities based on increased levels of experience, maturity and leadership skills. KEY RESPONSIBILITIES: Leadership of installation teams to achieve results and follow KGa processes and protocols. This is a “This buck stops here” role in the field. Heavily focus on training and mentoring of junior staff in areas of technical competence, safety and company policies. Act as a role model and exhibit and encourage exemplary behavior and ethics. Hold others accountable to KGa’s project plans and goals and take ownership for financial and safety outcomes. Represent KGa to clients and other trades with the utmost respect and competence. Assume responsibility for the proper installation and execution of KGa contracted projects including metal and glass and fitting into openings on job sites prepared by others. Organize, strategize and plan work sequencing and process to ensure successful installation. Lead Mechanic will be OHSA 10 certified. SPECIFIC DUTIES: Oversight responsibility for adherence to KGa policies and recordkeeping requirements for field teams. Represent KGa to customers in the field in a sales and customer service capacity. Attend progress meetings and make labor commitments as required. Assume responsibility for all training of field staff. Create and maintain systems to implement informal training process in the field. Assume responsibility for all new projects from first visit to job site through final completion, including oversight of all installation processes. Assume responsibility for all completed work of the installation team and adherence to established schedules and quality standards. Assume responsibility for all communication with clients’ field personnel and representatives, and other trades. Review assigned projects with the KGa Project Team to establish best installation methods and verify accuracy of scope of new work. Anticipate requirements to complete installation, including materials, labor and other resources to meet project deadlines. Communicate with PM to anticipate upcoming fabrication needs and material requirements. Responsible for maintaining adequate truck inventory of commonly used hardware and supplies. Responsible for maintaining adequate tool inventory. Take accurate field measurements and verify field conditions before installation process begins. Communicate at all times with PM Team and report any observed discrepancies, changes and problems immediately. Drive trucks to installation sites, and unload mirrors, glass equipment, and tools. Fabricate and install metal sashes and moldings for glass installation, using aluminum or steel framing. Install pre-assembled frameworks for windows or doors to be fitted with glass panels, using hand tools. Load, unload and arrange glass and mirrors to delivery trucks using suction cups or cranes to lift glass. Read and interpret blueprints and specifications to determine size, shape, color, type, and thickness of glass, location of framing, installation procedures, and staging and scaffolding materials required. Responsible for directing Glass Helper and other installation crew as needed. Oversight of assigned field staff and Glass Helpers, including quality control and on-job performance. Manage all assigned staff to follow Standard Operating Procedures (SOPs) for all aspects of the installation process. Safely operate and maintain assigned company vehicle. Responsible for keeping vehicle clean, organized and well stocked. Responsible for coordinating routine maintenance for assigned vehicles and communicating about necessary repairs. Coordinate schedule of Glass Helper and oversee time reporting and coordinating recordkeeping of Glass Helper’s schedule. Create and communicate expectations of team’s report times and arrange rendezvous of team at job sites. INTERACTIONS WITHIN COMPANY: Direct Supervisor is Field Superintendent. Direct Reports include Glass Helper as assigned daily. Participate in scheduled Shop meetings and Project Management team meetings. All candidates must submit to a pre-employment drug test and a background check. Kensington Glass Arts is an Equal Employment Opportunity Employer. Employment Type: Full Time Bonus/Commission: No"}