{"title":"Developer","location":"","salary":"","description":"","term":"$90,000 to $105,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJgBoFoCGMHnQfWDnWYQVFGim1Eoz15pi_mXrQyeYNf2-jra1V4OXXf13tbIsKN66v8z5cTE5_qepqzSwkCSlcsF1b8gXZIbzE5JhiaBr8kPcjdHe18YmtgU9vKT-hEBzinlnmM3IYrcYfEb23vOqb3pSdoWtv6upbL0wWvW9--RKsZHjfZ9Nm6LIK48anf","source":"ziprecruiter","full_description":"JAVA Software Developer w/ DOD Secret ClearanceLong-Term Position**Position is on the Washington Navy Yard, Washington DC (liberal telework permitted) PAID OVERTIME IS AVAILABLE**Job Summary:Craytek is seeking a robust software developer to join our Navy applications support team. On this project, we are developing and maintaining java applications to support the Business and Logistics divisions of our Navy customer. This position involves direct customer interaction, data reconciliation, and consulting to internal Divisions/Branches as needed. Contributions from this role will be key in delivering successful projects to our customers.Responsibilities/Requirements:Design, code, test, and deploy systemsExplore new technologies and have fun finding the best toolsWork on everything from the backend to user-interfaces and content management, to messaging and web servicesPractical understanding of object-oriented, multi-threaded, and asynchronous programmingExcellent debugging and problem-solving skillsDay to day assist the Craytek Project Manager in providing technical consultation to the customers in the design, installation, configuration for software solutionsRequired Skills & Experiences:5+ years of Java and JavaScriptStrong knowledge of STRUTS 2 framework, Maven, Eclipse, and Jenkins build toolsIIS and Tomcat server platformsOracle, SQL Server, and Oracle PLSQL proceduresExcellent knowledge of Web-based application delivery5+ years of experience with STRUTS, Hibernate, Oracle PLSQL proceduresExperience with CSS and HTML5Some scripting knowledge (VB, PowerShell) usefulMandatory Qualifications:ACTIVE DOD SECRET CLEARANCE REQUIREDCOMPTIA SECURITY+ CE REQUIREDQualifications, Experience & Skills:Experience with automated testing/scriptingSource Code Management such as Jenkins and SubversionCollaboration tools such as JIRA and ConfluenceKnowledge of DISA Security Technical Implementation Guides (STIGS)Excellent understanding of Windows OS & infrastructure to include File System, Active Directory & securityWorking knowledge of Jenkins for build/test/delivery automationExcellent communications skills (written and oral)Ability to work on a team or independentlyAt least 5-10 years of experience in the industry, some of which are more specialized to any of the above tasksEducationBachelor’s Degree in computer science or a related field; equivalent experience will be consideredAdditional NotesOur small and robust team embraces Agile values and use we use an agile hybrid approach in developing and maintaining our software. This includes continuous integration to develop software applications. We are looking for a developer with a genuine passion to learn, create quality solutions, and solve tough challenges. You will deliver technical solutions by coordinating with product owners, product teams, and IT cross-functional groups. You will be responsible for designing, developing, testing (automation), deploying, and self-documenting working software. This role is a dynamic and challenging opportunity that complements and extends the strengths of the Craytek onsite Application Support team. The successful candidate will need to prioritize multiple efforts and deliver flexible solutions and solid performance for our customers.Compensation: Based On Experience"}