{"title":"UAS Network Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJEbd6AOec2Ufj3XHRr_2T9oSOXtXbjHD94pLmKdraiSfvV01pYP_oGmgcbKrXtQSgyO76bTB6tpye9otEqrVio-hTGHm4CkIn0SLauieyNe9EpFMfKojwA5NKOd8YM4tanrjU1OBDV3RfBFqF1oc5kZoju-oCMjw0zsvFJdCWP6Fj0GCBGZ4eW1Q9xIinF","source":"ziprecruiter","full_description":"Dynetics, a wholly owned subsidiary of Leidos, is seeking a talented UAS Network Engineer to join a diverse team to create unique solutions for complex problems. With offices across the United States engaging in the defense, space, cyber and commercial fields, Dynetics provides responsive, cost-effective engineering, scientific and IT solutions.This position will perform network and computer system design, configuration, testing, debugging, and optimization in a dynamic lab environment. Tasks include router, firewall, and virtual machine network configuration, debugging of networks connected to tactical systems, and documentation of network configurations and topologies, to include tactical communications. This will occur across multiple operating systems and models of networking equipment, integrated with UAS tactical communications equipment. The work will be performed in a dynamic lab environment, with continuous systems integration and associated network implications. Basic QualificationsThe position requires a minimum of Associate's Degree or working toward completion of an Associate's degree AND at least 7 years of related experience. Preference shown to candidates who possess a CompTIA Network+ or CompTIA Security+ Certification.Candidate must have 7-10 years of experience working with information technology systems, network configuration, and network management.The candidate must have working experience with US Army Cybersecurity standards and practices.Candidate must be a resident of the North Alabama area or willing to relocate to the Huntsville - North Alabama, AL area.Other QualificationsA Bachelor of Science degree is preferred.Experience with the following is preferable:- Cisco brand routers and firewalls- Cisco cloud services routing- Juniper routers and firewalls- Virtual Machine (VM) technology including VMWare ESXI / hypervisor- Linux operating systems- Firewall configuration- Tactical communications hardware (Blue Force Tracker, Link-16, etc.)- Operational or tactical experience with Army communications and networks is a plus.Security RequirementsCandidate must be a US Citizen and possess (as well as maintain) a Final Secret Clearance. Dynetics is an equal opportunity employer M/F/DISABLED/VET"}