{"title":"Research Chemist","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AAJlFlhD8wXpBsOB8GzAS7nrB62KOL2ZZeJD_UH4pFmh_gi4XDoEXI4k0W-hUC_LDgHjwwvUXbyrnR83uVPsGXGgmIM98X695zNJ6swp40eNrFr0Vsx_FB2FI70oaP2AvURFKdRDpVS43PAhZiq57jH7nmS0WcxKKpFWl8SQN_8CmWTP4G7_XJNi4AUhgIsm","source":"ziprecruiter","full_description":"Job Details Job Location:    Garland - Garland, TX Position Type:    Full Time Education Level:    Bachelor's Salary Range:    Undisclosed Travel Percentage:    Negligible Job Shift:    Day Job Category:    Research DescriptionOverviewThe research chemist will conduct dairy chemistry research and supervise the R&D chemistry laboratory. The chemist needs to have knowledge in the area of food or dairy chemistry. Modern analytical techniques will be used to elucidate the complex system in fermented dairy products. The chemist designs experiment and selects appropriate methodology to understand product characteristics, identify key quality factors, and improve flavor and texture. He/She will supervise research analysts.    ResponsibilitiesAssist in the design of experiments.Perform experiments on the bench-top, in the pilot plant, and in full scale manufacturing.Collect samples, schedule testing, and organize data collection across multiple experiments.Develop new or adapt existing methodologies.Work with suppliers to customize ingredients for product development.Evaluate data for accuracy and precision.Maintain the condition of all testing equipment.Have a working knowledge of testing equipment capabilities and software. Provide training, guidance, and mentoring for research analysts and technologists. Know the compositions and attributes of products.Know the unit operations and parameters of manufacturing processes.Organizational RelationshipsThe Research Chemist reports to the Research Manager. Daily interaction with employees in R&D, Technical Services, and Engineering is expected. Occasional travel may be needed.Schedule and TravelTypically, work days are 8 hours, Monday through Friday beginning at 7:30 to 8:00am. This schedule may be changed to accommodate project schedules.Education, Training, and Experience M.S. or Ph.D. degree in dairy or food chemistry (preferred), chemistry, biochemistry or a closely related scientific discipline with at least 5 years of research experience in an industrial (preferred) or academia laboratory working with chromatography, mass spectrometry and spectroscopy. Successful track record of managing laboratories and supervising scientists is required. Knowledge and SkillsStrong knowledge of HPLC, IC, Mass Spectrometry, and Spectroscopy.  Knowledge of dairy chemistry is required.     Knowledge of statistical analysis.Successful research and mentoring record.    Excellent verbal and written communication skills and professional demeanor.Working knowledge of Microsoft Office and Project and JMP or Excel Stat.  Comopany OverviewFor more than four generations (over 100 years), Daisy Brand has been a family-owned company committed to providing the freshest, most wholesome dairy products with over half a billion in revenues. The company is headquartered in Dallas, Texas with manufacturing plants in Garland, Texas (opened in 1998), Casa Grande, Arizona (opened in 2008), and Wooster, Ohio (opened in late 2015). Having grown to above a 50 share, Daisy Sour Cream is the Nation's number one brand with distribution in all 50 states. Additionally, Daisy is the largest brand in food service, military, and club and is recognized by consumers for \"A Dollop of Daisy\", a tagline that put this once small brand on the map. Daisy's core values are Clean and Trust, which are woven into everything we do. In 2008, the company was given the impressive American Business Ethics award, awarded by Foundation for Financial Service Professionals. While maintaining a strong culture of curious and innovative problem-solvers, Daisy Brand tripled employment over the last 15 years. The future looks bright with the opening of its third facility to further strengthen the foundation for growth. Daisy Brand offers an industry leading benefits package that includes:A no-deductible, $0 premium option for employee-only health coverage.401(k) with 50% company match on first 8% of earnings you contribute.Safe harbor and profit sharing company contributions to 401(k).Company paid short and long term disability coverage.Company paid 2X annual salary life and AD&D insurance.4 weeks annual paid time off.Extra time off for volunteering.Tuition reimbursement.Fitness membership reimbursement.And more...  Daisy Brand is a nicotine-free company. Daisy Brand is an Equal Opportunity Employer. Veterans and disabled encouraged to apply. Qualifications: For more than four generations (over 100 years), Daisy Brand has been a family-owned company committed to providing the freshest, most wholesome dairy products with over half a billion in revenues. The company is headquartered in Dallas, Texas with manufacturing plants in Garland, Texas (opened in 1998), Casa Grande, Arizona (opened in 2008), and Wooster, Ohio (opened in late 2015). Having grown to above a 50 share, Daisy Sour Cream is the Nation's number one brand with distribution in all 50 states. Additionally, Daisy is the largest brand in food service, military, and club and is recognized by consumers for \"A Dollop of Daisy\", a tagline that put this once small brand on the map. Daisy's core values are Clean and Trust, which are woven into everything we do. In 2008, the company was given the impressive American Business Ethics award, awarded by Foundation for Financial Service Professionals. While maintaining a strong culture of curious and innovative problem-solvers, Daisy Brand tripled employment over the last 15 years. The future looks bright with the opening of its third facility to further strengthen the foundation for growth. Daisy Brand offers an industry leading benefits package that includes:A no-deductible, $0 premium option for employee-only health coverage.401(k) with 50% company match on first 8% of earnings you contribute.Safe harbor and profit sharing company contributions to 401(k).Company paid short and long term disability coverage.Company paid 2X annual salary life and AD&D insurance.4 weeks annual paid time off.Extra time off for volunteering.Tuition reimbursement.Fitness membership reimbursement.And more...  Daisy Brand is a nicotine-free company. Daisy Brand is an Equal Opportunity Employer. Veterans and disabled encouraged to apply. Education: Bachelor's Employment Type: OTHER"}