{"title":"IT Project Manager - Contract - Mortgage experience needed NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAKR15wETuJ-dkhSaKHUdHL5HUvAe1pQogVLB_QgRVz5iaCX-6nq11YaYMQvr8qLJ1zzfGXLKjkaUzvpUlwmvQldobJ239sTYv-VXjDmxWZ8R4pbH-9kp8pfcr5CbfyUgxElv1CL_MvGWOCCFAuwSrBT1HeyjHpYYAohREA-GqqB4FZz89f19LD2wFXetkk","source":"ziprecruiter","full_description":"Please note; this role is based in the Plano area!This financial services company is experiencing explosive growth! They have a fun and collaborative atmosphere and a convenient location right off of the highway. This company is on a steep growth trajectory and making major investments in technology. These are highly visible roles with a seat at the table! These roles will be for at least 6 months and there is a chance they can convert.Reporting to the PMO office, the main focus of this role is to customize the Encompass system. Candidates MUST have experience in the mortgage industry.Key Responsibilities:Manage the research, planning and execution of projects that supports strategy, including: analysis, specifications, planning, stakeholder engagement, communications, risk mitigation, and reportingServe as subject-matter expert (SME) within the team and provide direction, guidance, and training to staff membersReview processes and procedures and provide recommendations to management regarding ways to optimize efficienciesDelegate tasks to team members, ensure all deadlines are met, and address and resolve escalated issuesPartner with management to provide resource management across the organization and ensure resourcing risks are identified early and mitigated by leadershipDevelop, implement, and manage various tracking and reporting systems in support of IT and PMO needs (e.g. scrum ceremonies and reporting, best practices, communication, organizational alignment, strategic planning and reviews, key performance indicators, planning and budgeting, workforce alignment, etc.)Proactively engage with business area management to strengthen the PMO relationships across the organizationCollaborate effectively with other IT team members, including product owners, developers, QA testers, network and infrastructure, Help Desk support, and IT ManagementDevelop business cases by interacting with stakeholders from multiple business unitsPartner with product owners to engage with business units and ensure clarity on business needs within project effortsRemove obstacles and impediments during sprints and other project activitiesFacilitate the early escalation of issues and the prioritization of IT activities, especially in the event of resource conflictsKNOWLEDGE, SKILLS, AND ABILITIESSolid knowledge of computer systems including MS Office (Excel, Word, Outlook, Access, Project, PowerPoint, and Visio)Solid research, analysis, and problem-solving skillsExcellent presentation skillsAbility to lead a team and provide guidance and training to staff membersREQUIRED QUALIFICATIONSBachelor’s degree in information technology or a related field5+ years of experience in project management3+ years of experience in the mortgage industryExperience working in an Agile development environment as a Scrum MasterAdvanced working knowledge of best practices in project managementDemonstrated success in leading and implementing programs and/or projects in a cross-functional team environment-Ability to work remote for now but able to work onsite in DFW, TX in the futureLocal DFW Metroplex candidates only-This position is not available for C2C or visa transfers."}