{"title":"Software Engineer III - Java AWS NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAKLGOn88q-OYFV6JaIaZqykPNX8CxFJp9w-7k6A4ZokhFcK0Rf_Ol2cXmwlvex67VJkiSo4jWotcUJ1Mcj6BpNrl9qbl_X00rCV76hz4AXZ4J-YSFNSywYwKP4Dcrxbn_UL-UQ4gSvEIA0v8PkzjZfUWISJMcDXZeZfRSYLXXKiqc4z3hcbzv0OBwaJWbI","source":"ziprecruiter","full_description":"Greetings from Aditi Consulting! We help in hiring experienced employees for clients in the leading global information services company. We are a technology solutions company helping organizations accelerate their business innovation and growth through project and talent solutions.One of our esteemed client is looking for a Software Engineer III - Java AWS and this is a remote project for 06 months with the possibility of extension. ---------------------------------------------100% Remote - Anywhere EST / CST Time Zone Must Haves:• Spring, Spring Boot • Singleton • Java• Min 2 years of exp with Java Script, XML, HTML, ClearCase, JSP, Rational Rose, Struts, WebSphereQualifications:• 5+ years of Java software engineering experience• BS Engineering/Computer Science or equivalent experience requiredTechnical Skills (AWS):• Development and dockerization of Java Spring boot apps• Experience with AWS using ECS, S3, Dynamo, SQS and Lambda server less applications/microservices• Experience using Terraform/Terragrunt for AWS resource provisioning• Experience with TDD and/or BDD• Github and/or code samples preferred• Strong database knowledge including NoSQL solutions• Rest/SOAP API definition and implementation• Experience with build/deployment pipelines and best practices (GIT/Terraform)• CI/CD tools: Jenkins, Maven, Docker, Git, Dynamo• Experience working on back end systems• Strong knowledge of process improvement.• Strong knowledge of the software development process.• Advanced written and verbal communication skills.• Proven ability to develop cloud based applications• Ability to identify and implement continuous improvement practices.• Experience working in agile environmentAccountabilities:• Interact with the Product Management, Project Management, Engineering, and Operations teams to deliver products and enhancements meeting product requirements and quality standards.• Maintain flexibility to react quickly to changes in priorities or circumstances to meet the needs of the business.• Work with Development staff, project managers, technical leads, and subject matter experts to plan and execute AWS cloud based solutions.• Research available tools and participate in initiatives to implement those that will cost-effectively enhance development speed and product quality.• Develop automated tests in conjunction with code to ensure product requirements and quality standards are met.• Maintain awareness of the state of the industry and evaluate emerging trends/developments that may benefit the organization.• Cooperate in the enhancement of methodologies employed for the development team."}