{"title":"Sr. Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALJK0JxV80tIh5p-QUsm0ILor2YeCiKtQpLDj65HNubnzKbPy04XpgX7QR4WHK0kdyGLT9fK_20rHzmpel6FrReFBeq3GsuYAlekhzu-3m-uG7lbsEHt4MUA0Sm010fMFxpuXwSlDQKcLvTrYrFKOhaQaFzOD4UNo7yV9NyYjwVozilm2LP-T0nBblq5uua","source":"ziprecruiter","full_description":"JOB DESCRIPTIONAmazon Lab126 is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, we have produced groundbreaking devices like Fire tablets, Fire TV and Amazon Echo. What will you help us create?The Role:As a Sr. Hardware Engineer you will engage with an experienced cross-disciplinary staff to conceive and design innovative consumer products. You will work closely with internal inter-disciplinary teams, and outside partners to drive key aspects of product definition, execution and test. You must be responsive, flexible and able to succeed within an open collaborative peer environment.As part of a system team you will work alongside system integrators and technology focused engineers who are subject matter experts of their fields. You will be responsible for integrating various core features of the product such as display, cameras, and sensors, improving overall system quality, working with software/product design engineers to optimize product performance, and debugging tough systemic problems. You will be involved in projects from concept through production, gaining exposure to the complete design lifecycle. You will also support engineering builds gaining experience with high volume manufacturing. In this role you will: Be part of the system EE team focusing on integration of multiple technologies in the product Work closely with cross-functional hardware, software, and mechanical teams Lead the debugging of design and manufacturing issues related to hardware Design and validate boards Drive system performance validation Travel internationally to support engineering builds if needed"}