{"title":"Software Engineer - Android Mobile Development","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIWKiDYcXhmS8XSkcL01gXQ1UxzGbbtuxMBNdKaZLFleeQ7eBvxduFH40LJK69Xev3GVHcfI6McmELqjF9uxv7GrvW_7llys2MI5B1DJIVtrpuFXSPKBxLnION_FQoHo1bF1Cr5mrY7JzwZmzPMTftMxqCk9JvOosgI741MXtGKIwU-jVNkL0J-dxluOdw","source":"ziprecruiter","full_description":"Be visionaryAt FLIR, we have a simple but ambitious mission: to develop market-leading thermal and sensing technologies which enhance everyday life. From saving energy, to saving lives FLIR is making a real difference in our world.Our products are used in a wide array of situations to rescue people in danger, detect criminals, conserve energy, navigate safely, provide security around the globe, and protect our environment.We are looking for individuals who thrive on making an impact and want the excitement of being on a team that wins. Job Description **Applicants must be US Citizens or Green Card Holders for consideration, we cannot offer sponsorship for this role or hire non-citizens related to State Department guidelines**Work from Home: This role can be remote/work from home though preference will be given to candidates that reside within the midwestern part of the US as they will be needed to visit our facility in Indiana every few months or so.Direct hire role with extensive benefits package, paid time off, matching 401K, medical/dental/vision insurance.Job Summary:The Software Engineer will work on project teams to provide a broad range of software design and programming expertise designing applications and embedded software for complex analytical instrumentation systems for field application of scientific analytical equipment. The candidate will be responsible for all software engineering lifecycle processes including requirements gathering, analysis, design, programming, debugging, unit testing, of new development and sustaining of existing applications. Develop applications that require a broad range of technical expertise from instrument control to GUIs to complex algorithm development. Design innovative user interfaces implement data analysis algorithms and provide instrument troubleshooting and debugging. This position includes involvement with the project, scientific and manufacturing teams. Responsibilities include planning and tracking your own work schedules.Primary Duties & Responsibilities: + New application development+ Product sustaining activities Job Qualifications (MINIMUM): + BS or MS degree in Computer Science or equivalent+ Minimum 5 years relevant experience in software application development+ Expert with Visual Studio for Microsoft Windows application development+ C#/.NET, C++, C, WPF, WCF+ Comfortable with multi-threaded programming and debugging+ Experiences in instrumentation control and mass spectrometry are particularly favorable+ Entity framework/SQL experience+ Solid understanding of software security practices+ Communications protocols and embedded software architectures Job Qualifications (DESIRED): + Experience with mobile development, particularly Android+ Experience with Python and other embedded software tools+ Work on a small Agile development team+ Excellent written and verbal communication skills and proven analytical and problem-solving skills+ High energy, proactive orientation; comfortable in a dynamic, entrepreneurial atmosphere+ Very high mathematics aptitude+ Comfortable working with electro-mechanical components and systems + Applicants must be either a U.S. citizen, U.S. national, legal permanent resident, asylee, refugee or must be eligible to apply for and obtain the appropriate export control license from the U.S. Departments of State or Commerce.FLIR and all of our employees are committed to conducting business with the highest ethical standards. We require all employees to comply with all applicable laws, regulations, rules and regulatory orders. Our reputation for honesty, integrity and high ethics is as important to us as our reputation for making innovative sensing solutions.FLIR is an equal opportunity employer. FLIR Systems, Inc. designs, develops, manufactures, markets, and distributes technologies that enhance perception and awareness. We bring innovative sensing solutions into daily life through our thermal imaging systems, visible-light imaging systems, locator systems, measurement and diagnostic systems, and advanced threat detection systems. FLIR Systems offers a fast-paced, dynamic environment that provides for a challenging career and the ability to achieve professional growth. It is the talent of our employees that sets us apart as the technology and market leader in the infrared community."}