{"title":"PhD Analytical Chemist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK7WhibKokjerGtc3ejPLdbgqDVhZ89qg8xTFgu78okh6iqYTd3cmlgjyOBe_eUEFZXNHoMtQsgRlwflNujlSHVhjVa02jCc3QoTIX0jhWrxynrtc9f0FSpnszBIzpdxe7TP_c57UJGkxY24ATQhcqp0KCWMmEXZtqqCs6FS3td6TrzseeDK3kX4cEg1a21","source":"ziprecruiter","full_description":"PhD Analytical Chemist in San Diego, CA at APEX Systems Date Posted: 1/5/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: San Diego, CA + Job Type:Other + Experience:Up to 5 year(s) + Date Posted:1/5/2019Job DescriptionJob #: 922559 Our Cilent supports the research and early development of skin-applied products (for topical, regional or transdermal delivery), delivering R&D services to pharmaceutical, medical and beauty care companies worldwide. They are seeking an Analytical Chemist + Temporary, full- or part-time position; weekend flexibility preferred.Duties and Responsibilities of Position: + Develop, qualify, implement, and verify test methods for analyses of samples generated in screening drug product formulations and using a variety of technologies including HPLC, LC-MS, and LC-MS/MS. + Support data processing generated from sample analyses in an accurate and timely manner. + Optimize chromatographic conditions to improve throughput and reduce run cycle. + Provide support of client projects, including developing, implementing and verifying analytical methods in support of pharmaceutical product development, impurity identification, degradation studies, quantification of analytes in various matrices from skin permeation assays. + Support existing and new stability assays. + Support generation of analytical method protocols and reports. + Maintain instrumentation with troubleshooting and repairs as needed, perform IQ/OQ/PQ of instruments as needed in accordance with company SOPs.Qualifications Needed: + Minimum M.S. in Analytical Chemistry, Biochemistry, Pharmaceutical Science or related discipline with at least 3 - 5 years of research or relevant industry experience; Ph.D. preferred. + Experience with variety of analytical techniques, method development and validation + Experience working in a contract analytical laboratory preferable + Expertise in chromatographic quantitation techniques including HPLC, LC-MS, and LC-MS/MS, (with software including Chemstation, Agilent OpenLab CDS, and Masslynx) + Excellent organization, multitasking, and analytical data analysis skills. + Demonstrated excellence in working with groups with diverse backgrounds and communicating effectively in a collaborative small team environment. + Ability to work effectively in fast-paced R&D environment with multiple tasks at hand; weekend flexibility a plus#LI-CH1 EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}