{"title":"FT Field Service Electro-Mechanical Technician, Euless, TX NEW!","location":"","salary":"","description":"","term":"$19 to $22 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAL3-1pTs0U46Ob-uMIxUgMSEYMG7seFDl_n5Gb-l6Q_SF6t7An_RXlb7fzk4b4E8uFqgdG5ngHrxV5P5gFhU881_CVVnsitUaLzoUkLTkasdRXh0y0OaF58W_3K0oIq2hqfe5lfV1PCcb1sX3Kl3UXpXEIIOf6nifuRUFmHSvO9bz_fJUAdSjUjyRx-wtX0","source":"ziprecruiter","full_description":"Repair Technicians, are you looking for an opportunity to take your expertise and join an industry-leading organization that will reward your hard work and effort? Join us today at DOC Services Inc.! We service and maintain a variety of paint shakers, tinters, mobility carts, check-out stands, mobile storage systems, cutters and other light industrial equipment. With over 28 years of experience and, with full certified technicians, we provide our customers with support and repair solutions designed to extend the life of their equipment, reducing down time and minimizing the impact of your bottom line.As a part of our continued growth, we are seeking a Maintenance Technician to join our team. In this position, you will play a key role performing preventative maintenance and reactive service repair on paint and electromechanical equipment at big box retailers. This will include servicing stores within a 2-hour radius of your residency and driving to customer’s locations as needed. If you’d like to grow your career with a creative and successful team of winners, we definitely want to talk with you. Contact us today!“What’s in for you?”· Competitive compensation· 401(k) plan· Paid time off· Medical, dental and vision insurance plansJob ResponsibilitiesAs a full time Maintenance Technician, you will be responsible performing preventative maintenance and repairs on light industrial equipment. This will involve maintaining equipment parts and supplies inventories by checking stock to determine inventory level as well as anticipating needed equipment, parts, and supplies as a result of analytical information process and trends.Specific duties for this Maintenance Technician role include:· Troubleshooting the electronic and electrical components· Locating source of problems by observing mechanical devices in operations and listening for problems· Providing daily reports and communicate regularly with store managers, the regional DOC Supervisor and the assigned office administrator· Removing defective parts by dismantling devices, using hand and power tools and, examining form and texture of parts· Identifying correct parts needed for equipment and close calls in a timely manner· Adhering to OSHA and DOC safety regulations· Performing other administrative duties· Maintaining company vehicleJob RequirementsWe are looking for a detail-oriented Maintenance Technician who combines a significant level of technical expertise with a strong, dependable work ethic and the ability to work effectively with minimal supervision. You should be highly organized with strong multi-tasking and time-management skills. It is also vital that you display excellent verbal, written, communicational and interpersonal skills, to effectively interact with fellow employees, dispatch coordinators, vendors and location managers.Specific qualifications for this Maintenance Technician role include:· High school diploma or GED· Minimum 2 years of experience working with electromechanical equipment· Ability to read schematics· Valid driver’s license with clean driving record· Schedule flexibility and willingness to travel, as needed· Proficiency with MS Office products· Ability to provide own set of tools· Familiarity with lockout tag out procedures as required by OSHA, a plusCelebrating our past. Building our future – Join us!Apply now!"}