{"title":"Java Software Engineer THIS POSITION POST PANDEMIC WILL BE IN PHOENIX NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJ2nz0Ns4QdVD6TYD_31Uam_voNaMChE16lXKHEgYV6237hj782OkJ92yFbrxyPU2XwLEIWEd2eTOfeeFzp_-fH7N6OHSh1zufJAMG7hIeV03n6zskXNrpOXkY-7E9MgoLoaxnmv6jaWfzozl5HD706ZFVr30dvm8v2Q0FcRawW5Q22k9si-qCMayWBTMw","source":"ziprecruiter","full_description":"Verticalmove, Inc. is the leading technology talent firm for Information Technology, Software Engineering and Executive professionals. In 2017-2019, Forbes named our client as a Top 25 most valuable brand in the world (and #1 in financial services), estimating the brand to be worth $24.5 billion and growing. In 2018 and 2019, Fortune ranked them as a Top 15 most admired company worldwide, and a Top 25 best company to work for.We have an exciting, highly visible opportunity with this Fortune 15, next-gen group with more than 112 million business and consumer customers globally across 130 countries that is completely disrupting the $134.1 trillion global industry – named Top 25 most valuable brand worldwide with an annual revenue of $35 billion, which is increasing 5% year after year.This is a multinational financial services corporation headquartered in New York with a corporate Satellite office in Phoenix and is one of the 30 components of the Dow Jones Industrial Average.Why is this Role & Team Exciting?This is an opportunity with a Fortune 15 client in a highly visible role that could be seen by any other business or IT unit, company-wide.- You will be working on the Digital Payments team- Highly visible team that manages end to end PMO.- This is not simply a bill-paying team. They do all of the projects from the \"Labs\" team, which introduces new technology. This team builds all company tools that synchronize with apps like PayPal, Venmo, Apple / Samsung / Google Pay, FitBit, etc.- They pilot highly visible products the the company, globally.Contractors will gain massive amounts of expertise in how payments work in-store & e-commerce. They have exposure to distributed Platform Engineering. HIGHLY VISIBLE team. Your work will be seen by many people from I.C. to C-Level.************************************Verticalmove is proud to offer one of the best contingency-staff Benefits packages in the world:- We pay 75% or your monthly Insurance deductible- Medical- Dental- Vision- Accrued PTO (sick & vacation)- 401k with a 4% match************************************JOB DESCRIPTIONWe’re looking for an engineer to work on API development on a mobile payments solutions that will be used by tens of millions of users around the world. We want someone who is super creative and enjoys solving tough problems. You should be able to come up with brilliant solutions that no one else can, and be obsessive about API design and user experience.You’ll be part of the Digital Payments Engineering team whose mandate is to develop new products and platforms for customers, globally. Payment Engineering’s aim is to build interactive experiences at all touch points of a consumer's journey whether before, at, or after the time of purchase. The products will range from new payment vehicles and partnerships with other payment entities to interactive mobile experiences.This is an opportunity to work in a fast-paced, agile environment within a Fortune 30 company where you can directly impact real $$$$ in revenue growth and operational savings. You will get a chance to interact with the \"Apple\" and \"Google's\" of the world.- Your primary responsibilities will be to work on a team of engineers in developing mobile products.- You’ll work with product managers to help define product direction, provide thought leadership on emerging technologies and create best of breed mobile and mobile web experiences that will set the standard for future development.- You should be familiar with modern software development methodologies, and be able to dive deep and rapidly iterate on ideas despite ambiguity.This is an opportunity to work on the latest mobile technologies and influence how millions of people interact with their credit cards, their merchants and their money.JOB RESPONSIBILITIES• Perform hands-on development, and testing• Serve as a member of an agile team that drives user story analysis and elaboration, designs and develops software applications, and tests and builds automation tools• Utilize best-of-breed technologies to build a layered, component-based, service-oriented architecture over existing American Express technologies• Be highly motivated and maintain a positive, “can-do” attitude in a fast moving environment• Foster the spirit of collaboration across multiple internal teamsEXPERIENCE• Demonstrated technical capabilities and ability to work collaboratively and effectively with a range of stakeholders• Expertise in Java v5 and above.• Good understanding of RESTful API design principles• Thorough understanding of XML, JSONand data structure fundamentals• Experience in multi-threaded programming.• Should have good attention to detail.• Exposure to iOS and Android development is a plus.• Experience working in high-performing development teams using agile methodologies and tools is a plus.REQUIRED EXPERIENCETOP SKILLS:- Java Skillset: Version 5+ required. Version 8+ candidates receive priority- Kotlin will be accepted in lieu of Java- API Development work (REST API)- Must be able to write test cases and execute code- Huge Plus if you have: API tools to build API's- Huge Plus if you have: IDE's like SPRING, Vert.x, etc.REQUIRED EDUCATION• Bachelors degree in Computer Science/Engineering or 2+ years of equivalent experience in related disciplines"}