{"title":"Temp - Scientist, Analytical Chemistry","location":"","salary":"","description":"","term":"Temporary","detail":"https://www.ziprecruiter.com/k/l/AAK0I2MDzGkgsQveMdO9TrmKOAzYo1ANdFLtxRBAkH78cvP9tjdLaHb048n1UoO2IZ7Bxz3K5DA5UihAKLcOC2zZ0Ib-DOEZzD28q8mFdpZh4CX0Fdni35R86WP0Pc2mtpBXlV_OMZdY0VT8lH1yN3PEnaH6_EbOnQ2RwHIlg9z7gLdk6zvi2Y3_X_s8j_U","source":"ziprecruiter","full_description":"Regeneron Pharmaceutical's Analytical Chemistry Group, located at Tarrytown, NY is seeking a collaborative Temp, Scientist to join our group. In our group, we work within a state-of-the-art LC-MS lab to guide and support development and characterization of protein drug candidates. In this role, you will develop innovative mass spectrometry technologies to support Regeneron R&D programs.**A Typical Day in the Role May Look Like:**+ Independently develop and apply state-of-the-art mass spectrometry and its related technologies for the analytical characterization of therapeutic protein drug candidates + Design experiments, draft protocols, execute experiments and perform data analysis. + Work closely with project teams, including but not limited to research, formulation, process development, pharmacokinetic/pharmacodynamics, etc.; provide high quality analytical data and present results at group, department, and cross-functional team meetings. + Conduct analytical characterization for antibody development and regulatory submissions, and authoring characterization sections (e.g. INDs, comparability, and BLAs).**This Role May Be For You If:**+ You are results-driven + You have an excellent problem-solving attitude + You thrive in a creative, flexible team environmentThis role requires a PhD in analytical chemistry or a closely related field and 0-4 years of biopharmaceutical experience. A proven track record of publications in the field of biological mass spectrometry a plus. Strong expertise in mass spectrometry instrumentation and data processing software as well as chromatographic separations are desired. The ability to be detailed, diligent, and highly organized with strong time-management skills is preferred. A strong collaborator with cross-functional teams and external partners is desired. Excellent written and verbal communication skills are highly preferred.Does this sound like you? Apply now to take your first steps toward living the Regeneron Way! We have an inclusive and diverse culture that provides amazing benefits including health and wellness programs, fitness centers and stock for employees at all levels!Regeneron is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion or belief (or lack thereof), sex, nationality, national or ethnic origin, civil status, age, citizenship status, membership of the Traveler community, sexual orientation, disability, genetic information, familial status, marital or registered civil partnership status, pregnancy or maternity status, gender identity, gender reassignment, military or veteran status, or any other protected characteristic in accordance with applicable laws and regulations. We will ensure that individuals with disabilities are provided reasonable accommodations to participate in the job application process. Please contact us to discuss any accommodations you think you may need."}