{"title":"Associate Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALTCKGZWaOd-TCOXFiS3HUymyv174kFJcP2vtLJN54oTi8Ftxt53TUtBeb1spdumNTBcS3WPeKIa-1R6W6FizcFIKfsvf56vjoiDr-tzECj_dCU3h2OPwr86sljy0DEcgP3zDWzXcAswnWRu3idnz6lsIFtRfz5gtPyAhzteOebHAxH3CqXThJlsTj_R1U","source":"ziprecruiter","full_description":"Description/Job SummaryHydroGeoLogic currently has an opportunity available for a Project Chemist to join our team in Overland Park, KS. The Project Chemist will be expected to have a \"hands on\" role in management of project tasks associated with sampling and analysis including preparation of UFP-QAPPs, instruction of field personnel in sampling and preservation requirements, coordination with analytical laboratories to ensure readiness to implement project-specific requirements, review of analytical data as it becomes available to ensure conformance with quality standards, and serve as a point of contact for our client for issues related to environmental chemistry.Responsibilities/DutiesValidation of environmental analytical data in accordance with USEPA and DoD data validation guidelines to ensure data quality objectives are metPreparation of UFP-QAPPs, data validation narratives, and data usability reportsCoordination of environmental laboratory services and field sampling eventsManagement and reporting of environmental analytical data in enterprise environmental data management system (EDMS)Review, evaluate, and tabulate laboratory and field data and assemble written reportsAdditional duties may be assignedRequired ExperienceWorking knowledge of instrumentation used for environmental analysis (i.e. GC/MS, ICP, GC-ECD, IC, etc.)Familiarity with USEPA analytical methods and data validation guidelinesMust be proficient in standard office computer applications and software, to include Microsoft Word, Excel, and AccessExperience with analytical database management using Microsoft Access and Excel; experience with SQL/VBA, Locus EIM, EQuIS, and GIS programs desiredPosition requires analytical and interpersonal skills, and solid planning and organizational skills Detail-oriented and must have the ability to manage multiple tasks and interface with multiple project managersExcellent verbal and written communication skillsCommitment to working safely and adhering to all health and safety protocolsRequired EducationCandidates must have a BS degree in Chemistry, Environmental Chemistry, or a related scientific discipline. A minimum of 1 year of experience in environmental consulting or laboratory analytical chemistry.Required QualificationsMust be detail-oriented, and able to evaluate data quality impact of circumstances not covered by validation protocols. The successful candidate will demonstrate a history of responsibility, initiative, motivation and creativity. Strong written and oral communication skills are essential.Proficiency in MS Word, Excel, and Outlook required. Experience with PowerPoint and MS Access a plus.Good physical health and the ability to lift 30 pounds are required for performance of field tasks.Preferred QualificationsOSHA 40-hour HAZWOPER training is a plusDetailsTravel is required. A pre-hire drug test is required. Some positions may require US Citizenship.HydroGeoLogic, Inc. is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected Veteran status."}