{"title":"Analytical Chemist II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALjIbkUgiGyt0qzu7mnrK3oE8Y_Ru2rZKR6K-hW2fmA-3CbNbXEPTvapiPujTJNddD-WiRyqJErs_XKu_29wUe2ad37jToRdibjZVbx-RdgnU3XxeKq37fRg6Xnkgf6u0kh7FO-xSVUHYE7kRlJtAnzpchG64uLNjZjt0r5iORKDxDdVZ5rMzD1lJINeohp","source":"ziprecruiter","full_description":"Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries.     JOB DESCRIPTION:About AbbottAbbott Rapid Diagnostics is part of Abbott's Diagnostics family of businesses, bringing together exceptional teams of experts and industry leading technologies to support diagnostic testing which provides important information for treatment and management of diseases and other conditions.The position of Analytical Chemist II is within our Cardiometabolic Research and Development Business Unit located in Carlsbad, CA. Under general supervision, this position is responsible for manufacturing support functions and assisting senior scientific staff in carrying out complex research assignments involving a variety of laboratory methods, equipment and procedures.WHAT YOU'LL DOPerforms analytical testing / analysis of proteins using potentially complex methods, procedures and equipment.May provide technical expertise and guidance for the preparation and execution of validation protocols and reports.Conduct moderately complex experimentation including data collection, summary, design and analysis in support of analytical method development.Perform specialized tasks as trained in an independent fashion, requiring minimal ongoing direction.Establishes or revises procedures.Maintain records and notebooks in a professional, accurate manner.Operate complex laboratory equipment and perform routine maintenance/repair. Interface with contracted repair technicians.Operate equipment and conduct tasks in a safe manner, adhering to established guidelines and applicable regulations.Work involving potentially infectious materials may be required.Knowledgeable of federal and other regulations, e.g. QSR's, ISO, ISO 13485, CMDRDemonstrates commitment to the development, implementation and effectiveness of Alere Quality Management System per ISO, FDA, and other regulatory agencies.Responsible for exhibiting professional behavior with both internal/external business associates that reflects positively on the company and is consistent with the company's policies and practices.Understands and is aware of the quality consequences which may occur from the improper performance of their specific job. Has awareness of device defects that may occur in their area of responsibility, including product design, verification and validation, manufacturing and testing activities.Carries out duties in compliance with established business policies.Perform other duties & projects as assigned.EDUCATION AND EXPERIENCE YOU'LL BRINGRequiredBA/BS in chemistry or biological sciences; or equivalentTwo to four years of experience, with skills and knowledge in the field of specialty for the department assignedExperience following detailed instructions, maintaining accurate records and notes, and carrying out assignments in a thorough, conscientious fashion while adhering to safe laboratory practices.Experience with problem-solving and troubleshooting in a laboratory environment.PreferredStrong oral and written communication skills.Adaptable and willing to take on multiple new tasks and responsibilities.Independent collaborative self-starter with the ability to make appropriate quality-related decisions in real time.Process orientated, logical, analytical, meticulous, highly organized and able to analyze data and implement solutions.Proven ability to work effectively within a team environment while satisfying individual responsibilities and objectives.Able to work with a variety of people on multiple tasks.WHAT WE OFFER At Abbott, you can have a good job that can grow into a great career. We offer:Training and career development, with onboarding programs for new employees and tuition assistanceFinancial security through competitive compensation, incentives and retirement plansHealth care and well-being programs including medical, dental, vision, wellness and occupational health programsPaid time off401(k) retirement savings with a generous company matchThe stability of a company with a record of strong financial performance and history of being actively involved in local communitiesLearn more about our benefits that add real value to your life to help you live fully: http://www.abbottbenefits.com/pages/candidate.aspxFollow your career aspirations to Abbott for diverse opportunities with a company that provides the growth and strength to build your future. Abbott is an Equal Opportunity Employer, committed to employee diversity.Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.     JOB FAMILY:Operations Quality     DIVISION:ARDx Abbott Rapid Diagnostics        LOCATION:United States > Carlsbad : IBIS BioSciences     ADDITIONAL LOCATIONS:     WORK SHIFT:Standard     TRAVEL:No     MEDICAL SURVEILLANCE:No     SIGNIFICANT WORK ACTIVITIES:Not Applicable     Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.     EEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf     EEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}