{"title":"Network Engineer","location":"","salary":"","description":"","term":"$80,000 to $105,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIZdwIP8eqQHlj2N5yosBK-weik5lEHAB0c3GINqwKuOwQhs4qVrijOxXCPVj3XfY9-Rr4KEoDtu6L9GBjif_0S7QY2sXosF5b8i04gGxMt3A4dwYgSsWX9mnuO3OXR4NnN-zwBZACVNY83zVYQx1KVwjfdMPpOgEBDzpbL_GTwvqbqTfpPmTO4Nia8ikQ","source":"ziprecruiter","full_description":"Position: Network Engineer Basic Function:The Network Engineer will be responsible for the design, configuration, deployment, and maintenance of a comprehensive enterprise secure infrastructure. Analyzes problems, recommends solutions, products, and technologies to meet business objectives. Develops methodology and documents configurations and configuration changes. Provides assistance in user preparation of firewall change requests, ensures that such requests are properly vetted through change management, and approved. Completes any necessary security reports and audit responses. Participates in working groups for developing security policies, guidelines, best practices, and strategy. Responsibilities- Firewall implementations and configuration for the Fortinet Suite of products - Switch implementations and configuration for the Fortinet Suite of products- Design, configuration, deployment, and maintenance of the comprehensive enterprise security infrastructure.- Analyzes problems, recommends solutions, products, and technologies to meet business objectives.- Frontline support for implementation and management a variety of security systems, including firewalls, VPNs, endpoint security, web filtering, and other security devices. - Assists in incident response for any breaches, intrusions, or theft.- Monitors the systems for any anomalies, proper updating, and patching.- Develops methodology and documents configurations and configuration changes- Provides assistance in user preparation of firewall change requests, ensures that such requests are properly vetted through change management- Assists with the management of the enterprise anti-virus, endpoint security, and endpoint encryption system. Qualifications- Bachelor’s or Master’s Degree in cyber security, computer sciences or equivalent desired. - Three years of professional work experience in IT Network engineering- Demonstrated professional experience in a variety of network security systems including firewalls, VPNs, endpoint security, web filtering, and other devices. - Demonstrated excellence in customer service skills. Compensation & BenefitsHIRING SALARY RANGE: $80,000 - $105,000 (Salary to be determined by the education, experience, knowledge, skills, and abilities of the applicant, internal equity, and alignment with market data.)Company is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}