{"title":"Senior iOS Developer - Denver - Remote","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKhqRb-1nuF8dpNblinEdyGCcqASYl_HaNFmBMADO98BxNSeW9WEGaa58_k1Otx0FWyG3U3UskG2qcVHxqAzJZVfDsLr7jze5n_i-VXCfbmFXH7mCa9krVWQV6xD8S2fLXwoYNGVOb6eIdoUn5Z93eLZFkKpC5lcc_WhS7Fv0btSnvNAseOMmxuv1k4zYwg","source":"ziprecruiter","full_description":"Shopkick is a shopping app (30M+ downloads) that connects brands and retailers to consumers along the entire path to purchase. We provide measurable solutions for our customers as we get our audience to engage with content, learn about and pick up products helping drive incremental store traffic and sales using “kicks” instead of cashback, coupons, or discounts.Can you take Shopkick to the next level? We are looking for a Sr. iOS Developer with exceptional consumer app experience, who will be responsible for contributing to the development, maintenance, and integration of Shopkick’s iOS Apps. Developers on our team have a commitment to collaborative problem solving, sophisticated design, and creating quality products. ResponsibilitiesDesign, build and maintain high performance, reusable, and reliable Swift & Objective-C codeTranslate requirements, designs, and wireframes into high-quality codeContribute to our technical roadmap by identifying architectural improvements and major refactoring opportunitiesEnsure the best possible performance, quality, and responsiveness of our applicationsRequirements4+ years of work experience developing applications for both iPhone & iPad, building and maintaining major brand name apps available in the app store.Expert knowledge of Xcode, Swift, and Objective-CExpertise withiOS Instruments (time profiler, memory profiler, battery profiler, etc)DBs (Coredata/Realm/SQLite)Multithreading and concurrency, memory management, device caching mechanisms, performance, battery optimization, and profilingREST and Graph API consumption to connect iOS applications to back-end servicesiOS UI design principles, patterns, and best practices including auto layout and storyboardsTesting w/ Appium, XCTest, etc.CI/CD with Jenkins and Gitlab CIDependency management tools such as Cocoapods, Carthage, Swift Package ManagerKnowledge of popular open-source and industry-standard libraries available for common tasksExperience with SwiftUIFamiliarity with cloud message APIs and push notificationsFamiliar with App Store Connect, Provisioning profiles, AppStore, and Testflight DistributionProficient understanding of Git using GitflowKnowledge of NewRelic, Firebase, and other external APM frameworksFamiliarity with continuous integrationAbility to understand business requirements and translate them into technical requirementsA curious, creative thinker and experienced problem solverBonus: Android development experienceAny unsolicited resumes/candidate profiles submitted through our website or to personal email accounts of employees of Shopkick are considered the property of Shopkick and are not subject to payment of agency fees. this is a remote position"}