{"title":"Environmental Chemist _ Environmental Consulting Industry Experienced","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK5kvGZRVyjEcXpBjU0-22r9sJhJSzB10ntN760fN1RqicPGgw4OlnWZC-zWQVV6loj4G8HzyJC4ONi1cj7BGjowqC6K6IR0gb74kyUNQVbnSni82aykKTm5gTD3gjX6jkIvaNLFs9thgnLQQ85b4ePGvW5uKfsT8yB94IxldATblLtZNVWzPsJyRJR6QA","source":"ziprecruiter","full_description":"Mid to Senior Level Environmental ChemistEnvironmental Sustainment and Restoration Consulting ServicesCan be based out of our Ventura, Burbank, or San Diego, California OfficeJob Title: Environmental ChemistIndustry: Environmental Consulting ServicesLocations: Ventura, CA 93001; Burbank, CA 91502 or San Diego, CA 92110Prestigious national customer focused environmental, science, engineering, and construction services consulting company currently seeks full time Mid to Senior Level Environmental Chemist to join our Ventura, Burbank, or San Diego, California office.The ideal Environmental Chemist will be a self-motivated professional with the ability to work independently within a team structure. This Environmental Chemist will be ensuring that lab work is completed correctly and reviewing and analyzing the data returned from the lab. This Chemist will also be involved in completing reports and completing data validation and verification.Ideal Environmental Chemist Qualifications and Experience Needed:Must have a bachelor’s degree or higher in Chemistry or closely related science or engineering field.Must have a minimum of at least 5 years of progressively responsible work experience in the environmental consulting, environmental cleanup, environmental laboratory, or other relevant industrial experience.Must have strong verbal and written communication skills.Must have the ability to serve as both a team leader and team player.The ideal and successful Environmental Chemist will be a focused, disciplined individual passionate about producing quality work and contributing to a positive and productive work environment.Knowledge of laboratory analytical methods and field sampling methods/equipment for organic, inorganic, radiological, and munitions-related chemicals.Experience with field sample collection.Familiar with U.S. EPA SW-846 methods, the UFP QAPP, and regulatory programs including RCRA, CERCLA, CWA, and CAA, as well as laboratory certification programs.Mid Level Environmental Chemist Overall Role and Responsibilities:To provide oversight of chemical data acquisition, analysis, and interpretation of results for environmental consulting work performed for federal and private sector clients.Develop project quality assurance plans, sampling and analysis plans, and other work products for chemical data acquisition, laboratory and field analyses, quality control, and reporting.Serve as Chemical Data Quality Control officer for federal clients; interact directly with clients on environmental chemistry and planning.Responsible for management and oversight of subcontracted analytical laboratory services, including resolution of technical and contractual issues. Support project managers and staff on technical issues; provide expert consulting to internal and external clients as needed.Supervise, mentor and train Jr- to Mid-level Chemists to perform their duties and ensure chemical/field data quality. Perform and oversee data reduction, interpretation, evaluation, validation, and reporting. Work cooperatively with the environmental database manager to maintain and improve the Environmental Data Management System (EDMS), and to create cost-effective means for making full use of archived data.Work with Corporate QC managers and support business development, including assistance with proposal preparation and cost estimation, client meetings, and presentations are needed.*** Additional Job Responsibilities to be considered for our Senior Environmental Chemist Role***Provide leadership and oversight to our companies Chemistry Group. Ensure the goals of the Chemistry Group are achieved. Will help develop and motivate our chemistry group to ensure our firm has the following capability and capacity for awarded and projected engineering and environmental project requirements. Ensure a Chemistry Group maintains/advances knowledge, skills and abilities but ensuring chemistry staff receives varied project assignments and staff attends selected conferences, client/laboratory training opportunities and lunch and learns as budget allows. Ensure Chemistry Group maintains required credentials and certifications based on each member’s role and responsibility. This would include Common Access Cards, access to FUDSChem, ERPIMS and other databases.LEARN ABOUT US:Our firm’s mission is to preserve, restore, and enhance the natural and constructed environment for future generations through successful project delivery for our customers. As a Native American, tribally-owned, SBA-certified 8(a) SDB providing environmental, engineering, science, construction, munitions, and specialized professional services solutions for customers nationwide.Serving the federal market, our firm collaborates with our customers to achieve long-term environmental stewardship goals with reduced life-cycle program costs.For federal and commercial customers, our firm provides diversified professional resources for training and education; research and engineering; and IT solutions.California Office Locations: San Diego, Ventura, Burbank, Santa Barbara, and Walnut Creek, CACOMPANY SERVICES & PROJECT TYPES INCLUDE:Environmental Compliance SupportProject Examples:Risk Assessment for RI/FSBiosolids Recycling Facility Vitrification DecommissioningDredge Readiness and Operations PlanEnvironmental Services and EngineeringProject Examples:Ecological Risk Assessment (US EPA)Independent External Peer ReviewRemoval Assessment for VOC Plume SitesTime Critical Removal Action for National Wildlife RefugeMunitions Response Services and Operational Range ClearanceProject Examples:Explosive Decontamination Services at Air Force BasesNaval Base Dredging UXO SupportResponse and Recovery ActivitiesOperational Range Clearance and Range Residue Removal for the NavyEnvironmental Site Investigation, Remediation, and RestorationProject Examples:Superfund Technical Assessment and Response Team Non-Emergency for US EPAAbandoned Junk Yard Assessment and Removal ActionAbandoned Sewer Line Survey and Radiological SurveysExcavation of Contaminated SoilsMonitoring Well Abandonment (National Wildlife Refuge)Construction Support ServicesProject Examples:Building Renovations and Facilities Improvements at Naval StationsHazardous Materials Locker Refurbishment at Various Marine Corps Reserve CentersBridge DemolitionJOIN OUR DYNAMIC TEAM:Working for our firm will offer opportunities for creative problem solving in a growing, dynamic work environment. To serve our customers’ ever-changing needs, we seek driven individuals with an ownership attitude to serve customers with applied scientific, engineering, and operational solutions. We need people who excel in a team-oriented atmosphere in which a collaborative and innovative attitude is celebrated. We value both technical and communication skills.With our firm, you join a national multi-disciplinary environmental, engineering, science and construction firm committed to serving our customers with environmentally sustainable services, delivering modern and traditional solutions customized to cost-effectively meet each customer’s needs. Working with our firm, you’ll truly be an active participant in building a sustainable future.Our firm is a great place to use your skills to solve complex, multi-discipline challenges, expand your capabilities, and create a rewarding career. Whether you are just beginning your career or are anywhere along the spectrum of practice, we encourage you to learn more about us and consider joining our thriving team.COMPENSATION: Our firm offers a benefit program that fosters a culture of quality and cost-effectiveness and the fundamental interest in the health and general welfare of our employees. We provide our staff with top tier base salary plus performance bonuses and employee benefits such as paid Holidays, Vacation, Sick Days, Tuition Reimbursement, Medical Insurance, Dental Insurance, Flexible Spending Accounts, Company-paid Life/AD&D Insurance, Company-paid Long-term Disability Insurance, 401(k) Retirement Plan with Company Match, Employee Assistance Program (EAP), Voluntary Benefits (Short-term Disability, Optional Life/AD&D Insurance, Critical Illness, Accident), Wellness Program, and Employee Referral ProgramHOW TO APPLY:For immediate and entirely confidential employment consideration please click the (APPLY NOW) link below to email a detailed copy of your resume. You will be contacted promptly by our Environmental Division Lead for next step hiring consideration.Key Industry Terms: environmental consulting, environmental consultant, environmental remediation, environmental construction, environmental investigation, natural resource evaluation, environmental impact statements, environmental assessments, biological assessments, NEPA investigations, Bas, EAs, EISs, EAs, NRDAs, hazardous waste management, air analyses, noise analyses, solid waste, storm water management, pollution prevention, environmental management, environmental sampling, testing, analysis, wetland assessments, vulnerability assessments, remediation, remedial, DoD, EPA, federal projects, RCRA, CERCLA, wetland delineation, earth moving, soil sifting, geologist, geology, hydrogeologist, hydrogeology, environmental science, environmental scientist, geological sciences, Hazwoper, Environmental chemist, P.E., earth science, chemical engineer, environmental studies, environmental geoscience, Biologist, biological sciences, career, careers, employment, hire, hiring, job, jobs, opportunity, chemist, chemistry, environmental laboratory, Ventura, Burbank, San Diego, CA"}