{"title":"Senior Software Engineer - Open Source Node.js Team (Open to Remote) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJYcT7_38f8GU6Q3EgB8vwrN_R7SBxTMOtghzsG_HjXtTWMmC4t6XGVX-_BAqyqLWc4LMivizTe0wUU21Ax9hfSy172uAoE_adKWHaIJOOruH7GM-QuAKMbQJkStLgg_fMA721Iq4mR0gtV9_QHqOHgGuWazNmrwtyFrJQLC-X0u5KtRKXs7h6ukfs-gmel","source":"ziprecruiter","full_description":"Description Your Opportunity Please note that visa sponsorship is not available for this position.Do you love making lightweight and efficient applications in Node.js? Want to help software engineers create more perfect software, experiences, and businesses? Are you interested in contributing to and maintaining open source projects?New Relic's Node.js Agent Team is seeking a Senior Software Engineer to work with the team to instrument, measure, and improve the internet. We love making software that improves the lives of people who make software. Our products help customers answer their most important questions by allowing them to visualize, explore, and understand their ops, application, and customer data.Opportunity to work from a remote office may be available depending on applicant location.What You'll DoDelight customers by giving them key insights into their applications through instrumenting key Node.js frameworks and driving improvements.Empathize with customer needs and trade-offs to inform solutions to complex problems.Contribute to the Node.js community by delivering open source software from New Relic and participating in various open source projects outside of New Relic.Collaborate with team members, product management, and across other language agent teams to deliver the best possible features for our customers.Serve as a Node.js subject matter expert for the organization. Help us stay up to date with the Node.js ecosystem, libraries and developer tendencies.Your QualificationsMust-haves:You have 3+ years of Node.js experience in a team environment.You have a deep understanding of Node's async execution and event loop.You can demonstrate senior-level software engineering skills.Accountable for the software you ship and for the overall success of the team.Strong written and verbal communication skills.Nice-to-haves:Experience engaging in open source projects.Knowledge of or participation in the OpenTelemetry project.Our OfficeOur office is in the center of downtown Portland, situated in a thriving tech community in the Pacific Northwest. We enjoy easy commute access and a plethora of good eats and great coffee. We provide competitive compensation including equity and big-company benefits (medical, dental, etc.)-all while maintaining the energy, agility, and fun of a start-up.About UsNew Relic (NYSE: NEWR) is a cloud-based platform that gives developers, engineers, operations, and management a clear view of what's happening in today's complex software environments. So they can find and fix problems faster, and deliver delightful experiences for their customers. That's why the world's best engineering teams rely on New Relic to visualize, analyze, and troubleshoot their software. It's the simplest, most powerful cloud-based observability platform, built to create more perfect software. All from one place.Founded in 2008, we're a global company passionate about building a culture where all employees feel a deep sense of belonging, where every 'Relic' can bring their whole self to work and feel supported and empowered to thrive. We're consistently recognized as a distinguished employer and are committed to building world-class products and an award-winning culture. For more information, visit newrelic.com.Our Hiring ProcessNew Relic takes seriously our stewardship of the data of our thousands of customers worldwide. In compliance with applicable law, all persons hired will be required to verify identity and eligibility to work and to complete employment eligibility verification.We will consider qualified applicants with arrest and conviction records based on individual circumstances and in accordance with applicable law including, but not limited to, the San Francisco Fair Chance Ordinance. https://sfgov.org/olse/sites/default/files/Document/FCO%20Poster%20Set%20All%20Languages%2010%2001%2018.pdfHeadhunters and recruitment agencies may not submit resumes/CVs through this website or directly to managers. New Relic does not accept unsolicited headhunter and agency resumes, and will not pay fees to any third-party agency or company that does not have a signed agreement with New Relic.New Relic is an equal opportunity employer. We eagerly seek a diverse applicant pool and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities (or disability), age, sexual orientation, veteran status, or any other characteristic protected by law.Interested in the details of our privacy policy? Read more here: https://newrelic.com/termsandconditions/applicant-privacy-policy"}