{"title":"Hardware Engineering Manager","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJSWS2C8pKar_dhTauS9ZbU-4x7JGnu_92fBvAYQ-2rqvtLDxVzZ9MFCwJHMaJ9r7MKNTQ8oDr5rMNUV_c93876_F8VdIfU8u0flIjxkAm2lqyQk1eOUV42rDt90L6vgpVM2sxhDUYYptIOUNpPE8-737SmWRrtfSg8dZ6BhRtgFNT4owrLKaM3FmvYV_fu","source":"ziprecruiter","full_description":"Position: Hardware Engineering ManagerLocation: Cleveland, OHAbout ViewRayViewRay®, Inc. (Nasdaq: VRAY) designs, manufactures, and markets the MRIdian® radiation therapy system. MRIdian is built upon a proprietary high-definition MR imaging system designed from the ground up to address the unique challenges and clinical workflow for advanced radiation oncology. Unlike MR systems used in diagnostic radiology, MRIdian's high-definition MR was purposely built to deliver high-precision radiation without unnecessary beam distortion, and consequently, help to mitigate skin toxicity and other safety concerns that may otherwise arise when high magnetic fields interact with radiation beams.At ViewRay, our vision is clear. We’re dedicated to giving doctors new and better ways to treat cancer with radiation therapy.We’re an entrepreneurial company with big ambitions, unlimited potential, and a passion for improving the lives of patients with cancer. We’re always on the lookout for talented people who share our commitment and values. Contact us if you’re enthusiastic about working with a close-knit team and motivated by the prospect of making a difference.The Vision for SuccessThe Hardware Engineering Manager will be responsible for bringing alignment, ownership, and focus to the hardware engineering team. Should have a proven track record of strong people management, R&amp;D and NPI project management, and technical leadership. This person will have the background in one or more of engineering domains such as Mechanical Engineering, Electrical Engineering, or equivalent field.In addition to technical skill, this critical role requires superior organization and communication skills, as well as project management skills. This person will work closely with PMO or independently manage resources, timeline, and budgets effectively and creatively. This position is based full-time at ViewRay’s Oakwood, OH office but will interact daily with teammates throughout ViewRay’s global offices. The ideal candidate must be willing to travel approximately 10% of the time.Hire, train, and mentor engineers to add to the capabilities and capacity of an existing teamLead, develop, and manage hardware engineering team, provide technical guidance, evaluation, and facilitate career growthResponsible for planning, design, development, prototyping, and testing of complex mechanical or electro-mechanical systemsOversee and apply strong analytical and problem-solving methodologies including modeling and simulations to early risk retirement and build confidence to the timeline and budgetLead best practice implementation in design methodologies, development processes and tools to ensure high quality and reliable products within time and budgetLead the definition of Proof of concept: design inputs, creating design descriptions and specifications, test protocols, conduct and/or oversee testing, and issue resolutionProject management responsibilities, which may include internal or external resources, developing and maintaining project schedules and budgetsPlanning, executing, and reporting on issue investigation, closure, and design change effortsGuide team to be responsible for defining and communicating the requirements to internal and external engineering teamsTeam contributes to the overall architecture and design improvements with an emphasis on system level performance, fault handling and reliability, and Cost reductionThe Value you Will Bring B.Sc. in Electrical Engineering, Mechanical engineering or equivalent10+ years of experience in the product development role, with at least five years in medical device development, or other regulated industries3+ years of direct people management experience in product developmentExperience with medical devices development of capital equipment such as MRI, CT, Ultrasound, Radiation therapy devicesProficiency with the latest mechanical CAD tools (e.g., SolidWorks) and the simulation toolsExperience with electrical CAD tools (e.g., Altium)Bonus PointsExperience with medical industry regulations such as IEC60601Strong analytical skills in mechanical domain or electrical domainWhy you'll see yourself hereAt ViewRay, our teammates have the opportunity to challenge your mind and capture your hearts, by changing the standard of care in radiation therapy.Plus, we offer great benefits, including: Health, dental, and vision insurance that begins on your first day of employment 401(k) plan with company match and immediate vesting period Generous paid time off and flexible schedule Office stocked with snacks, drinks, and occasional catered meals Fun collaborative team with quarterly social events ViewRay is an EEO employer."}