{"title":"Senior Software Engineer (C#/.Net)","location":"","salary":"","description":"","term":"$110,000 to $140,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALwR1TfA_VPF7ssgzWlF3YQauodLbYWT_4dGEwgpHhlaCNLDVkIh5UFcE_qVEuywrcUYwBF4G-TxFCmOMLOLxsjndErV8FE9YTKg9J4OTzFCGg9c-vV9q_r_gE32QxJOGriiuvCM5me1bZ-CkBvPf01AB55xQniNEUUMkuedkjvUixK61LZ04IxPnLTrg","source":"ziprecruiter","full_description":"Senior Software Engineer (C#/.Net) If you are a Senior Software Engineer with C#/.Net experience, please read on!With offices in Chicago, IL and the Lakewood, Ohio area, we are a branch of one of the fastest-growing insurance companies in the U.S. Family owned and operated, we have been a staple in the industry for over 50 years. We separate ourselves with our world-class customer service, and by using technology to gain our competitive edge. Due to our various software-based initiatives, we are looking for a Senior Software Engineer who is extremely well-versed with C# and the .Net stack. This person will help with the designing/coding of new web applications and help enhance our existing ones. This person will also enjoy writing clean and scalable code that can help take our team to new heights!Top Reasons to Work with Us-HUGE room for growth-Stable company (50+ years)-Remote flexibilityWhat You Will Be Doing-Writing clean, testable, efficient code in C#-Help with the design/implementation of microservices and APIs-Create exciting new web applications and help enhance existing ones-Collaborate with other team members and mentor more junior developersWhat You Need for this PositionMore Than 5 Years of experience and knowledge of:- ASP.NET- C#- JavaScript- SQLNice to have:- Angular- API development (REST/SOAP)- Experience in the insurance industrySo, if you are a Senior Software Engineer with C#/.Net experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}