{"title":"Senior Chemist II, Makeup Development, NYX, L'Oreal USA Research & Innovation","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJozYmusMqVZZJ0Y8rN-3Cw13v71teKhsd128YzjTMj77TKLunGiSd73yTHUeDRbZor7A6vKkB6NOBk8C27S74qmnbAfE8SkN9QsuCYu9p6lLb6JWQSKOCdd5rQzaDTr5ncvvADR3yhHOG9MHdXZDmsxuPaMSHlX-OI5hmvyZe_MBoJHVCRiD2JSbRblFon","source":"ziprecruiter","full_description":"Do you enjoy project management that involves managing technical makeup formulations and all the data therein including but not limited to testing data , product performance results, safety data, regulatory results, claims data, and stability testing?  For more than one hundred years, L'Oreal believes that Beauty needs Science. In a world now transformed by digital technology and the emergence of new scientific Domains, we are confident in our ability to turn these opportunities into major innovations, closely linked to the new consumer expectations all over the world. Science & Technology are allowing us to invent safe, dependable, sustainable & responsible beauty products and experiences that will change people's lives. L'Oreal Research and Innovation has continuously invested upstream in its research with a high level of ambition. Our 3800+ L'Oreal R&I people are talented and highly skilled, located in major markets, working in a cooperative way, opened to the world.  Inside L'Oreal's Research & Innovation Division, Open Development, is where our chemists work closely with external manufacturers to develop and refine formulas to meet the needs and expectations of our consumers. We value the development of products that consumers find innovative, safe, reliable, and sustainable. We build strong, international collaborations across different functions to ensure that products are seen from inception to officialization for our local and global launch deadlines. We are currently seeking a talented and innovative Senior Chemist II to join our Open Development department located at our El Segundo, California facility for Research and Innovation. In this role, you are responsible for technical aspects of developing and homologating cosmetic products for NYX Professional Makeup. This position will liaise on formulation, product performance, stability and robustness to manufacture. This position requires a qualitative and quantitative researcher, possessing strategic thinking, excellent analytical and collaboration, which will be responsible for coordinating multiple data sets and technical information across functions. This position requires a developed awareness of scientific literature, raw material technology, processing methodology, claims and marketing/consumer trends required to perform innovative product development assignments in an efficient manner. Must have effective communications skills to engage key stakeholders (NYX, L'Oreal R&I teams, Vendors) to define evolving priorities and working methods. Must manage complexity and changing priorities.   You Will . . .  Work closely with designated vendors to deliver strong formulations for successful product launch: initiate formula review, confirm formula entry, assure quality and conformity of formulas, monitor stability reports and obtain technical data required by R&I partnersWork in collaboration with vendors' formulation team and internal micro teams to assure robust formulations that will pass L'Oreal and industry standard micro testsWork closely with Safety toxicologists and Claims Evaluation teams to coordinate product testingReview concepts, formulas, artwork and documentation for technical accuracyCommunicate with technical and non-technical partners (such as Project Managers, Product Development, Marketing, Legal etc.) to assure R&I and Brand requirements are metTrack and maintain awareness of NYX product development projects and respective timelines. Under minimal supervision, manage multiple projects and priorities with varying complexityCreate, Review and issue documentation for existing and new NYX products.Provide management, internal labs, and support teams with information regarding the NYX brand, status of projects, and product information, as well coordinate and follow up on general requests.Maintain a strong relationship with vendors to ensure product quality in a timely fashionIdentify raw materials and technologies suitable for product development from either in house or vendors.Work in collaboration with Open Development chemists to lead and/or support projects that are more complex to maintain and improve departmental processes or support operational needsProvide mentorship and training to Vendors and support groupsPresent technical R&I information to a variety of audiences including R&I, marketing and vendor partnersWork closely with designated cross-functional teams to help objectify sufficient data and provide formulation support for claim validationUnderstand protocols and results of claims studies including but not limited to consumer perception, hydration, wear, and waterproof claimsto effectively translate and present claims results and insights to business users at various management levels.Stay abreast of International regulations affecting marketing product verbiage and product positioningPossibly have direct report(s) to manage, mentor, and growYou Have . . .A minimum of a Bachelor's Degree in Chemistry, Biochemistry, Chemical Engineering or related science is required.5+ years of progressive experience in the cosmetics industry with a focus in formulation and/or creation of color cosmetics. Preference for someone with a hybrid background with formulation and other category such as regulatory, claims, product development, engineeringMust have a strong cosmetics formulation background in all categories, especially makeup: lipstick, foundations, eye makeup, hot pours, emulsions and suspensionEffective communication skills to work with experts and non-experts alike, both orally and in writing   You Are . . .Someone who works wells under pressure, in a fast paced environment, within a matrixed organizationAn effective communicator orally and written, to experts and non-experts alikeAn independent thinker with the ability to prioritize deadlinesSolution oriented and can demonstrate creativity and resourcefulness in proactively identifying and proposing solutionsA strong cosmetics formulation chemist with formulation background in all categories, especially makeup: lipstick, foundations, eye makeup, hot pours, emulsions and suspensionWe are an Equal Opportunity Employer and take pride in a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, sexual orientation, national origin, age, marital or veteran status, medical condition or disability, or any other legally protected status. If you require a reasonable accommodation to complete an application for a recognized disability under applicable law, please email USApplicationAccommodation@support.lorealusa.com. Please note this email will only respond to specific requests for assistance completing the application as a request for accommodation for a disability. All others will not be considered.  #DDIR"}