{"title":"Fleet Service Coordinator/Lead Mechanic NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIQ-3gb10iHPv2CWshpV6OwXpoJ5vXct1guF-8dFkgizfkJuDiVdWd5eGaUHr8GsGPilMtgeoOMqd7i4qU1YPDTvoWJMgItODU5LfAUMPpFHyqumfJbs3-JtguaJIhiNyXI1J7j-PI3osEt49G-xdG5x0MnkONg3kfC1St5HuITk_huK370JF_a_Db59ZdC","source":"ziprecruiter","full_description":"NJ | Mobile HealthCare is seeking a full-time Fleet Service Coordinator/Lead Mechanic to diagnose and repair company fleet vehicles. Vehicles requiring repair include ambulances, vans and other vehicles. The Mechanic will work in our maintenance/repair shop.We are a rapidly growing EMS agency with multiple locations throughout New Jersey. We work with a range of healthcare facilities, other EMS agencies, and municipalities to provide professional, reliable, and safe patient care and medical transportation. NJ | Mobile Healthcare emphasizes our team environment which fosters employee development and success.Requirements include:Troubleshooting, diagnosing, and performing mechanical repairs and maintenance on company fleet vehicles (diesel and gas ) including wheelchair vans, and ambulances for both diesel and gasolineDiagnose electrical defects down to component level.Must be competent in electrical diagnostics and be able to read wiring diagrams.Performing preventative maintenance in a timely manner to reduce breakdowns and costsUpdating any and all managers of concerns and potential problems with employees or equipmentInforming operations of any equipment that needs to be restocked or replacedMaintaining a pleasant and professional cooperative attitude with co-workers, departments and clientsEnhancing the operations department’s reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishmentsQualifications• High School Diploma or GED• Strong knowledge of 6.0 powerstroke a plus• Must be able to lift and move 70lbs.• Mechanical and technical aptitude• Strong work ethic and integrity• Must have a valid driver’s license• Must have four years of driving experience• Must be a self starter, Hard worker and able to work independently with minimal supervision.• Experience with Ford e250, e350 and e450 trucks• Experience with emergency vehicles is a plus"}