{"title":"Technical Software Support Specialist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAICo5tGDP-OjG9N4rxKO_XLYS8CH5K26FP2QP16Un0Qvzu722MFpGivIx7FtsZli3QEI5T9u2BqlAKFOwa-WgsPJbWjK2qrF4LYjgJHYO3gW313sXg7-OSy_cpvTgJmyVCVjrq6xPXZEM8G9a8AWJvpc2Kmz3VvXznQIh5i7en_1pJ841GDXIEnrx3lSzc","source":"ziprecruiter","full_description":"We are seeking highly motivated individuals who have a passion for providing superior technical customer service to join our team. PatientNOW develops EMR/PM/Medical CRM software for aesthetic medical practices in the United States. Located in Englewood, Colorado. PatientNOW is experiencing double-digit YOY growth and in need of people who enjoy thinking outside the box. Job Description:Technical Software Support Specialists will provide patientNOW software application support and technical support to end-users (customers) by performing a question diagnosis while guiding users through step-by-step resolution for EMR/PM/Medical CRM software. Support will be provided by clearly communicating solutions, instructions and best practices in a user-friendly, professional manner. Representatives will strive to achieve great outcomes with every call. This position reports to the Manager of Support and is located at the Corporate Office in Englewood, CO. Job responsibilities:Assist clients with all aspects of our software with a focus on helping them maximize efficiency, profits and client satisfaction. Diagnose and resolve software and hardware issues involving patientNOW software and other related hardware including document scanners, barcode readers, cameras and credit card equipment. Identify and escalate priority issues per department procedure;Accurately process and record cases in the CRM ticketing systemOffer alternative solutions where appropriate with the objective of each customer having a wonderful experience;Follow up and make scheduled callbacks to customers where necessary;Stay current with patientNOW software and the industry. Job Qualifications:Prior software support experienceTechnical acumen and the ability to diagnose and resolve client issues in a timely mannerPrior support or training experience with EMR and Practice Management software.Ability to use CRM and ticketing systemAbility to use remote access software such as LogMeIn RemoteProper phone etiquette;Ability to speak and write clearly and accurately;Knowledge of customer service principles and practices;Effective listening skills;Multi-tasking capabilitiesCompetencies:Focuses and guides self in accomplishing work objectives.Interacts with others in a way that gives them confidence and those of the organization.Clearly conveys and receives information and ideas, through a variety of media, to individuals or groups in a manner that engages the audience, helping them understand and retain the message, and permitting response and feedback from the listener.Makes customers and their needs a primary focus while developing and sustaining productive customer relationships.Deals effectively with others in antagonistic situations, using appropriate interpersonal styles and methods to reduce tension or conflict.Establishes proper courses of action to ensure that the work product is completed efficiently and on time/within proper time limits.Possesses, acquires, and maintains the technical/professional expertise required to do the job effectively and to create effective customer solutions. Technical/professional expertise is demonstrated through problem-solving, applying technical knowledge, and product and service management for the functional area in which employee operates.Actively appreciates and includes the diverse capabilities, insights, and ideas of others and working effectively and respectfully with individuals of diverse backgrounds, styles, abilities, and motivations.Sets ambitious standards of performance for self; assuming responsibility and accountability for successfully completing assignments or tasks; self-imposing standards of excellence rather than having standards imposed.Emotional Maturity Benefits:The compensation is a combination of base salary and bonuses.Benefits include Health Insurance, Dental, Vision, Vacation, and profit-sharing.Job Type: Full-time"}