{"title":"Sr. Specialist, Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALb0vc-IAHDH1FQb-oLY9R9Yxon1FuxFv4QMbTu6xiMWO6uuW14L04OTN3szX0LpDP7YxHYy0mA4NFHzZkqkJT5ypMhA6N_nrPfG78n8R2n9cSa7JOBcGG21d022_e5kiXVGJCG6KQuYR8MQWy50jo3ElRK2WcdXS5vsV_WJgV2Pict-aCmZI7PJXb6nYwB","source":"ziprecruiter","full_description":"Sr. Specialist, Software EngineerJob Code: SAS20210803-57712Job Location: Colorado Springs, COJob Description:L3Harris is seeking to hire a Senior Software Engineer who will be responsible for developing software applications and lead and/or participate in the entire software development life cycle. The candidate requires to have a good knowledge base of engineering principles, theories and techniques and a passion for relevant new technologies.Essential Functions:Lead and/or participate in the entire software development life cycle including software design, implementation, code reviews, integration and debugging for new products and existing ones.Drive continuous iterative agile like software planning and development.Collaborate with systems engineers to ensure design and implementation meet customer requirements.Utilize software engineering principles, processes, and industry best practices with the ability to apply them in daily work.Read, analyze and interpret requirements and common government specifications.Interact with Systems, software, program management on specifications/requirements weekly.Ensure that products/projects delivered meet customer requirements and specifications.Drive process improvements to aid in team coordination and maintain delivery schedule.Communicate with leadership on status, issues, milestones, and successes.Qualifications:Bachelor's degree in Computer Science, or other related technical discipline and 6 years experience or Master's degree and 4 years in Computer Science, or other related technical discipline4 years related C/C++ software development experience and object-oriented design and developmentExperience with Linux-based application developmentPreferred Additional Skills:Basic Linux Buildroot experienceExperience with Linux kernel and driver development and debug and Linux OS experienceBash shell experienceGit experienceIn compliance with Colorado's Equal Pay for Equal Work Act, the salary range for this role in Colorado is $87,000 - $162,000 (salary ranges in other locations could differ). This is not a guarantee of compensation or salary, as final offer amount may vary based on factors including but not limited to experience and geographic location. L3Harris also offers a variety of benefits including: health and disability insurance, 401(k) match, flexible spending accounts, EAP, education assistance, parental leave, paid time off, and company-paid holidays. The specific programs and options available to an employee may vary depending on date of hire, schedule type, and the applicability of collective bargaining agreements."}