{"title":"Network and Security Administrator (Work from Home) 18614 NEW!","location":"","salary":"","description":"","term":"$50 to $55 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAJ9ChxR0wSznlsOJb2l9nyeevqfM3vipF9jEk5Vmj1fH2QhhwvFnJEiJm-ZAXqFxzKCk0IhDOqbsaaNTFVgSfon9uvDzJHYUfLQ49kvFp-rmp9tIg0HqTsafdauMOAEspQevhXcsF9xpZsyO6t-ltDhRa2U0s7Yc7iAWJPSEFopV8zp1B9YiZ50lPfMHQ","source":"ziprecruiter","full_description":"Our Client, a Public Utility that provides natural gas and electricity to the majority of Michigan’s 10 million residents is seeking a talented and self-driven individual for needs serving in the role of Network and Security Administrator.DUTIES:Our client is seeking a talent for their Critical Networks Team. This role is intended to be a System and Network Administration resource. The candidate will have access to all network equipment, systems, and applications resources within IT. This position is in support of network engineering efforts for a two to three-year capitol project. The contract is 6 months in duration with possibility to extend until the completion of the project. Work will include a combination of work from home, work from the corporate office in Jackson, with occasional trips to various sites around the state.SKILLS:Experience with converged and hyper-converged infrastructureExperience with routing protocols such as EIGRP/OSPF/BGPExperience with Firepower Threat Defense and the Firepower Management CenterExperience with Field Networks using a private APNExperience with IPSEC/DMVPN tunneling and encryptionExperience with monitoring tools such as SolarWinds Orion, Microsoft SentinelAdvanced certifications such as:Cisco Certified Network Administrator (CCNA)Cisco Certified Internetwork Expert (CCIE)Juniper Networks Certified Internet Expert (JNCIE)Experience in an Industrial Controls environmentEXPERIENCE & EDUCATION:Requires a bachelor’s degree preferably in an Information Technology field. Less than a bachelor’s degree may be acceptable if accompanied by other technical training / relevant certifications and experience in positions that demonstrate required abilities and performance1+ years of professional experience or equivalent experience with administrating or working with network administrationCertifications & Licenses - DESIRED:CCNACertified Internetwork ExpertCertified Network AdministratorCisco CertifiedCisco Certified Internetwork ExpertCisco Certified NetworkCisco Certified Network AdministratorJuniper Networks Certified Internet Expert (JNCIE)"}