{"title":"Network Engineer IRES - SAFB","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKYYXv_p-SZR32Jiy_GJC5HRHinWwV56DTFhBgg4S_S0kb1Xi5QVD4MlUeTEEj655HuPOiq_d4o8MkoxbBgwWZHztRPPWXz_kGV_Xc7gSNbrSLJPRH44eUc_lOkUO8_8vb714oANFm4h0EuDbnScyvjl6K9BY4VkqcUgN5hnbgTFL5NxHQutkFQdIwpM1nd","source":"ziprecruiter","full_description":"Description of Duties:The Global Network Operations Security Center (GNOSC) Network Engineer supports the Missile Defense Agency (MDA) on the Integrated Research and Development for Enterprise Solutions (IRES) contract. The candidate will: Be responsible for all facets of a continuous 24/7 Global Network Operations Center, communicate with the MDA GNOSC event team, support the GNOSC Mission Support Team, Network Operations Center, and implement Network technician duties in firsthand support of MDA events, exercises and war-games.Monitor the MDA Enterprise Network using Solarwinds/MicroFocus NNMi and other provided devices.Respond to Remedy Incident Tickets, working with customers to resolve network communication issues.Work with DISA and DREN to report and resolve network circuit issuesPerform Layer 1 cable troubleshooting and replacement and Layer 2 port activationsProvide basic OSPF and BGP troubleshooting as neededProvision and modify QoS as necessary to support MDA EventsUnder direction of senior staff, perform basic Firewall troubleshooting.Research and capture event supporting network architecture from data repositories and network configurations.Implement network, system, and cloud systems monitoring/surveillance, environmental monitoring, incident administration and MDA Cybersecurity.Support and service maintenance activities to include Change Management coordination during the assigned shift day/time.Develop event products, and modify and maintain event baselines prior to and during the event.Be responsible for all aspects of IT incident administration and escalation, ensuring that incidents are effectively escalated, managed and resolved with full communication of status, plans, and actions provided to executive management and the Government customer.Coordinate with the GNOSC Watch Officers, Event Team and Lead/train/manage the GNOSC MST personnel on IT Incident Administration requirements, to ensure proper site, service and application outages and/or degradations are effectively escalated, managed and resolved with full communication of status, plans, and actions by providing senior key team mebers and the Government customer the latest status through resolution.Regularly participate in the Mission Execution Team working group meetings.Assist the MDA GNOSC Event team by supporting the Mission Execution Team (MET) as part of Flight Test implementation, which requires the integration of contractor's into the MET battle rhythm, leading up to and during the implementation of the event tests.Serve as the subject matter expert on network transport and service delivery of all MDA/IC delivered capabilities essential to support test implementation.Work with Network Operations Center personnel to develop the \"Event Preparedness Checklist\" for all MA-1 events. Coordinate with other relevant IRES contract teams to ensure the timeline of implementation and delivery of all other Task Order 8003 work products and requirements are identified in the \"Final event work products and activities with RACI\" matrix.Coordinate the Mission Support Schedule to ensure all CIO assets directly support event requirements and to work in concert with operations personnel, ensuring assets are identified and scheduled.Provide post event recommendations, \"Lessons Learned\" and \"Hot Wash\" inputs.Coordinate with the GNOSC Manager, GNOSC Event Team Lead, and Watch Officers to meet service levels defined for the IT Services organization.Coordinate with Change Management and other key leadership to ensure pre-defined service levels for the IT Services organization are achieved and to also provide insight into the impacts of the event posture.Implement the job roles/responsibilities which includes varying shifts which are adjusted between day and night shifts as needed and is located at Schriever AFB, CO.Provide guidance and lead troubleshooting in dynamic, time constrained scenarios to matrix staff, including network, systems, and application engineers, in a geographically distributed enterprise.Follow documented process and procedures and provide feedback to update as necessary. The successful candidate will:Demonstrate excellent customer service skills.Demonstrate proficiency in developing comprehensive and detailed drawings.Work well in team environment.Have excellent communication skills, verbal and written, at both technical and senior/Executive management levelsBe able to perform as a section trainer and create lesson plans.Have an understanding of Command level Management and be able to speak clearly to diverse cultural audiences, VIPs, and dignitaries. This position will be filled at Schriever AFB, Colorado Springs, CO. This position is expected to pay $80,400 - $128,625 annually; depending on experience, education, and any certifications that are directly related to the position. This position will be posted for a minimum of 3 days. If a candidate has not been selected at that time, it will continue to be posted until a suitable candidate is selected or the position is closed. Resumes, in month and year format, must be submitted with application in order to be considered for the position.  The selected candidate will be assigned as an employee for Jacobs or one of the following teammate companies: HX5, GCS, ERC, MEIT or Aerodyne. Jacobs health and welfare benefits are designed to invest in you, and in the things you care about. Your health. Your well-being. Your security. Your future. Typical benefits offered include flexible work schedules and opportunities to work remotely, educational reimbursement, retirement benefits (401K match), employee stock purchase plan, health benefits, tax saving options, disability benefits, life and accident insurance, voluntary benefits, paid time off and paid holidays, and parental leave.#cjpostBasic Requirements:Must have one of the following combinations of education and experience: HS Diploma (or GED) and 10 years of general experience; Associate's degree and 8 years of general experience; Bachelor's degree and 6 years of general ..."}