{"title":"Outside Sales Representative","location":"","salary":"","description":"","term":"$80,000 to $150,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKaYNSI3ArEv0u-GcntfOovWNqdsIoGGJzUZGbfBSHowU-X7x5rSG6uIDs79sY5LxcLWxVeUkX7OuXnSMgGWcdpvQV76LS4fQcAyB4zgNNw9b1ji1efzfAUnDSpr9h9HemeDHlUOQXJEB-0ObFJzTtIMwhSsfRXm1WQzJJfb9CAnsbMYTq7wVJOImIdR1I","source":"ziprecruiter","full_description":"You and I know that most ads on job boards are terrible.They say the same things and then they are ambiguous about the position, what's required, how you get paid, and what happens when you do an amazing job.So, let me do you a favor and spell out what we are looking for and tell you what's in it for you.We are looking for an Outside Sales Representative with a track record of ELITE performance in B2B or B2C sales.The specific field is Construction and Roofing but that is fairly irrelevant because we know we can quickly train you if you are the right person. This position does not require specific industry experience.What is relevant? That you have a PROVEN track record of performing at a VERY high level in your own personal sales and you LOVE the thrill of the hunt and closing in new clients. You know how to connect with people and you know how to sell. PeriodTalk is cheap for us. We need someone who can do the work. The person we are looking for is a humble dominator. They are someone that can put up HUGE numbers and be proud of their work without feeling they need to brag or boast about it.What you need to bring to the table:B2B or B2C experience. Specifically in construction Sales Hunter MentalityWillingness to Prospect/Cold-Call in Key AreasClose DealsHandle Full Customer ExperienceWhat's in it for you?Freedom of schedule. We do not believe in “babysitting” adults. We want you to set your own schedule and put in the work it takes to win. You decide what that looks like.Room for growth. There is NO ceiling for income here and there is NO ceiling for growth. You can advance as quickly as you like and you can make as much money as you like.A higher-than average compensation plan. Outside Sales Reps on average earn $80K-$120K/yearResults. Do the action that is required and necessary. That means every single day you will be focused on doing what is necessary to make sure you succeed.Leadership. Demonstrate through your work, effort, and mentorship to the rest of the team what it takes to win and what it takes to be GREAT at what you do.This position is with one of the best and fastest growing roofing businesses in the Dallas, TX. area. They believe in doing things right, and setting up their sales reps for success. They want the best of the best on their team. If this is you, apply now and let's talk!How to apply…Apply now using the quick application options below. You can expect to hear from the primary recruiter, Rebecca Marshall, within 24 hours of your application. Eager to move faster than that? Email the recruiter directly at: rebecca@thesmashco.com with a copy of your resume and your availability for a conversation.#zr"}