{"title":"Lead Maintenance Mechanic","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKEU0TaA4dKPRGz_mCNBMaBMi1blJsl9hjxub__5u607HzNB3FhJTM37J9hrT10khxHiqCgysO8y21iIjUT1i5z0FJL-mibNgdJY0jAuXwP-p9lZ8gS4yCNEebNsypvqJ9MalDGEcroOEH9NPh8abVrAdxzd7avKYfSWQI9uoLegJsAcDojuVf5O5ROau4","source":"ziprecruiter","full_description":"A&K Railroad Materials is a leading supplier of new and used railroad track materials. A&K has sales offices and a network of storage and distribution facilities strategically located throughout the United States. Together, these offices and inventory locations maintain an extensive and comprehensive inventory of new, relay, and reconditioned rail and track materials across the nation. Our mission is to help our customers perform better by providing them exceptional service and support while delivering them the quality railroad materials and services they need, when they need them. JOB DESCRIPTION The Lead Maintenance Mechanic is responsible for the installation, maintenance and repair of both the facility—consisting of several buildings—and all the machinery within the facility. JOB DUTIES · Perform preventive maintenance on production machines—both CNC and manual--and maintain up-to-date PM records on each machine · Troubleshoot issues related to production machines: electrical, mechanical, hydraulic, pneumatic, etc. · Troubleshoot issues involving both 120-volt single-phase and 480-volt 3-phase electrical, including magnetic starters, electric motors, relays and control circuits · Make needed repairs whether to the facilities or the machinery · Uphold and enforce the company’s safety and quality policies and programs · Maintain an inventory of parts and supplies · Effectively manage and develop the maintenance staff · Participate in the weekly production meeting, reporting on issues related to the facility and production machinery. · Minimize production downtime · Research to resolve issues utilizing resources such as the internet, manufacturers’ instructions, engineering specifications, various manuals, individuals, etc. · Other duties as assigned SKILLS · Welding and fabrication · Microsoft Office suite · Lathe · Read and interpret schematic diagrams · Read and interpret blueprints WORK EXPERIENCE/REQUIREMENTS/SKILLS · Minimum of 5 years maintenance experience involving electrical, mechanical, hydraulic and pneumatic applications in a manufacturing environment EDUCATION REQUIREMENTS · High School diploma BENEFITS · Health insurance · Paid Time Off (PTO) · Employer-matching 401(k) Equal Opportunity Employer/Veterans/Disabled Job Type: Full-time Pay: $25.00 - $30.00 per hour Employment Type: Full Time Years Experience: 5 - 10 years Salary: $25 - $30 Hourly Bonus/Commission: No"}