{"title":"Technical Assistant/Receptionist NEW!","location":"","salary":"","description":"","term":"$17 to $20 HourlyPart-Time","detail":"https://www.ziprecruiter.com/k/l/AAKmdR5rBmD-FtkkSHkk0Oo6dRdpP-N9N2R_Ibjbsx18xWaptWaQbdIv-U5ZTz5e1ZYxP2PZ8ct0RvX0H1jEsekQyL6UbaXgMEy5HVeVyYGS8xlMhM-cLnT--Ev2ctygt5DA3pWPjRpQ2S_H5_oUtK6I8pzbxGScFcJT0O7Qgsd-AGRSeEu37Cd0fYSPnDw","source":"ziprecruiter","full_description":"This is a part time position Mon-Fri 9:00 am to 2:00 pm.Qualifications:Less than 3 years of technical experiencePrevious administrative or related experiencesProficient in Microsoft Outlook, Word, Excel and PowerPointStrong research skill set using internet search engines, Social mediaAbility to multitaskStrong attention to detailCapacity to maintain confidentiality (Essential)Strong organizational skillsAbility to balance multiple tasks/initiatives and prioritize workloadDemonstrates good judgement when to seek help from supervisionDemonstrates good reliability in attendance on the jobPreferred QualificationsAssociates or Bachelor's DegreeProficient in Microsoft Excel, Access, Project and WordExperience with internet research and proof-reading/editingHelps maximize the effectiveness of operations by assisting in the creation of project schedules. Creation of vlookups and pivot tables using Excel.Major Duties:Provide technical and administrative support to executive and management staff.Assist with Tier 1 Tech Support. Including Troubleshooting, setting up users, networking knowledge, other tasks as assigned.Serves as receptionist; Answers a multi-line telephone system, greet, and refer visitors.Perform extensive internet research.Proof-reading/editing project related specification documents.Ability to be trained in participating in Quality Control checks of contract deliverables.Monitoring and ordering of office and kitchen supplies.Coordination and scheduling of travel, air, hotel, and related travel logistics, for executives and other employees (as assigned) of the company.Develop and maintain office files including routine correspondence/materials, sensitive and confidential employee information.Manage incoming and outgoing mail and package delivery.Assisting in the creation of new invoices.Organize catering when necessary.Other duties as assigned."}