{"title":"Technical Support / System Admin (Automotive) NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJX0OvbSJc2uVplA10097lMz3svx-gnQ7iY6_r2BvAmcZy5RzsyX5OyiDg6oJsfZm3m38tLOZufjDQk2C6wCUkuS4ZAwNDv9TppuuvsfdTARj-LU28tyeH3kmFTPjU-ASeo8Uusp3wqIRyGpLg26_ZUGFz8mEfV_I7GoE8FzKuLv9ibpVrUz2-R-Lq-a4o8","source":"ziprecruiter","full_description":"Description:Senior Manufacturing Applications & Infrastructure Specialist provides technical and project leadership for plant IT activities for the complex shift leads. Responsibilities include but not limited to:• Lead corporate IT sponsored application integration, change management, incident management and problem resolution, meeting the objectives of manufacturing while minimizing lost production due to IT related issues.• Provide SME (Subject Matter Expert) support of critical applications and systems for manufacturing. Management and integration of mission critical plant applications.• Expert level of knowledge for plant applications used by the local plant, ability to troubleshoot system issues, manage and/or configure application and application access including but not limited to Broadcast, FIS, AVI, PFS, PFCS, MPTS, Mainframe Systems, Royal Tool, Andon, OPC (Kepware), SGPP (ProcessVue), Mercury, MDT, Factory Asset Center, and QAS.Requirements:*Candidates must be available to work all shifts including nights and weekends*• Requires a Bachelor's degree in Engineering, Computer Science, Information Technology, or related field.• Requires 5+ years IT deskside technical support experience.• Requires experience leading large diverse teams.• Requires Active Directory, Windows, Client Server, LAN/WAN, UNIX knowledge.• Knowledge of machine monitoring, performance and quality systems, component tracking, common plant and office network environments, engineering systems and identification systems.• Experience working with Manufacturing Engineering to launch and integrate IT systems from concept to the production environment while following appropriate change management procedures.Preferred Requirements:• Master's degree in IT or Business.• Project Management experience leading diverse teams.Notes:Candidates must be able to start the assignment within 2 weeks of an offer.Driving and Travel Requirements:May be required to drive a company car. A valid driver’s license is required as well as a clean driving record.May be required to travel domestically up to 0%."}