{"title":"Strategy, Risk, and Compliance Expert","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAISiVl6Thw4TW9ajjdgGapmAyAlLJHocfeuqOhqmwMYOEWVqgBUcq9_O2wUgZFeO3a8vfUZqY7argZG3OEtonyYfF8Myp3Y3VtDwpIM-kSTfIE36Ntda1xYyiE_97AaxHKY2usAZjg4fKW-oJdgNKjPjXG6CJPGyQfd4O5ViOz3DYYk2Nya-kFBXgA0DVw","source":"ziprecruiter","full_description":"Strategy, Risk, & Compliance Expert Role Summary:  The Strategy, Risk, & Compliance (SRC) and Identity Access Management (IAM) Expert will be a crucial member of our Kudelski Security Services business, driving industry-leading capabilities around SRC and IAM domains. The potential candidate will be a trusted advisor to our Fortune 500 clients and a security expert who can speak to building Security Programs over a multi-year timeframe, have an expert understand of the evolving regulatory landscape, and communicate recommendations and program enhancements to both technical and leadership/executive audiences. The Practice Lead will be focused on and have in-depth knowledge of SRC and IAM, complemented by general security knowledge across domains and capabilities.  Working directly with customers to understand their strategic initiatives and the challenges that come in protecting I.T. systems, the SRC Expert will assess and assist customers in establishing security programs using commonly adopted frameworks such as ISO, NIST, COBIT, and Kudelski Security frameworks (if necessary). The Practice Leader will mature our capabilities, including the creation of staffing and hiring plans (people), development of viewpoints and sales collateral, delivery templates and procedures (process), and alignment of technology and vendor partners (technology). This role will help the sales team understand customer challenges and translate those needs into proposals and Kudelski Security engagements. The Practice Lead will be focal for the SRC and IAM teams and deliver Practice aligned projects as sold.  SRC and IAM capabilities would include concepts such as Program Assessments and Roadmap development, Virtual CISO Support, eGRC deployment and configuration, Compliance Assessments (e.g., NIST Common Control Framework (CSF), NIST 800-53, ISO 27001/2, HIPPA, and PCI Readiness), IAM Strategy and Implementation, Vendor Risk Management, and other capabilities as identified by the Practice Leader.  Role Description:  Develop capabilities for the SRC and IAM Security Practice Areas, including the definition of capabilities, development of sale collateral, creation of delivery methodologies and templates, identification of supporting technologies and partners, and training and hiring plans for the Practice. Deliver SRC and IAM projects and/or manage delivery teams within the scope of the capabilities defined for the Practices and the customer signed SOWs. Develop SRC and IAM teams while balancing utilization and pipeline metric. Drive the sales and capture activities for SRC and IAM capabilities and identify opportunities to deliver all of Kudelski's security offerings. Drive the bookings of $3M in SRC and IAM capabilities. Develop proposals and Statement of Works (SOW) to deliver SRC and IAM projects as discussed and scoped with the customer. Produce marketing materials highlighting SRC and IAM offerings such as point of view documents, blog posts, YouTube videos, presenting in conferences, etc. Mentor staff and encourage a Kudelski culture.  Role Skill / Experience Requirements:  10+ years of relevant professional work experience 7+ years of experience working in a Cybersecurity role 5+ years of prior Cybersecurity consulting experience 5+ years of experience directly managing, supporting, and implementing SRC and IAM programs and technology Expert knowledge and hands-on experience with industry-leading security frameworks such as NIST, ISO, and COBIT and regulatory requirements such as GDPR, CCPA, HIPAA, and NERC-CIP. Ability to and prior experience working with customers to identify project requirements, develop proposals, scope projects, and develop SOWs Ability to lead teams between 2-10 and deliver projects up to and excess of $7M+ Ability to build long-lasting relationships with customers Ability and willingness to mentor and grow junior staff.  Bachelors Degree in a relevant field or equivalent experience Willingness to travel up to 75% (the U.S. only) and live in a major US city with access to a major airport Speak and understand English fluently  Preferred Skills / Experience Requirements:  Big 4 / Top Tier Management Consulting experience Familiarity with SRC eGRC tools (e.g., Archer, Allgress, OpenPages) Familiarity with IAM technologies (e.g., BeyondTrust, CyberArk, OKTA, Microsoft, Ping) MBA or Masters Degree in a related field or equivalent experience Certified Information Systems Security Professional (CISSP) or similar technical cybersecurity certifications Project Management Professional (PMP) or comparable work experience  Located in Phoenix, AZ; San Diego, CA; Dallas, TX, Minneapolis, MN; Atlanta, GA"}