{"title":"Senior iOS Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJFddbNlmtdkkvFvj-8KoghCFD8hMFdocIxyr_JpXS1gSvotfEDE-L1qULzfafRnF2_tnmiSrDWVZactBSBnCJ98Y_HWWwUeSgB0Mn3M7l7Cn5VJyMi7t1TyZVqU431lACTa0QHmop67EWD5VxxcvbbIBuuLG7-2-PMeR4JzsZqxI8Y3HN-41jmiR3VMRMb","source":"ziprecruiter","full_description":"Ibotta is one of the top mobile shopping applications on the App Store and Google Play. Our apps are used by millions of customers every month and we're looking for a Senior iOS Engineer to join our innovative team and contribute to our mission to Make Every Purchase Rewarding. As part of the engineering team, you will work with our iOS Engineering team to build all things iOS at Ibotta. We're looking for a self-motivated engineer who has a passion for building high-quality consumer-facing applications. Every engineer has input into our product process and will have a real impact as part of a small, nimble team.This position is located in Denver, Colorado or with the option of full-time remote. Candidates must live in the United States.What you will be doing:Embrace and uphold Ibotta's Core Values: Integrity, Boldness, Ownership, Teamwork, Transparency & Advocate for SaversWork with mobile team to design and implement featuresDevelop automated tests for Ibotta's iOS applicationFix bugs and improve performanceParticipate in the definition of new mobile features and experiencesWhat we are looking for:Passion for building mobile applicationsProficient in relevant technologies including Swift and Objective-CAdvanced knowledge of iOS development environmentSignificant knowledge of mobile UI design principles, patterns, and best practicesAdvanced knowledge of source control systems including GitSkilled in object-oriented programming design and developmentFamiliar with architecture patterns such as VIPER and MVPSolid experience in writing unit testsFamiliarity with continuous integration tools such as Bitrise and FastlaneFamiliarity with the use of sensors such as camera, gyroscopes, and accelerometersScrum/Agile development experienceBachelor's degree in Computer Science, Engineering or a related field and 5+ years of iOS software development experienceAbout Us:Built in Denver, CO, Ibotta (\"I bought a...\") is a free mobile shopping app that gives users cash back on groceries and more. Through our partnerships with brands and retailers like Procter & Gamble, Kraft Heinz, Kellogg, Amazon, Walmart, Target and Uber, we've delivered over $800 million in cumulative cash rewards to our Savers. Guided by our values and our mission to make every purchase rewarding, we come to work energized by the business problems we get to solve, the technology we get to build, and the people we get to innovate (and have fun) with. Ibotta made Inc.'s 2020 list of the 5000 fastest-growing private companies in the U.S. for the third consecutive year. In 2019, we became the first mobile consumer technology company in Colorado to achieve $1B in valuationTo learn more about what our Tech teams are doing day to day, visit Building Ibotta on Medium.com.Additional Details:This position is located in Denver, CO and includes competitive pay, flexible time off, benefits package (including medical, dental, vision), Lifestyle Spending Account, 401k match, profit sharing and equity.Base compensation range: $120,000 - $150,000. Total compensation for this role also includes a variable component in addition to base compensation.Ibotta is an Equal Opportunity Employer. Ibotta's employment decisions are made without regard with race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, sexual orientation, or any other legally protected statusApplicants must be currently authorized to work in the United States on a full-time basis.For the security of our employees and the business, all employees are responsible for the secure handling of data in accordance with our security policies, identifying and reporting phishing attempts, as well as reporting security incidents to the proper channels."}