{"title":"Performance Modeling Senior Manager","location":"","salary":"","description":"","term":"$190,000 to $225,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALlmsRN43caf8eZSCOGw1jlQ36LHlbOZEqqZzQSP5X_8U4lj6Z0airyhH1C9UfViUZA6DoSDVpxwsuetavdmnsMfPSx8ZxGAdoNsj33lmNI7UP2CzXyxmiNdDOlMjMo77fx4Ml86t_MAnHrKjvRaXSBzQqBD4ELgCahh2w_1Y3GSqKPzoKSrsGjqFPQiL2l","source":"ziprecruiter","full_description":"Performance Modeling Senior Manager If you are a Performance Modeling Senior Manager with experience, please read on! ---Position Based in Austin, TX or Campbell, CA---Top Reasons to Work with Us1. Based in Campbell, we are a semiconductor company2. Our company has been around for over a decade, so we offer a unique balance of stability and a small, tight-knit feel.3. You will have the chance to lead new development projects with a talented team.What You Will Be Doing- You are the kind of person that brings your intelligence, motivation, and sense of humor to the office.- Lead a talented team of engineers.- Set priorities for the team, get results across functional teams, ensure an inclusive work environment, develop employees, and manage performance.- You are excited about using software to accelerate ASIC design.What You Need for this Position- Master in Computer Science/Electrical Engineering or related field. - 5+ years of experience of leading or managing a team.- 10+ years of experience with ASIC and SoC design.- Experience modeling IP using C++- You have a good working knowledge of SystemC and/or TLM2.0 Nice to Have:- You have knowledge of ARM/MIPS processors, cache coherence, and on-chip interfaces such as AXI, ACE, and CHI.- You have SoC or IP development/integration experience.- You have experience with code generators to create configurable hardware descriptions.What's In It for You- Competitive salary- Full Benefits- Incentive stock options- 401k- PTO- Relocation package if needed- Great Place to WorkSo, if you are a Performance Modeling Senior Manager with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}