{"title":"Software Engineer (JR1019641)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKhHUQCxNCbEV0uYRyOFi_GSRgxrXVlCfmwrXMsuTj3yuSuuVPpMKTcSmYilzQAa9eET8z9a3F4g6Bg6PD0cBD8Na8eNwDScIvA6pcvT2Ku7sdEqc1McGdht1SvvcT3gXfJ52iKpbGijzKzoqFBJ7PfAwPZF7fGkjnCqLy_XVa2QDGoKgkM2yyCKnsOeoVN","source":"ziprecruiter","full_description":"Company DescriptionBroadridge Financial Solutions, Inc. (BR), a $4 billion global Fintech leader and part of the S&P 500® Index, is a leading provider of investor communications and technology-driven solutions to banks, broker-dealers, asset and wealth managers and corporate issuers. At Broadridge, we do well by doing good. Our unique culture is guided by the Service-Profit Chain—the idea that success is mutual, directly connecting employee engagement, client satisfaction, and the creation of stockholder value. We enable better financial lives by powering investing, governance, and communications for our clients, their customers, and the financial services industry.Job DescriptionFast-paced, quality-driven FinTech start-up seeks a Software Engineer with 4-6 years of experience in automation build-out, business analysis, and the creation/execution of behavior-driven and integration tests. Some manual testing will also be expected, but emphasis will be placed on the build-out of the QA Department’s automated test frameworks. This Software Engineer needs to have some background in coding in Java to enhance and maintain our custom-built Java-based framework. Experience with Selenium and FIX Protocol or other API messaging test tools is a plus.The candidate for this Software Engineer position should have a deep knowledge of:• Scripting languages such as Python, bash and Javascript; knowledge of programming in Java;• SQL and noSQL databases in order to understand and work iteratively with complex data sets and models; data are tested for accuracy, completeness and performance;• Test strategies that can be executed timely to accommodate an agile SDLC organized into Sprints. To that end, good common sense, as well as the use of automation tools, should allow a complete and sensible set of regression tests to run efficiently within the timeframe of each Sprint delivery;• Familiarity with SDLC tracking and release deployment tools, such as JIRA, Jenkins or similar Technology tools.Other desirable experience includes:• Knowledge of the financial markets, including fixed income instruments and trading life cycle;• Devising/configuring integration tests, to ensure the newly built modules are integrated properly with their source systems and are robust enough for accurate, speedy delivery to the downstream consumers;• Ensuring the usability of the Customer UI experience. • Experience with Selenium and Cucumber test tools.The Software Engineer we seek for our exciting new product exhibits a keen sense of end-to-end ownership of the quality of that product, organizing his/her assigned tasks with care, attention to detail under pressure, and respect for target delivery dates. He/she enjoys working with a small, talented team but has an independent mindset to champion our Customers’ experience of quality as the foremost group deliverable. Additional InformationBroadridge is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, age or any other protected status. \"Everyone Benefits from Diversity & Inclusion. Diverse & Inclusive Teams Drive Growth.\" US applicants: Click here to view the \"EEO is the Law\" poster. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation in the event you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request a reasonable accommodation(s) by calling 888-237-7769 or by sending an email to BRcareers@broadridge.com"}