{"title":"Nuclear Field Service Coordinator NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALE0Nqf31YvD7UUiSaRqKSrXUDrDlZqRUAPVsReN2pkbbJG7DDEutM8Xyp9qn97gldHX7hjoRW0_MVxmtslXY7fzQjZ_rCVO2KSGyAFednbccfd2hrMAQ0riVJDThM1D5pBf2cj-xHw3UPjWdDqn_L16Aj0jfjp8cU2YCuUX4UfynoS9MloqACNXNV14Ybn","source":"ziprecruiter","full_description":"FieldCore, a GE company, is a new, independent industrial field services company that will deliver the highest standard of field services excellence and capabilities for GE and its customers. FieldCore will bring together the field services expertise and people from both Granite Services and GE's Power Services into one powerhouse. Driven by the values of safety, quality, and integrity, FieldCore will be built to deliver operational excellence for customers in the power generation, oil & gas, nuclear, and wind power markets. For more information, check out www.fieldcore.com**Role Summary/Purpose**The Field Service Coordinator will organize the mobilization and demobilization of field employees. Coordinators will update the company databases as appropriate on a daily basis ensuring accurate employee and job status and financial information. The Field Service Coordinator will serve as a liaison to the Processing and Business Ops Specialists, Field Operations, HR and Finance.**Essential Function**+ Receive and create new jobs and employee assignments in company databases + Update and maintain company databases with employee, job and financial information + Interact with field employees to provide information about job assignments + Ensure travel costs support FieldCore's Cost Management objectives (flights, accommodation, vehicle hire) + Generate and manage multiple reports for business partners as needed + Assist with development and testing of system modifications within FC systems and databases + Coordinate mobilization and demobilization of field employees to ensure timely arrival to and from job sites + Update employee status in the company database on a daily basis + Initiate requests and follow up on information in the GE Travel Advisory System (TAS) + Update and maintain accuracy of pay, cost, and bill rates, site information, and project information + Understand and follow Master Service Agreements for job set ups for the business supported + Validate financial information in GE financial systems (IBS) + Assist management team with employee payroll or credit card issues + Support segment conferences and/or training events + Perform other duties as assignedImmigration (if required)+ Monitor and manage outbound travel via FieldCore tools + Initiate cases with outside counsel to procure visas / work permits + Communicate with various government agencies for certification of documents + Fulfill request for Letter of Invitation (as needed) + Provide guidance to employees and Field Business Ops teams regarding documents, cost and time requirements for visa / work permit applications + Ensure all paperwork including applications for immigration visas / work permits are completed accurately and in a timely manner + Track visa and work permits progress to keep business partners updated + Maintain immigration tools and files for all employees on foreign assignments + Process and complete any exit permit or formalities prior to employees leaving the home country for assignment, if applicable**Qualifications/Requirements**+ Three years relevant work experience in field operations, customer service or office administration role desired. + Bachelor's degree preferred. Related degree considered in lieu of experience**Desired Characteristics**+ Excellent customer service and interpersonal skills + Excellent communication, time management and organizational skills + Ability to multi-task, coordinate, plan and assume managerial responsibilities as deemed appropriate by the Supervisor + Demonstrate leadership ability through decision-making abilities, troubleshooting, problem-solving and teamwork + Intermediate knowledge level of Microsoft Office (Word, Excel, Power Point, Outlook) + Minimal travel required + English proficiency requiredWe are an Equal Opportunity Employer, including disabled and vets.For more information regarding affirmative action and equal employment opportunity click here at http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}