{"title":"Research Chemist (Research Associate- Post doc)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJBio_cY_PfhAKGOYwkruIOLqs_iZQXjCXpvdHTXIE8seMf2zyi8z9oX0rAlhkM_RmOntfgoJJx9o31usyjnnRIYJVV436WhnBlR8ezMa-76rEK27qvEhzzVpmSQNAqzB_ud4gBI1JDcB5HLSpWUheq5OALgz5UskCG6HpoihA7nedWVBO2KMTkrqfekPvv","source":"ziprecruiter","full_description":"SummaryThe Agricultural Research Service (ARS) is the United States Department of Agriculture's chief scientific research agency and one of the world's premiere scientific organizations. ARS Postdoctoral Research Associates are hired to supplement a lead scientist's research on agricultural problems of high national priority affecting American agriculture. This position is with Grain Quality and Structure Research Unit of ARS **ANNOUNCEMENT IS OPEN UNTIL FILLED OR January 10, 2022**ResponsibilitiesSolve complex chemical research problems.Perform measurements and component characterization and analyses.Develop new methods/formulas for the production of fermented foods and products.Organize experimental progress in the form suitable for oral presentation or posters for scientific meetings.RequirementsConditions of EmploymentQualificationsThis position requires a Ph.D in the physical sciences, life sciences, or engineering that included 30 semester hours in chemistry, supplemented by course work in mathematics through differential and integral calculus, and at least 6 semester hours of physics. Applicants must meet basic Office of Personnel Management (OPM) Qualification Standard's requirements of the scientific discipline necessary to perform the duties and responsibilities of the position. In addition to meeting the education requirement listed above, applicants must also meet the Specialized experience equivalent the GS-09 level. Specialized experience is fulfilled by the following: Conducting research related to solving complex chemical research problems, carrying out measurements and component characterization, developing new methods/formulas for the production of fermented foods and products, preparing technical reports, maintaining official laboratory notebook and technical instruments in accordance with good laboratory, and presenting research findings at scientific meetings.EducationThis position has a positive education requirement. You must submit a copy of your academic transcripts OR a list of college courses with credit hours, dates completed, and grades received to verify education when applying for this position. If this information is not provided, your education may not be appropriately evaluated and you may lose consideration for this position. If you are selected for this position, you will have to provide an official copy of your transcripts prior to entering on duty. Application materials will not be returned.Additional InformationRecruitment or Relocation Incentive may be authorized. Final determination to pay an incentive will be made by the hiring official at time of job offer."}