{"title":"Technical Writer, Card Services","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJEImNwqCVpqFIMlg6Fy8eGBmeZaLB1sDlxK6SBd4itPZbNQ0J_v2mPgub0KY8f6SXcD92xZTi69gFPcxLs6QKDAGEQLBXcRyRTVkieAaHX4mWIRjGRm_T60jrQOyRJn4mLzS7WxN6qcOV5mgxWTaTLNBHym9cUcYG3zLTLfnw6AF3YbS-sHEhFfnv9BpK8","source":"ziprecruiter","full_description":"**What does an exceptional Technical Writer do?**The Technical Writer will produce exceptional technical documents including user manuals, message standards, technical specifications, quick references, knowledge articles, page-level help, forms, and other documents as assigned. You'll craft documentation that contributes to the success of our products and business. Documentation is a dynamic department-the contributions of all members are key to producing quality documentation and maintaining our high standards. You will apply your understanding of products and services to translate complex information into simple, polished, and engaging content. Seeking a candidate with excellent writing and verbal communication skills, experience writing business documentation, and demonstrated ability to work in a fast-paced development environment.**As a Technical Writer, you can look forward to:**+ Producing exceptional documentation that enables clients to understand Fiserv's products and efficiently complete their jobs with minimal service calls. + Documenting focus of: User Guides, Quick References, Page Help (HTML)files, and Technical Specifications. + Applying product-specific knowledge; using skills in graphic design, instructional design, writing, and editing. + Leading all aspects of the documentation development and project lifecycles. + Producing all documentation deliverables within project timeframes. + Researching available technical documentation, write descriptive copy, and verify documentation content with related departments. + Analyzing and translating technical and functional designs into user friendly client material. + Reviewing requirements and functional design documents to determine product enhancements. + Mastering the department selected style guides and department procedures. + Managing and validating the content of the knowledge base. + Maintaining and enhancing organization's knowledge infrastructure. + Identifying requirements, scope and estimation of work. + Determining timeline and reporting progress to project sponsor. (Product Manager/Product Owner) + Utilize online resources. (e.g., applications, databases, and test environments) + Transforming complex, unorganized or unstructured data into usable information. + Managing every aspect of the daily work associated with a project. + Working as the documentation specialist on a development team using Agile development methodology. + Conducting audience and task analyses. + Creating final content for client-facing documentation. + Outline proposed deliverables or indicate where existing work will change. + Conducting quality checks, including technical reviews by development teams and other SMEs. + Coordinating formal approval process, including reviews by peer writers, product manager/owner, and Legal & Compliance. + Ability to effectively communicate at all levels of an organization, with strong verbal and written communication._The above statements are intended only to describe the general nature of the job and should not be construed as an all-inclusive list of position responsibilities._**Basic qualifications for consideration:**+ Bachelor's degree required. Degree in Technical Communications, Professional Writing, English, or Journalism preferred. + 5+ years of relevant technical writing experience in applicable field. + Adheres to the Microsoft Manual of Styles and Standards and department writing standards. + Experience with help development toolset to include desktop publishing, graphics, and word processing. (Word, FrameMaker, Visio, Excel, SharePoint and Adobe Acrobat) + Experience with Madcap Flare software and HTML. + Experience with screen capture and screen editing tools for importing into other sources. (Flare, Word, PowerPoint) + Understanding of content analysis, modeling, design, and structured writing. + Experience creating technical documentation in SDLC and Agile environment. + Proficient at writing content in U.S. English.**Preferred qualifications for consideration:**+ Advanced degree in Technical Communications. + Experience working with DITA and/or Adobe Suite. + Solid understanding of the KCS Knowledge-Centered Support methodology. + Experience writing user interface text and application screen content. + Experience with Component Content Management Systems. + Exposure to ePayments or Card Services products in B2B professional service environments. + Proficiency with SharePoint document repositories and Word templates. + Related banking industry experience in platforms, banking applications, payments or online financial solutions. **Learn more about us.**To support the total well-being of our associates, Fiserv takes a broad approach to our benefits. We offer a comprehensive benefits package that provides flexibility and affordability with a variety of medical, dental, vision, life insurance and disability options. We are #FISVProud of our benefits and well-being programs. Our commitment to wellness, wellness education, preventive services and fitness activities are designed to meet you where you are.In this role you will be aligned with our card solutions team. Card Services authorizes and settles point-of-sale (POS) and ATM transactions, monitors and drives ATMs, provides nationwide switching of debit, credit, prepaid and ATM transactions, and owns the Accel Network. We provide clients with proven solutions to maximize profit, reduce cost, and mitigate risk.We welcome and encourage diversity in our workforce. Fiserv is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.**Explore the possibilities of a career with Fiserv and Find Your Forward with us.**"}