{"title":"Sr Advanced Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKf8w9OjSAQxaNRuTawCZ8FWDnz6L9kqkx5U_Zh5isrHIdL1L5q1OBDuOmpelodGuK8YxCgsHaoxwol9HKlTleRKNjCWRPOoCYlhHh-ySj6AF9F1ivoFnQBpT-0BG8w0af2hd0_8emzLbEgnU_qZnDzwYuT_g_pjtH8Kp5WjM1EPtJvE3d6FA1b2YEjlPc","source":"ziprecruiter","full_description":"The future is what you make it. When you join Honeywell, you become a member of our global team of thinkers, innovators, dreamers and doers who make the things that make the future. That means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars. Working at Honeywell isn't just about developing cool things. That's why all of our employees enjoy access to dynamic career opportunities across different fields and industries. Are you ready to help us make the future?Use your advanced knowledge of the hardware engineering discipline, processes and tools to help Honeywell SPS Productivity Solutions & Services Advanced Engineering team deliver innovative solutions that meet the evolving needs of our customers. You will work under limited supervision and alongside some of the world's most talented engineers. You will contribute to the development of Honeywell's next generation of AIDC Mobility, Scanning & Printing products by designing, testing and/or validating products/processes from prototype to market. You will be part of a group of highly committed professionals who provide expertise to ensure the success of complex engineering projects and programs while acting as a mentor to more junior engineers. You will interact with internal and external customers in order to facilitate the completion of products to customer specifications. RESPONSIBILTIES: Plan and execute project subtasks (designing, testing, etc) Analyze design requirements - provide electrical input for product designs and design specifications Develop electrical architectural models, perform schematic design and reviews Carry out prototype review and testing, troubleshoot prototype design issues and confirm that designs meet or exceed product specifications. Assist in product and process certification for customer acceptance Guide engineers, technicians and associates to ensure project and product compliance Present to leadership and external customers Consult with vendors and suppliers to ensure product and project compliance Communicate any non-compliance incidents and results of internal project audits to pertinent parties Establish and follow methodologies for new or existing concepts Identify opportunities and propose technical improvements by applying advanced electrical engineering knowledge and principles Suggest enhancements to advance projects YOU MUST HAVE+ Bachelors Engineering WE VALUE Deep understanding of a variety of hardware engineering standards and specifications Digital circuit design, embedded microprocessor-based designs, and experience with wired or wireless communications Capability to complete demanding assignments by applying advanced hardware engineering methods and tools Ability to influence cross-functional teams to deliver optimal solutions Ability to consistently make timely decisions and balancing systematic analysis with decisiveness in an ambiguous environment Clearly and concisely convey subtle or complex messages to a variety of audiences Capability to follow guidelines and ensure efficiency on given project tasks Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status."}