{"title":"Software Engineer - (MySQL) - Opportunity for Working Remotely NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKJn3vWlhbiUGHVuogv8ykPCq0gU0I0cqb-anWHnaQZFs4OiyKO8XqWwm4Qs_zkuMAPwv09NmqGEjONKXlDwnshoBJK5YUbDEqCfNul8FQNkdw14TyZLJJ_zstODnO9YNGbWnpVvVX16Ya25WcsVMbpIK5vTQhyC-s4dEPmTlzehpP9aaSjffaM6B9SqCI","source":"ziprecruiter","full_description":"**About Us**Ready to build? So are we. Come join VMware's new exciting Modern Applications Business Unit (MAPBU) team, made up of products and services under the Tanzu portfolio (#TeamTanzu) to help customers build, run and manage their most important applications. We build applications with velocity to run in a cloud-native environment, run open-source Kubernetes with consistency, and manage our customers' entire footprint with confidence to help them achieve their business outcomes.We are looking for engineers who want to make a lasting impact on our enterprise-grade database offerings, Postgres and MySQL for VMware Tanzu.**You**You are looking for a collaborative environment building database systems that enable enterprises to focus on their business rather than architecting open source database solutions from scratch.You know MySQL like the back of your hand. You've run production databases at scale, where uptime and consistency were of prime importance. You can debug slow queries in your sleep. You understand the tradeoffs between synchronous and asynchronous replication. The thought of cross datacenter replication fills you with excitement, not dread. High availability isn't a buzzword, it's a way of life.You are a database expert, but you're also interested in writing code. You've been a software developer, or maybe you've written scripts to solve your own problems and are interested in learning more. In the past you might have been a DBA, a systems administrator, an SRE, or a software developer. Today, you're interested in doing all of these at the same time.You judge your success by the success of your team; you are interested in automation; and you are excited to work on open source software.This role is the expert who shapes the product to automate MySQL deployment.**Us**At VMware we transform how the world deploys and scales software, and we are opinionated about how software should be built. We work hard to deliver platform capabilities so customers can accelerate their time to market for software solutions. Agile concepts are at the core of our process. We have a whole host of Pivotal Practices around Test Driven Development, pair programming, team retrospectives, technical retrospectives, and continuous integration. We are excited to teach these to you and innovate with you on their implementation. Our engineers pair program, all-day every day, because we know it delivers remarkable results. They also work in small teams, and rotate between them frequently so that they are able to meet everyone in the organization.**Your Day**You will be part of a team that's responsible for MySQL's place inside of our organization. That includes both connecting with other teams that need a database within VMware, and working with our product folks to empathize with customers of our commercial products. We are agile, and work on small, bite-sized blocks so that we deliver value incrementally. We believe in working at a sustainable pace - you'll typically work hard for 8 hours each day, but then you're off work to relax, recharge, and refocus.Making an investment in each Pivot's professional development improves the organization as a whole. We encourage you to go to conferences, take classes, and read books -- and we'll give you a budget each year to do it.Desired Skills/ Experience:+ Deep experience running large, high availability transactional MySQL clusters + Experience with Galera replication or MySQL v8 group replication + Knowledge of other relational databases + Contributions to open source projects + Interest in creating a high quality data product that customers will be excited to use + Experience and/or interest in Test Driven Development (TDD) and agile methodologies + Operations or Systems Administration experience, particularly on Linux + Experience with Kubernetes, Docker, or cloud deployment technologies + Knowledge of a configuration management tool - Chef, Ansible, Puppet, BOSH or similar.**Category :** Engineering and Technology **Subcategory:** Software Engineering **Experience:** Manager and Professional **Full Time/ Part Time:** Full Time **Posted Date:** 2020-12-17VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what's possible today at http://careers.vmware.com.Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law."}