{"title":"Senior Software Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAISTnjTRxE3S5ewvbUa9udwbfy8BCo248gSRqBqVY_BohkAwcDLBsqrf2OnL9UF3uMKcBerMeWhs7D9aTPJD_8tLV8lYIlczH3JmJW2WrbHCaI4dSngFI4ICH6atjheNvVsR6DrsurfEEqQbrGT4eKqrCmTgfGDNT20dx6Bx1trX3L74O1wPgAUDf2XO7M","source":"ziprecruiter","full_description":"Position Summary:The Senior Software Developer is responsible for developing best-in-class medical software products on schedule. This position is one of technical influence and expertise within the Cadwell software team. Come join our innovative team and help our customers help their patients.Key Duties / Responsibilities: Own, design, and implement software features/requirementsProvide technical expertise and guidance to the teamPerform code reviewsImplement unit testsFrequently communicate status of tasksPerform other duties as requested, directed, or assignedEducation / Experience:Requires a bachelor’s degree in Computer Science or related field (or equivalent experience)5+ years of software development experienceJob Knowledge / Requirements:A passion for software development and leadershipAble to complete tasks as directed by development schedules with minimal supervisionAble to work in a team environment as a leaderProficient with Visual Studio, TFS, Azure DevOps, and other development toolsExtensive experience with C#, WPF, WCF, Networking, SQL, & “Cloud” desirableCommunicate clearly and professionally through listening, speaking, and exceptional writing skills; remain professional and solutions-focused while interacting with othersCritical success criteria include attention to detail, organized approach to work, effective time management and follow-throughProficient with computers, Microsoft Office, and Google Apps (GSuite)Medical device software development leadership experience desirable (ISO 13485 & IEC 62304)Physical Requirements / Working Conditions: Positions working with Cadwell equipment generally may require some reaching, bending, stooping, squatting, crawling, kneeling, pushing, pulling, lifting and carrying up to 50 pounds, finger dexterity, repetitive motions, standing, walking, sitting, hearing, visual acuity, color vision, and 2-way written/verbal communication. More specific details may be provided as needed or requested.Extensive use of computerRemote work possible (relocation not required) but standard work schedule of 7:30am-4:30pm PST is requiredTravel may be required; must be able to obtain necessary travel documentsWork hours outside normal business hours may be required to meet business needs"}