{"title":"Principal Java Developer- SDET","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJbf-M0B9Kwni3ZCMTtFEhO5l6AFzS2hTTyR7zJWSGGKRIy_Ca3PY8HHHJVNH5OLumnFAktT_IHTOHvC9wmeJC9VTudk7DBQ5aoXTxqaMux9CNH32LukUGdY4u5VAwKxM-g-YkIXYhTO8seS8Gc8Q9tQvqRRgIFvxfUZNa4PQpj9Nax2pWDDC85TzUGjKro","source":"ziprecruiter","full_description":"Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.*This is a remote/office based position which may be performed anywhere in the United States except for within the state of Colorado.**Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.*Future of enterprise employee work automation is going to be through channels based on text, voice and image, which we all love, and use every day instead of going to a specific App UI. Digital Assistant team facilitates that dream to come true for Oracle SaaS customers by providing a platform for these capabilities.We are a talented group within Oracle working on solving some really hard problems in the areas of Digital Assistant, chatbots, NLU, mobile, cognitive services, analytics and. We are like a start-up inside a large company with a big charter and lot of creative freedom. We have assembled some of the smartest people in the industry and are growing this team.We are looking for an engineering mindset with a holistic system level thinking in order to develop systems which can qualify our Digital Assistant product for functionality, HA, stress, stability and the first-class user experience. We expect you to bring in that thought process which will explore the product in-depth and make the objective of world class product a reality. You are expected to challenge the status quo of the product and develop software to demonstrate the same.Job Responsibilities:Innovate, design, and develop test automation frameworks. Build automation frameworks to break/test complex back-end systems. Master the skills of performance bench marking of large scale back-end applications. Be a Quality Engineering guru, and influence the development team for best practices. Be a thought leader in open source technologies, and contribute back to open source.*Preferred Qualifications:** 6 years of experience in Development or SDET Strong Java background Git TestNG, Junit SQL DB/Oracle skills Understanding of docker and kubernetes Experience with the Agile Methodology and continuous integration/delivery(i.e. nightly build and release) Jenkins Gradle JavaScript , Node.js Mobile Development Knowledge of iOS or Android Shell scripting/python Knowledge of Authorization schemes such as OAuth, SSOJob: **Product Development***Organization:** **Oracle***Title:** *Principal Java Developer- SDET***Location:** *United States***Requisition ID:** 210000T1"}