{"title":"Board Level Digital Hardware Design Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJPpCERI926IgUVjoLWYEWU5OsgBwExGcDORuOcTClhMMK_LuvfxmxcMucRe57Tce47RLLRU1kPTXGhk_1ZA-Hyhtdz5nwEv_3_68a7ELUAoXAILl32zHxilKH40ehMWi8LF6kHBq3jg-okL8zEehXl-pd6lJcsKGEhmXmP1k_oygD0r7ifL3jJaU2OY--l","source":"ziprecruiter","full_description":"Company:Qualcomm Technologies, Inc.Job Area:Engineering Group, Engineering Group > Hardware EngineeringJob Overview:Qualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is the Invention Age - and this is where you come in.General Summary Plans, designs, and develops electronic systems, circuits, components, integrated circuitry, mechanical systems, equipment and packaging, optical systems, and/or DSP systems. Conducts simulations and analyses of designs. Develops emulation solutions. Evaluates, characterizes, and develops the manufacturing solution for leading-edge products in the most advanced processes. Interfaces with various cross-functional teams (e.g. Designers, Software/System Engineering, Architecture Development, Business Groups, Customers, Customer Engineering) to drive and incorporate the latest test solutions in the production program to improve the yield, test time, and quality. Evaluates reliability of materials, properties, and techniques used in production. The responsibilities of this role include: Working under some supervision. Making decisions that are moderate in impact; errors may have relatively minor financial impact or effect on projects, operations, or customer relationships; errors may require involvement beyond immediate work group to correct. Using verbal and written communication skills to convey information that may be somewhat complex to others who may have limited knowledge of the subject in question. May require basic negotiation and influence, cooperation, tact, and diplomacy, etc. Having a moderate amount of influence over key organizational decisions (e.g., is consulted by senior leadership to provide input on key decisions). Completing tasks with multiple steps that can be performed in various orders; some planning and prioritization must occur to complete the tasks effectively; mistakes may result in some rework. Exercising creativity to draft original documents, imagery, or work products within established guidelines. Using deductive and inductive problem solving; multiple approaches may be taken/necessary to solve the problem; often information is missing or incomplete; intermediate data analysis/interpretation skills may be required. May be solicited during strategic planning period. The responsibilities of this role do not include: Financial accountability (e.g., does not involve budgeting responsibility).Principal Duties & Responsibilities Develops basic to moderately complex features and components of hardware designs in line with product proposals or roadmaps, with minimal supervision from more experienced engineers. Applies basic design rules and processes for electronic hardware, equipment, and/or integrated circuitry independently. Reads device specification sheets and interprets common details required to design various hardware features. Identifies basic ways to optimize tests and/or hardware designs by evaluating device performance over a limited range of operating conditions and configurations. Assists in the assessment of complex design features to identify potential flaws (e.g., electrical, mechanical, hardware), compatibility issues, and/or compliance issues with minimal supervision of more experienced engineers. Documents essential details about materials, components, chipsets, and assemblies for a device; records and tracks changes to design accurately. Troubleshoots common issues with product designs, suggests possible solutions, and documents lessons learned. Provides basic technical input and support for internal customers, with some supervision from more experienced engineers. Acts as a tech lead on small projects with minimal guidance from more experienced engineers and owns the outcome of the project. Provides accurate schedule in preparation of kick start to project. Seeks to continually learn about Qualcomm products. Seeks essential knowledge of industry trends, competitor products, and advances in various engineering fields from publically available information; shows interest in a specific area of expertise Assists in conducting specialized analyses (e.g., feasibility studies, signal integrity, power integrity, teardown analyses) under the direction of more experienced engineers. Additional responsibilities may also include: Develops design implementation, analysis, methodology, flows, and automation for development and validation of System on Chip, electronic parts, components, integrated circuitry, and packaging. Provides design solutions to evaluate, characterize and develop the design implementation solution for leading-edge products in the most advanced processes. Interfaces with various cross functional teams (RF, Analog and Digital IC designers, Software, System Engineering, Test Engineers, Customer Engineering, and Operations) to drive and incorporate the latest design solutions in the production program to improve yield, productivity, and quality.IT Core Competencies N/ARequired Competencies (All competencies below are required upon entry) Analytical Skills - The ability to collect information and identify fundamental patterns/trends in data. This includes the ability to gather, integrate, and interpret information from several sources. Building Trusting Relationships - The ability to build trusting, collaborative relationships and rapport with different types of people and businesses. This includes delivering on commitments and maintaining confidential information, as well as being approachable, showing interest in the other person, and relating well to people regardless of personality or background. Communication - The ability to convey information clearly and accurately, as well as choosing the most effective method of delivery (e.g., email, phone, face-to-face). This includes using a technically sound communication style both verbally and in writing. Creating the New and Different - The ability to be creative. This includes the ability to produce breakthrough ideas, being a visionary, managing innovation, seeing multiple futures, having broad interests and knowledge, and gaining support in order to translate new ideas into solutions. This also includes the ability to plan and implement unconventional ideas and speculate about alternative futures without all of the data. Decision Making - The ability to make quick, accurate decisions. This includes the ability to weigh alternatives and take into account the impact of the decisions on people, equipment, or other resources. Documentation - The ability to appropriately document software and/or hardware specifications and processes to promote knowledge transfer to other engineers. Getting Work Done - The ability to be organized, resourceful, and planful. This includes the ability to leverage multiple resources to get things done and lay out tasks in sufficient detail. This also includes the ability to get things done with fewer resources and in less time, work on multiple tasks at once without losing track, and foresee and plan around obstacles. Hardware Design - Knowledge of and the ability to understand advanced or complex hardware design elements in order to carry out designs, upgrades, and technology roadmaps. Project Management - The ability to use organizational skills for purposes of planning and decision-making. This includes developing and communicating objectives, timelines, assignments, and goals. This also includes the ability to scope projects, orchestrate multiple activities at once, and use resources efficiently across functional areas within the enterprise.Additional Competencies N/AMinimum Qualifications Bachelor's degree in Engineering, Information Systems, Computer Science, or related field. 2+ years Hardware Engineering experience or related work experience.Preferred Qualifications 4+ years Hardware Engineering experience or related work experience. 2+ years experience with circuit design (e.g., digital, analog, RF). 2+ years experience utilizing schematic capture and circuit simulation software. 2+ years experience with hardware design and measurement instruments such as oscilloscopes, spectrum analyzers, RF tools, etc.Physical Requirements Frequently transports between offices, buildings, and campuses up to mile. Frequently transports and installs equipment up to 5 lbs. Performs required tasks at various heights (e.g., standing or sitting). Monitors and utilizes computers and test equipment for more than 6 hours a day. Continuous communication which includes the comprehension of information with colleagues, customers, and vendors both in person and remotely.Applicants: If you are an individual with a disability and need an accommodation during the application/hiring process, please call Qualcomm's toll-free number found here for assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities to be able participate in the hiring process. Qualcomm is also committed to making our workplace accessible for individuals with disabilities. Qualcomm is an equal opportunity employer and supports workforce diversity.To all Staffing and Recruiting Agencies:Our Careers Site is only for individuals seeking a job at Qual..."}