{"title":"Web or Full Stack Software Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJJHblHTBRVsRwJOg0FoHQ_WpegIjopT6w_91ybaAbs8My0cZlN58Ui7e9ooxix5lojM3KF4qzQ8EEIjBT4ia3ywVROpzJL8eXUpiTwEVzOEjqyUZyne2zSzZisEQa7p1mo5afYbICfyZXrOorQgeScKOXr6h0hCxqd34exbERPgkY6akQo8ChDBkj9Ww","source":"ziprecruiter","full_description":"Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.As a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience.*This is a remote/office based position which may be performed anywhere in the United States except for within the state of Colorado.Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.Front End or Full Stack Software Engineer***Are you passionate about software development and problem solving? Self-motivated and eager to learn new skills and technologies? Do you want the benefits and stability of a large company but the culture and agility of a small team? If so, this role might be for you.We re looking for a full-time generalist software developer to augment our innovation team. We build fully functional, integrated demonstrations of our Customer Experience product portfolio - as well as simulated presentations - to highlight product capabilities to audiences and stakeholders. These include potential high-value Oracle clients, conference and event attendees, our C-level executives, and major industry analysts. Our work products have made national headlines and regularly have positive impact on revenue for our entire organization. We operate at a fast pace in an Agile framework without the heavy burden of cumbersome release management procedures and change management overhead. Work/life balance is maintained by our dedicated management team, and our projects are typically creative and always engaging.We work extensively with HTML/CSS and JavaScript, both on the server side (Node.js/Express) and in the browser (plain JS, React). We also work with Swift/ObjC for iOS development, Python, and occasionally Java, as well as Oracle's suite of CX Cloud products.Work full-time from home or at any of our campuses in the continental United States - your choice. Minimal travel - we try get together once or twice a year to team build, and professional training opportunities or events are sometimes available to attend as well.Apply today for this challenging role, building innovative technical demonstrations with visibility at the highest levels of Oracle and the customer experience industry./As part of Oracle s employment process candidates will be required to complete a pre-employment screening process, after a conditional offer has been extended./* **Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.***Job:** **Product Development***Organization:** **Oracle***Title:** *Web or Full Stack Software Developer***Location:** *United States***Requisition ID:** 200016DR"}