{"title":"Medical Sales Representative NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALG19kGbCJunyWo-ydw3l0rQUzGmCt8aKQkD9VXRmz1Cjxd_jYYJudeOVDINuwfZRyYKV6MB4xnnLA63KPrHOaZvhG7qPnf3ywVZdkFcisItTxBbiLb-ZXGOivTKrcMpa9Vr35DsGCjX5ngKmPzzsZ_TdNke5JhRYNqOs14_csjxAfwBA4KFSrb7ufT6a4K","source":"ziprecruiter","full_description":"Base Salary $40K - $45K, total comp at plan first year $80K - $120K. Uncapped commissions which makes your total comp the investment you put in the position.Leading medical/surgical products distributor is seeking a full-time field sales representative for the Central and Eastern North Carolina and surrounding territory. This position requires an experienced sales person who can, not only sell products but also, recognize new opportunities with both new and existing customers. Preferred candidate would have a documented success history selling in the following areas: Operating room, inpatient pharmacy and/or compounding pharmacies, ambulatory surgery centers, and/or IV Therapy. The ideal candidate must be self-motivated and have a strong proven sales record with solid relationship skills.The Company offers a Base salary, an uncapped commission program, defined and protected territories, approved expenses, car allowance, insurance benefits package and 401(k). Your success will be measured by your ability to meet sales quotas, attract new accounts and build relationships. This is a phenomenal opportunity in the medical sales industry with an innovative and dynamic leading company. If you meet the above criteria and are looking for a new position with an outstanding organization, please apply as directed. Only qualified candidates meeting the above criteria will be notified.The top reasons why the best reps want to work for Progressive Medical, Inc:1. Financially rewarding.2. Comprehensive Sales Support team.3. Support from a fully staffed Customer Service Department who processes all sales orders, completes all pricing quotes, and generates agreements/contracts.4. Monthly sales tracings and detailed sales reports.5. Active on most GPO's and IDN's.6. Uncapped commission plan with quarterly bonus program.7. Nationwide exclusivity agreements with most manufacturers.8. Well qualified sales leads, generated by Sales Support/Marketing team and National Conventions.9. State-of-the-art Customer Relationship Management (CRM) database system.10. 6,000+ Active Accounts.11. Well diversified and balanced product portfolio.12. Simple, successful commission/compensation plan."}