{"title":"Media Facilities Technical Specialist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI6uS_t6NLBrxvcS1y3L5Hscg67FLOTOs6FhLpsK2U-CQFiw0TLfvqvHqofSktSbTCxelFCaRfMIphJUeC6qVEOIdNWy0sKnQ1A02BSe5QD-2Dyajv6k8yjzuLWrWu37IvuKssAGZh7efhNxe8PRx_lgNtUnIpLEN4p08pfpJqt_Vd9PS1reW-QG6aY7uCA","source":"ziprecruiter","full_description":"NYU Langone Health is a world-class, patient-centered, integrated academic medical center, known for its excellence in clinical care, research, and education. It comprises more than 200 locations throughout the New York area, including five inpatient locations, a children's hospital, three emergency rooms and a level 1 trauma center. Also part of NYU Langone Health is the Laura and Isaac Perlmutter Cancer Center, a National Cancer Institute designated comprehensive cancer center, and NYU Grossman School of Medicine, which since 1841 has trained thousands of physicians and scientists who have helped to shape the course of medical history. For more information, go to nyulangone.org, and interact with us on LinkedIn, Glassdoor, Indeed, Facebook, Twitter, YouTube and Instagram.Position Summary:We have an exciting opportunity to join our team as a Media Facilities Technical Specialist.  In this role, the successful candidate Responsible for all aspects of audio visual, video conferencing, unified communications and collaboration equipment and systems used throughout the Medical Center. Responsible for all A/V operations support for the Undergraduate Medical Education department school schedule, class lecture captures as well as other events.Job Responsibilities:Be compliant with all responsibilities and administrative tasks: Innotas, timely journal entries, use of standard email templates, etc.Perform newly built or refreshed room check-outs by going through checklist troubleshooting and reporting room issues with functionality. Work closely with the Unified Communications, and Infrastructure Collaboration teams on new rollouts, refreshes, etc. to ensure proper support hand offMonitor the assigned desktop queue(s) in the Front Range ticket system. Log real time written journal entries documenting actions taken on all ticket requests. Close tickets within established service levels.Demonstrate an ability to communicate technical terms, MCIT policies, and difficult messages to end users in a service oriented fashion.Perform diagnostic checks on audio visual equipment. Ensure all AV equipment is fully operational, repair or clean equipment when necessary and break-down, remove, and secure equipment when not in use.Set-up and perform complex troubleshooting for all AV/projection/lighting/conferencing equipment, devices, and systems, when needed. Use judgment based on technical expertise while troubleshooting and performing diagnostic checks and independently implements solutions.Assists and provides one-on-one instructions/training/guidance to clients regarding proper usage and operation of AV equipment and monitor equipment operation at appropriate intervals. Responsible for creation and maintenance of written documentation on problem solutions, tool configurations and end user documentation.Staff and operate the Audio Visual, video conference and computing equipment for classes and special events, including set up, configuration, recording and testing lecture captures; class and event scheduling. Review daily event schedules and coordinate accordingly. Handle student lecture capture and uploads.Responsible for the setup, installation, maintenance and support of audio visual systems and equipment. Supported components include but not limited to: A/V rack systems, codecs, Audio Mixers, Control Systems, A/V Automation, Wiring, Amplifiers, Microphones, Projection systems, Video Cameras and other peripheral equipment. Crestron, AMX, VoIP Video and Telephony, Call Manager (CUCM), Cisco TelePresence (Acano/Tandberg/Codian), ClearOne, and WebEx CMR, Cisco TCS, Cisco Unified Communications products,Epiphan, Vbrick, Meeting Room Manager, ALEX, Webex, Meeting 2.0, Cisco Jabber, Spark.Perform other duties as required.Additional Position Specific Responsibilities:Contributes individually with minimal supervision and as part of a team.Minimum Qualifications:To qualify you must have a BA/BS degree with 5 or more years of related experience. Requires an in-depth knowledge of Audio Visual and Video Conferencing equipment/systems, personal computing, MAC and Windows PC/Workstation based LAN systems. Excellent consultative and communication skills, analytical ability, decisiveness, strong judgment, and the ability to work effectively with clients, IT management, staff and vendors. Must have excellent interpersonal skills, and ability to understand the business and technical needs of the client as well as foster customer relationship building and deliver outstanding customer service.Strong verbal and written communication skills; ability to communicate technical information to non-technical users; ability to work effectively with customers.Candidate should be able to work in a fast paced environment, support multiple initiatives simultaneously, prioritize work to meet and or exceed established service levels and be dependable. Strong time management, technical and analytical skills required. Ability to think logically and creatively in problem solving.Preferred Qualifications:Familiarity with Front Range ticketing system and Microsoft Outlook a plus. Work experience in healthcare and/or education or equivalent experience in complex organizations.Qualified candidates must be able to effectively communicate with all levels of the organization.NYU Langone Health provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you'll feel good about devoting your time and your talents.NYU Langone Health is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sex, sexual orientation, transgender status, gender dysphoria, national origin, age, religion, disability, military and veteran status, marital or parental status, citizenship status, genetic information or any other factor which cannot lawfully be used as a basis for an employment decision. We require applications to be completed online. If you wish to view NYU Langone Health's EEO policies, please click here. Please click here to view the Federal \"EEO is the law\" poster or visit https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm for more information. To view the Pay Transparency Notice, please click here.Required SkillsRequired Experience"}