{"title":"High Voltage Connecter Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIWKXqMaBNV7s1PXvVw3DXy-x8m6kBmFSgfQ-mY34QkSeicbvUwDoslonmg9HJ46R5kfeImDtTkUYMKX0R3e0CbAwB_4yAo7CSsA3mw0MMDwBH22R03MZkAKm9QqNbPJiWfgdUBBpqNQx50yPvEzhztzBKwJhEwcPTwNhPnutLVMV3uQzptC5WBx6Q-jrGz","source":"ziprecruiter","full_description":"Title: High Voltage Connecter EngineerJob ID: 21-00215 - 12651772 Location: Southfield, MIPay Rate: OpenAdditional Benefits: Health, Dental, Vision, 401(k), company paid holidays and more!Type of hire: DirectPosition Summary:Reporting to the Manager of Product Development, the Senior Product Engineer (connectors) will be responsible for managing the 3D model development (30% of day) along with 2D print development and library release (25% of day) lab validation support (20%).Position Responsibilities:Leads the engineering activity for assigned programs to ensure that products meet customer and Company specifications and that program milestones are achieved.Responsible for coordinating and monitoring the engineering process and for providing direction as required.Will typically be responsible for managing or leading a group of support engineers.This role will emphasize on high voltage connector development to implement roadmap deliverables. Regular communication with customers, vendors and global engineering teams is expected.Position Requirements:Knowledge of Connector Industry Design Criteria (both low and high voltage)Self-motivated communicatorsInformation sharingAble to work within a diverse global team with varying levels of experience.Able to mentor Jr. EngineersKnowledge of CAD (CATIA V5, Solidworks, UG); Able to use CAD as a design review tool at a minimumLead a team composed of designers and lab technicians to the desired project design goals.Able to follow APQP processes for project documentation. Position Preferences:A background in metallurgy CATIA V5 design experience"}