{"title":"Android Engineer, Orders Experiences - Checkout NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ9GCRb8RAgTCjffUhCJ5dN91LbW9MPUhq5BsO2PnTR-tJu_TKlE2w40g5BsPVPlOPrkfhWNxl2zYk6JWJovzYEVwEumdjIulGrFW7dYrj9i7HafvqSQspDVM8rFLii5MlOiTEft9qWufPjckmAK7cKhEOtoR2E7p59f8xVy1i5mVtwY48ZQUzB3NYBnuQN","source":"ziprecruiter","full_description":"Company Description  Square builds common business tools in unconventional ways so more people can start, run, and grow their businesses. When Square started, it was difficult and expensive (or just plain impossible) for some businesses to take credit cards. Square made credit card payments possible for all by turning a mobile phone into a credit card reader. Since then Square has been building an entire business toolkit of both hardware and software products including Square Capital, Square Terminal, Square Payroll, and more. We're working to find new and better ways to help businesses succeed on their own terms-and we're looking for people like you to help shape tomorrow at Square.  Job Description The Checkout team owns the shared mobile checkout experience shipped within our various Point of Sale mobile products. If you've ever purchased a product in person at a business that uses Square, you've interacted with the mission critical flow that we own! We're focused on delivering a best-in-class checkout experience to Square Sellers and their customers, while also collaborating internally with robust mobile APIs for building specialized new experiences and features. We work closely with various partner teams from across the company and are the drivers for many high leverage initiatives that push the Square product ecosystem forward.As an Android engineer on the Checkout team, you'll help design, build, and maintain our best-in-class Checkout experience for Square Sellers and collaborating closely with engineers, product managers, and designers from across the company.You will:Build innovative new features that improve critical merchant and customer experiences.Collaborate with other Android, iOS, and Server engineers from across the organization.Work closely with product managers and designers to help shape and refine the mobile checkout experience.Hold yourself and your team to the highest standard of engineering excellence and prioritize quality over quantity.Help shape the future of our codebase by building flexible, extendable, and reusable components. Qualifications You have:4+ years of industry experience, preferably with a B.S. or equivalent.Proficiency in native Android development using standard tools and frameworks.Proficiency in Kotlin and/or Java (we use a mix of both).A passion for building mobile products at all levels - from the low level architectural decisions to the individual pixels and overall product experience.An innate desire to build mission critical products that our merchants will depend on every day to successfully run their business. Additional Information At Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)squareup.com. We will treat your request as confidentially as possible. In your email, please include your name and preferred method of contact, and we will respond as soon as possible.PerksAt Square, we want you to be well and thrive. Our global benefits package includes:Healthcare coverageRetirement PlansEmployee Stock Purchase ProgramWellness perksPaid parental leavePaid time offLearning and Development resourcesQualifications: You have: 4+ years of industry experience, preferably with a B.S. or equivalent. Proficiency in native Android development using standard tools and frameworks. Proficiency in Kotlin and/or Java (we use a mix of both). A passion for building mobile products at all levels - from the low level architectural decisions to the individual pixels and overall product experience. An innate desire to build mission critical products that our merchants will depend on every day to successfully run their business.Responsibilities: The Checkout team owns the shared mobile checkout experience shipped within our various Point of Sale mobile products. If you've ever purchased a product in person at a business that uses Square, you've interacted with the mission critical flow that we own! We're focused on delivering a best-in-class checkout experience to Square Sellers and their customers, while also collaborating internally with robust mobile APIs for building specialized new experiences and features. We work closely with various partner teams from across the company and are the drivers for many high leverage initiatives that push the Square product ecosystem forward. As an Android engineer on the Checkout team, you'll help design, build, and maintain our best-in-class Checkout experience for Square Sellers and collaborating closely with engineers, product managers, and designers from across the company. You will: Build innovative new features that improve critical merchant and customer experiences. Collaborate with other Android, iOS, and Server engineers from across the organization. Work closely with product managers and designers to help shape and refine the mobile checkout experience. Hold yourself and your team to the highest standard of engineering excellence and prioritize quality over quantity. Help shape the future of our codebase by building flexible, extendable, and reusable components."}