{"title":"Mobile Application Developer/Programmer Analyst","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIrpC66G2M11Z_GII9ExkFfiESkYkULTen3Fqa3UMKDFArg5TmshgmlblPqnA4VyYIvOU_zFlJgoxbtIrHKx0k8oZnadSjGLcL2Y1KiBNHlzWJpqstcPJk_-DPXreawWCdDMf1IKLqaXQX29d3MtPMJT-76vCnQcaVlT71i0I5HmfWmwLAICvfYtjspAKEZ","source":"ziprecruiter","full_description":"Overview  FORUM's primary mission can be summed up in one simple, yet sincere statement:Helping Members Live Their Financial Dreams. Voted Best Places to Work in Indiana for the past eight years, FORUM is dedicated to enriching the lives of our employees so we can in turn enrich the lives of our members.   FORUM Credit Union is seeking a Mobile Application Developer to develop, maintain and continuously improve mobile applications. The apps being developed for Android and iOS will integrate with the company's systems to deliver products and services on mobile devices. This is a great opportunity to bring your mobile application skills into a dynamic environment focused on delivering business value. Responsibilities As a Mobile Developer, a typical day might include the following:Working as part of a team in the development and support of applications.Creating and maintaining mobile applications on both iOS and Android.Working as part of a team in creating and maintaining supporting back-end systems and APIs.Working on components of large applications or entire applications for smaller projects.Gaining an understanding of new and existing product offerings and processes and creating technical support documentation.Performing necessary maintenance and upgrades to new and existing product offerings and supporting systems.Prioritizing tasks and technical issues during all phases of software development and communicating them to the team in an efficient manner using issue and bug tracking tools.  This job might be for you if:Possess strong knowledge of developing cross-platform and native mobile applications using .NET/C# and Xamarin.Understand common software engineering and design practices. Enjoy staying current with the latest software engineering methodologies, design patterns, practices, and technologies. Attention to detail and a high level of comprehension and problem-solving skills.Ability to prioritize tasks and technical issues during all phases of software development and communicate to the team using issue and bug tracking tools.Possess a high level of customer service and interpersonal skills. Qualifications What we are looking for:Equivalent to a college degree (BS or BA) in a relevant fieldThree years to five years of similar or related professional experienceExperience/knowledge of native and cross-platform mobile application development in both iOS and AndroidExperience with Microsoft products including Visual Studio.NET, MS SQL Server and IIS.Programming knowledge including asynchronous programming, HTML, JavaScript, C#, XML, SQL, LINQ, ASP.NET, .NET Core, and Xamarin.Experience developing and debugging web applications, mobile applications, web services, and database centric applicationsExperience with object-oriented programming patterns and practicesExperience with relational database design and related toolsExperience with scripting and automation tools.Experience with source control management toolsWillingness to be available and work such hours per day or per week as the credit union determines to meet business needs (i.e. hours, weekends, holidays, etc.) Willingness to travel to such locations with some frequency as the credit union determines is necessary or desirable to meet business needs.What we offer: Competitive industry pay Award winning training and developmentComprehensive benefits package FORUM Credit Union is a full service financial institution offering 13 convenient branch locations in the Indianapolis area. We were formed in 1941 and have since experienced tremendous growth by offering innovative services and considering our members' needs as top priority. The Credit Union began with volunteers, and that same volunteer spirit exists today as we strive to help members better their financial lives.FORUM Credit Union provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics."}