{"title":"Field Service Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI9Y32cPFEUeWMfm-0iA88Xdw8w-0XfSaR8a8iLjO2Y2S2zh7-oruaJvcUSglmXxVjmvgbgD5mVOJMMdo5ZTCFMGx_8ZHUSOmPmMDfz7Yx0V6CCITAvev3_5QFlbFg4gkB5a7rUEUqsIR6-pbcNvmtCOY_LkuB0mb_8OwmbQ1a6GRecPi9JQKyufoUy2_aD","source":"ziprecruiter","full_description":"\\#Indeed Grifols has been a leader in the healthcare industry since 1909 by creating innovative products and services based on the values of ethics, quality and responsibility. Grifols' activities focus on fulfilling the needs of its patients as well as healthcare professionals working in therapeutics, pharmacy, diagnostics and blood banking. For more than 100 years, Grifols has developed, manufactured and marketed product designed to improve human health. Grifols manufactures plasma derived biopharmaceutical products of proven efficacy, quality and safety. For more information, please visit our website: http://www.grifols.com Position Overview: The Field Service Engineer I Grifols Diagnostic Solutions Global Service & Training organization has the primary responsibility of providing the highest quality service and support to Grifols customers at the customer facility and by telephone. Job responsibilities include but are not limited to the following:  Compliance - Adhere to procedures and protocols outlined by the Grifols GST organization and Grifols Diagnostic Solutions  Customer Service - Respond to customer inquiries and complaints, participate in customer site evaluations, upgrades of hardware and/or software, product installations, preventive maintenance, and ongoing service and support for all equipment at the customer facility and via telephone. Documentation of activities within CRM system  Escalation of Customer Needs - openly communicate with other groups within Grifols to assure rapid resolution of issues raised by customers  Projects - will communicate integrally with Global Service and Training (GS&T) and Account Managers regarding product performance, participation in development teams and process development and improvements  Personal Development - The FSE will continue personal development to enhance their skills, including but not limited to: Presentation Skills. Communication Skills  Additional Responsibilities include but are not limited to: May perform other duties as assigned by the Manager or Supervisor; Document translation & verification; Root cause analysis; Identify and make recommendations for improvements to products, functions, and processes Key Performance Indicators / Measures for Success:  Internal Training and corporate training will be completed on time 98% of the time  PMs 100% on time * Documentation of activity within 24 hours of occurrence; SR activities resolved within 3 days of completion of work. SR rework to be completed within 3 days of notification.  Total Service Cost/Instrument - Labor, Parts, Travel  FSE Time per Service Request (Labor Hours)  Mean Time Between Failure (MTBF)  Invalid Runs, Invalid Samples, RUF (Reagent utilization Factor)  MTTR  Repeat/Return Calls  Call closure rates - as defined in individual goals & objectives each year.  Customer satisfaction Skills/Qualifications/Education: (To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skills, education, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions). + Bachelor's Degree, Engineering, Technical or related Scientific Discipline, Equivalent Military education or Associates Degree with 2 years' experience or High School Diploma/GED with 4+ years' experience servicing electronic/electro-mechanical equipment + Entry: If candidate has a degree, no previous experience in operating diagnostics equipment in a laboratory environment required. Otherwise, please see Education requirements for additional experience required + Excellent organizational, record keeping and inventory skills required + Knowledge of GMP, ISO and other certifying agency policies and regulations + Proficient with Microsoft applications and familiar with computerized call handling systems + Excellent analytical and troubleshooting skills + Self-motivated and self-directed, with strong interpersonal and communication skills, and the ability to communicate technical information effectively + ***Customer Focus + Is dedicated to meeting the expectations and requirements of internal and external customers; gets first-hand customer information and uses it for improvements in products and services; acts with customers in mind; establishes and maintains effective relationships with customers and gains their trust and respect.  + ***Intellectual Horsepower + Is bright and intelligent; deals with concepts and complexity comfortably; described as intellectually sharp, capable, and agile. + ***Composure + Is cool under pressure; does not become defensive or irritated when times are tough; is considered mature; can be counted on to hold things together during tough times; can handle stress; is not knocked off balance by the unexpected; doesn't show frustration when resisted or blocked; is a settling influence in a crisis. + Depending on the area of assignment, directly related experience or a combination of directly related education and experience and/or competencies may be considered in place of the stated requirements. Example: If a job level typically requires an Associate's degree plus 2 years of experience, an equivalent could include 4 years of experience or a Bachelor's degree. Position will be based in the field with up to 70% travel required. Candidate must have ability to travel outside assigned geographic area. As needed, will cover additional geographic regions to facilitate significant service requirement of customer base. * Work hours are flexible, not conforming to a standard 40 hour work week; Overtime will be required. Candidate must be accessible for contact by phone and cover rotations for weekend/holiday on-call. Candidates will work from a home office. * Ability to lift up to 50 lbs as an essential function of the role (lifting of equipment for installation and preventative maintenance.) EEO Minorities/Females/Veterans Req ID: 189488"}