{"title":"Digital Hardware Design Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALGE5vZOAnDunKTeSp9O8CAVCL__ISeDHmY1m6Eb6yxPOipeTB8k4Bua8qQgMjqQx29EdkHey6j6lUuHotu7JnwX-UM-gnwTrNISVQFOrYpVrTwEDkgelgJk0-R4odc-btTpWDo_lcPIk2HhxEn7Hv1h6QD_0IenNuCTk8U9GsfUQIdJqUwjhiKm5YT9TEe","source":"ziprecruiter","full_description":"Please Note: US citizenship or permanent residency is required for this position.At CesiumAstro, we are developers and pioneers of out-of-the-box communication systems for satellites, UAVs, launch vehicles, and other space and airborne platforms. We take pride in our dynamic and cross-functional work environment, which allows us to learn, develop, and engage across our organization. If you are looking for hands-on, interactive, and autonomous work, CesiumAstro is the place for you. We are actively seeking passionate, collaborative, energetic, and forward-thinking individuals to join our team. Learn more about our company at https://www.cesiumastro.com.We are looking to add a Board-Level Hardware Design Engineer to our team. If you are great at what you do, enjoy working in a startup environment, and are passionate about developing leading-edge hardware for satellites, spacecraft, and aerospace systems, we would like to hear from you.In this position, you will be responsible for high-speed digital electronic designs, including products based on processors, FPGAs, and GPUs, through all phases of the development process. Projects will include software-defined radios, single-board computers, microcontroller circuits, and high-speed (10Gbps+) serial communications.As a Cesium hardware team member, you will be responsible for major components of hardware product design from initial concept through requirements definition, part selection, detailed design, analysis, manufacturing, testing, qualification, and in-orbit support of Cesium's products. Hardware design tasks will include roadmap planning, block diagrams, schematics, PCB layout and routing, analyses (e.g. signal integrity, failure method), testing, and qualification.The successful candidate will also present engineering design review materials to our customers and executive team, as well as participate in proposal-writing efforts. As such, excellent written and verbal communication skills are required.We provide a generous benefits and stock option package to all our employees.Successful candidates will require, as a minimum:Bachelor of Science (BS) or Master of Science (MS) degree in Electrical Engineering or Computer Engineering from an accredited university.Minimum of 1 year of industry or university research experience in high-speed electronics design, analysis, test, and troubleshooting. More experienced candidates are also encouraged to apply.Proficiency in electronics design (EDA) tools such as Altium.Experience with high-speed PCB layout.Experience with signal integrity simulation tools such as Ansys or ADS.Hands-on experience with lab instruments such as oscilloscopes, spectrum analyzers, electronic loads, and signal generators.Excellent written and verbal communication skills.Preferred experience includes:Aerospace electronics design, development, and qualification.Worst-case circuit analysis, failure method and criticality analyses, and reliability analysis.Programming (C/C++, Python, MATLAB, etc.).EMI/EMC design and mitigation techniques.CesiumAstro is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}