{"title":"Senior DevOps Engineer (Remote)","location":"","salary":"","description":"","term":"$120,000 to $150,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIRJ0ekWB39hn73rkb8EGLYsM9Q2UtSPfcwEfrZ9g-2zlGSr9-guIE6dTwvgMwUNa4Rtw6jbzTcoRrH-_URvKMUHQImwYZs0H3UwH3lESoJHAXab1YWIhq-furBz_v9s4NNgY9rTfjRRv4acPX9LSq0XRBK1ZZxt7khXrezyB-OT6N9S5qjPFTPl7JNPIzS","source":"ziprecruiter","full_description":"Senior DevOps Engineer (Remote) --Remote--Job Title: Senior DevOps EngineerJob Location: RemoteRequirements: 5-10+ years experience - DevOps, Docker, Kubernetes, AWS (or GCP/Azure)We are a leading provider of secure SDI & IP audio/video routing and streaming solutions, we offer a wide selection of products to support SDI solutions as well as new and exciting secure IP solution sets. We offer FIPS encrypted A/V over IP using our award winning iCS control system. We support Gov, Military and Pro A/V corporations where secure A/V is a must.We are looking to add a Senior Devops Engineer to containerize our existing applications, deploy to a kubernetes cluster, and maintain it in a cloud environment. This person will collaborate with embedded and hardware engineers for development of new products related to containerizing and deploying.Top Reasons to Work with Us- Competitive Salary ($120k - $150k)- Remote- Join a very well funded/stable company with exciting projects- Full Benefits (health, dental, vision, etc.)- 401k- Casual work environmentWhat You Need for this Position- 5-10+ years professional experience - Docker- Kubernetes- Cloud platform such as AWS, Azure, or GCP- C++ (or Java / RUST)- REST/APIs- Linux- BS in CS (or related)So, if you are a Senior DevOps Engineer (Remote) with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}