{"title":"Sales Engineer - AMERICAN Flow Control (Birmingham, AL)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKHIu53fangfiFvEFzkvTXCEwdEgIirE1Na3uQZrwgYPcbf9VyzCMhY45HSe651LB6oSwPJYZ9vKkzskiJie-nQECE4NEmR40Y6jhzsoEhs46d4nlTFPtKahP-kw2jz2lGMN7N_D86NV3Ga43riMp5nQLz8x_P7Gffutx_TIrgZIybsxkMitbJ5mD5xbUhu","source":"ziprecruiter","full_description":"This individual is responsible for the promotion and sale of Valve Division products to all water and sewer markets in assigned territory. This individual is responsible for planning, marketing and sales within the designated territory for products and divisions represented. They develop positive, long-term relationship with owners, engineers, and contractors that lead to beneficial results and repeated exclusive buying practices toward AMERICAN. Coordinates with and keeps abreast of marketing and sales activities within assigned territory.Price authority for standard products for sale to distributors and direct sale to utilities within guidelines established by direct supervisor. Duties include, but are not limited to, promotional calls and specification development with water and sewer authorities and consulting engineering firms; managing of or supporting of distributors in territory; and intensive coverage of assigned territory and resolving product complaints. Spends about 75% of time in field (as opposed to office time).Establishes and develops long-term relationships with owners and engineers to ensure that AMERICAN products are being properly specified in a way that gives AMERICAN a competitive advantage.Establishes and develops long-term influential relationships with consulting engineers associated with the specification process of AFC products at the municipal and/or private utility level.Establishes and develops long-term relationships with contractors that work toward exclusive buying practices with AMERICAN.Establishes and develops loyal, long-term, influential relationships with key decision makers at municipalities, engineering firms, water and sewer authorities, private utility companies, and/or distributors.Develops and maintains relationships with key individuals who can influence the purchasing or approving of our products.Works with distributors to develop a TEAM concept between distributor and AFC.Sets up and supports new or existing stocking distributors within a territory.Develops and maintains working relationship with distributors.Develops Marketing Channels by working with distributors to develop a TEAM concept between the distributor and AFC.Maintains knowledge of sales territory and keeps management informed of market activity.Promotes all products in AFC's product line.Promotes AFC by establishing goals, which foster the expansion of sales and market share, as well as the development of relationships with key individuals and organizations.Coordinates manufacturing/engineering/crating/shipment efforts for industrial export orders with letters of credit and domestic industrial orders. Introduces other sales personnel to industrial customer base.Prepares accurate, timely quotations that will positively impact sales.Provides customer service by responding timely to all calls, checking e-mail, coordinating and checking orders, expediting shipments, addressing special pricing concerns, providing special pricing when necessary, providing literature, furnishing and coordinating quotes with other AMERICAN sales personnel as necessary, and reviewing and writing specs to our customers.Resolves product complaints and performs repair work as needed in the field.Establishes long-term sales and marketing goals in territory and works to meet those goals.Enhances personal sales skills by developing effective listening habits, speaking skills, presentation skills, negotiation techniques, and closing skills that will help one to be sensitive and responsive to customer needs.Maintains political, administrative and international lending institutions' contacts to enhance AMERICAN ability to compete in the international market.Keeps and maintains accurate records and furnishes activity/call reports, itineraries, expense reports, sales correspondence and other necessary communication to Division/Assistant/Area Manager, customer service, secretary, etc. at required times.Compiles timely, accurate and informative quotations for line and treatment plant projects, and actively follows projects to secure orders.Maintains company equipment and image.Keeps work area clean and orderly. Knows safety rules that apply to the safety of others and to personal safety. Reports malfunction of equipment to proper authority. Performs other work as instructed by supervision.Miscellaneous responsibilities.MINIMUM QUALIFICATIONSMust possess a B. S. Degree in engineering from an accredited four-year college or university. Proof of transcript is required.Must exhibit the ability to learn. Weight will be given to grades, Sales courses and work experience.Must exhibit punctuality and good attendance.Must be physically able to perform the essential functions of the job, with or without reasonable accommodations.Must possess a valid driver's license.Must exhibit good oral and written communication skills.Must be able to read and interpret specifications for projects involving our products.Must be subject to transfer within the continental United States.Must exhibit the knowledge, skills, and ability to perform the job duties.Subject to departmental transfer to other engineering positions within the Sales Division (ADIP, AFC, Steel Pipe, International Sales, etc.).Must exhibit the ability to work with confidential information and maintain confidentiality.Must exhibit a working knowledge of word processing, spreadsheet, and presentation software such as Word, Excel, PowerPoint, etc.Must be able to work overtime on weekdays and/or weekends as required to fulfill job duties.Must be available to travel a minimum of 60% of the time. More travel may be required depending on sales territory.PREFERRED QUALIFICATIONS:Experience in technical and communication skills.Familiar with AMERiCAN's manufacturing process.ESSENTIAL PHYSICAL FUNCTIONS: Sitting at a desk, in car, and occasionally on plane. Standing and walking on various surfaces, some uneven depending on job site. Climbing stairs, ladders, and balancing required, depending on job site. Stooping, kneeling, and crouching required, depending on job site. Crawling required to check joint separation, quality, etc. Overhead reach required depending on job site. Forward reach required for desk activities and at job site, depending on each assignment. Bended reach required for filing and some activities at job site. Handling required for phone use, files, carrying briefcase, positioning equipment, etc. Use of fingers required to use tools, scales, digital phone, writing, leafing through sales brochures, etc. Feeling required to check for quality, pipe cracks, temperature (gasket problems), etc. Talking essential for phone, person to person with engineers and customers, giving and receiving instruction, pricing, etc. Vision required to ensure quality, check blueprints, etc. Hearing required for quality and safety. Lifting required for plans, briefcase, sales brochures, valve and hydrant parts, fittings, and product demo equipment that can weigh up to 80 pounds. Carrying files, briefcase, plans, specifications, calculators, sales brochures, binders, up to 25 pound maximum. Pushing and pulling drawers, doors, equipment, up to a maximum of 25 pound force.EOE/VETS/DISABILITY"}