{"title":"Sales Representative NO COLD CALLING ( COMPETITIVE 18 WEEK NON - RECOVERABLE DRAW + PAID TRAINING )","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKI-_49gQ3d9aY9dADGV3ZkskYF-hFTfycodGO8DIt_hGx1XizxdNrWRI-uHoJXwuu_HbLLcEH5EUulnE_KXpNPmRSVk94_f0S1wqjeoTyhWJ3PeKyKouqX52bdVxjx5yDD81RyZluqCAuIevEm-0Oh7R2z3g-JIoYgvMEmh7LOHb5rFh-34LAKyFsn5SvT","source":"ziprecruiter","full_description":"Sales Representative (NO COLD CALLING) What if you didn’t have to sell the brand, just our amazing product line, in addition to no cold calling and pre-qualified leads. That’s what it’s like to sell for Renewal by Andersen Windows and Doors (National Window and Door Company). Renewal by Andersen is united by the common goal of making a difference in the lives of our homeowners, our colleagues, our families, and in the communities we serve. We believe that we can make the world a better place by living up to the promise that everyone benefits from their association with Andersen. Renewal by Andersen is looking for an accomplished, driven, and collaborative candidate to help perfect our customer’s experience in upgrading their homes. Want to join our team? Primary Job Location: Greater Washington, DC/Baltimore and Surrounding Area PURPOSE: We are looking for talented individuals who can help fuel our dynamic growth and have successful selling experience with a consultative style. We want you to have the ability to build trust and rapport with customers quickly, display drive and motivation for top results, and have the desire to be a part of a highly energized team that thrives on success and excellent customer experiences! WHY WE’RE DIFFERENT Lead Generation No cold calling! Your leads are pre-set and pre - qualified Compensation Competitive Non - Recoverable Draw $2000 per week for 18 WEEKS!!!!!! Pay for performance is a salesperson’s greatest compensation motivator! Our compensation plans reward solid performance with a strong non recoverable draw + commission Typical first year income is between $100,000 - $200,000 Paid Training (Five Weeks) + Vehicle Allowance and Mileage Reimbursement Monthly Electronic Technology Stipend (Cell Phone and IPAD/Tablet) Learning and Development The first five weeks are spent in the classroom learning our extensive product offerings and proven sales methodology along with running appointments in the field. Our Sales Training Managers and Sales Managers will be by your side coaching you to build the skills and confidence you need in order to get the results you strive for! Responsibilities: Meeting or exceeding individual and sales team goals Follow established Renewal sales processes through to completion Through knowledge of Renewal product offering Complete Renewal training process Become proficient at assessing and measuring insert windows Convert sales leads into sales Ensure premium customer service Arrive at sales appointments prepared and on time Qualifications and Skill Requirements High school diploma or equivalent; college degree preferred Valid driver's license and reliable vehicle A proven track record of closing sales A strong focus on exceeding customer expectations Strong written and verbal communication skills Self-motivation and results orientation Strong sense of accountability Ambition and discipline A healthy sense of competition—tempered by an equally strong sense of teamwork Schedule availability to run homeowner appointments on many evenings and weekends Time and work process management skills and the ability to work independently CULTURE AND BENEFITS: We are committed to demonstrating mutual respect and appreciation of our similarities and differences so that each employee can realize his/her potential and we exceed our customers’ expectations. In addition to excellent earning potential, we offer excellent benefits, such as low cost medical and dental insurance, and affordable dependent coverage. The other benefits may include: Vision/Life Insurance Health Savings Account contributions Paid holidays plus PTO 401(k) plan contributions Professional development and tuition reimbursement opportunities A culture that supports work-life balance An environment where collaboration is key Volunteer opportunities – on company time Employee Resource Networks Environmentally conscious business decisions 8,000+ employees and career opportunities nationwide An Equal Opportunity and Veteran Friendly Employer Employment Type: Full Time Years Experience: 1 - 3 years Salary: $150,000 - $200,000 Annual Bonus/Commission: Yes"}