{"title":"Tier 2 Network Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK1E-RJaJptKtcBMBtZEQn2xUsunQPYBntp8K5_C_Q_qJekhYYHCmqd7Lehpkp-EH3KWD8ucBberJds27YopcVA6mlsiY5czldUL1ExrCDJuBkwWRYBbqVkWwqNPnRNywk4ysx9PRqMc_pIUTMAY4naPHuv7TR1_4VnHCjwyjqFxqRcf_WeNuUUVVFuEdXf","source":"ziprecruiter","full_description":"Job Description:The National Solutions Group at Leidos is seeking a Network Engineer to perform Network design, plan analysis, installation and support the network communications systems (LAN, WAN, VOIP). The engineer will perform a wide range of engineering duties to include network architecture, monitoring the networks, and enterprise networking. The Network Engineer provides technical expertise in all areas of network and computer hardware and software interconnection and interfacing, such as routers, multiplexers, firewalls, hubs, bridges, gateways, etc.Primary Responsibilities:The Tier 2 Network Engineer provides technical support in all areas of network and computer hardware and software interconnection and interfacing, such as routers, multiplexers, firewalls, hubs, bridges, gateways, etc. The Tier 2 Network Engineer evaluates, coordinates and performs installation and/or reconfiguration of hardware and software elements of networks. The Tier 2 Network Engineer works daily with the customer and Tier 3 Network Engineers in all aspects of day-to-day activities to resolve issues. The selected candidate must understand the site and enterprise well enough to work through network-related issues with all stakeholders at the facility and across the enterprise. Working at a customer facility and with the customer daily requires good communication skills and the ability to multi-task efforts based on a dynamic environment and changing priorities. The candidate will maintain documentation as well as perform logistics duties. The program supports a 24x7x365 mission critical customer environment. Although this is a day shift position, employees may be scheduled to work or called in to work during off hours to meet customer mission support requirements. A Single Scope Background Investigation and polygraph are required.Basic Qualifications2-5 years experience in design, maintenance, and operation of small to medium sized networks2-5 years experience with military networks, CISCO routing and switching, and network troubleshootingKnowledge of Cisco Switching/Routing product lineHands-on experience diagnosing network related issuesAbility to work independently to resolve technical issues in a dynamic environment.Security+ CertificationBachelor's degree from an accredited college in a related discipline, with 4 years of professional experience; or 2 years of professional experience with a related Master's degree; or equivalent experience/combined education.Preferred QualificationsExperience with ACS/TACACS ServersExperience with Cisco lOS/ Brocade OS / JUNOSCCNA or other advanced networking certificate.Experience with HP NNM, Cisco Prime, and CiscoWorksExternal Referral Bonus:EligiblePotential for Telework:NoClearance Level Required:Top Secret/SCI with PolygraphTravel:Yes, 10% of the timeScheduled Weekly Hours:40Shift:DayRequisition Category:ProfessionalJob Family:Network Administration and OpsPay Range:"}