{"title":"Field Service Engineer I (Hillsboro) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKudfMkOU7XjDvBaNOgU-zQDyAAuDzjnwsm19orTOvcS1ROsMY-W1dkXenA9xhosR4O3GQZagSMyx3zN79_SjK-ZuF2mtxE0ZgvEmQnEKH1glCnL4rq9ZRS-kBLPqW8PX-E1MTx3MjffiboBb9iDHzr8y74f3EJtYO4U4uMebsqBvVeuhtLbb9xro5bBb3W","source":"ziprecruiter","full_description":"When you're part of the team at Thermo Fisher Scientific, you'll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and you'll be supported in achieving your career goals.**Location/Division**The Materials and Structural Analysis Electron Microscopy business enables customers to find meaningful answers to questions that accelerate breakthrough discoveries, increase productivity, and ultimately change the world. The M&SA EM business designs, manufactures, and supports the broadest range of high-performance microscopy workflows that provide images and answers in the micro-, nano-, and picometer scales.Combining hardware and software expertise in electron, ion, and light microscopy with deep application knowledge in the materials science, life sciences, electronics, and natural resources markets, the worldwide Electron Microscopy employees are dedicated to customers' pursuit of discovery and resolution to global challenges..**How will you make an impact?**The Field Service Engineer for the Materials and Structural Analysis Division (MSD) of Thermo Fisher Scientific is responsible for performing the on-site installation, servicing and repair of complex equipment and systems. Engineers investigate and improve operational quality of system equipment; instruct customers in the operation and maintenance of the system; serve as company liaison with customer on administrative and technical matters for assigned projects; and conduct on-site installations of the full range of Thermo Fisher Scientific electron microscopy systems and their associated options.**What will you do?**+ Conduct on-site installation of complex equipment and follow testing procedures to ensure proper working order + Conduct on-site scheduled planned maintenance visits + Provide troubleshooting and repair support for customers and other field service personnel + Cultivate and develop positive working relationships with customers, system users and company personnel + Travel, often on short notice, to customer sites to resolve problems or support other field service personnel + Complete and submit field service reports + Provide training for customers and users on system maintenance + Provide feedback to product quality teams + Provide appropriate input in writing updating and correcting various system documentation + Provide input for various reports including identifying and isolating unique problems with system + Act as a subject expert and resource for training**How will you get here?****Education**+ Minimum education is a degree from a technical or undergrad program in electronics, computer science, physics, or similar field with 2yr. degree or equivalent combination of skills and experience.**Experience**+ Experience with operating, troubleshooting, repairing and calibrating complex analysis tools such as SEM, TEM, FIB, Prober or similar systems is a plus but not required. + Experience with Ultra High Vacuum (UHV) a plus but not required. + Experience operating O-scopes and digital voltmeter.**Knowledge, Skills, Abilities**+ Must possess a valid driver's license. + Must have ability to obtain a valid passport and travel regionally and internationally as required. + Physical requirements include the ability to lift to 50 lbs. + Must be able to secure entrance to US Government laboratories and facilities, if requiredAt Thermo Fisher Scientific, each one of our 75,000 extraordinary minds have a unique story to tell. Join us and contribute to our singular mission-enabling our customers to make the world healthier, cleaner and safer.Apply today! http://jobs.thermofisher.comThermo Fisher Scientific is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, creed, religion, color, national or ethnic origin, citizenship, sex, sexual orientation, gender identity and expression, genetic information, veteran status, age or disability status."}