{"title":"REMOTE Software Engineer - C, C++, Networking NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAItIIer3Hq4RfA9YpDOTbc0QU1NlRrOrSgqBHkyN-wEG_PFymfZA0moQ_hE4q8r718n-wD_QHIPV237tQDWTnxo1dUlDOzh0AJ494Pv8iO925xqDXyX4swNgJ5eIQNRgmpCw87Ap36CTG_abPPWqOh8YCSGFZR1u7naGaDhteCiuyzm6_LgddtmoHfvJnZS","source":"ziprecruiter","full_description":"REMOTE Software Engineer - C, C++, Networking If you are a Software Engineer with experience, please read on!We are an established computer networking company that is working on building a new line of handheld products to assist thousands of people in their daily work life. We have won numerous awards in the past three years for our work place and we have maintained our staff levels through the COVID-19 pandemic. We're passionate about innovation and are proud to be creating equipment with success in mind. We are working to bring on more talented, hardworking engineers to our team to help us continue our recent trend of growth.What You Will Be Doing- Work on the design and development of new handheld product- Ability to write testable software and unit testing of the code produced- Be a competitive, team player while working in an Agile/SCRUM environment- Provide input on future best practicesWhat You Need for this Position- 2+ Years of Experience- Prior work with C AND C++- Practice with design tools and packaging tools- Expertise in designing software applications to interface- Understanding of Networking protocols (TCP/IP, HTTPS, etc)Bonus points for: - WiFi - Firmware developmentWhat's In It for You- REMOTE work- Strong base salary (DOE)- Medical - Vision - Dental- 401k planSo, if you are a Software Engineer with experience and a strong networking understanding, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}