{"title":"Radio Frequency Hardware Engineer, Senior NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI_ZoNklhNt1HQ6TPn7-ADQTu53brXa_E1NQpCkhUS-kIoBnMBK38bj6o9uzL2LPxOU1fHj9HhqCPZBH3aWKHgg4bJGmwW177UEvW-ICMVmU44OqVxenbvLGG7aojYoJVSiPKgLlFdjYmzlQPv0OTB2eV0q2UWo8w50BMXDj-MPFgocz_KC97o7rOB9ZHa2","source":"ziprecruiter","full_description":"Radio Frequency Hardware Engineer, Senior McLean,VA,US Apply + Be you+ Be Booz Allen+ Be empowered+ Learn MoreJob DescriptionLocation: McLean, VA, USJob Number: R0075139Share job via: Share this job: Share Share Radio Frequency Hardware Engineer, Senior with FacebookShare Radio Frequency Hardware Engineer, Senior with LinkedInShare Radio Frequency Hardware Engineer, Senior with TwitterShare Radio Frequency Hardware Engineer, Senior with a friend via e-mailRadio Frequency Hardware Engineer, Senior The Challenge:What if you could use your engineering skills to transform the world of communications? As an electrical engineer, you understand the power behind complex systems. That knowledge is key when it comes to designing new methods of communications that leverage machine learning. We're looking for an electrical engineer who can use their skills to develop and verify new approaches to traditional communications methodology to help the team modernize the world of communications.Our team builds software that focuses on combining machine learning with traditional communications theory. That's why we need you, an electrical engineer, who specializes in radio frequency design and wireless communications, to help us design and develop new capabilities for machine learning software based upon radio frequency theory. You'll work with a team of both software developers and electrical engineers specializing in wireless communications to develop and verify new approaches, which leverage machine learning, to traditional communications methodology. You'll directly impact government customers by helping the team create a product that can modernize the field of communications. We'll look to you to share your electrical engineering expertise through leadership and mentoring junior staff. This is a chance to use your experience-based knowledge in wireless communications and RF theory while broadening your skillset into areas like software development and machine learning frameworks. Join us and take on exciting challenges in wireless communications, as we improve and modernize the world of communications.Empower change with us.You Have:-Experience with electrical engineering, wireless communications, and RF design-Knowledge of wireless communications and RF theory-Secret clearance-BS degree in EE or Computer EngineeringNice If You Have:-Experience with software development, including Python or C/C++-Experience with machine learning libraries, including Keras-Top Secret or TS/SCI clearance-MS degree in EE or Computer EngineeringClearance:Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.Build Your Career:When you join Booz Allen, you'll have the opportunity to connect with other professionals doing similar work across multiple markets. You'll share best practices and work through challenges as you gain experience and mentoring to develop your career. In addition, you will have access to a wealth of training resources through our Engineering & Science University, an online learning portal where you can access more than 5000 tech courses, certifications and books. Build your technical skills through hands-on training on the latest tools and tech from our in-house experts. Pursuing certifications that directly impact your role? You may be able to take advantage of our tuition assistance, onsite courses, vendor relationships, and a network of experts who can give you helpful tips. We'll help you develop the career you want as you chart your own course for success.We're an EOE that empowers our people-no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, veteran status, or other protected characteristic-to fearlessly drive change."}