{"title":"Driver / Field Service Representative - Buffalo, NY (27962) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI_qm_INbeDkqkyEnmjb05qB-FymBp3s8bZuEczz316gGflbmiY2D4pmAgCyV_pgPjeu2GrAeWPPjm0H4zUWjpBZjZQ-ssiTOnCk-jmz3D2co7RkuHSfQbsy1YjFSPR445bgpccxOOSBCGaZa6dXilCUxqQtyedM7Xnb5vOJbd8f5oNPQbSRqYudnu97Tk","source":"ziprecruiter","full_description":"Salary - $15 to $20BenefitsPaid trainingPaid time offInsurance coverage401k Join Arjo today and work with career-minded people in the medical device distribution industry! The Driver / Field Service Representative is responsible for the maintenance, cleaning, delivery and pick up of Arjo medical equipment that is used on rental basis by local hospitals and nursing homes. This position is based in our Cheektowaga service center but will involve local driving to and from Buffalo area medical facilities using company vehicles. Day-to-day functions include the following:Prepare medical equipment and documentation for deliveryLoad and unload medical equipmentDrive 24 foot cargo van to make deliveries and pick-upsProcess delivery and pick-up documentation as requiredSearch for equipment that has been misplaced or lostMaintain vehicle appearance by ensuring all routine vehicle maintenance is completed and records maintainedClean and disinfect medical equipment to ArjoHuntleigh quality standardsPresent highest level of customer etiquette in all patient/customer interactions QUALIFICATIONS: High school diploma or equivalentTwo(2) years' experience within service or operations fieldTwo(2) years' experience in front-line customer-serviceExperience with Microsoft Office applications, including Word, Excel, & OutlookAbility to enter information into work logs and existing computer systemsAbility to lift up to 75lbs and push/pulling up to 135 poundsAbility to drive work truckMUST HAVE clean driving recordAbility to comprehend work instructions and safety requirementsAbility to work with solvents and cleaners to disinfect products in a non-climate controlled warehouse environment  EOE AA M/F/Vet/Disability:   Arjo Inc. is an equal opportunity and affirmative action employer and gives consideration for employment to qualified applicants without regard to race, color, religion, age, national origin, disability, military service, protected veteran status, genetic information, sex, sexual orientation, gender identity, or any other characteristic protected by federal, state or local law.Please review the U.S. Department of Labor EEO Is the Law Poster, EEO Is the Law Supplement and Pay Transparency Nondiscrimination provision here:  https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm Qualified Applicants who require a reasonable accommodation for any part of the application and/or hiring process may contact us through the following email address: application.accommodations@arjo.com"}