{"title":"Test Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIcfTZpg1uxSbnrFIylWwQwfxQN31t7DVezAAQJ0DKjD1X3px2YacLsgJ5tQdz_guRfV9moV01mhbPHvZ9HO6Wx8_IqaSf1FIwjRe0J3m-2Vcair_AhOm_08FvKLKhX3VGKvy5B3CZOf7mHgt_Yv-xxolIXWtBE2aJYWiA9I_x_O1Ld0wb5ubKdlmgIya99","source":"ziprecruiter","full_description":"Aderas, Inc. is seeking a Test Engineer to join the team.Primary Job Duties:Follow established standards and procedures to estimate and create test cases to satisfy requirements.Trace requirements to the test cases.Review customer comments and apply edits to the test cases.Follow test case steps to execute test cases in dry-runs, environment verification, and other internal testing in non-production environments.Support test events by executing the assigned test cases and creating detailed annotated test evidence files for redaction and safekeeping while the customer may be witnessing the test event remotely or physically next to you.Play multiple roles as needed to support the test and evaluation group.Provide input to the test reports after a test event occurs.Required Education & Work ExperienceAA and min. five (5) years’ relevant work experienceRequired Experience & Skills:Demonstrated understanding of testing methodologyWord, PowerPoint, and spreadsheet experienceKnowledge of and ability to follow best practices for redacted documents.Preferred Qualifications:IBM Jazz test repository tool experience including RQM or equivalent (JIRA, TFS, etc.)Clinical testing background, direct or related clinical experience, or prior experience with the Military Health System (MHS) applications/environments.Clearance/Citizenship: U.S. Citizen, Public Trust/Able to obtain a Public TrustJoin the Aderas team!At Aderas, we are looking to recruit and retain only the best and brightest. If you like working with emerging technologies, using your unique personal skills to solve technical, functional, and organizational issues, and can easily adapt to the ever-changing IT market, then Aderas is the place for you! We are a vibrant company delivering implementation services & support for enterprise solutions and custom application development. We strive to form long-term partnerships with our clients to foster an environment based on trust, proven history of delivery, and camaraderie.Why Aderas?We sincerely try to shape our employee's lives by administering a generous package of employee benefits. Our company culture encourages collaboration, creative thinking, and growth. Headquartered in Reston Town Center, in Reston, VA, the Aderas main office is a short step away from shopping, dining, and a movie theater. Beyond the tangible and intangible rewards, Aderas provides the following:Pay for Life, AD&D, Short term disability, and Long term disability at no cost to the employee.Employer contribution toward monthly health insurance premiums.401k plan which employees are eligible for after being with the company for 3 months.Safe Harbor plan in which Aderas contributes 3% of employee salary once a year.A week of paid training and reimbursement for approved professional courses and tests.Monthly allowance for cell phone bills.Transportation allowance."}