{"title":"Senior Security Engineer, Application & Cloud (Fully remote)","location":"","salary":"","description":"","term":"$175,000 to $200,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALiqU5UzEZKzsWMVRCzLFjMOhzvjRGmhiBQxC4HN5FUNZaF2IErum8xmc6JBSx0nDNN6Uv6r1R-EZhHT70DLTH_FwbEgd--dcwFcSG6frvZJ-QueCoDDQcfm7fc0LFChDVRU4r6Qb4kG7rFVYN9L-CatgQZO2xRKf3cZ0peGwjOnLQtTmvgo4saNSiuC8A","source":"ziprecruiter","full_description":"MPA has been appointed by one of the fastest growing and leading Digital Health organisations in Canada to source a Senior Security Application Engineer to join their growing team. This role can be based remotely anywhere in Canada or America. You will be joining an organisation that has grown significantly in recent years to become a leader within the Digital Health sector by bringing much-needed innovation to the stagnant health care industry.Their mission is to help people live healthier, happier lives every day. In this role you will be working with product managers, designers and developers in cross-functional teams dedicated to areas of the product.Your mandate is to ensure that features of the companies system have security and privacy baked into their design. In this role, you will:· Help teams identify and quantify threats and risks using threat modeling and other processes to promote security and privacy by design· Hold lunch and learns and other training to level up security across the engineering organization· Build security automation and tools to make it easier to ship secure code· Perform tools assisted security scanning and testing· Identify opportunities to automate the detection of indicators of compromise and roll them into incident management playbooks · Participate in an on-call rotationAbout you:· You can explain the difference between threat, impact and risk to product teams· Experience with OWASP, static/dynamic analysis and common exploit tools and methods that affect applications written in Golang, Javascript (React), Android and iOS· Experience working within the Google Cloud Platform· Experience working with Docker and KubernetesYou should have 3-5 years experience as a Security Application Engineer or experience in a similar role.You will receive a salary of up to $175,000 - 200,000 per year with industry leading company benefits.This is a fully remote position for candidates anywhere in the US or Canada.To find out more about this role or to apply please contact Conall on +1 437 234 5135 or conall.anderson@mparecruitment.caReference ID: CADHSEAJob Types: Full-time, Permanent Salary:"}