{"title":"Electronics Engineer II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI7U3Zv55hMd363jsIdR0PpGQuw8PSFo17iq6g4fcPVvb73Kn2muxoi5n5vdBARBiCM9FFJ7KW3-9W26_Db5lm9NE7OE4HARASStwLVkalAXKnWIKvF5uFwQjtUjGzTz-S__fx2Qr1EvL1L_QmAo6OrnnwSeMMlV0i77Wp59PgqlwkpqDEt5kSCFk28BHnP","source":"ziprecruiter","full_description":"Position Overview:  Design and implement real time embedded control systems, features and communication protocols for industrial products. Designs, prototypes, and tests firmware subsystems per defined requirements and architecture. Develops verification test plans and procedures. Documents firmware thoroughly and creates user manuals. Participate in all areas of development (brainstorming, test fixture design, reviews). Essential Job Functions:Work with customers both internal and external to identify product requirements and potential solutions.Work with contractors on pieces of development subcontracted to speed development process.Develop software and firmware product architectures to meet product requirements.Work with electrical and hardware engineers to select the best processor, microcontroller, or DSP for the application and system.Produce software design, implementation, and subsystem integration.Produce appropriate documentation in support of the development effort.Participate in architecture, code, and documentation reviews.Utilize compilers, code management systems, emulators, simulators, etc.Integrate firmware onto the embedded hardware and perform debug.Plan and perform software verification and validation and record the results.Contribute to improvements in software development process.Support defect tracking and resolution.Support established goals to achieve quality objectives.Follow all procedure that make up the quality system.Other duties as assigned. Basic Qualifications:BSCE, BSEE, BSCS or equivalent.3 to 5 years of experience in related field.Experience with C, C++, C#, Embedded Linux, and QT.Experience with software development for embedded microcontroller/DSP design.Experience with hardware/software interfaces and integration.Experience with product requirements documentation and design verification testing.Superior communication, planning and problem-solving skills.Experience with ARM processors.Low level I2C, UART, SPI features, Low level hardware interrupts, peripheral and IO configuration.Version control systems (Git, SVN).Thrive in an environment where you are working on multiple projects simultaneously.Be self-motivated to set and meet aggressive goals with little supervision.Passionate about quality and correctness.Ability to work in very small development group.Preferred Qualifications:Experience with FreeRTOS and MBED.Experience with ATMEL AVR, SAM and ST32 line of microcontrollers.Ability to read and interpret Schematic and PCBs.IoT development.Python, Squirrel Programming Language, Machine Learning.  GUI and UX design. Physical Requirements: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Ability to stand, sit and/or walk on a hard surface as well as safely bend, stoop, reach, climb steps and use ladder.Lift up to 25 pounds.Vision abilities required: close vision, peripheral vision, depth perception, and the ability to adjust focus. Vision to accurately read all related distribution documents and computer monitor screens. EEO                The Company is an equal opportunity employer. In accordance with applicable law, we prohibit discrimination against any applicant or employee based on any legally-recognized basis, including, but not limited to: veteran status, uniformed servicemember status, race, color, religion, sex, age (40 and over), pregnancy (including childbirth, lactation and related medical conditions), national origin or ancestry, physical or mental disability, genetic information (including testing and characteristics), sexual orientation, gender identity or any other consideration protected by federal, state or local law. Our commitment to equal opportunity employment applies to all persons involved in our operations and prohibits unlawful discrimination by any employee, including supervisors and co-workers.Furthermore, it is Company policy to provide equal opportunity to individuals with disabilities and protected veterans in all phases of the employment process and in compliance with applicable laws. This policy of non-discrimination shall include, but not be limited to: recruiting, hiring, promotions, demotions or transfers, layoffs, recalls, terminations, rates of pay or other forms of compensation, selection for training, and recruitment or recruitment advertising.The Company will provide reasonable accommodations to any employee with a known disability who is otherwise qualified to perform the essential functions of his/her job, unless such an accommodation would present undue hardship on the Company's business operations or unless doing so causes a direct threat to the health and safety of the employee or others in the workplace.  An employee who believes that he/she requires a reasonable accommodation because of a disability must notify Human Resources. The Company is committed to providing employees with a work environment free of discrimination and harassment. All employment decisions at the Company are based on business needs, job requirements and individual qualifications."}