{"title":"Mechanical Engineer (in KY) NEW!","location":"","salary":"","description":"","term":"$60,000 to $70,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALgVN8WLrj3vNSlCeGwEm4bgRltxJSiT8J_tU336A70LljlX6JXVtkPjIAdiPUTgfPb7a2YcjME-9d4u3sEzpOyChTwm_9pOiVSGtgQisvt0JMdrDcIIzkdpsTo9lAD-BWEPrJjcH5u35Elmd-UQ5ujX8iCD06JEmruhIamvU5UJEn6Y3PQ2X-DRYV9A1BM","source":"ziprecruiter","full_description":"We are looking to fill a full time Mechanical Engineer position with a manufacturer located in the area of Franklin, KY. If you fit the requirements below, send your resume for consideration.MUST HAVES:· Completed BS degree in Mechanical Engineering· Full time or co-op experience within a MANUFACTURING environment working as a mechanical engineer.· Knowledge of machine design, CAD, tooling, machine installation, developing PFEMA.SALARY RANGE: $60k to $70k per year plus relocation assistance and great benefits.Title: Mechanical Engineer  Reports to: Plant ManagerJob Function:Provides engineering analysis and evaluation of complex technical manufacturing problems, and provides the support needed to improve quality, productivity, and safety. Works closely with contractors, vendors, plant and corporate staff, and production and maintenance team members to improve existing capabilities and develop new ones.Required Qualifications:B.S. Degree in Mechanical Engineering, with manufacturing experience. Thorough knowledge of machine design, CAD, tooling, machine installation, developing PFEMA.Desired Qualifications:Prior engineering experience in a manufacturing environment. Working knowledge of PLC Programming, GML, Servo Systems, Robotics.Essential Functions:· Evaluate and manage capital and kaizen projects in a time-critical environment.· Provide analysis, evaluation and review of problems regarding automation, advanced methods and equipment, material handling, layout and material flow.· Provide alternative solutions to anticipated or actual technical and/or business related manufacturing problems.· Develop safeguards and improve team member safety through process improvements.· Provide training to production and maintenance team members.· Provide trouble shooting assistance to production and maintenance team members.· Develop new equipment specifications, tooling and other associated requirements.· Design new equipment or redesign existing equipment, and coordinate its fabrication, assembly, installation, and startup as needed.· Provide daily leadership to hourly maintenance personnel· Maintain all mechanical functions of plant painting process· Actively and aggressively support 6S policies and procedures"}