{"title":"Field Test Engineer NEW!","location":"","salary":"","description":"","term":"$19 to $25 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIJic9qZTfIiGibW7oNkm8b63S3lKXElWfcSY7Oa8ZZUhTeo80bvsebx7a0BPxvW266hIRqW3mDMG4BsDkN0dexfjj8d_rJ00C-AWydxMn9i2gpP-UwWlVLQuM9WJLZaQIQdTbAw42JP3U2OYEU5Wm-90WJjtkmPO-aH1PrIUhcSASqPuvfoA4XuHV_S80","source":"ziprecruiter","full_description":"Sage Ag is looking for a farm agriculture Field Test Engineers / Field Service Engineer Technician. This position requires previous experience with farm machinery. There is a generous living expense stipend with this position.Sage Ag Inc. is currently seeking a hardworking, self-motivated, and detailed oriented individual who is passionate about production agriculture and machinery. Through this position, you will be working with a major agricultural machinery manufacturer on experimental self-propelled forage harvesters (SPFH) in Tulare County California. Home to approximately 380,000 dairy cows, Tulare County is considered the dairy capital of the world. The combination of a large volume of available forage to harvest and high ambient temperatures make this an ideal spot for SPFH proving grounds. The test site team includes two technicians and an onsite engineer.Job Description:As a contract test technician (CTT) you will be expected to provide in the field and on-site support for SPFH equipment. The majority of the job is based in Tulare County but may require up to eight weeks of travel per year to help support equipment at off-site locations. The main factory is located in Zweibrucken, Germany, so most correspondence with engineering will be done via email. Occasionally long work hours are required.Responsibilities:Diagnosing and repairing experimental machine failures as directed by technical manuals and engineering recommendationsReporting machine issues directly to design engineersGathering critical machine information, crop condition, and test dataEnsuring engineering teams’ goals are met for the crop seasonWriting detailed field reports objectively and technicallyProviding professional opinions & advice to engineering on how new features are meeting customer demandsCorrectly installing new parts for customer evaluationDaily & routine maintenance of equipmentSPFH equipment operation & ability to train new customers how to operate SPFH equipmentIdentifying possible root causes of failuresRequirements:Minimum of 250 hours of agricultural machinery operationMinimum GPA of 2.5 in an agricultural major; preferably Ag Systems Tech or Ag EngineeringKnowledge of SPFH equipment preferredMechanically inclinedStrong communication skillsClean driving recordProfessional, engaging, positive attitudeProficient with Microsoft OfficeAbility to work in a diverse team environment as well as individuallyStrong troubleshooting and problem resolution skillsAbility to keep accurate & detailed records of work performedAbility to lift 75 pounds and work in hot, dusty environmentsDetails:Job Duration: Full TimeLocation: Tulare, CaliforniaCompensation: Pay plus bonuses based on experience"}