{"title":"Mechanic I NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKNDvDafH0ofxRYBnG-Z02IAKhBbmsK2z02c2CXS5tpgZSih8j0wAdSAFPznZHq2N9yxW2-beqSLkE77PE_fP9udtuedrrtmiyOKGM4Tf7Q3P46b2X3gF8bA9jxMxR2k4626FSpc4LHBf2TBQZft5iaf0WBM2QqmCeR1lUhuDRQY4n1DPPw-AwsgbmDiNg","source":"ziprecruiter","full_description":"Hiring Range: $20.51 - $25.64 HourlyDescriptionThe Fleet Mechanic will service and perform preventive maintenance and minor repair work on a variety of heavy, specialized and light equipment including landfill/road and bridge equipment (Cat, John Deere, Komastu), snowplows, transit buses, and patrol vehicles. Work in this position involves complex automotive, heavy equipment and mechanical/electrical systems; considerable analysis of facts and alternatives may be required. This is an entry level position with the possibility of advancement.The Fleet Shop is located in Gypsum, however, this position works outdoors at our satellite locations around Eagle County 80% of the time.Schedule: This position will work 4x10s Mon-Thurs or Tues-Fri. Duties1. Inspect equipment brought to shop or in the field for structural integrity and other potential safety and maintenance problems.2. Performs required preventative maintenance on county vehicles and equipment; checks oil levels, checks fluid levels, changes lubricants, changes filters, applies grease to fittings, moving parts, etc., cleans dirt from air filters, checks operating condition of lights, brakes, hoses, tires, and belts.3. Inspect primary and auxiliary operating systems for loose and worn parts, hydraulic systems for faulty cylinders, hose or fittings, and air systems. Assists in diagnosing malfunctions and determining necessary repairs.4. Repair and replace worn parts not requiring major mechanical work. Identify and report to supervisor any major problems requiring mechanical attention.5. Replace air compressor filters and air lines. Lubricate auxiliary attachments, suspensions, moving parts, and wearing surfaces on equipment. Remove, inspect, and repair wheels and tires on vehicles and heavy equipment.6. Respond to emergency road service on tires, tubes and wheels of specialized and heavy-duty/automotive equipment, including hydraulic jacks and lifts.7. Wash and steam clean equipment and cleans work area.8. Use County computer system (CCG/FASTER Fleet Management System) to prepare work orders recording labor used and parts used on all County equipment repaired.9. Attend a variety of equipment repair training sessions for continuing education.10. Maintains a clean and safe work area; performs duties in a safe manner; maintains an awareness of others in the work area.11. Performs other related duties as required.QualificationsOne year performing routine maintenance on gasoline or diesel powered vehicle and one year experience in the repair of tires, tubes and wheels; or, any combination of education and experience which produces the required knowledge, skills, and abilities.Must possess a valid Commercial Driver's License (CDL) or be able to obtain such CDL within six (6) months of employment and possesses a satisfactory motor vehicle record.Must be a self-starterAbility to effectively communicate in verbal and written form.  Possess some knowledge of safety hazards and necessary safety precautions and/or the ability to use good judgement to be able to establish a safe work environment for self and others. Ability to establish effective working relationships with department supervisors and fellow workers;Visual ability to see colors, determine differences in surface texture and recognize defective surfaces. Ability to lift and carry moderately heavy materials, supplies and equipment (25-50 lbs.) frequently; and heavy materials, supplies and equipment (50-100 lbs.) occasionally. Ability to hear a wide range of sounds associated with equipment function and malfunction. Ability to perform work in/outdoors with exposure to work hazards from weather/environmental conditions, loud noises, moving parts and caustic substances when repairing and operating heavy equipment or using power tools. Additional InformationA career with Eagle County Government impacts and enriches the lives of our community members by following our mission: Creating a Better Eagle County for All. With nearly 500 amazing employees, Eagle County is a progressive and values-driven organization located in the heart of the Rocky Mountains. Outdoor enthusiasts and those seeking a small town community are attracted to Eagle County for the amazing lifestyle. Although we are best known for our world-class skiing, hiking, biking, fishing and outdoor activities, it is really the people that make our valley so great!Benefits for full-time employees: Comprehensive and low cost medical, dental and vision insuranceWellness program where you can earn $1000+ cash or extra days off11 paid holidaysPaid time off and medical leave Paid volunteer hours6% match retirement planFree classes at Colorado Mountain CollegeEagle County University classes (internal trainings) Tuition reimbursement programsFree bus passDiscounted gym memberships and moreAs a certified healthy workplace our culture recognizes the importance of individual needs and enjoying life outside of work. Other perks may include flexible work arrangements, paid volunteer time and daytime fitness classes/bike rides. Eagle County is proud to be an Equal Opportunity Employer. Working in a diverse, respectful and inclusive environment is essential for our employees be successful in serving our community. We do not discriminate with regard to age, race, color, religion, sex, sexual orientation, gender identity or expression, genetics, national origin, disability, veteran status or any other legally protected status. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions of this position.Eagle, CO Relocation Guide (Courtesy of Town of Eagle & Eagle Chamber)Vail Valley Relocation Guide (Courtesy of Vail Valley Partnership)"}