{"title":"Software Developer II","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIR14PKaCLiAk54hzZbg7h9q82Yc9GTEgmiIQvE0waixNOf1kLDLvEcNEOrTZjSMcf4wFM1OdVhhilvis2RwQipY7lNnQ6nvLlRod8yq8btH_ZgjeoVNqiaTtVFtdOHbggLsJGW0UPSoJEslWq1xrRNIzysI4DqYq2tvMfx_wfgSUEbVMT60823aovk_mw","source":"ziprecruiter","full_description":"DEMDACO's purpose statement is very simple; to pursue business the way it ought to be done. We're committed to the notion that business does not have to be solely a financial endeavor. It is first, and foremost, a human endeavor. Founded in 1997, DEMDACO offers a hand-selected collection of tailor-made products that celebrate how people live in their homes, engage with family and friends, and treat themselves.DEMDACO products are as diverse as the people buying the, but we strive for them to have one important thing in common: to lift the human spirit. Our hope is to offer DEMDACO products that reflect a person's desire to nurture goodness in the their own lives and in the lives of others.DEMDACO has an immediate need for a Software Developer to join our growing team of colleagues.In order to be considered for this position, you must complete the following survey:https://www.cindexinc.com/c/9671A7This position will include the following:The Software Developer I gathers user requirements into standard development methodologies for automation of manual functions as well as maintenance and modifications to existing software developed and utilized by all of DEMDACO. Gathers, Develops, Tests, and Documents programs and resolves problems for both batch and on-line systems.Essential Duties and Responsibilities: include the following: (Additional duties may be assigned.)Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. · Performs programming assignments requiring knowledge of established programming procedures and data processing requirements.· Assists business units with simple to very complex questions and problems on applications and processes.· Determines, investigates, and performs application problem resolutions until problem is resolved or work-around defined.· Works with business units to develop specifications for new and existing programs, process flows and systems as well as changes to existing applications.· Modifies and maintains simple to very complex existing software applications by coding changes, amending flow charts, and developing detailed programming logic.· Evaluates simple to complex integration points between programs and databases.· Provides release testing and support.· Improves the efficiency of programs by applying newer technologies and/or incorporating better programming techniques.· Meets departmental and organizational deadlines as outlined by the department manager.· Provides support and problem resolution for applications, to include code in testing, beta, or production.· Maintains broad knowledge of new or state-of-the-art technology as required to support or enhance company processes.· Additional duties as assigned, capitalizing on employee’s skill base for the benefit of DEMDACO.Competencies necessary for success in this job: To perform the job successfully, and individual should demonstrate the following competencies: Problem Solving - Identifies and resolves problems in a timely manner; gathers information skillfully; works well in group problem solving situations. Technical Skills – Assesses own strengths and weaknesses; pursues training and development opportunities; strives to continuously build knowledge and skills.Written Communication - Writes clearly and informatively; edits work for spelling and grammar; presents numerical data effectively; able to read and interpret written information. Team Work - Exhibits objectivity and openness to others' views; gives and welcomes feedback; contributes to building a positive team spirit; recognizes accomplishments of other team members.Adaptability - Adapts to changes in the work environment; manages competing demands. Supportive of Growth and Change initiatives within the organization. Initiative - Undertakes self-development activities; seeks increased responsibilities; asks for and offers help when needed.Qualifications:The requirements listed below are representative of the knowledge, skill, and/or ability required.Education/Experience:· 1+ working experience developing applications for business· 2-4 year college education in Computer Science or related field· Basic knowledge in one or many areas of PL/SQL, Java, Oracle Database, SQL Server, .NET technologies· Write and maintain/extend existing PL/SQL code to convert initial data sets, system enhancements, reports production, and improved transaction editing. Willingness to learn the nuances of Oracle E-Business Suite with the guidance of Senior Development staff· Develop database packages, procedures, functions, and queries to maintain production data · Basic knowledge of software development and methodologies.· Ability to implement and troubleshoot programming code and modifications.· Ability to investigate and analyze information and to draw conclusions.· Ability to communicate with the user community.· Ability to work and perform under pressure.· Ability to communicate, both verbally and in writing, technical information in easily understood terms.Work Environment:Inside office work with local travel and the occasional out of town/country travel for short periods.Physical Demands:Equipment use includes prolonged periods of keyboard/mouse use and the visual attention to CRT, LCD, or Plasma screens.Qualifications:The requirements listed below are representative of the knowledge, skill, and/or ability required.Education/Experience:1+ working experience developing applications for business2-4 year college education in Computer Science or related fieldBasic knowledge in one or many areas of PL/SQL, Java, Oracle Database, SQL Server, Node.js, AngularWrite and maintain/extend existing PL/SQL code to convert initial data sets, system enhancements, reports production, and improved transaction editing.Willingness to learn the nuances of Oracle E-Business Suite with the guidance of Senior Development staffDevelop database packages, procedures, functions, and queries to maintain production dataBasic knowledge of software development and methodologies.Ability to implement and troubleshoot programming code and modifications.Ability to investigate and analyze information and to draw conclusions.Ability to communicate with the user community.Ability to work and perform under pressure.Ability to communicate, both verbally and in writing, technical information in easily understood terms.Work Environment:Inside office work with local travel and the occasional out of town/country travel for short periods.Physical Demands:Equipment use includes prolonged periods of keyboard/mouse use and the visual attention to CRT, LCD, or Plasma screens."}