{"title":"Laboratory Technician IV - Automated Chemistry Evening Shift NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKIVRSd9I1Rx3yoWk3msQyFz4_DL7e9jGyXn9j9VuTYJ1TXrjZi2rETWlUE6qqmCELy6dkVpSO2EYyI-SPMghmAu3xlodQ7OI9jEJG9dKK7_YczP-Lq51j6TI_0vsY-e0egmSVidUlZ_MxdRWLW_kaaKCcNE85h1kVf5LuIj_IB3CGl1L4QZQHk_poBG_oe","source":"ziprecruiter","full_description":"At Cleveland Clinic Health System, we believe in a better future for healthcare. And each of us is responsible for honoring our commitment to excellence, pushing the boundaries and transforming the patient experience, every day.                        We all have the power to help, heal and change lives - beginning with our own. That's the power of the Cleveland Clinic Health System team, and The Power of Every One.                                    Job TitleLaboratory Technician IV - Automated Chemistry Evening Shift                        LocationCleveland                    FacilityCleveland Clinic Main Campus                     DepartmentClinical Biochemistry-Pathology And Lab Medicine                      Job CodeE21000                     ShiftEvenings                       Schedule3:00pm-11:30pm                       Job SummaryPerforms and interprets tests at all complexity levels. Demonstrates an understanding of the theory and scientific principles of laboratory testing as well as the technical, procedural and problem solving aspects. Correlates abnormal laboratory data with pathological states, determines the validity of test results and the need for additional tests. Determines the validity of test results through the monitoring and/or verifying of quality controls, standards, etc. Communicates test results, reference ranges, specimen requirements, and other pertinent information to authorized sources.                         Job DetailsJob Responsibilities:Follows the laboratory's procedures for specimen handling and processing, test analyses, reporting and maintaining records of patient test results.Performs laboratory testing in a compliant manner.Maintains regulatory knowledge and awareness as it pertains to specific job duties.Adheres to the laboratory's quality control policies, document all quality control activities, instrument and procedural calibrations and maintenance performed.Assumes responsibility for and takes action regarding any quality control or quality assurance issues as it pertains to specific job duties.Maintains instruments and equipment in accordance with manufacturer's specifications.Assumes responsibility for good documentation practices and maintains clear and legible records.Performs proficiency testing in compliance with Clinical Laboratory Improvement Amendments (CLIA) regulations i.e. analyze proficiency survey sample in the same manner as a patient specimens, no communication with other CLIA laboratories, complete record retention and accurate documentation and result reporting.Assumes responsibility for participation in continuing education, professional development and required annual competency assessment.Follows the laboratory's established policies and procedures whenever test systems are not within the laboratory's established acceptable levels of performance.Identifies problems that may adversely affect test performance or reporting of test results and either must correct the problems or immediately notify the General Supervisor, Technical Supervisor, Clinical Consultant, or Laboratory Director.Exercises good judgment, analytical and problem solving/troubleshooting skills.Recommends solutions and improvements.Documents all corrective actions taken when test systems deviate from the laboratory's established performance specifications.May function in an educator and provides instruction and training in theory, technical skills, safety protocols, and the application of laboratory test protocols to students, employees, residents, etc.Other duties as assigned.Education:Bachelor's degree in a chemical, physical, biological or clinical laboratory science or medical technology from a four-year college or university.Diploma and/or transcripts must be provided.Education will be verified.Education outside of the United States requires diploma/transcripts translated into English and proof of foreign equivalency from by an HHS approved agency or nationally recognized organization such as NACES (National Association Credential Evaluation Services, Inc) or AICE (Association of International Credential Evaluators, Inc).Certifications:None RequiredCompetencies (Complexity of Work):Requires critical thinking skills, decisive judgment and the ability to work unsupervised or with minimal supervision.Must be able to work in a stressful environment and take appropriate action.Work Experience:None RequiredPhysical Requirements:Physical demands include: Visual acuity to study specimens under a microscope.The ability to distinguish colors.Fine motor skills and manual dexterity to handle specimens and lab equipment required to process specimens and repair equipment.May be required to stand for long periods of time.Light lifting may be required.May be exposed to hazardous chemicals, biohazards, radioactive materials, etc.Personal Protective Equipment:Follows standard precautions using personal protective equipment as required.                       The policy of Cleveland Clinic Health System and its system hospitals (Cleveland Clinic Health System) is to provide equal opportunity to all of our employees and applicants for employment in our tobacco free and drug free environment. All offers of employment are followed by testing for controlled substance and nicotine. Job offers will be rescinded for candidates for employment who test positive for nicotine. Candidates for employment who are impacted by Cleveland Clinic Health System's Smoking Policy will be permitted to reapply for open positions after 90 days.Decisions concerning employment, transfers and promotions are made upon the basis of the best qualified candidate without regard to color, race, religion, national origin, age, sex, sexual orientation, marital status, ancestry, status as a disabled or Vietnam era veteran or any other characteristic protected by law. Information provided on this application may be shared with any Cleveland Clinic Health System facility. Please review the Equal Employment Opportunity poster.                   Cleveland Clinic Health System is pleased to be an equal employment employer: Women/Minorities/Veterans/Individuals with Disabilities"}