{"title":"Chemist II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL93GUhegzyB18qfwKik1BLSLY-OHoSD322CaPx_plhVVEK0rakW5ORUpxxNXaBuO8ks6_rwORzyMEwjoy8xaH8BEpdjM8dx3cWgPfPFecC-XSvUXBJ-I4tA-LZiWopkZkHMUXoNVEHH9FFkaBfzibQoK1pRR8VxYgJ0Nh7CD1WJEuij7zmVhh9-n_RPlL2","source":"ziprecruiter","full_description":"Chemist II in San Diego, CA at APEX Systems Date Posted: 1/23/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: San Diego, CA + Job Type:Other + Experience:Up to 2 year(s) + Date Posted:1/23/2019Job DescriptionJob #: 933706 SUMMARYAssists with the development of new or improved autoimmune diagnostic assays according to established procedures. Major research and development duties include assistance with reagent formulation and optimization of existing formulations. Additional duties involving organizing and facilitating timely progress and completion of projects will be assigned. Key Accountabilities + Assists in the activities associated with the development of new or improved autoimmune diagnostic products in accordance with established procedures. + Assists in transfer of autoimmune diagnostic products to the Manufacturing group in accordance with established procedures. + Assists with the preparation of pilot product reagents according to Manufacturing Documents. + Assists with the evaluation of raw materials, in-process materials and finished reagents associated with pilot products. + Performs laboratory bench work including sample dilutions, running of assays, experiment preparation, and disposal of used reagents. + Properly maintains detailed Design Control Records, laboratory notebooks, scientific reports, and any associated documentation for all research and development activities in accordance with Quality Systems Regulations (QSRs). + Assists with processing and analyzing data, using software tools such as Excel and Analyse-it. + Assists with organizing data, reports, and other documentation to facilitate smooth progress of development activities. + Sets-up, operates and cleans equipment used in the development and preparation of autoimmune products according to Standard Operating Procedures (SOPs) + Informs supervisor of laboratory equipment needs and other supplies required to avoid interruptions in research schedules. Informs superior of broken or deteriorating equipment.EDUCATION and/or EXPERIENCE + Bachelor's degree B.A. or B.S. or equivalent in the biological or related sciences with 1-2 years of applicable laboratory experience. + Basic knowledge of biological and chemical laboratory procedures. + Ability to operate laboratory equipment #LI-CH1 EEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}