{"title":"Software Engineer - Opportunity for Working Remotely NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIZ-seJEGeljQEWk6lm_UveTqW0H0i0b_xFqI8cRuOESoT8nGnwp6_GJiR36RI22G0NLFBw3k2CTqDvULI3OgYXHoZmeC-4UjEvJjz5_zzrgh9rBH6B6_zeCsMbTJesIsynj8X5J_laQ5tAKm9Vx67km0AVrW3m2IQ9jHIhVj7JgTAUefFH41rhQFO9StG-","source":"ziprecruiter","full_description":"We're looking for a Software Engineer to join one of our VMware Carbon Black Cloud Development teams to build solutions that will help us deliver an industry leading security product to our customers. Join a talented team of developers using a wide variety of latest cloud technologies to solve big problems while partnering with threat researchers who are on the bleeding edge of malware analysis. You'll build solutions that our customers are clamoring for, that will help our customers prevent the next front page security breach.What You'll Do: Lead the development of major product features in a highly-scalable environment using AWS and big data technologies. + Contribute to architectural direction in design discussions. + Collaborate to design, build and scale services and data processing pipelines. + Participate in all phases of the software development cycle as part of a Scrum team. + Collaborate with product management, SRE, backend and front-end engineers to deliver the right solution. + Support existing production code and improve performance and customer experience.What You'll Bring: Expertise in building a high-performance, highly distributed, scalable and reliable system to process terabytes of data. + 5+ years of experience developing server side applications. + 2+ years building high performing/data intensive applications running in the cloud. + Experience owning a project from concept to production, including proposal, discussion, and execution.Experience with: Strong experience developing in Python & Java or equivalent statically typed language + Scaling enterprise applications in the cloud + Strong AWS experience + Strong database experience with both relational and NoSQL databases + Experience with containers and container orchestration tools + Agile Software DevelopmentCategory : Engineering and Technology Subcategory: Software Engineering Experience: Manager and Professional Full Time/ Part Time: Full Time Posted Date: 2021-02-18VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what's possible today at http://careers.vmware.com.Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law."}