{"title":"Field Service and Installation Tech","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ5QltpZoR9oFCjEASRdW_fnYL07xFCdRgTPrNDxVNdxKnRBk9Kz6oCd9F8-5SLYrbvJiS9UEmT1IeJ5Shi8sVrNIuGZzSa10bR3S3wIXdRfkcWeUcPTq4ngWcwXEwFHErvf_GtqZ1_bn1gbB7oYNXt5U6ndeOJKOcxbcsvtn7tq7sHV-jYtuyKiQtdn0eS","source":"ziprecruiter","full_description":"Why Choose Boon Edam?Why Choose Boon Edam?Why Choose Why ChooseAre you looking for a challenging career in a technology-driven industry? Boon Edam may be the entry to your future!Are you looking for a challenging career in a technology-driven industry? Boon Edam may be the entry to your future!Boon Edam is a global market leader in entry solutions with offices across the world. Although we currently employ over 1400 people worldwide, we remain a family company at heart. We are proud that a large number of our people have been with us for over a decade. They have joined us at the start of their career and have developed themselves with us through our internal training and career development programs. We are characterized by our drive and dedication; drive to create the most premium entry solutions and dedication towards the company, our colleagues and our customers. We take that extra step to make sure our clients are fully satisfied with our service and expect our staff to show the flexibility needed to achieve this.Boon Edam is a global market leader in entry solutions with offices across the world. Although we currently employ over 1400 people worldwide, we remain a family company at heart. We are proud that a large number of our people have been with us for over a decade. They have joined us at the start of their career and have developed themselves with us through our internal training and career development programs. We are characterized by our drive and dedication; drive to create the most premium entry solutions and dedication towards the company, our colleagues and our customers. We take that extra step to make sure our clients are fully satisfied with our service and expect our staff to show the flexibility needed to achieve this.Our Values MatterOur Values MatterOur ValuesOur ValuesAt Boon Edam Inc., we strive to live and breathe every day by our core values. They provide a platform that enables us to serve our customers to the best of our ability, treat each other with kindness, work cohesively as a team, improve processes as well as ourselves... deliver the best overall experience in the industry... and having a little fun along the way.At Boon Edam Inc., we strive to live and breathe every day by our core values. They provide a platform that enables us to serve our customers to the best of our ability, treat each other with kindness, work cohesively as a team, improve processes as well as ourselves... deliver the best overall experience in the industry... and having a little fun along the way.What we offer What we offer What weWhat weCompetitive compensation with bonus potential Medical, Dental & Vision plans 100% company paid medical premiums for you and your family Life Insurance 401k with company match Generous PTO & Paid holidays Maternity & Paternity Leave Short- and Long-term disability Employee assistance programs& More Competitive compensation with bonus potential Competitive compensation with bonus potential Medical, Dental & Vision plans Medical, Dental & Vision plans 100% company paid medical premiums for you and your family 100% company paid medical premiums for you and your family Life Insurance Life Insurance 401k with company match 401k with company match Generous PTO & Paid holidays Generous PTO & Paid holidays Maternity & Paternity Leave Maternity & Paternity Leave Short- and Long-term disability Short- and Long-term disability Employee assistance programsEmployee assistance programs& More & More Where are we located?Where are we located?Where are we located?Where areWhere areOur North America Headquarters is located in Lillington, NC. Centrally located between Raleigh, NC and Fayetteville, NC Our North America Headquarters is located in Lillington, NC. Centrally located between Raleigh, NC and Fayetteville, NC 35 Minutes to Downtown Raleigh, NC 35 Minutes to NC State 25 Minutes to Wake Tech 40 Minutes to RDU Airport 45 Minutes to Research Triangle Park 40 Minutes to Cary, NC 35 Minutes to Apex, NC 25 Minutes to Holly Springs, NC 20 Minutes to Fuquay- Varina, NC 40 Minutes to Fayetteville, NC 30 Minutes to Sanford, NC 10 Minutes to Campbell University35 Minutes to Downtown Raleigh, NC 35 Minutes to Downtown Raleigh, NC 35 Minutes to NC State 35 Minutes to NC State 25 Minutes to Wake Tech 25 Minutes to Wake Tech 40 Minutes to RDU Airport 40 Minutes to RDU Airport 45 Minutes to Research Triangle Park 45 Minutes to Research Triangle Park 40 Minutes to Cary, NC 40 Minutes to Cary, NC 35 Minutes to Apex, NC 35 Minutes to Apex, NC 25 Minutes to Holly Springs, NC 25 Minutes to Holly Springs, NC 20 Minutes to Fuquay- Varina, NC 20 Minutes to Fuquay- Varina, NC 40 Minutes to Fayetteville, NC 40 Minutes to Fayetteville, NC 30 Minutes to Sanford, NC 30 Minutes to Sanford, NC 10 Minutes to Campbell University10 Minutes to Campbell UniversityAbout The OpportunityAbout The OpportunityAbout TheAbout TheWe are seeking a Field and Service Installation Tech will provide technical support for installation, service and maintenance of Boon Edam products.We are seeking a Field and Service Installation Tech will provide technical support for installation, service and maintenance of Boon Edam products.How will you help our impact?How will you help our impact?How will you How will you How will youhelp our impact?You will...You will...You will...You willYou willProvide Boon Edam product service and support via telephone communication and site visits within the branch areaWork with different general contractors, subcontractors, and end-users to install Boon Edam product in a professional, safe and efficient manner.Work remotely with the Technical Service Manager, Installation Manager and Customer Support team at the Boon Edam facility in Lillington, NC.Provide training to less experienced installation and service techniciansRecord and track installation and support materials for project record keepingAbility to receive assignments and work independently from factoryProvide Boon Edam product service and support via telephone communication and site visits within the branch areaProvide Boon Edam product service and support via telephone communication and site visits within the branch areaWork with different general contractors, subcontractors, and end-users to install Boon Edam product in a professional, safe and efficient manner.Work with different general contractors, subcontractors, and end-users to install Boon Edam product in a professional, safe and efficient manner.Work remotely with the Technical Service Manager, Installation Manager and Customer Support team at the Boon Edam facility in Lillington, NC.Work remotely with the Technical Service Manager, Installation Manager and Customer Support team at the Boon Edam facility in Lillington, NC.Provide training to less experienced installation and service techniciansProvide training to less experienced installation and service techniciansRecord and track installation and support materials for project record keepingRecord and track installation and support materials for project record keepingAbility to receive assignments and work independently from factoryAbility to receive assignments and work independently from factoryWho do you need to be?Who do you need to be?Who do you need to be?Who do you Who do you Who do youneed to be?Detail oriented and highly organized.Strong telephone skills, strong verbal and written communication skills. Customer driven & focused Have the ability to prioritize tasks with strong time management skills. Microsoft Office skills, PC, and Internet Explorer knowledgeAbility to work in a team and actively contribute to the success of the team. Continuous improvement mindset with strong organizational and communication skills.Ability to lift up to 50 lbs routinely.Must be able to pass frequent OSHA, background, and drug screens.Fluency in speaking and writing Spanish and English not required but a plus.Detail oriented and highly organized.Detail oriented and highly organized.Strong telephone skills, strong verbal and written communication skills. Strong telephone skills, strong verbal and written communication skills. Customer driven & focused Customer driven & focused Have the ability to prioritize tasks with strong time management skills. Have the ability to prioritize tasks with strong time management skills. Microsoft Office skills, PC, and Internet Explorer knowledgeMicrosoft Office skills, PC, and Internet Explorer knowledgeAbility to work in a team and actively contribute to the success of the team. Ability to work in a team and actively contribute to the success of the team. Continuous improvement mindset with strong organizational and communication skills.Continuous improvement mindset with strong organizational and communication skills.Ability to lift up to 50 lbs routinely.Ability to lift up to 50 lbs routinely.Must be able to pass frequent OSHA, background, and drug screens.Must be able to pass frequent OSHA, background, and drug screens.Fluency in speaking and writing Spanish and English not required but a plus.Fluency in speaking and writing Spanish and English not required but a plus.Experience NeededExperience NeededExperience NeededExperienceExperienceTwo-year degree in Electrical/Electronic Theory or Plant Maintenance, or similar. Or two years similar field experienceMust hold a current U.S driver license and be capable of obtaining a US passport for international travel.Ability to overnight travel 25% of the timeElectrical skills, low voltage electronics and high voltage electrical theoryAbility to read and understand electrical schematics.Electrical circuit trouble shooting abilities.Strong mechanical installation skills (layout, assembly, tie in, etc.)Excellent capability in reading and understanding mechanical and construction drawings.Experienced with use of hand tools such as cordless drill, hammer, levels, etc.Two-year degree in Electrical/Electronic Theory or Plant Maintenance, or similar. Or two years similar field experienceTwo-year degree in Electrical/Electronic Theory or Plant Maintenance, or similar. Or two years similar field experienceMust hold a current U.S driver license and be capable of obtaining a US passport for international travel.Must hold a current U.S driver license and be capable of obtaining a US passport for international travel.Ability to overnight travel 25% of the timeAbility to overnight travel 25% of the timeElectrical skills, low voltage electronics and high voltage electrical theoryElectrical skills, low voltage electronics and high voltage electrical theoryAbility to read and understand electrical schematics.Ability to read and understand electrical schematics.Electrical circuit trouble shooting abilities.Electrical circuit trouble shooting abilities.Strong mechanical installation skills (layout, assembly, tie in, etc.)Strong mechanical installation skills (layout, assembly, tie in, etc.)Excellent capability in reading and understanding mechanical and construction drawings.Excellent capability in reading and understanding mechanical and construction drawings.Experienced with use of hand tools such as cordless drill, hammer, levels, etc.Experienced with use of hand tools such as cordless drill, hammer, levels, etc."}