{"title":"Senior Software Engineer (.NET / Web Services & ETL) (Remote - US) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKCKg93DTojMQkkULnpNLWgAjwwuinGHaZn6GRScM2n-auBk7Gab1Y7sJK7jF-zBZbmXKxlc2JDEeJCLLg8KXNJJTY-mrx0JoQt6qlN-BkMq36EDkNloQf3vdFSPgl0x2UQ5uP_ZNkxLkx1h1_62bWinoQVU91r7DgfCJU6aGFKkWfEUiBVorOM-rdifqNC","source":"ziprecruiter","full_description":"DescriptionThe Senior Software Engineer codes software applications based on business requirements. The Senior Software Engineer work assignments involve moderately complex to complex issues where the analysis of situations or data requires an in-depth evaluation of variable factors. ResponsibilitiesDo you thrive on working on the cutting edge technologies? Do you want to develop technology solutions to transform an industry? Crave new challenges and solving hard customer problems using the latest in software technology?... As a Senior Applications Engineer, you will use the latest technologies to transform and migrate on premise applications to Cloud to create enterprise solutions. Come help us re-imagine our solutions to provide world-class, best of breed solutions to delight our customers. Make a major impact on the Healthcare industry.'The Senior Software Engineer standardizes the quality assurance procedure for software. Oversees testing and debugging and develops fixes. Researches complaints and makes necessary adjustments and/or recommendations to resolve complex software related issues. Begins to influence department's strategy. Makes decisions on moderately complex to complex issues regarding technical approach for project components, and work is performed without direction. Exercises considerable latitude in determining objectives and approaches to assignments. This opportunity will enable the individual to work with newer technologies (neo4J, Mongo Database, Streamsets, Kafka) and cloud migration.Responsibilities:The Senior Software Engineer standardizes the quality assurance procedure for software. Oversees testing and debugging and develops fixes. Researches complaints and makes necessary adjustments and/or recommendations to resolve complex software related issues. Begins to influence department's strategy. Makes decisions on moderately complex to complex issues regarding technical approach for project components, and work is performed without direction. Exercises considerable latitude in determining objectives and approaches to assignments.Role Essentials: Bachelor's Degree in Computer Science, Information Systems or related field + 5+ years of experience in applications program development + Strong .Net C# development experience + Strong analytical and problem solving abilities + Excellent organizational, interpersonal and communication skills + Track record of success in development and support of applications utilizing waterfall and agile-scrum methodologies. + Ability to translate high level details into coding/testing requirements. + Comprehensive understanding of OO, SOA, and PaaS principles, design patterns, and containerization (i.e. Docker) + Strong Web & Service Development expertiseExperience in relational databases like Oracle/SQL Server and Document based NoSQL database like MongoDB/Cosmos.Experience using Microsoft .Net Core and NugetExperience in Public (Azure/GCP/AWS) or Private Cloud (PCF) implementation or Certification in Public cloud.Experience using Graph Database (Neo4j) technologyExperience or exposure in DevOps tools (Azure DevOps/Jenkins/GitHub)Experience with the any of following technologies are preferred: + Client - Angular/Vue/React + Server - Node.js, TypeScript, Python + Platform - Windows, Linux + Messaging - RabbitMQ/KafkaPreferred Qualifications Master's degree in Computer science, Information systems or related field + Healthcare IT background + Experience with application architecture and design concepts + Experience writing technical specifications + Any public Cloud certificationsAdditional Information: This position reports to the Associate Director, Software Engineering, ITSE - IT Provider + \\#Cloud + \\#LI-Remote + If selected for additional screening, you will receive a text message from Modern Hire (Montage) with additional questions. You have 48 hours to respond.Scheduled Weekly Hours40"}