{"title":"Mechanical Equipment Specialist - US Navy Experience Required - 1759 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALIg0-w6OKmoRh1P-UQxDFu66badTm8RcIHtp1VML2jE_S-fEU5sXVp-7MsjdUcXMgLD_8ms8cdLJAqdIENMMnotlWG3RpJ2pdHSBP-zJXL9e4zR5vek7qwO1UAcNVm6GD47nzZzUIGqm5-RyzCQwt8PQkWsAwlVEwfUv2iiQY0ddj-wX3WmkDHjz4SZ0A","source":"ziprecruiter","full_description":"GVI, Inc, a subsidiary of Three Saints Bay, LLC and a Federal Government Contractor industry leader is searching for an experienced Mechanical Equipment Specialist - Navy to support the Planned Maintenance System Project managing Auxiliary Systems.Thorough knowledge of operating, repairing and maintaining installed Steam-turbines and Reduction Gears, Turbo-generators, pumps, and oil purifiers; Air conditioning and Refrigeration units, Liquid oxygen and Nitrogen units, Hydraulic lifting and Hoisting gear, Hydraulic power plant components and mechanisms. Familiarity with emergency diesel engines and corresponding sub-systems. The Navy Rate skill set that is best suited for this position is: Machinist's Mate (A-ganger, Submarine of Surface) or Engineman with a variety of experience both inside and outside the engineering spaces or other Navy technical rates with experience performing or managing maintenance on related systems aboard Navy vessels.Typical Fit for Duties Performed while on Active Duty: 3M Coordinator, Department 3M Assistant, Leading Petty Officer, Work Center Supervisor, ATG/TYCOM experience desired but not required.Position Responsibilities:Familiarity with basic technical and administration policies, procedures, and practices.Ability to perform technical reviews and prepare responses to Planned Maintenance Systems (PMS) Technical Feedback Reports (TFBR's) to include complete tracking, interfacing with technical codes, In-Service Engineering Agent and shipboard personnel to resolve issues with above listed systems and other related systems/equipment.Ability to develop Planned Maintenance Systems (PMS) documentation for new ship construction and/or new systems/equipment configuration using the Reliability Centered Maintenance (RCM) concept.Ability to research technical manuals, blueprints, ship's drawings, and conduct ship visits to validate (PMS) coverage for shipboard and shore station equipment. Ability to establish, update, and maintain the corporate history of developed (PMS) documents, to include Maintenance Index Pages (MIPs) and Maintenance Requirement Cards (MRCs) for associated auxiliary systems.Ability to coordinate with Acquisition Managers and In-Service Engineering Agents (ISEAs) to ensure accuracy and adequacy of (PMS) coverage for modified or newly installed systems/equipment on board Naval ships and Shore commands.Position Requirements:US Citizen.Must currently possess an Active Secret Clearance.High School Diploma or equivalent.Five (5) years of related experience.Must be able to pass a background investigation and drug screen as a condition of employment.Valid US Driver’s License.Proficient with MS Office Suite.Excellent verbal and written communication skills.Excellent customer service skills.Position located in San Diego, CA.Apply online at: https://phg.tbe.taleo.net/phg01/ats/careers/v2/viewRequisition?org=GATEWAYVENT&cws=55&rid=1759or email resumes to: Employment@ThreeSaintsBay.com.VEVRAA Federal ContractorThree Saints Bay, LLC and its subsidiaries offer a diverse, team-oriented working environment and the opportunity to work with exceptional dedicated industry professionals. We offer our employees a comprehensive benefits package and the opportunity to take part in exciting projects with government and commercial clients, both domestic and international.We are an EEO/AA employer. We invite resumes from all interested parties without regard to race, color, religion, creed, gender, national origin, age, genetic information, marital or veteran status, disability, or any other category protected by federal, state, or local law."}