{"title":"Software Developer (Track Services)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALbZ6gjp9d8jmlX4IBvW81MjUuqHzosHZWRtGFC0DB8lgsDg1ACcAL9cTJTgQcZYbhe6iVAztEzUVwTB_wYgc_IOzWF0bX1JLCzgJZXSZJpPx2_DF4skOu9PLVWZdGSEsufIRqIZ8tQNIDvuNLOpW0szNrawbB0bWrRwODXAOJuZI2Eb1s5FCmQaZb8o-TZ","source":"ziprecruiter","full_description":"SecretISYS Technologies delivers emerging technology solutions through our diverse and talented employees who are dedicated to our customers’ success. We empower our teams, contribute to our country and operate responsibly. We are a reputable award-winning WOSB providing Engineering and Enterprise Information Technology (EIT) services to the Federal government.  Headquartered in Colorado, ISYS serves key national customers throughout the United States with a presence in more than 16 states. Functional Responsibilities:                                                                            ISYS Technologies is Software Developer (Track Services) Clearance:  Secret  Job Duties:Design and development of Java-based applications and automated testsGenerate software design artifacts, implement software changes, support design and code reviews, support software testing and resolution of issues arising from software testingExperience Requirements: Bachelor degree in software engineering, computer science, mathematics, physics, or related field from an accredited college1+ years’ experienceExperience in software development of Java-based applications and systemsHands-on development experience for Java-based applications in a UNIX/Linux platform environment. Experience developing software in a structured, process-based integrated team environment. Use of common software development and management tools such as Clearcase and Eclipse Understanding of standard system engineering design artifacts such as Use Cases and SysML diagrams Experience implementing mathematical algorithms in source codeWorking knowledge of Ballistic Missile Defense concepts, and Command and Control systems, defense communications systems, and the BMDS in general is especially beneficialGood working knowledge of MS Office products. Desired Requirements:Command and control system application development Experience with Software Integration testing Strong problem solving skills, including the ability to review performance issues, identify root cause and recommend a solution. Essential Requirements:US Citizenship is required. ISYS Technologies is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected Veteran status, or disability status. Physical Demands:The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job with or without reasonable accommodation. While performing the duties of this job, the employee will regularly sit, walk, stand and climb stairs and steps. May require walking long distance from parking to work station. Occasionally, movement that requires twisting at the neck and/or trunk more than the average person, squatting/ stooping/kneeling, reaching above the head, and forward motion will be required. The employee will continuously be required to repeat the same hand, arm, or finger motion many times. Manual and finger dexterity are essential to this position. Specific vision abilities required by this job include close, distance, depth perception and telling differences among colors. The employee must be able to communicate through speech with clients and public. Hearing requirements include conversation in both quiet and noisy environments. Lifting may require floor to waist, waist to shoulder, or shoulder to overhead movement of up to 20 pounds. This position demands tolerance for various levels of mental stress. ISYS Technologies is an Engineering and Information Technology Company focused on providing Services to the Federal and State Government. ISYS offers a competitive compensation program and comprehensive benefits package to our employees."}