{"title":"Principal Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ2usYKoBnfGAU6G_--bYwvotEdxkBYQdTP9Qlqw3YiBtPtYdf5gVlR7G-MD2xHZN9VB_CSalsQP5IeThZrVfvWFo50IHe1c0M9e_Tlv7lZ-VUMMZJVu2qfD7YINeF-01LDvt3b7gaC75Tmw08Wary7vRhN_Xd1Lr5UaaSSEbpuYwWvP1wAu2xGyba7baHC","source":"ziprecruiter","full_description":"Principal Software Engineer If you are a Principal Software Engineer with experience, please read on!---On site or remote | Direct hire position---With our HQ located in San Diego CA, we are a groundbreaking graph-based knowledge discovery, analysis and visualization software technology company. ou will join a growing team of software engineers working all phases of the software development lifecycle to produce cutting edge, best of breed commercial software.What You Will Be Doing- Take ownership of system design and/or system components to ensure excellence in execution- Work alongside others in executing the delivery of complex yet coherent end-to-end systems on time and within coding standards- Be a key contributor to the company as you transition user stories into high quality, highly functioning code.- Implementing enterprise-class Java-based servers, REST APIs, and user interfacesWhat You Need for this Position- 5 Years as an Application Architect and a minimum of 10 years developing Java applications- Java Spring Framework- Core Java- RESTful- ETL (extract, transformation, and load)- SQL- Microservices- AWS, Azure or gcpExperience with the following is a plus:- Graph Theory / Social Network Analysis / Ontology(BIG plus)- Bus architectures such as Kafka or Tibco- MPP solutions such as Greenplum, Netezza, Informix XPS, Teradata, etc- NoSQL databases and in particular experience with Schyla and Cassandra- Semantic Web / RDF / Graph & Triple Stores / Linked DataWhat's In It for You- Competitive Base DOE- Potential stock options- 401k matching- Full benefits including medical, dental, and vision- Opportunity for professional growth- Awesome Glassdoor review- Great company culture and work-life balance!- Much more!So, if you are a Principal Software Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}