{"title":"React Native Mobile Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALDb3IA-o29LWOQ4XOSvrtRmVVTGUY93nYmFzvaEjbyMfVeWe7xkK50RarzFtP5nIkQnBbxgxFtmSMcvhol9gvJRrjhICaNVp21dfP6gce1xCCkT2adlmHP1AHIWyQF0DdgP0TWk6YJpR96_EfTJ8axgQyd2PtEMrzHNO3iwUkCy6QYRPXyanJHd3PXnng8","source":"ziprecruiter","full_description":"About Red TechnologiesAt Red Technologies, we’re changing the way freight moves. Our technology plays an essential role in everything we do and is built to solve the challenges that come with managing freight for our shippers, carriers, and drivers. Our fast-growing company allows for you to bring new ideas to the table while quickly making an impact on the future of our technology.What You’ll Be Doing:As a React Native mobile developer, you will be key in the design, testing, and maintenance of our proprietary app, Red Tech Mobile. Your goals are to develop new core functionalities for the app, and maintain its compatibility with iOS/Android. You will be responsible for work in all stages of the development life cycle - reviewing business requirements, design, construction, testing, and implementation.Our Ideal Candidate Is/Has:At least 1-3 years of experience in either React or React Native Experience using the Agile development methodWorking knowledge of Github/BitbucketAn eye for good UI/UX designExperience with ExpoExperience using React HooksExperience with Unit Testing (Jest, etc.) Why Red Technologies?Be able to make an immediate impact in a rapidly growing companyComprehensive training program to set you up for successOngoing career development and internal advancement opportunitiesModern, downtown office with a bowling alley and an on-site gymCasual dress code- Red Technologies gear for the days you can’t decide what to wearConvenient downtown parkingComprehensive medical, dental, and vision insuranceLife insurance and 401k with employer matchRed Technologies provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. Red Technologies is committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a disability, you need a reasonable accommodation, please send an email to info@redtms.com to notify us of your request. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}