{"title":"iOS Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALnU0-nBkRYJ22HFV1KG8-b5Ab0PRJ8O_6MsL8sBEE8q_Olr90mjbiBBgMaRFABGJ4FUNUkyzM6iT1w7GmAfbuopwSkjbfyJNthxfIDBem4xaZmCLYt9fCVKqIzSVK987Gswf93FtARGhkQkacviA1pakNl3ANvFsuE2XQi84FP3v0t6tzCUP7YU68z5p8","source":"ziprecruiter","full_description":"At eimagine, we believe one thing over everything. We are only as good as the people we hire to join our team! Founded in 1998, eimagine specializes in Microsoft SharePoint, Dynamics CRM, Salesforce, custom application development and mobile development. We are a Microsoft and Salesforce Partner with a staff Certified Professionals. Recognized as one Best Places to Work in Indiana since 2015, eimagine fosters an environment of employee engagement, career development and a comprehensive benefits package. We are seeking a iOS Developer who will be responsible for developing new native /hybrid mobile applications for clients of eimagine. Successful candidates must be resourceful, detail-oriented, and self-directed, with a passion for understanding their clients’ business and implementing technical requirements in a way that fulfills that need. Outstanding listening skills, genuine interest in fostering teamwork, a willingness to provide honest feedback, and extreme ownership are keys to the success of our projects. If you are looking for a challenge, willing to go the extra mile, and want to work with people who are just as talented as you are, this is the place for you! Description of Duties:Define and develop new native/hybrid mobile applications and web products (iOS and web).Design and build advanced applications for the iOS platformWork on iOS libraries supporting multiple applicationsEnhance existing mobile applications and web products with added features and functionality.Work with business partners to understand requirements, consult on possible solutions, create and determine technical tasks necessary to fulfill themDirectly interface with customers to support, troubleshoot and resolve issues.Demonstrate application functionality for new and existing customers.Code, test and support mobile and responsive web applications throughout the software development life cycle.Deploy and debug native/hybrid mobile and web applications.Understanding of Service Oriented Architecture and Object Oriented Programming Architecture.3+ years of iOS developmentSwift experience within the iOS environmentExperience working with remote data via REST and JSONUnit testing with XCUnitExperience with third-party libraries and APIsWorking knowledge of the iOS ecosystem, architectures, paradigms, trends, and emerging technologiesFamiliarity with \"Git\" is preferredExperience working with remote data via REST and JSONUnit testing with XCUnitEffectively prioritize, organize, use time-management skills and be adept at multi-taskingConfident in making decisions, accurate, detail-oriented and able to problem solve/analyze.Good interpersonal, listening, written and verbal communication and troubleshooting skills.Bachelor’s degree in information technology, computer science or business administration required"}