{"title":"Staff/Principal Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALXbhir0xzo3nJH4FLUyrTTBCy0AzJkKmljqQUwvtgf5_AN6QBeYeNCbLQWQzokwnb2srzUh3aSa15X7_uU1Lh32Iqp5MP1YIeWNEA0PtcLPiSTJk4sI4bqIX-0WVYpxR3aef6JGRvzYgI7ELjkiH610aEWWErgZ5mbw5MfSqOegZ608tcQjnJMMwdGFXA","source":"ziprecruiter","full_description":"DescriptionInscripta is developing the world's first scalable platform for benchtop Digital Genome Engineering. The company's advanced CRISPR-based platform, consisting of an instrument, reagents, and software, will offer a fully automated workflow that enables multiplexed, trackable editing of cells at an unprecedented scale. Inscripta's goal is to empower scientists whose gene editing research is stifled by current technical and licensing limitations. By providing this unique platform and engaging in collaborative business practices, such as making its MAD7 CRISPR nuclease free for research purposes, the company enables scientists to realize a new era of biological discovery.  Due to rapid growth Inscripta has an opening for a Staff/Principal Chemist which can be located in either our Boulder, CO or Pleasanton, CA office.We are looking for an outstanding Staff/Principal Chemist to drive development of a CRISPR-based DNA editing platform.  This individual will innovate in areas of chemistry development, process optimization, hardware/consumable development, and product automation. Essential aspects of this position include project leadership, innovative solutions, formulation design, synthesis, and analysis.  The right candidate will leverage their creativity and R&D experience to build an industry-leading genetic-engineering platform in a highly innovative, team-oriented, fast-paced environment.Responsibilities:Provide scientific leadership in a technical team to build a high-throughput automated, genetic-engineering platformDesign and synthesize new compositions of matter including polymers, materials, and chemistries for use in fluidics and nucleic acid applicationsPerform bioconjugation, purification, and characterization of oligonucleotide complexesFlexibly contribute to high-priority tasks across platform development effortsPresent clear and concise written and oral communications to colleagues and supervisorsRequirementsDemonstrated experience solving challenging, interdisciplinary research/development problems at the interface of chemistry, nanotechnology, biology, materials, and engineeringExpert knowledge of chemistry techniques used for nucleic acid manipulation, functionalization, and fluidic device surface modificationsDemonstrated expertise in the development of new materials such as nano-materials and nanotechnology, composites, and/or novel polymeric materialsExperience in oligonucleotide or peptide synthesis, modification, and purification is a plusDesire to work in a team environment and collaborate closely with other cross-functional and geographically distributed teamsExperience with mammalian cells and their manipulation in fluidic systems desirable.Ph.D. in materials science, polymer, chemistry, biochemical or related field.  A minimum of 5 years ofexperience in a multidisciplinary R&D setting.   Inscripta offers a competitive base salary, bonus plan, benefits package and stock options to all team members.  Join us and work with a great team of people developing the world's first scalable platform for benchtop Digital Genome Engineering. At Inscripta we don't just accept difference - we celebrate it, support it, and thrive on it for the benefit of our employees, our innovation, and our community. We are proud to be an equal opportunity workplace because the more inclusive we are as a company, the better our work will be. Inscripta is headquartered in Boulder, CO with offices in Pleasanton and San Diego, CA. This role could work out of either our Boulder, CO or Pleasanton, CA location, however strong preference will be given to candidates who live or are willing to relocate to Colorado."}