{"title":"Ionic Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKupHUVt4sR1tZG6B_7x9auDM-cVeC3y4sqOKcTl5qupu6VhlUM7rhLz7D2eki5mIBkM9LPcFK9xtobjRdFLXw_asgUeXRa8IsSaT9yBfIbMDFqMOehUbIwE3lmSFumPjBa-KNQTYNusgP8OCrPqrnj8q4yTJvoAbxRIFeB581Yq2e09QgT571W3QsEap0","source":"ziprecruiter","full_description":"As a company whose mission is to be the most progressive and inclusive money transfer business in the world, we deliver the highly reliable payment services to our customers. With locations in over 402k locations in 165 countries, we have adopted the true identity of what it means to be multicultural and embody the idea of being family, no matter where we are. At Ria, you’ll be surrounded by colleagues, across the globe, who are dedicated to each other and empowered to be creative and nurture “out of the box” solutions.Join our family. The OneApp team within Ria is responsible for our money transfer application. The Ionic Developer will be responsible for working closely with developers in Spain and Germany to maintain our current application and expand for future scalability.WHAT YOU HAVE: Strong understanding of Ionic, Cordova, Angular and web markup (including HTML/CSS/SASS)Technical portfolio includes: Native iOS, Native Android, Vue.js, RESTful & SOAP-based web servicesGood experience of usability and design and are well versed in dealing with common APIs and interfacesExcellent understanding of developing app solutions and a good understanding of currentDAY TO DAY:Work on developing new app solutions in the innovative, competitive and challenging money transfer sector for both Android and iOSBuild reusable code and libraries for future use and ensure the technical feasibility of UI/UX designsParticipate in the development of comprehensive concepts starting with the design to actual implementation and integration of itDesign interfaces by working with the API teams locally and worldwideWork with an agile and international team of skilled and motivated developers and stakeholdersOUR TECHNOLOGIES:JavaScript, Vue, HTML, CSS, Tailwind, Ionic, Restful and SOAP-base sweb services, Native iOS and Android, .Net, C#Why Choose Ria?In this business, humility can be hard to come by. We put others ahead of ourselves, the way our customers do every day. Because this isn’t just business, it’s personal. People deserve much more than just a fair price. They deserve empathy, hope and ultimately respect.This how we do right by people and their needs – not more, not less.We never rest, we raise the bar and put people first.We work hard and take nothing for granted.We facilitate possibilities in every possible way.We champion people’s needs, today and tomorrow.We open ways for a better everyday life."}