{"title":"515 - 1st shift / Manufacturing Tech position in Austin, TX","location":"","salary":"","description":"","term":"$19 to $21 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAKAWwai_TTIsgicNZwW4QpPUBiDDZDXUxLMH67rSeCQuBtgNiA3STVlLC4ScLGqaRZPo2Escv5JsMlEM3CWJIJOcwimpgk_zHrOqqxlvEP1RGhNaacG75zfblkOBZ1uEz2J7hbuUhg_gxaWcUcYuiudhXEE5YmBJmCeDTyaNeAb0l-ZQYbmowDrKFI2061A","source":"ziprecruiter","full_description":"One of our largest clients in Austin,TX, a leader in the semiconductor industry, is growing rapidly and is currently hiring! Positions are full time and long-term term to indefinite contracts with a chance to be hired on permanently.We have immediate openings for Manufacturing Technicians in the Austin, TX area who are looking to earn plenty of overtime. We have a few shifts available, please see below1st shift Monday - Saturday 6:00am - 5:00pm. Should be comfortable working on Sunday if neededPay Range is from $19.00 - $21.00 base 18-month contract witch can turn into a permanent position Please see the below job description and if you feel you are a fit, please apply!JOB DESCRIPTIONUtilizes routine work orders, schematics, wiring diagrams, parts and wire lists, written and/or verbal instructions to build, repair and/or test electrical, electro-mechanical, vacuum, pneumatic assemblies, sub-assemblies and components.With assistance, performs electro-mechanical assembly operations, troubleshooting and repair. Identifies and corrects errorsUnder supervision, utilizes test fixtures, electronic measurement equipment, leak detectors, and/or vacuum pumps to test assemblies, sub-assemblies and components. Enters data on computer terminal, such as progress, work expense and labor details. May perform computer programming, repair or software installs.Details finished work. Receives parts and performs audits to ensure all necessary parts are available to perform built, test and repair. Inspects parts for defects. Troubleshoots and improves processes.May perform other duties as assigned.SKILLS AND ABILITIES Requires strong skills in change management, problem solving, communication, customer orientation, personal effectiveness, team skills, and quality.Requires use of hand tools and some power tools such as a drill press, belt sander, power saw, etc.Requires knowledge of systems and software necessary to perform job function such as MS Word, Excel, PowerPoint, Oracle Manufacturing Inquiry and View, and/or PDM.Ability to work flexible hours and overtime as needed.EDUCATION AND EXPERIENCE AS Degree preferred but not requiredDiplomaBackground Check: Up to 7 yearsDrug Test: YesIf you feel you are a good match, please apply!***Equal Opportunity Employer/Veterans/DisabledTo read our Candidate Privacy Information Statement, which explains how we will use your information, please visit https://www.modis.com/en-us/candidate-privacy/The Company will consider qualified applicants with arrest and conviction records."}