{"title":"Technical Support Manager - Clinical Decision Support","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJQZnLNJ4MbCYS1WppTx74eNQtSMgfbSoOEagEEurKuxfhIsswDpZaH_JO-BsNDuyLBe_iVSzR1ZWs64-lkFry942Y8ZcEIRoghAZaFcUXT0dwAq6F8pjp4ReU2-uFPSYTQrk1CxsDxigffdW9PLbhn1Ju3K1tvoPu9Uod_2ou57ql7ZVDR-Sbo_U6P57sr","source":"ziprecruiter","full_description":"Technical Support ManagerTranslational Software is a Software as a Service company that unlocks the value of genetic testing for clinicians. We are looking to add a well-rounded and technically minded Technical Support Manager to our team. Support Engineers are accountable for everyday tasks required to support clinical organizations and laboratories in generating and distributing data derived from genetic test results, as well as the implementation of internal process improvements necessary to increase efficiency as the company expands. Candidates must possess strong critical thinking skills and be self-motivated; preference will be given to those that either have previous experience or a strong interest in genetics and clinical environments. The ideal candidate will be comfortable discussing complex concepts with external clinical personnel and our internal development team. A basic understanding of genetic testing and terminology is highly desired. Minimal business travel may be required.PRIMARY RESPONSIBILITIES:Provide on-going technical support to clinical organizations and diagnostic laboratories for Translational Software's Clinical Decision Support platformAssist with implementation and troubleshooting of complex technical integrations Maintain procedures and processes for root cause determination and issue resolutionProvide training to customersServe as liaison between the Customer Support, Development, and Scientific teamsCollect technical requirements and/or customer feedback and translate into formal software requirements for the Development teamDocument new software functionality for both customer and internal useProvide an excellent customer service experience by offering support through phone, e-mail, and chat in a timely and accurate mannerBuild and manage a team with diverse technical talentsADDITIONAL RESPONSIBILITIES:Develop and maintain in-depth product knowledge in both the software and scientific realmsDesign and implement reporting templates Assist customers and internal teams with data mining and analytics activitiesPrepare documentation and reports on routine customer interactionsQUALIFICATIONS & SKILLS:Bachelor's or Masters degree in computer or laboratory science or a related fieldExcellent oral and written communications skillsDemonstrable critical thinking and problem-solving skillsExposure to or working knowledge of one or more programming languages (C#, HTML, JS, SQL, etc.) helpfulBasic understanding of (or interest in learning about) genetic testingHigh level of proficiency with basic office software (Outlook, Excel, Word, PowerPoint, Sharepoint)Ability to function in a fast-paced startup environment with fluid responsibilitiesStrong customer empathy and ability to see problems through to conclusionJrqigNQeou"}