{"title":"Med Tech- Chemistry/ Hematology 2nd shift- Perm","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AAKtfTKy8gay_qWBlZI30K7_l8zJCZE8ZYrRmt0ZA59--ID5ZFBKQgILm08KifZ-HWVDwV30iYALjsIvsv8GI_N8VsPZ7gPXG7ssRKtfO_6DA18RNOOGn5-cgZZRcJ4GxL_DPQ57m-Qw3PDIVYxqA6ScZpL_y4rl-V7biUWak9gMnNF81Y_W_8rFjuSy3zJG","source":"ziprecruiter","full_description":"Job Summary Directs and performs standard laboratory procedures for diagnosis and treatment of disease to include chemical microscopic bacteriological immunological hematological and coagulation studies. Operates equipment to make qualitative and quantitative analyses of specimens. Recognizes abnormal trends or results and makes required decisions and corrections. Performs in a teaching role as required. Assists with patient phlebotomy registration and order entry. Essential Functions \"Completes required daily procedures and checks that equipment is maintained in good working order. \"Ensures work area is cleaned stocked and organized daily. \"Performs manual calculations and documents results accurately. \"Analyzes and reports test results applies rules of specimen rejection and arranges recollection of specimens as needed. \"Acts as in-charge tech when requested. \"Follows established general safety procedures and utilizes PPE appropriately. \"Coordinates work to achieve maximum productivity and efficiency in performance of assigned tasks. Recognizes and deals with priorities. \"Ensures that patient billing is accurate for testing performed.\" Demonstrates proficiency and follows testing procedures and policies by adherence to quality assurance guidelines for equipment and work area, documenting corrective action to any non-conforming event.\" Prepares reagents, maintains an adequate supply of materials for test procedures and manages inventory to effectively reduce departmental waste/expense.\" Exercises clinical judgment in assessing priorities while identifying, problem solving and offering solutions to test systems through the appropriate department channels, i.e. contacts hotline to troubleshoot with a specialist when necessary to resolve the issue or set-up service when appropriate.\" Assists with review and revision of procedures and documentation related to accreditation, adhering to all regulatory requirements for various authorities, including but not limited to CAP, TJC, OSHA.\" Maintains clear, real time communications shift-to-shift and with leadership regarding issues, concerns and problems which may affect patient care or the operation of the department.\" Participates in planning and implementing change through participation in staff meetings, task forces or projects.\" Participates in competency assessment program, where qualified."}