{"title":"Senior Process Development Chemist","location":"","salary":"","description":"","term":"$90,000 to $110,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKH3Z8qOGO45Uv4Nr5x9mOY1SsbiO7QNO9VxMEa7D9RCsnSKFeul_BF4TM1H2jjdbLhhO-W13Ht_dubO5POpi-pObSQlNe-8lxUm5TLbhtp52LhOT5RKRbQ7iAxqajlJXPIl8rJVxxL3rjpAXS4XX646R_4VbULumTaoB8teWtRZGyl8lR0Trl5SrR_hyw","source":"ziprecruiter","full_description":"SENIOR PROCESS DEVELOPMENT CHEMISTPOSITION SUMMARY: We are a full service Pharmaceutical CDMO and we have an immediate need for a Senior Process Development Chemist in our High Potency API site in Riverview, MI. We offer a generous compensation and benefits package as well as RELOCATION assistance and H1B Visa transfer.The Senior Process Development (PD) Chemist is responsible for the development of current and new manufacturing processes under the supervision of a senior member of the group.To perform this position successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required.Shall adhere to all regulatory requirements, including FDA, EPA, OSHA, and related safety, health and environmental procedures, policies and practices.Consistent support and practice of all Company mission and values.KEY ACCOUNTABILITIES: Carries assigned tasks under the supervision of a senior member of the group.Develop, conduct, and/or manage the process development of current and new synthetic/process pathways under minimal supervision.Maintain communications with clients and ensure their requirements are met.Manage the production of new APIs. Ensure that adequate supplies of process materials (raw materials, solvents, reagents, etc.) and operation equipment (hoses, reactors, glassware, etc.) are available for assigned tasks.Ensure that product shipments meet customer and regulatory (FDA, EPA, OSHA, etc.) requirements.Write progress reports and provide technical support in meetings regarding current API production and new API process development.Ensure that approved processes are carried out according to cGMP guidelines and are properly documented.Keep Quality Assurance and Quality Control departments updated in regards to project/client requirements and schedules. Participate in the development, training, and transfer of new processes into the plant. Maintain accurate inventories of materials.Prepare appropriate reports as needed for management and/or clients.Maintain notebooks for research and development and non-GMP activities. Complete and audit production and cleaning records. Complete logbooks and documentation (dispensing record, BPRs, cleaning records, deviation reports, etc.) related to production and cleaning is accordance with regulatory requirements.Generate and/or evaluate standard operating procedures as required.Provide technical support for chemical operators, engineering, quality control, etc.EDUCATION/EXPERIENCE: To be qualified as a Senior PD Chemist, a candidate must have a B.S. or M.S. in Organic Chemistry and up to five (5) years’ experience in a relevant field.Qualified candidates not meeting the above education/experience requirements will enter as a PD Chemist.Knowledge of organic chemistry and chemical safety.JOB COMPETENCIES:Excellent organizational and planning skills.Strong written, verbal, and interpersonal communication skills.Self-motivated, creative, and independent.Ability to work on projects covering a variety of chemical compounds with minimum supervision.Familiarity with cGMP, plant safety, and EPA requirements is desired."}