{"title":"Advisory Hardware Modeling Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKHm-fucCKke5jn_eC4KAwFqAxnbFj6vvUbxbPR6dkk8tLdTzQ2PDS7VD-o3GBZdmsl-Oxhn_RdIy2QQ5r8o2nAlaO9PeqWL0DDFwV5-rbXADdfBcvM6w4OBqX8E1Rp_etuucQmpS87vtYzZyMDMivp_76gWKKCXTBQfjanl8FW3k7SvAZ6uvi9o0ZgGweT","source":"ziprecruiter","full_description":"Advisory Hardware Modeling Engineer, IBM Corporation, Austin, TX: Implement new features and maintain existing codebase of simulator on code repository based on processor design workbook. Validate the simulator model and fix any inaccuracies in the model behavior by interlocking with processor design teams to compare performance metrics between simulator and design requests triaging any mismatched workloads. Evaluate new features by running real/synthetic workloads on the performance simulator. Set expectations for performance metrics and debug any unforeseen behaviors. Collate and present various performance metrics from different performance experiments. Report experimental results to microprocessor design engineers and deliberate on feasible options for inclusion into plan of record. Write and maintain regression tests to maintain the health of the performance simulator. Conduct performance tests and debug performance issues on real hardware during processor bringup. Come up with and prototype novel ideas in the simulator model to improve performance of future microprocessors. File invention disclosures and add to company intellectual property. Utilize Computer Architecture, Processor Microarchitecture, System on Chip (SoC) Architecture, system performance analysis using simulator models, Compiler Design and Optimization, Optimization of Just-In-Time (JIT) Compilers and libraries, Python and Linux scripting. Required: Master's degree or equivalent in Computer Engineering or related (employer will accept a Bachelor's degree plus five (5) years of progressive experience in lieu of a Master's degree) and one (1) year of experience as a Performance Engineer or related. One (1) year of experience must include utilizing Computer Architecture, Processor Microarchitecture, SOC Architecture, system performance analysis using simulator models, Compiler Design and Optimization, Optimization of JIT Compilers and libraries, Python and Linux scripting. Send resumes to recruitad@us.ibm.com. Applicants must reference Y342."}