{"title":"Senior/ Lead iOS Engineer/","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJNhJ6-K6_gvoGQTrWlJo3tQNgr--9keWNiknT-7Qz2oiEvqDscZ_WcofN7j8JkS2hUP-mMS2wnvhiIKRV9V7XsyUIdKT0QViqQnpYcSH7-c10Ww9FBhBqPIcpC6ULN4vXeqEb9wQ-DBxrT2EObA673wTLavwsKCA9aE-1kFn22BqDiYbJoUxYlxXDDQBdj","source":"ziprecruiter","full_description":"Our Opportunity: Chewy is looking for a Senior\\u0026amp;nbsp;iOS Developer to join our Pet Health Team located in our Dania Beach, FL. office. The ideal candidate succeeds in a fast-paced environment, is self-motivated, and has a passion for both business and technology.\\u0026amp;nbsp; You will be responsible for maintaining existing code and developing new features in a Swift based native iOS application.\\u0026amp;nbsp; We pride ourselves on the Chewy culture and are looking for teammates who value collaboration, innovative problem solving, and quality products so that we can continue to provide the best possible experience for our loyal Chewy customers. What You\\u0026#39;ll Do:+ Contribute to system architecture and design + Improve code quality through participation in peer code reviews and knowledge share sessions, within and across teams. + Keep up to date with the latest technology and development trends in iOS + Contribute to all areas of the development lifecycle, including architecture, design, development, testing, and releasing to the App Store + Unit test code for robustness, including edge cases, usability, and reliability + Work alongside product managers, designers, and other developers to analyze tasks and provide accurate estimatesWhat You\\u0026#39;ll Need:+ Excellent verbal and written communication skills + Expertise with Objective-C or Swift (preferred) + Proven experience in writing high quality, reusable code + Experience releasing to the App Store frequently + Understanding of software design patterns and enterprise system architecture + Experience with Git flow + Experience in an Agile environment + Position may require travelBonus:+ Experience debugging memory and performance related issues through developer tools + Hands on experience with managing an iOS CI ecosystem, including provisioning profiles and certificate management + Knowledge of REST or GraphQL for connecting iOS applications to back-end services + Knowledge of Accessibility best practices and Apple's Human Interface GuidelinesIf you have a disability under the Americans with Disabilities Act or similar law, or you require a religious accommodation, and you wish to discuss potential accommodations related to applying for employment at our company, please contact HR@Chewy.com. To access Chewy's Privacy Policy, which contains information regarding information collected from job applicants and how we use it, please click here: Chewy Privacy Policy.Chewy is committed to equal opportunity. We value and embrace diversity and inclusion of all Team Members. \\u0026amp;nbsp; If you have a disability under the Americans with Disabilities Act or similar law, or you require a religious accommodation, and you wish to discuss potential accommodations related to applying for employment at Chewy, please contact\\u0026amp;nbsp;HR@Chewy.com. \\u0026amp;nbsp; To access Chewy's Privacy Policy, which contains information regarding information collected from job applicants and how we use it, please click here:\\u0026amp;nbsp;https://www.chewy.com/app/content/privacy)."}