{"title":"iOS developer","location":"","salary":"","description":"","term":"$110,000 to $140,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALDdNNzB2OTpB4zW8_GB8w1TkV1rBz8Nppje8ijafh60cx2W2k2W9W3NM_bmADoap7T3AD2s-GNmdtVxo8JFD9DmDxYFfgLDD0kKwtMHRp8l7VrxX4TirUxXo_AvHgeqa-Dy2nbmRZ9bkneg3c8VPcGxTP7inlGrdjsOwWFAYCxr56CgN7hrsIxJ40qtyc","source":"ziprecruiter","full_description":"iOS developer If you are an iOS developer with experience, please read on!We are best described as a group of hackers that enjoy tinkering with things, and making them better than before. We are experts at researching, developing, and analyzing how to best secure your tools and applications, whether they are on desktop or mobile devices. We enjoy what we do here. Helping clients feel at ease, constantly learning, and pushing our creativity to new heights. We are actively looking for iOS Developers with top secret clearance or higher. Recognized by The Washington Magazine as one of the \"50 Great Places to Work\" in the Washington, D.C. area, which was awarded on the basis of attributes such as generous pay and benefits, interesting and meaningful work, opportunities to learn and grow, etc.What You Will Be DoingAs an iOS Developer, you will be working on various team projects, focusing in cyber mobile. This will entail working closely with our clients to ensure their expectations are met in a timely manner. You will be using your past experiences and successes to develop, test, design, and improve customer tools and applications.What You Need for this Position- Active Security Clearance- Top Secret Clearance or higher- Security background (Cybertechniques, Mitigation, Vulnerability, etc.)- iOS SDK- Objective-C- SWIFT- Python- C, C++Nice to have skills: - Experience in Bash or JAVA - Experience in Software Configuration Management - Understanding of low level systems development for Linux, Android, and Windows OSWhat's In It for You-110K-140K DOE- Competitive 401K and corporate profit sharing- Great Medical and Dental - Flexible work hours - Opportunities to travel around the world to conferences and training- Choose your technology- be it mac or windows - Amazing company culture and cool office (break room includes foosball, shuffleboard, VR games) - Coffee and espresso bar- Company activities like concerts, barbeques, game nights, etc.So, if you are an iOS developer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}