{"title":"Chemistry of Photocatalysis","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKknytjdH8JR-Ml2avCXfthkXa82jjr07zHLDvKTn-Jhp-bLzFLCzMgrGtXFnWVplVfrxDOTdGkIijILSehd82frU-EcgQYL5cRk_HTfdFtm1O_a7tcMtilyDgBI5CkgyKfEYfXoiW5A2xwKDiy5hyY1eQ8pgPxQd7sjsiIY9SowVE4CsqQ9q44uSkOiwo","source":"ziprecruiter","full_description":"Posting TitleChemistry of Photocatalysis.LocationCO - Golden.Position TypePostdoc (Fixed Term).Hours Per Week40.Job DescriptionThe National Renewable Energy Laboratory (NREL), located at the foothills of the Rocky Mountains in Golden, Colorado is the nation's primary laboratory for research and development of renewable energy and energy efficiency technologies.We have a postdoctoral researcher position available in the Chemistry and Nanoscience Center to support our fundamental science in photocatalysis.As a postdoctoral researcher, you'll have the opportunity to work within a diverse,dynamic, multidisciplinary team toenhance your professional skills, and support the NREL mission while also receiving advanced training from a mentor. The appointment will also support the research independence required to pursue your chosen career path.Specifically, the postdoctoral researcher will be broadly engaged in a large group effort exploring the chemical mechanisms of the light-driven photocatalysis of carbon dioxide reduction and water oxidation using molecular, nanoscale or bulk semiconductor systems..Basic QualificationsPh.D. in chemistry, materials science & engineering, physics, or related field. Record of publications/presentations in areas relevant to NREL projects..Additional Required QualificationsQualified candidates must demonstrate skill in interpreting and assessing the experimental results of their own work and have a demonstrated record of success from graduate and/or post-graduate work. Excellent interpersonal, oral and written communication skills are essential for success in this role. Teamwork and collaboration define the modern scientific approach, and the ability to work as part of a larger group is desirable. Inclusion and diversity are core values, and the postdoctoral researcher will be expected to support a work environment that maximizes the unique talents and innovative ideas of every worker.Preferred Qualifications.Annual Salary Range (based on full-time 40 hours per week)Annual Salary Range: $68,000 - $112,200Offers will typically be made in the bottom half of the listed range. NREL takes into consideration a candidate's education, training, and experience, as well as the position's work location, expected quality and quantity of work, required travel (if any), external market and internal value, including seniority and merit systems, and internal pay alignment when determining the salary level for potential new employees. In compliance with the Colorado Equal Pay for Equal Work Act, a potential new employee's salary history will not be used in compensation decisions.Benefits SummaryBenefits include medical, dental, and vision insurance; short-term disability insurance*; pension benefits*; 403(b) Employee Savings Plan with employer match*; life and accidental death and dismemberment (AD&D) insurance; personal time off (PTO) and sick leave; and paid holidays. NREL employees may be eligible for, but are not guaranteed, performance-, merit-, and achievement- based awards that include a monetary component. Some positions may be eligible for relocation expense reimbursement.* Based on eligibility rulesSubmission GuidelinesPlease note that in order to be considered an applicant for any position at NREL you must submit an application form for each position for which you believe you are qualified. Applications are not kept on file for future positions. Please include a cover letter and resume with each position application..EEO PolicyNREL is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard basis of age (40 and over), color, disability, gender identity, genetic information, marital status, military or veteran status, national origin/ancestry, race, religion, creed, sex (including pregnancy, childbirth, breastfeeding), sexual orientation, and any other applicable status protected by federal, state, or local laws.EEO is the Law | Pay Transparency Nondiscrimination | Reasonable Accommodations E-Verify www.dhs.gov/E-Verify|For information about right to work, click here for English or here for Spanish.E-Verify is a registered trademark of the U.S. Department of Homeland Security. This business uses E-Verify in its hiring practices to achieve a lawful workforce."}