{"title":"R&D Process Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIxNhquoRbJOI4SclHSTVLR8P0sR3NeE8lF9LgNoWTNQw7ZHbebqT_sNJ1UOOsEyZvqJmHJmfUApw7Jp7OcJ4e7iDJywuty4cZ7egvpgOJpuuEeK-ewhpP9uMMjrp6vvP3MvrlJMWX7D8S1miZ4VTgl-XReWDDL0ypAPHWIMs57-r_pRmW5lH9BuF2nymfY","source":"ziprecruiter","full_description":"R&D Process Engineer If you are a R&D Process Engineer with experience, please read on!(THIS POSITION REPORTS TO DURHAM, NORTH CAROLINA AND REQUIRES RELOCATION OR A COMMUTABLE DISTANCE, NO REMOTE WORK ALLOWED)Based in Durham, NC, we are a fast growing futuristic company that is changing the world of optics. We are the pioneers of patterned liquid crystal optics and the world leader in innovative solutions for optical and photonics challenges across a wide range of industries.What You Will Be Doing(THIS POSITION REPORTS TO DURHAM, NORTH CAROLINA AND REQUIRES RELOCATION OR A COMMUTABLE DISTANCE, NO REMOTE WORK ALLOWED)The R&D Process Engineer will play a critical role in product development, quality testing and manufacturing scale up activities at our world-class manufacturing facility. This position will be responsible for working with technical team members to operate state-of-the-art thin-film coating and holographic patterning equipment, conduct experiments to determine optimal processing conditions, and perform standard optical characterization. This individual will work alongside both Research Scientists and Production Operators.What You Need for this Position(THIS POSITION REPORTS TO DURHAM, NORTH CAROLINA AND REQUIRES RELOCATION OR A COMMUTABLE DISTANCE, NO REMOTE WORK ALLOWED)- At least Bachelor of Science degree in Engineering, Physics, or related field.- At least 5 years of hands-on experience with standard cleanroom processing equipment (optical or semiconductor)- Prior liquid crystal fabrication experience; this may or may not include experience in the semiconductor or optics/photonics industry, in a lab or manufacturing setting.- Ability to translate product attributes and outcomes to processing conditions and equipment parameters.- Experience working within quality management systems and ISO 9001 environments.- Background in statistical analysis and data driven decision making. Capable of executing test plans and capturing a robust set of accurate data.- Able to work in clean room for extended period.- R2R- Coating- Liquid Crystal Displays- ISO 9001- Roll to Roll- LCD- Liquid Crystal- Thin-film- Optics- CleanroomSo, if you are a R&D Process Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}