{"title":"Sr Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKXYqr7RdNvou5f1fzCt7zCyumhhEJwOyFDwGjtGq2NUDJZT8tVyOt2GPC0e2ewOw02DVZUgpIzPGGNk73odLIhn1LwBAVSl9ortOpRgWh2QfsCmcBVuClPjoxP1EulTagO4mp28-C3P5xsip9sfPozYs_B8vqcJGo8YGppUXAkRniMGYjUrjGiTloPxaHc","source":"ziprecruiter","full_description":"Position Description: Software Engineer is tasked with creating and maintaining the software and applications for Zelis Network Analytics. Software Engineer reports to the Software Engineering Manager in charge of the application they are tasked with.  Primary Responsibilities: Planning, development, implementation and maintenance of current and future customer-facing applications. Research and implement of new technologies as related to the Company's products and services.Work with Product Management Team and developers to develop and document new features for customer-facing and internal applications.Participation in cross-team discussions regarding future product offerings and current topics related to application and database performance, architecture, features and security.Implementation of design specifications.Implement and manage development processes and procedures related to the application and in conjunction with the Software Engineering Managers.Manage production systems and respond to questions and issues that arise from operations.Document and improve existing processesDevelop new applications and enhancements for existing applications using Kanban/Agile methodsWrite code using OOP conceptsUse source control and consult with the development team on best practicesTools/Skills usedRuby/Python Node.jsReactPostgreSQLLinux and command utilities  professional experience:Agile/Kanban experienceExtremely motivated and proactive with a demonstrable history of high achievementThrives when working in a fast paced, demanding environmentInnovative problem-solver who constructively overcomes obstacles utilizing resourceful solutionsPassionate about technology and businessEnjoys a collaborative, team settingWorks well in an open environment and thrives on constructive feedback Possesses excellent oral and written communication skillseducation:Bachelor's degree4+ years experience, with at least 3 years as a Software Engineer Zelis is a healthcare and financial technology growth company and market-leading provider of claims cost management and payments optimization solutions to price, pay and explain healthcare claims. Zelis delivers integrated network analytics, network solutions, payment integrity, electronic payments and claims communications for payers, healthcare providers and consumers in the medical, dental and workers' compensation markets nationwide. Zelis is backed by Parthenon Capital Partners and Bain Capital.  \"We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.\""}