{"title":"MAINTENANCE MECHANICS-All Shifts NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJcdPG0jIEWZnZGw3w7zg6OL8ypIchB9BMzOYGZtmHjOvSarqd0IIUnElawYSs6kJ8SUCwgDyBLxfhcgJ6u2hc2OZKeJKG4gJAf-9AcLU7VCk03mxXlceeg95XazCMNjAkL5JB5Ut5vkmY5_RuDnYt3PRo9Hqz2UZqZb3zW1BRf9OcT5mNdG9_S3oZJpA","source":"ziprecruiter","full_description":"MAINTENANCE MECHANICS-All Shifts-Hillside, NJAAK Foodservice, a division of AAK USA, a Swedish based, world leading producer of high value-added specialty vegetable oils and fats, is a National Foodservice Manufacturer and supplier recognized as the leader in Customer Service and Innovative Solutions. Our purpose is to improve the quality of life of our customers and our employees. We make it our mission to ensure the safety of all employees, develop a highly engaged workforce, and enable our customers to meet their goals while operating in a sustainable and ethical fashion.We make safe, enjoyable food for customers and consumers while adhering to our team values. At AAK Foodservice we encourage and challenge each other, by speaking honestly and openly and being committed and accountable to one another. We have high expectations of ourselves and rely on one another to produce an enhance trust within our team.We are currently seeking a Maintenance Mechanics for all shifts our Foodservice Manufacturing facility in Hillside, NJ manufacturing facility. The maintenance mechanic is involved in the successful daily completion of assigned work either on a priority basis or continuing basis as assigned by the Maintenance. There are no formal reports for this position with the exception of work documentation as required to document material and equipment requests as pertinent to the job.Essential Duties and Responsibilities (to include but not limited to)Work Requirements Performs various mechanical maintenance functions to include but is not limited to:Repairing rotating equipment including centrifugal and positive displacement pumps, agitators, cooling fans and gear boxesInstalling and repairing pipe work, both screwed and welded, in stainless and carbon steel.Experience working on various types of heat exchangers including the over pressure protection.Repairs to all types of valves and pneumatic acutators.Steam distribution equipment and condensate collection.Knowledge of plant utilities such as boilers, cooling towers, compressors and waste water treatment.Executes work in a safe and expedient manner according to the following priorities: Safety, Quality then Production.Performs emergency corrective maintenance daily and attends out of hour call-ins as requested.Executes capital and maintenance project work as directed.Conducts preventive/ predictive maintenanceCorrective maintenance, this may require out of normal hour working such as late nights or weekends.Provides assistance to all other employees as able and assigned.Trains other employees in areas qualified, and attend training courses as requested Looks for opportunities to help work get done safer, faster and more cost effective.Participates in company activities such as; Safety Committee, Continuous Improvement, Audit committees, employee task forces, etc.Qualifications:3 - 5 years as a maintenance mechanic in a process manufacturing facilityHS DiplomaStrong problem solving and math skillsStrong equipment troubleshooting skillsExcellent communication (verbal and written), time management and organizational skillsCandidates must be authorized to work in the US, now and in the future, without sponsorship.AAK Foodservice is an Equal Opportunity Employer that is committed to workforce diversity. EOE. M/F/D/V."}