{"title":"Lead Software Engineer","location":"","salary":"","description":"","term":"$150,000 to $180,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJcAumwqdf2EqA8Ll-CSnKBgnBbf12gQP-ws2CxRd9A95PysrD5txTqCLxH26tVE2rqnaVxuf_h-I12pppz2ueCMWqYyGdt97GOwVXZyb0YnMP_SUugdlFuUNjDmRLDJGcRasmG3XtKlT-IDXf566BQAu2x0SjA6ACcprLDKxMba_v8y3Ilmce-UaMKTkRf","source":"ziprecruiter","full_description":"Lead Software Engineer Job Title: Lead Software Engineer Salary: $130-180K Total comp (this includes a 7-10% bonus) Location: Remote or onsite San Diego or TusconWhat You Will Be DoingThe Sr. Software Engineer (Tech Lead) for our growing mobile application and server team will focus on the continued expansion of cloud services and related technologies to guide us into the future of internet connected irrigation systems. As Sr. Software Engineer (Tech Lead) your day to day activities will include tracking current development tasks internal and external as well as identifying upcoming requests and converting requirements into detailed specifications for implementation.What You Need for this Position- Bachelor's degree in Software Engineering or related - 7+ years of Software Engineering and architecture- 3+ years as a liaison between business teams such as product and tech/ engineering teams to determine requirements, design documentation etc- Agile/ Scrum preferred- Java expertise- C++ or C# preferred- AWS or Azure- IOT or mobile device experience preferredSo, if you are a Lead Software Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}