{"title":"Software Developer - Remote Working Opportunity NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL2t0YG_KZp1eO16asfNnR6JvC3GquwfzMzUqU1hqQXEycaW83T9MW3Te2SpxpHv1jh0xWYS1ccyqPbN2_DoMO7mKRgvxNZ-34WZOoiwjSiXiYhMqNBgq0qjS1DljVr-Rq-hLtONjYPvafm1j-W2PP_UE89kc1yf2A7hfzd1wM7fsdXa4dYEcJGScxQbqA","source":"ziprecruiter","full_description":"Software Developer Job Description: Engaged in all phases of the software development lifecycle which include: gathering and analyzing user/business system requirements, responding to outages, and creating application system models. Participate in design meetings and consult with clients to refine, test and debug programs to meet business needs in the achievement of business and technology initiatives.Essential Duties and Responsibilities:· Develop, test, and implement new software programs· Clearly and regularly communicate with management and technical support colleagues· Design and update software database. This includes, but is not limited to: Software Applications, Web Sites, Data Communication Processes and User Interfaces· Test, maintain and recommend software improvements to ensure strong functionality and optimization· Work with team members to conduct root cause analysis of issues, review new and existing code and/or perform unit testing· Identify ideas to improve system performance and impact availability· Resolve complex technical design issues· Development of technical specifications and plans· Provide comprehensive support to internal customers; achieve resolution to outstanding problems or issues· Compile timely, comprehensive, and accurate documentation and or reports as requestedQualification Requirements: Education / Licensing:· Bachelor’s degree (Computer Science, Systems Programming, Information Technology, Accounting, Math and/or relevant professional certifications).· Knowledge of insurance, claims industry a plus.Technical Skills:· Knowledge of current programming languages, i.e., VB/.NET/Java/JS/PHP/SQL programming· Possess up-to-date knowledge of technological developments in the industry· Communicate effectively and professionally in all forms of communication with internal and external customers· Possess strong problem solving and decision-making skills while using good judgment· Multi-task and change from one task to another without loss of efficiency or composure· Prior functional experience in full software development life cycle methodology - Waterfall or Agile methodology preferred.· Experience in writing views, stored procedures, triggers and functions with SQL and Oracle PL/SQL.· Experience with scripting, process automation and APIs· Time management.· Must be highly organized.· Must be able to work independently and possess excellent written and verbal communication skills."}