{"title":"Director, Analytical Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKnPsMECAdAUSlba8rp57FQS5A6OucWLxK41DLrkYdOCv2prZQp413wNjfirM907Fc_oBwxvTC4I0Mh04LgOWLyER-IF1grZUtDbCWuSgHHGMMBbwuuPFaMxJg6hFdRxOOvLfZyJZ1coP77e4a8R9b_SZ_1gMJcuH3knDbD52UTEmMYLgL_U0fl9SWMOLzW","source":"ziprecruiter","full_description":"Leads the analytical group efforts in the evaluation and testing of raw materials, and development of analytical methods for evaluation of new and existing products internally and as used by customers.  Ensures quality of products through accuracy of testing methodology and results and completion and reporting of appropriate documentation.  Directs Lab adherence to ISO quality management policies and procedures and leads continuous improvement efforts.Leads development of analytical methods for new and existing products and ensures accuracy of testing and documentation to ensure qualify of products.Leads overall effort in evaluation and testing of raw materials in process product and finished goods to ensure materials meet or exceed customer requirements.Leads team to complete projects for internal research and development, coatings, plastics and wood application testing, and evaluation of samples for customer projects.Works with Tech Transfer of new products from development to Pilot Plant to full production as well as transfer of existing products from other manufacturing regions.Directs effort to ensure company adherence to ISO Quality Management policies and procedures and leads continuous improvement efforts.Manages Analytical Chemistry budget to ensure spending is within approved levels.Generates KPIs for Analytical Lab and set goals for continuous improvement.Manages service agreements for all analytical equipment in Florham Park and evaluates new instrumentation as well to assess suitability for Company’s needs.Performs all other duties and special projects as required.Master’s in Analytical Chemistry, with Ph.D. in Analytical Chemistry preferred.  Eight to ten years progressively more responsible experience in a chemical manufacturing environment working in analytical chemistry and having laboratory management responsibility. Three to five years people leadership experience.  Measures of Performance:Timely generation of test results and analytical methods to ensure smooth and efficient analysis in manufacturing Ensures quality and specifications of all products meet required standards prior to delivery to customersEnsures quality policies and documents are adhered to and correctContinuous maintenance and upgrade of analytical equipment and systems required for day-to-day operationsManages department budget within agreed-to guidelinesSets goals and KPIs for continuous improvement"}