{"title":"Production Supervisor","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJFP9yfSb-ssJgWugXGUV7hkLfYagSMzW6kKMGO4jkG9E8HXJyG-xaURZpht-ptCA4FRA0UwH-LB4ZfTRg4xn4Fw53ZTohLa5-u6DOsa404-m0F_dd16aXRazglZ-D_1QpfQVxM2tfn-pkxZoUSR2j4ym5bedsZRNGtdVgsEhM79Ip6wXfnQprgFYTslBb7","source":"ziprecruiter","full_description":"Job Summary: The role of the Production Supervisor is to assist the Production Assistant Manager with the daily functions of the production department. This role ensures production goals laid out by Production management are being met. The Production Supervisors are delegated tasks from the assistant manager. Specific job responsibilities include the following but are not limited to:Duties and Responsibilities: Responsible for dispensing material to be processedAssists the Assistant Manager with harvests and recording harvest dataAssists the Assistant Manager with new employee trainingDaily coaching/training of production employeesMaintains quality standardsEnsures sanitation and cleanliness standards are being followed and maintained by the production teamThe Production Supervisor will work with the production crew during down timeProvide support to packagers/production team in any capacity when necessaryJob Requirements (Education and Experience)High School DiplomaMinimum one year experience in cannabis industryMust have experience managing employeesQualifications (Knowledge, Skills and Abilities)Self-starter, Self-motivated, Positive AttitudeProven multitasking and prioritizing skillsAbility to work with and train othersStrong oral and written communication skillsProficiency in Excel and Google LiveExpected Hours of Work: This is a full-time position that requires, but is not limited to, 40 hours per week. The Production Supervisor is expected to arrive at least 15 minutes prior to the production team's arrival and to stay 15 minutes after the team leaves to ensure daily set up and take down. This Production Supervisor may be required to work on weekends and holidays. This position requires excellent attendance and reliable transportation. Must be able to work at all processing facilities.Physical and Environmental Requirements: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.Ability to lift, push, and pull 25 poundsAbility to sit, squat, bend, and kneel repetitively throughout an 8 or 10-hour dayAbility to stand and walk for extended periods of timeAbility to visually identify product health issues, safety hazards, and signageManagement reserves the right to assign other job duties as necessary. Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.Good Chemistry is an equal opportunity employer.Applicants must currently be qualified to work in the United States."}