{"title":"Senior Analyst, Chemistry Laboratory","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIpqdAH4gpHRPDNCMLCEIPD0TMPbGyV77ffMHrDGd073U6o7v-gXXPOOVyIruX25MhNJdmO8eJT4zzvFuUKQfCGkvR4X0hAhMTEygJtsTAPq-o-dJFGFkyZwcndkkOY6E-VYEpjO0OiCZ5AApk1ak8yUWLTA5S6qBDfBTNNFdd2IQtYWmdSDjfYfFkM5c8J","source":"ziprecruiter","full_description":"Company Description SGS is the world's leading inspection, verification, testing and certification company. SGS is recognized as the global benchmark for quality and integrity. With more than 89,000 employees, SGS operates a network of over 2,600 offices and laboratories around the world. Job Description SUMMARY The Senior Analyst, Chemistry Laboratory LSS evaluates the chemical and physical properties of various organic and inorganic substances for consumer product testing purposes. Independently conducts sample analysis of different complexity, preparation, extraction, and digestion with and without the use of instrumentation following official methods and laboratory Standard Operating Procedures (SOPs). Serves as a technical resource for other Analysts. Leads the team in analytical techniques and analysis of data.REPORTING LINEDirectly reports to Manager, Chemistry Laboratory LSSJOB FUNCTIONSReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.         Conducts analytical studies of different complexity (routine, moderate complexity and complex) of samples, preparation, extraction, and digestion with and without the use of instrumentation following official methods and laboratory Standard Operating Procedures (SOPs) and protocols.         Develops, reviews, submits and files reports on client sample tests, correlation tests, calibration, validation and other projects.         Performs routine operation, maintenance, calibration, and trouble-shoots laboratory instruments / equipment.         Develops and validates analytical methods, Standard Operating Procedures (SOPs) and other operating, safety and quality documents for method development, transfer, and validation studies.         Provides technical training, advice and support to Analysts in data analysis.         Often serves as a team lead.         Investigates, responds to and follows-up on client inquiries and complaints as needed.         Provides technical support to Marketing, Sales, Customer Service and clients regarding testing, reporting or technical inquiries.         Inputs and maintains technical information as needed to support the laboratory functions/operations.         Manages multiple projects as assigned.         Maintains Laboratory Notebook.           Adheres to internal standards, policies and procedures.         Performs other duties as assigned. Qualifications   EDUCATION AND EXPERIENCE Required:       Master's Degree in a Chemistry discipline or related science disciplines       5+ years of years' relevant experience in Analytical Chemistry Laboratories       1+ year of protocol and report writing experienceOR       Bachelor's Degree in Chemistry and similar disciplines       7+ years of experience in laboratory       1+ year of protocol and report writing experienceKNOWLEDGE / SKILLS / ABILITIES       General knowledge of Chemistry and advanced knowledge of routine and non-routine testing methods and methodologies required       Language Skills: English - Intermediate level required       Mathematical Skills: Intermediate level required; knowledge of statistical analysis preferred       Reasoning Skills/Abilities: Intermediate level required       Computer Skills: Microsoft Office Suite (Outlook, Excel, and Word) - Intermediate user proficiency required       Understanding of the company Quality Management System ISO 9001 and ISO 17025 requirements in related tasks       Knowledge of government, industry and other regulations, standards and methodologies including but not limited to - Restriction of Hazardous Substances (RoHS), American Society for Testing and Materials (ASTM), United States Pharmacopeia (USP), The Code of Federal Regulations (CFR), California Safe Drinking Water and Toxic Enforcement Act (Prop. 65) and CONEG (Coalition of Northeastern Governors) & The Toxics in Packaging Legislation       Ability to read and interpret documents such as safety rules, operating and maintenance instructions and procedure manuals       Ability to execute detailed but uninvolved written or oral instructions       Ability to follow directions, ensuring the end results are accurate and completed with the required timeframe       Strong attention to details required       Excellent communication skills, including grammar and composition       Ability to handle multiple competing priorities       Strong time management skills and organization skills       Leadership abilities preferred  TRAVEL          No travel required. Voluntary travel may be requested for training purposes. EQUIPMENT       This job operates in a laboratory environment and routinely uses chemistry instruments and equipment       This role routinely uses standard office equipment such as computers, printers, and phonesPHYSICAL DEMANDS OF THE JOBPhysical/Sensory Demands Frequency Requirements:         Stand - Constantly         Move or traverse - Constantly         Sit - Occasionally         Use hands - Constantly         Reach with hands and arms - Frequently         Climb or balance - Occasionally         Stoop, kneel, crouch or crawl - Occasionally         Talk/hear - Frequently         Taste/Smell - none         Lift/carry/push or pull - Frequently         Lift/carry/push or pull - may have to lift up to 20 poundsVision Requirement:          Close vision (clear vision at 20 inches/50 centimeters or less)         Distance vision (clear vision at 20 feet/6 meters or more)         Peripheral vision (ability to observe an area that can be seen up and down or to the left and right while eyes are fixed on a given point)         Depth perception (three-dimension vision, ability to judge distance and three-dimensional relationships)         Ability to adjust focus (ability to adjust the eye to bring an object into sharp focus)         Ability to see colorAuditory Requirements:          Must be able to hear equipment operating, alarms sounding, traffic, telephonesSAFETY CATEGORY         Safety-Sensitive: Has a high exposure to catastrophic operational incident and has access to operations where failure could result in serious harm to public or employee well-being, Group assets, or the environment. Additional Information SGS is an Equal Opportunity Employer, and as such we recruit, hire, train, and promote persons in all job classifications without regard to race, color, religion, sex, national origin, disability, age, marital status, sexual orientation, gender identity or expression, genetics, status as a protected veteran, or any other characteristics protected by law. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily with or without reasonable accommodations. The requirements listed above are representative of the knowledge, skills, and/or abilities required. This job description should not be construed as an exhaustive statement of duties, responsibilities or requirements, but a general description of the job. Nothing contained herein restricts the company's rights to assign or reassign duties and responsibilities to this job at any time.  If you are applying for a position within the United States and you have difficulty completing the on-line employment application because of a disability, please call 201-508-3149 for assistance and leave a message. You will receive a call back.  Please note, this phone number is not for general employment information, but is only for individuals who are experiencing difficulty applying for a position due to a disability.Qualifications: EDUCATION AND EXPERIENCE Required: Master's Degree in a Chemistry discipline or related science disciplines 5+ years of years' relevant experience in Analytical Chemistry Laboratories 1+ year of protocol and report writing experience OR Bachelor's Degree in Chemistry and similar disciplines 7+ years of experience in laboratory 1+ year of protocol and report writing experience KNOWLEDGE / SKILLS / ABILITIES General knowledge of Chemistry and advanced knowledge of routine and non-routine testing methods and methodologies required Language Skills: English - Intermediate level required Mathematical Skills: Intermediate level required; knowledge of statistical analysis preferred Reasoning Skills/Abilities: Intermediate level required Computer Skills: Microsoft Office Suite (Outlook, Excel, and Word) - Intermediate user proficiency required Understanding of the company Quality Management System ISO 9001 and ISO 17025 requirements in related tasks Knowledge of government, industry and other regulations, standards and methodologies including but not limited to - Restriction o..."}