{"title":"Test Technical Writer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALwOJRkMtuFYPbjcIB995IU5GWAC1rZnSH_tw_HOPid_Z8-rVg1aG7PgBnPpIRGSX2YMsMoew4KC58P0kp5Ac19q7RBPjVnkXvPnlWKHXqTSndV0qDkwVtkAWmMFUw5IQCB3bhttVqta-mu-ONF5KPjsO8wpESRl_9UFxCcYBzoBxF9M75VcttnZg8MOqY","source":"ziprecruiter","full_description":"**Minimum Clearance Required to Start:**Secret **Job Description:**Ready to put your writing and editing skills to work on complex, urban construction projects? Parsons is now hiring a Senior Technical Writer with a desire to work in a support role alongside the Project Manager on various writing projects that enhance the fabric of our community.In this role you will: perform difficult and/or complex writing and editing tasks required in the preparation of proposals, presentations, reports, technical papers, newsletters, web sites, multimedia resources, marketing collateral, and other materials. Tech Writers at this level ensure that completed documents conform to required formats, standards, and style guidelines, and provide original writing as needed. You may be required to interface with a variety of authors/requestors, both internal and external. Parsons extensive experience in this field, combined with your experience will propel your career and leadership opportunities forward. We need our Writers to be versatile, enthusias tic to work in highly flexible, teamoriented environments that have exceptional communication, analytical and organizational skills.Responsibilities: Proofreads and performs difficult and/or complex writing and editorial functions, including formatting and stylesheet verification, copy editing, rewriting, revising, writing, proofreading, and production planning. Ensures compliance of all assigned documents with their required presentation, correct use of paragraph headings and numbering, referencing of illustrative and tabular matter, and applicable bibliographic styles. Ensures consistency in application of technical abbreviations and acronyms, figure and table callouts and captions, and handling of boilerplate materials. Compiles and verifies tables of content, lists of figures and tables, references, and printer's dummy. Marks copy to provide word processors and graphic designers with clear, legible instructions relating to spacing, indentation, and changes or co rrections. Conducts research in the preparation of copywriting assignments and verification of acronyms, terms, etc. Works directly with authors/requestors to review copy, illustrations, and other materials submitted for inclusion in assigned documents. Recommends improvements for accuracy of expression, project or company style, clarity, consistency, and grammatical construction. Recasts or writes new portions of text subject to the review and approval of the requestor. Ensures, when applicable, that text references are consistent and comply with client requirements. Coordinates both the scheduling and production of deliverables by working with lead technical writers/editors, authors/requestors, and required technical publications resources. May also interface with various personnel assigned to a specific project or client effort as required. Reviews and verifies materials after reproduction to ensure conformance to the printer's dummy. Serves as part of a functional tea m and can work independently to complete assignments according to scheduled deadlines. Performs other responsibilities associated with this position as appropriate.Qualifications: Bachelor's degree in business administration, English/journalism, or related field (or equivalent) 5+ years of related work experience, including at least 3 years experience proofreading and editing all facets of technical engineering publications, specifications, and proposals from rough draft through printready. Strong written and oral communication, organizational, research, and interpersonal skills are required. Demonstrated proficiency in keyboard skills and a working knowledge of MS Windows and related software, including Microsoft Word, Adobe Acrobat, and Adobe InDesign. Accuracy, attention to detail, consistency, and clarity in conformance with required formats and standards. Incumbent should also possess a working knowledge of production scheduling and related processes.Must be able to obtain, maintain and/or currently possess a security clearance.Parsons is an equal opportunity, drug-free employer committed to diversity in the workplace. Minority/Female/Disabled/Protected Veteran/LGBTQ+. All qualified applicants will receive consideration for employment without regard to an individual's race, color, religion, national origin, ethnicity, union affiliation, age, sex, sexual orientation, gender identity and expression, pregnancy, employable physical or mental disability, veteran status, genetic information, immigration status, or any other basis protected by all applicable laws."}