{"title":"Life Insurance Agent - No Experience Necessary NEW!","location":"","salary":"","description":"","term":"$50,000 to $75,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAI9vng4vKzuiBCarAhZ4N2XuahvG94PFsrw5wv7kg3Eztg9mUrjWXsAt6KLML-NwKWwdnpVB4ye7P3L1jdf5O25xM4PyBLSJHCcBuC3KeqYDopOlZ_a7OIzGWhcHy3hsLeKt7-R5K0e6RFeC5m6Fyml-Cfvz_6ZAt5XgoZWIWruII3K7FieYNxzXHIDBg","source":"ziprecruiter","full_description":"As a final expense agent, you are in control. At Senior Life Insurance Company, we focus on providing people with final expense services to help them with peace of mind when a loved one has passed. Whether your goal is to spend more time with your family, travel the world, or build a financial legacy, we have the tools you need to make even your biggest dreams into a reality.We want you to be a part of our family culture and we offer:• Unlimited and exclusive leads sent straight to your phone.• A 100% health benefit plan available for you and your family.• Guidance and counsel from our executive leadership team including the owner and founder of the company.• Five different income streams with same day pay as well as stock ownership to reward your entrepreneurial efforts• A family environment where agent success is the priority• The choice between field sales, telesales, or a combination of both.• A fulfilling career helping people in their moment of greatest need.What is required? • Agents must have or be willing to obtain a life insurance license• Agents must demonstrate a strong work ethic• Agents must be coachable• Agents must be reliable and responsible• Agents must possess an entrepreneurial mindsetWhat is not required? • College degree or higher education• Formal sales training• Prior experience selling insuranceOne of the greatest advantages of working with Senior Life is the ability for you to build your business to incredible heights.At Senior Life, we have been dreaming and achieving since 2000. What are your dreams? And what is holding you back? It’s time to take a chance on yourself. With the ability to grow and build all across the country, you can create an unstoppable team.Reignite your dreams and your passion with Senior Life today."}