{"title":"JR Android Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJfZiexs7enYIQ4PJB_ljD54175vMPf8R-xET0hXhsFW-MpgiMum6qUysx5aNwA5p9G7IlvJYuNOCjnUYZD0AyzMqUQelQu_ovuFDusNNj9G_xIqD9VsjcQTF7NpoMsn3b1AuSSgetm3__oOlxqCwqmNb9vXSTVa_X_4JYSwgQE_hQ4vMD0mijv9fQQcLo","source":"ziprecruiter","full_description":"Join a fast-paced, cutting edge, start-up in Boulder, CO developing passwordless authentication. We are looking for a Jr Android Developer to join our team! You will be a co-located member of the engineering team, working with both internal and sourced mobile app developers driving a consistently high-quality product across Android for our customers. Our current mobile solution handles secure actions, notifications, asynchronous transactions, and leverages various device hardware and security from biometric capabilities, Bluetooth communication, accelerometer & gyroscope data, as well as secure enclave storage. Junior Android Developer Responsibilities:Designing and building mobile applications for Google's Android platformCollaborating with the team to define app featuresEnsuring quality and performance of applicationsIdentifying potential problems and resolving performance bottlenecksFixing application bugsDesigning and implementing application featuresJunior Android Developer Requirements:Bachelor's degree in Computer Science or Software EngineeringProficient in Java and Kotlin Thorough understanding of memory management and the Android application lifecycleExperience with retrieving data from a backend service using OkHttpUnderstanding of concurrent programming and the tools available on AndroidKnowledge of Material design principles and componentsCompetent in the use of Android Studio for both writing code and debuggingExperience with Git for version controlAdditionally, it could be valuable if you had any of the following:Experience developing for iOS devicesTo be successful in this role, you must be a highly motivated individual who is experienced enough to plan ahead and document your work amidst a fast-paced environment."}