{"title":"100% REMOTE Principal Software Engineering Manager NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKpzRSBTFKsP8FB0bHTPo43CO0lmWIf-1FGYUMwRwLrfC3rLoS9Cf51DTsrLz0snp_eDzazDVfSVAuLGezizz2MQUlZJJJp8EA2VihHFdG8lzh84tQrjcGCmOnmL0GmZSoOOLmdBuNK34LwCIzbsAsJGBIsGlzR9WVHywvapSvazQiuMrSaxWZfY_R5jm1I","source":"ziprecruiter","full_description":"100% REMOTE Principal Software Engineering Manager ---THIS POSITION IS 100% REMOTE---If you are a Software Engineer Manager with more than 8 years of experience, please read on!We are a medical device company dedicated to improving the lives of people with diabetes through relentless innovation and revolutionary customer experience.  Our approach is user-centric to the design, development and commercialization of products for people with diabetes who use insulin. We are not a diabetes division, we are a diabetes company. Our whole reason for being is to make the lives of people with diabetes better and better, through relentless innovation and revolutionary customer experience.Top Reasons to Work with Us- Competitive compensation- Work from home- Stock Options- 401k- Medical- Dental- Vision- 20 Days PTO...and more!What You Will Be Doing- Act as technical lead for both individual projects and/or entire products- Implement new features to deliver customer portal features and diabetes data visualizations- Leverage the latest React technologies to engineer clean, modularized, and well unit and integration tested TypeScript code that runs seamlessly across native and mobile apps- Build out our components library for Web, iOS, and Android and contribute to our design system- Integrate micro services, negotiate API contracts, and architect modern client data caches- Push the boundaries of how software development works in a regulatory environment- Work with DevOps to set up custom CI/CD pipelines for web and mobile at scale- Mentor junior engineers through peer coding, perform code reviews, prepare knowledge transfers, discuss how we write code, and improve the developer experienceWhat You Need for this PositionTeam Lead/Management experience REQUIREDAt least 12 years of experience with a combination of the following:- React (3 yrs+ REQUIRED)- React Native (Preferred)- Typescript- JavaScript/HTML5/CSS3- iOS- Android- CI/CD- Unit Testing- MicroservicesSo, if you are a Software Engineering Manager with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}