{"title":"Android Developer (W2 Only)","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAIvRML103I6ipDFDkZZtx7Yv2Ect3z4hi-kSWbrC8zIehNfTYplCtndhVlalMXKqjaskM47TmWGsdGjl7YMJoHY5m8LJC95r8wPfwoM9FfOAuLQ5V5uM2H9eWS6b4FKwEiGFHs-9KIlvo0g0B9qTRHIIiko2vWdoO6De-g5X1CQeEvkYk4sNr8xwRlAJcCe","source":"ziprecruiter","full_description":"Android Developer / Software Engineer 3 positionsDescription:Android Developers will work as part of the emulator team to build the MY23/24 VCU Emulator for Google and 3rd Parties’ new Telematics/Infotainment applications that are downloaded directly to in-vehicle infotainment systems. As a member of the application delivery team, this developer will work hand in hand with stakeholders and other engineers throughout the entire product development lifecycle to define, design, develop, and deliver groundbreaking applications that re-define the driving experience.Key Responsibilities:The Software Engineer will be responsible for application development and support including story elaboration, estimation, analysis, design, programming, unit/integration testing, and code debugging leveraging the Scrum framework. This person will work in a highly collaborative, cross-functional, and Agile environment and will assume a lead role for various practices and decisions.This person will:· Test-drive code· Elaborate, estimate, and design for small increments of work just-in-time· Perform root cause analysis, technology evaluation, and design spikes· Commit to completing well-defined work and deliver on those commitments· Swarm around tasks along with other Scrum team members· Pair program with different people in many situations· Report status of assigned software development and/or maintenance tasks· Consistently follow the specified software development methodology· Model courageous and continuous learning to the team. Actively help team members continuously learn· Promote improvements in programming practices such as acceptance test-driven development, continuous integration, and test automation· Continuously learn and challenge the organization concerning new practices, processes, technologies, and languages· Build a strong team using their collaboration skills. Interview and mentor team members.· Provide leadership and assistance among and across teams/organizations· Prospective candidates possess a high degree of business insight, creativity, decision-making skills, a drive for results, the ability to negotiate, the ability to develop peer relationships, and a strong technical learning capability.Requirements· BS in Computer Science or other fields of study along with applicable work experience· 2+ years of experience in Android development· Knowledge of RTC (rational test code) & RQM (rational quality metrics)· Prior experience in working in an Agile environment a plus· Knowledge of Android M, T, or Q preferred· Prior automotive experience highly preferred· Experience with AOSP build process preferredLocation: Detroit, MI (remote initially)Duration: 12+ month W2 contract11543"}