{"title":"QC Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJLf4lBOT5vfBwp_hnrwotCdhz842xBeE0uPc5tvx-PC5QNdNxcGRov3yVbvUTveILvagQyiAbBzV1gimD2W28t50bNcmL5HPcUWSOgyDX8kAa3UIYEz4WezQXEKucvMB0H8PNF1BCPukjv5eQsqmyz3fpb8iyGJb7i172hROUqyYogFClxSrsrxrIhgAQ","source":"ziprecruiter","full_description":"Description Position Summary Under immediate direction of the Quality Control Manager, the Quality Control Chemist performs various tests and analyzes samples in Laboratory for cement production. RequirementsCollect samples of raw materials, fuel and product for quality analysis.Run chemical and physical tests on samplesMake up solutions required to run chemical testsKeep records of tests runCalibrate apparatus used to run tests and maintain calibration recordsMaintenance of laboratory equipmentParticipate in CCRL and inter-plant quality control testing programsClean assigned lab areasEnter test results into computer on daily basisInventory and order consumable items used in the labOther duties as assigned by SupervisorMinimum Education and ExperienceHigh school diploma or equivalentA minimum of 60 hours of college-level work from an accredited college including a minimum of 8 hours of Chemistry or related science course(s)Knowledge, Skills and AbilitiesAbility to read, write and verbally communicate in the English languageAbility to reason through operational issues as they arise and resolve or communicate to othersMust have comprehensive knowledge of plant operations as they affect quality of productMust have general knowledge of calculators and computersA high degree of manual dexterity and accuracy requiredPreferred knowledge of all types of equipment used in the manufacturing of cementKnowledge of hazards associated with areas of responsibilityAbility to perform basic math functionsMust have a basic understanding of the plant operationsMust have excellent work and safety recordMust understand Lockout/Tagout procedure and safety requirementsPhysical RequirementsMust work rotating shiftAbility to lift and carry 50 pounds of weight up/ 2 flights of stairs 2 times per dayMust be able to work at heights of 50 ft. or moreMust be able lift and carry 20 pounds for up to 200 yards 12 times per day and up/down up to 3 flights of stairs each tripPhysical requirements also include visual acuity, speech and hearing, hand and eye coordination, standing, sitting, walking, climbing stairs, climbing on equipment, bending, stooping, crouching, kneeling, pushing, pulling, reaching, twisting, balancing, and squatting to perform the essential functionsMust be able to use proper Personal Protective Equipment as requiredWorking Condition Must be able to work in all weather conditions (heat, cold, and rain). Must be able to work in noisy environment with noise levels up to 120 dba. Must be able to work in environments including vibration and mechanical and electrical hazards. Must be able to work any assigned shift.  May have exposure to dust, cement, clay, gypsum, sand, diesel exhaust, lubricants, solvents, various fuels, etc. (See MSDS's)Equal Opportunity Employer/Veterans/Disabled"}