{"title":"Senior IOS Developer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJBN7RuMJCd5CdZrjG7r3Gm9V3heo8u3AOf8VhRPC_31XD1hca4TwxDP_noFpPSo5o-tCZe8dIh5Tx0fpWaWSWfQx733zffGWa0lD55-z_R5drei9b4eMES3-dSWEztzpVvENaL_Jz-WwQH49wc5bzX7mp_4A7tRAKfbqt5RKVdN1e5TN7bQScasazE5Tg","source":"ziprecruiter","full_description":"Senior IOS Developer in Cleveland, OH at APEX Systems Date Posted: 1/1/2019ApplyNot ready to Apply?Job Snapshot + Employee Type:Contractor + Location: Cleveland, OH + Job Type:Mobile Development + Experience:Not Specified + Date Posted:1/1/2019Job DescriptionJob #: 908591 Title: Senior IOS Developer Length: 6 months contract to hire Location: Cleveland, OhioAs a Lead iOS developer, you'll collaborate with internal teams to develop functional mobile applications, while working in a fast-paced environment. This role will be primarily hands on application development, but may also include strategy, mentoring and training. This role will be responsible for the daily maintenance and delivery of mobile applications. Knowledge & Experience + 3+ years' experience in iOS application programming (Focus on Swift, but practical knowledge in Objective-C, XCode) and preferably some experience in Android application programming (Java, Android SDK) + Published examples of mobile applications on the Apple App Store and possibly in the Google Play Store + Preferred experience with third-party frameworks such as Ionic, NativeScript, Cordova, and ReactJS + 2+ years' experience in Swift development for iOS mobile applications. + Experience with automated deployments of mobile apps as well as continuous integration. + Experience with user experience and rapid prototyping + Knowledge of API data feeds, ingestion techniques, data mapping, data modeling, and best practices for object oriented design patterns. + 2+ years JavaScript application development preferred. + Highly skilled in the use of Git source code control + Experience in Device Management + Strong working knowledge of beta testing servicesPersonal Attributes + Advanced analytical, conceptual, and problem-solving abilities. + Strong written and oral communication skills. + Proven ability and initiative to learn and research new concepts, ideas, and technologies quickly. + Experience working in a team-oriented, collaborative environment. + Ability to translate an idea or need into a completed solution or work product.Formal Education & Certification + Bachelor degreeEEO Employer Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at 844-463-6178"}