{"title":"Inspection Technology Field Service Technician NEW!","location":"","salary":"","description":"","term":"Part-Time","detail":"https://www.ziprecruiter.com/k/l/AALr_XTw8sELnsJWGO2Maurf3w0MEZcethTL-hzWkNvfXWdWn-xay9Nz6vUVdX4ay40uPQmYIjhcTYgDcMOdKFNyR55oxmjXAGMNw2ZIZ4BlYyNfp_RmWiE3zSTgHAda77WcxC6dFm09zAVzIG_JIBSSyNDYjkej_LbP04mCWhTWwl6gfL1o5wQhCBwL3CMb","source":"ziprecruiter","full_description":"FieldCore, a GE company, is a new, independent industrial field services company that will deliver the highest standard of field services excellence and capabilities for GE and its customers. FieldCore will bring together the field services expertise and people from both Granite Services and GE's Power Services into one powerhouse. Driven by the values of safety, quality, and integrity, FieldCore will be built to deliver operational excellence for customers in the power generation, oil & gas, nuclear, and wind power markets. For more information, check out www.fieldcore.com **Role Summary/Purpose** The NDT Technician is responsible for performing advanced level NDT (NonDestructive Testing) Inspections performed in multiple industries including industrial, petrochemical, refineries, power plants, pipelines and wind farms around the world. **Essential Function**+ The NDT Technician is responsible for on-site inspection for the customer. + The NDT Technician is responsible for Operation Excellence and Technical Quality of services performed. + This role is responsible for delivery of services on time, safely, and with the highest quality possible. + This position is part of the Delivery Process and is expected to lead other NDT technicians and project personnel in providing the primary service of inspection performance to our client. + The NDT Technician should be qualified to set up and calibrate equipment and to interpret and evaluate results with respect to applicable codes, standards and specifications and should be able to organize and report the results of NDT tests + Perform others duities as assigned **Qualifications/Requirements**+ Technical Degree in electronics, electrical or mechanical discipline, non-destructive technology, related discipline, or equivalent OR + High School Diploma/GED AND Five (5) years of field experience and certification as a Level II in MT, PT and UT with the ability to meet company certification standards.(Must have verifiable discipline hour documentation for certifications). + Preference given to candidates with Advanced Level Certifications and Experience in the following methods: Eddy Current, Phased Array, Guided Wave Ultrasonics and/or Shearwave. + You must be able to demonstrate your abilities through successful completion of formal training, OJT, and examination. + Must have a valid Driver's License + Must be able to read and interpret technical manuals + English proficiency required **Desired Characteristics**+ In-depth knowledge and field experience with the NDT discipline in customer site applications + Certification as a Level II in MT, PT and UT and ability to meet company certification standards. + Experience with automated and computerized NDT Equipment. Demonstrated work history supporting customers and producing final reports. + Working knowledge of MS Office (Word, Excel, Outlook); + Trainee level. Trial position to ensure a good fit for GSI - attitude, skills, ambition + Basic skills training to ensure knowledge of fundamental concepts, practices and procedures of a particular field of specialization. + Ability to read and interpret schematic diagrams and engineering drawings. + Demonstrated work history supporting customers and producing final reports.We are an Equal Opportunity Employer, including disabled and vets.For more information regarding affirmative action and equal employment opportunity click here at http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}