{"title":"Software Engineer/Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIRlcFuZuugKCBQOwezWkNAKAJi-eHM75zLz5IQqZnd7cy_wY1wxigjFnsikLQ6CBZByN5uO7neQdya86ysPWfXkQ1h6tWMOWdeT4h8oUZmFk_q5k3AqET-QxkBeR36bNuPqokIOc25QSW9nmDVgjZOZs89H75cmJihbXWB1CIHVPbUKupd5XbnE82rOxs","source":"ziprecruiter","full_description":"Software Engineer/DeveloperSUMMARY: The Software Engineer/Developer will provide analysis of business, engineering, and scientific problems, and the documentation and development of well-defined methods, procedures, and programs in the delivery of practical systems solutions.ESSENTIAL RESPONSIBILITIES:  The ability to develop software using JAVA or EJB on various application servers  Develop automated unit tests using JUnit  Perform unit and integration testing  Work with Systems Engineers to review detailed technical requirements  Translate detailed technical into software design  Support System Testers to ensure system quality, functionality, and performance  Support system in productionQUALIFICATIONS:  BS in Computer Science or related major OR Relevant Experience  3+ years experience of software development/sustaining experience with Java/J2EE, and demonstrated fluency in Java.  3+ years experience with Java Application Servers with one or more of the following:  Tomcat  JBoss  WebLogic  WebSphere  Sun Application Server and Oracle Application Server is a plus  Experience with Web Development, client-server programming  Experience in using framework and libraries including:  Apache Strut 1.2 and above,  Apache Common Library, File Template Framework  Knowledge of dynamic client side script - Javascript, DHTML, HTML  Strong in RDBMS: SQL DML and DDL  Experience with: HTTP/HTTPs, AJAX, CSS  Excellent Software Designing experience with OOAD and UML  Experience using configuration/testing with Ant and Junit  Work experience with XML parser/transformation - DOM, SAX, XSLT, DTD and Schemas  Strong in Design Patterns (GoF/J2EE)  Knowledge of the following protocols: TCP/IP, RMI/IIOP, SMTP, MIME  Knowledge/understanding of AD, UNIX, LDAP, and Database systems  Identity and Access Management experience a plus  Experience with C# is a plus About Us Mycroft Inc. is the innovation leader in delivering IT security, identity, access management and regulatory compliance solutions leveraging over 20 years of unmatched professional services experience across all major vendor technologies.Focused on the strategy, design, configuration, implementation and management of its solutions, the company seamlessly integrates software and deep professional services expertise to provide fully managed cloud-based, hosted and on-premise deployments.Mycroft XSpectra, the company's most recent innovation, further solidifies the company's commitment to bringing cutting edge IT security services to market that enable business agility, flexibility and cost efficiencies across organizations of all sizes.  Mycroft has service centers in New York, St. Louis, Detroit and Seattle.Mycroft Offers Competitive Compensation and Robust Benefits Including:  Medical, Dental, Vision, Life Insurance, Short/Long Term Disability, Flexible Spending  Account Plans  Competitive Wages and Outstanding Incentives  401K with Matching  Paid Vacations & Holidays  Growth & Training Opportunities  Casual work environmentMycroft is an equal opportunity/affirmative action employer. M/F/D/V."}