{"title":"Utility Project Manager NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALfojk2Qyaefbw9U00-3IZkOKPBnY3rsuMlmOFwclQOy6FGhyo3sWbZKlL0wDnSnQZBSMMlt18H6TWH1nOxItRXc-wnf7gd7Sxt4jfBUq6PsItd5dQuyPRTu6cN5MLHDhUD4vQRWA1t1FkKkHVK_1uTDMFC1A075zWNTnfq3kpNXnwHtTu-P_JUyriTp64","source":"ziprecruiter","full_description":"(RECRUITERS MAY NOT CONTACT- Direct Applicants Only)Position Description: Subsurface Utility Engineering (S.U.E.) Project ManagerResponsible for all S.U.E. proposals, estimates, presentations, employee evaluations, and recruiting process. Serves as the \"lead\" on SUE Field Teams. Participate in pre planning meetings with project managers, resident engineers, and contractor representatives. Involves designating of all types of utilities in rural and urban environments using geophysical equipment, project field documentation and survey, and vacuum excavation to expose utilities. Provide support to the senior managers in survey department. GDOT experience in procedures and deliverable requirements is advantageous.ResponsibilitiesWorking knowledge of ASCE 38 guidelines and associated quality levelsBasic comprehension and interpretation of planimetric and design plans, profiles and cross sections, utility records, etc.Development of utility drawings that are complete, accurate and organizedDevelopment of drawings meeting the specific standards dictated by the clientCoordinate survey work in relation with SUEExperience with GIS platforms is desirableTraining and mentoring SUE technicians and staffAssist on projects requested by department managerRequired ExperienceHigh School Diploma is requiredA valid current driver’s license4-6 years of utility locating or designating using many types of pipe and cable locating devicesExperience with Subsurface Utility Engineering (SUE) is preferredMust have project management experienceExcellent time and project management skillsVery organized, dependable, and professionalPhysical RequirementsPhysically mobile in and around construction sites and field assignmentsAbility to carry survey instruments and equipmentShould enjoy working outdoors in a variety of weather conditionsAbility to lift 50 poundsEqual Opportunity Employer (U.S.) all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, sexual orientation, gender identity, or any other characteristic protected by law."}