{"title":"Senior Software Engineer - Roku, Peacock NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAIFgWrrMmLnS3fVQnEHyBWA6_63NwSivBX9XlNStJvtAVFNSMaYHLRxRwOBnMB5SkGDHqp1hH0iR0QMAHTzb25HtY8l4RUQE0xG3FJQKi32QubP5AdjqBW6S-ySAV-AeoPesp15z4rEG_X63LoDf9u73lOyIiScjMA6n-o8TUlJESTNOfyBOoRMZ4FOy1M","source":"ziprecruiter","full_description":"ISGF is currently seeking a Sr. Developer (ROKU) for a contract to hire position with one of our Fortune 500 clients located in the New York City, NY . Can be Remote!Senior Software Engineer - Roku, PeacockDigital Media Peacock SUMMARY:Peacock is one of the newest entrants into the video streaming industry with an innovative model offering premium content at no cost to the user on the ad supported tier. We have already surpassed 34 million subscribers. Central to this success is an excellent user experience with fast loading times, high quality streams, and no playback failures.The Core Video Roku Team plays a crucial role in making this happen. We build a video playback SDK which abstracts away all the complexities of DRM protected playback and download, analytics, and dynamic ad insertion so that our clients can focus on creating great user experiences. To achieve this wide array of functionality, while maintaining an easy-to-use interface, we value good coding practices, solid design patterns, and follow principles for sustainable technology solutions in an agile environment.We’re always looking for the best ways to solve problems and we are looking for teammates who equally share our passion for problem solving. Peacock is off to a flying start and we are looking for passionate, pragmatic software engineers, who value the opportunity for growth and impact, to join us.RESPONSIBILITIES:• Produce a reliable, performant, configurable, state-of-the-art SDK.• Write clean, concise, readable code that follows common design patterns while adhering to best engineering practices.• Strive to constantly improve quality of engineering through code reviews, tech talks, pair programming and other collaborative practices.• Understand business needs and design quality software solutions that work well within the wider architecture.• Push technical boundaries and propose new processes and technologies.• Ensure quality and confidence in software by writing effective automated unit tests.QUALIFICATIONS/REQUIREMENTS:• 4+ years of professional software development experience.• Accomplished experience with BrightScript and SceneGraph.• Demonstrate strong skills writing testable code in BrightScript.• Value collaboration with teammates and stakeholders.• Enthusiasm for building a Roku library that handles all aspects of video playback.DESIRED CHARACTERISTICS:• Experience with video-on-demand and/or linear video playback.• Experience with Client-side or Server-side ad stitching technology.For immediate and confidential consideration, please send your resume to:engagement @ isgf.comISGF is an Equal Opportunity Employer (EOE)#ZR"}