{"title":"Technical Support Specialist (BioTech/Flow Cytometry)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI3g6e2Eqe4zpqeGzdm4SHr06Qa80wfxrm_PoCrIwuNkt83iGXHVRK6DqZOdShnpZUW2RyKdrQWHYmr_b9njQg96N1ph6LJ_UB42VROHY7KK9Wxi8LYUUehc4wRLPifSpcjn4mY3lK2facA9bZGmpfOBgqJWgU6khizbCBPOyzoDtd1OYOXjTzkQ7R-7_Q","source":"ziprecruiter","full_description":"Technical Support Specialist (BioTech/Flow Cytometry) If you are a Technical Support Specialist (BioTech/Flow Cytometry) with technical support experience, please read on!We are located in the La Jolla, CA area and we are a cutting edge Biotechnology company that has been proudly serving the San Diego area for over 10 years! We continue to work on breakthrough medical technologies and have a collective passion for what we do. We can promise work will never get stale and you will be surrounded by some of the brightest minds in BioTech.We are looking for a Technical Support Specialist to work with our customer support team to ensure the optimal success of our products and the happiness of our customers! This person will help with troubleshooting and analysis of our products and respond to phone/email technical questions. This person will ideally come from a biotech or cell focused background to be able to ramp up to speed on our products.Top Reasons to Work with Us-Work with cutting edge BioTech equipment-Unlimited PTO-HUGE room for growthWhat You Will Be Doing-Providing technical support on our products-Ensuring optimal experience/success of our clients-Serve as customers main POC to answer technical questions-Troubleshooting and analysis on our productsWhat You Need for this PositionAt least 1-2 years of experience with:- Biotech or Flow Cytometry- Technical SupportSo, if you are a Technical Support Specialist (BioTech/Flow Cytometry) with technical support experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}