{"title":"Senior Software Engineer","location":"","salary":"","description":"","term":"$100,000 to $130,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAI1AREITi30viNc-4d6czetZZxpVSq0-RYAWKwvaNjcopCVQKD70uFk1LO6nQ8tK51I6MKA1D5BSeHQgg90EDM5CLihBwBLM92uACtKgrlfooKd_1AR38vGnpMejPJsHOF1NSAbP2g-6E5N4G-08E86Caq_mlCOvkXgs5MeYu5GGJHDj-qAVHVhzpj1srv5","source":"ziprecruiter","full_description":"Senior Software Engineer If you are a Senior Software Engineer with experience, please read on!We are a health-focused company dedicated to providing women the resources necessary for a safe pregnancy. Throughout the US, women experience unequal medical treatment and we aim to equalize medical care, regardless of socioeconomic status. If you are interested in working for our platform and expanding safe medical practices to all, then please apply!What You Will Be DoingYou will work with your product team on full-stack development pertaining to our front-end mobile apps & web, backend infrastructure, APIs, datastores, etc.What You Need for this PositionMUST HAVE:- At least 4 years of software development experience - Javascript expert - Typescript & Angular (that's what we use)- AWS Expert - Lambdas, SQS, SNS, Cloudformation, DynamoDB, SES- Past experience mentoring or helping other junior developers Nice to Have:- Mobile ExperienceWhat's In It for You- Competitive Salary ($100,000 - $130,000+)- FULLY remote now and after COVID- Medical Package- Unlimited PTO- Allowances for WFH resources - 401k planSo, if you are a Senior Software Engineer with experience, please apply today or send your resume to sydney@cybercoders.com! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}