{"title":"iOS DEVELOPER","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKSzw-a1wlHS7yawLH3QM_HWxeQnap0X0I6uO5xpTmdfwHgNbZeID0ewcIKZunNijR_MPt9sKZxkSYFMgb8driPQCyNXEgg5hhlRqLGgXMqJCW1XbZcktAdjxJ-YtyaDr8eoGtGx-D-zw0ihhjzhkzc-xX1sWZimg0UGvHSKZxEQuZV4ccmO74iOavIMvUx","source":"ziprecruiter","full_description":"Description As a Senior iOS Software Engineer, you will plan, develop, build and release with a full understanding of the tech stack while collaborating with our backend and Android team. Responsibilities: Architect, build, iterate, and manage our ongoing iOS mobile apps. Able to own and deliver a feature independently. Partner closely with our design, product, and engineering teams to produce features that flow seamlessly and work intuitively. Able to understand the requirements and come up with estimates, write high quality, maintainable and unit-testable code. Own important pieces of the product that have high visibility both internally and externally. Minimum Skills Required: Experience with mobile software development using Swift & Objective-C. Experience using distributed source code version control systems (Git/Github) Experience working with Flutter Experience with Apple SDKs for iOS development Experience with software debugging techniques (debuggers, loggers, crash report tools) Experience with analysis of memory issues such as memory leaks using memory analyzers tools (Instruments) Experience with embedded real time systems with limited resources (memory and processing) Experience with command line XCode build tools for Continuous Integration Experience in design patterns, MVC, data structures and algorithms. Experience in unit and integration testing Objective-C code. Published iOS application is required. Requirements Requirements : Bachelor's degree in Computer Science, Computer Engineering, Software Engineering, or a related field Highly experienced with development for iOS platform Has experiences and sees value in client-facing work and communication Strive for excellence in the deliveries to clients Rational and understands the business aspect of the work Quick learner, Independent, Autonomous Thrive in a client-facing team environment with impact to both, Avast as well as the partner business Robert Half Technology matches IT professionals with remote or on-site jobs on a temporary, project or full-time basis. From roles in software and applications to IT infrastructure and operations, we provide you unparalleled access to exciting career opportunities. Our experienced staffing professionals can promote you to employers and advocate on your behalf. We provide access to top jobs, competitive compensation and benefits, and free online training. For more opportunities, get the Robert Half app and receive instant notifications when our AI matches you with jobs. When you work with us, you're working with the best. Robert Half has been recognized as one of FORTUNE's \"Most Admired Companies\" every year since 1998 and was named to Forbes' inaugural list of America's Best Temporary Staffing Firms. Questions? Call your local office at 1.888.490.4429. All applicants applying for U.S. job openings must be authorized to work in the United States. Benefits are available to temporary professionals. Visit https://roberthalf.gobenefits.net/ for more information. 2020 Robert Half Technology. An Equal Opportunity Employer. M/F/Disability/Veterans. By clicking \"Apply Now,\" you're agreeing to Robert Half's Terms of Use (www.roberthalf.com/terms-of-use). **Salary:** DOE**Location:** Boca Raton, FL**Date Posted:** February 23, 2021**Employment Type:** Temp to Hire**Job Reference:** 01020-9502861991**Staffing Area:** Technology u0026 IT"}