{"title":"Senior Mobile Application Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL3jC1ygr7GLG2Mx7ZlxE-TFJCDKUtb3f7tliwzyrcRvTN-KQBdK0hCzF20h5Di_XAmuyZabCTdXozOZ3qBy0rQ_C3kjUGh8QRfqYhzUUeZL1VCoEDlrEs6tRamHlUdpOSE9auntkOacScOfNnBNd2h2vCNyCrFJnVT8MTFO806jfi2p35VQsiiJNp3nyGq","source":"ziprecruiter","full_description":"Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.As a member of the software engineering division, you will perform high-level design based on provided external specifications. Specify, design and implement minor changes to existing software architecture. Build highly complex enhancements and resolve complex bugs. Build and execute unit tests and unit plans. Review integration and regression test plans created by QA. Communicate with QA and porting engineering as necessary to discuss minor changes to product functionality and to ensure quality and consistency across specific products.Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience.The Oracle Construction & Engineering Global Business Unit (CEGBU) industry's most advanced solutions for planning, building and operating assets, partnering with leading organizations globally.We are looking for a Senior Software Engineer to join our team building native mobile applications on both Android and iOS.From a Software Development point of view, you will be working within a large codebase, use Test-Driven Development to add new functionality whilst refactoring to continually improve the design and reusability of that codebase.*Responsibilities Include** Eagerly participate as an integral member of a high performance team making innovative solutions meeting market demands. Contribute to all activities of the software development lifecycle including; coding, building releases, testing and bug fixing. Breakdown software system designs into collections of task with realistic estimates. Create and maintain technical documentation as needed Mentoring relatively less experienced developers of the team.*Required Skills** Mastery of C 11 and greater standards; 5 to 8 years of recent experience Thorough knowledge of OOP and Design Patterns Thorough knowledge of data structures and STL Proficiency with threading and asynchronous processing Experience designing APIs and related documentation for library development. Excellent debug and troubleshooting skills. Familiarity with source code management tools Excellent written and verbal communication skillsPreferred Skills** Passionate about building quality, secure, standards compliant applications. Experience with Android NDK and JNI. Familiarity with OpenGL or Vulcan Android Application development Embraces new technology with an emphasis on embedded and mobile solutions* Self-directed, willing to take initiative with minimal supervisionJob: **Product Development***Organization:** **Oracle***Title:** *Senior Mobile Application Engineer***Location:** *United States***Requisition ID:** 210007QS"}