{"title":"Contingent- Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKD6yU-yQg6vo_3oXMuq_HuixR72KWn5qffs-enZj_hGoB21D6UR8_hbf6fejfyGLMvMIwHBuQXNzg9wrVj3sbxUYtaQXcvR_Cp7eokSa0bHqY83r2zmI7Dbbw2vK5zdCbF_zzisRV4hElLTlcELStyCMNfbJ1ditGtGe80ArLaSoOca8REELv-6r15MwA","source":"ziprecruiter","full_description":"If you want to accelerate your career growth and are passionate about applying your expertise to solve problems of national importance, then we have the job you are looking for! You will be able to achieve your personal and professional goals in a stable environment that emphasizes and rewards the entrepreneurial spirit. Not only will you solve challenging core problems, you'll be able to grow your career in an exciting environment that promotes teamwork and cross-training in a wide range of related disciplines.  The successful candidate for this position will have a strong passion and background in making quality production software at all stages of the software lifecycle. You will be a key member of a team that is developing analytic tools and technologies to support real-world planning and intelligence operations for the Department of Defense. You will serve as an on-site member of the software team responsible for designing, developing, and deploying an analytic architecture and the applications that will run in this architecture. The Software Engineer develops, maintains, and enhances complex and diverse software systems (e.g., processing-intensive analytics, novel algorithm development, manipulation of extremely large data sets, real-time systems, and business management information systems) based upon documented requirements. Works individually or as part of a team. Reviews and tests software components for adherence to the design requirements and documents test results. Resolves software problem reports. Utilizes software development and software design methodologies appropriate to the development environment. Provides specific input to the software components of system design to include hardware/software trade-offs, software reuse, use of Commercial Off-the-shelf (COTS)/Government Off-the-shelf (GOTS) in place of new development, and requirements analysis and synthesis from system level to individual software components.This offer is contingent upon contract award and in certain cases approval of your qualifications for the position by the Prime contractor and the government agency.Software Engineer Requirements:Hold an active TS/SCI with Full Scope Poly Security ClearanceBS degree in computer science, engineering, applied mathematics, or a closely related field along with 7 years relevant work experience OR MS degree with 3-5 years of relevant work experience Analyze user requirements to derive software design and performance requirementsDebug existing software and correct defectsDesign and code new software or modify existing software to add new featuresWrite or review software and system documentationDesign or implement complex database or data repository interfaces/queriesAssist with developing and executing test procedures for software componentsDevelop software solutions by analyzing system performance standards, confer with users or system engineers; analyze systems flow, data usage, and work processes; and investigate problem areasSoftware Engineer Preferences: Strong coding skills in a high-level language (Python, C++, Java, )Demonstrated experience in developing web API's AWS certification(s), preferably at the associates level or higherFamiliarity with Docker and KubernetesExperience with backend web frameworks (e.g. Django, Flask)Experience configuring web servers (e.g. Apache)Experience in CI/CD workflowsExperience with agile software developmentAbout Us:Applied Research Associates, Inc. (aka ARA) is an employee-owned international research and engineering company known for providing technically superior solutions to complex and challenging problems in the physical sciences. We were founded in Albuquerque, NM in 1979 as the disco era was, thankfully, closing out and the personal computer era was beginning. We employ over 1,400 professionals and continue to grow. ARA offices throughout the U.S. and Canada provide a broad range of technical expertise in defense, civil, and health technologies, computer software and simulation, systems analysis, environmental technologies, and testing and measurement. Around ARA you are equally likely to hear a conversation about Kubernetes clusters as you are a debate on merits of a reverse polish notation (RPN) calculator!While this is all of the Year One and Beyond stuff, Day One is highly impressive too. These are things like our competitive salary (DOE), Employee Stock Ownership Plan (ESOP) & 401(k) with matching program, benefits package which includes medical, dental vision, flex spending, telehealth services, company-paid life & disability insurance including paid maternity disability leave through our company-paid short-term disability benefit, domestic partner coverage, dependent care flex spending, daycare discounts, pet insurance, relocation opportunities, floating holidays, tuition reimbursement, professional development as well as flexible schedules with remote/work from home options. ARA also prides ourselves on having a challenging culture where innovation & experimentation are the norm. At ARA, employees are our greatest assets, so we give our employees the tools, training, and opportunities to take active roles as owners. The motto, \"Engineering and Science for Fun and Profit\" sums up the ARA experience.  The company realizes employee ownership spawns greater creativity and initiative along with higher performance and customer satisfaction levels.ARA is passionate about inclusion and diversity in our workplace. In 2018 40% of our new employees voluntarily self-identified as protected veterans. (Source-AAP EOY 2018 Veterans Data Collection Report). We are also very proud of our Women's Initiative Network (WIN) whose purpose is to motivate, support, and encourage professional career development for women to maximize career and professional accomplishments. Additionally, the Southeast Division looks not only for the right skills, but also for a cultural fit. We seek colleagues who will contribute to the unique culture that makes ARA such a great place to work. Some of the social impact aspects we have implemented at our division include monthly get-togethers, team outings to local baseball games in the summer, board game lunches, holiday party, corn hole tournaments, chili cook-offs and so on. For additional information and an opportunity to join this unique workplace, please apply at careers.ara.com."}