{"title":".NET Backend Developer - REMOTE NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAL7kZcfFtySJShSd5FRPaydkupCmlw8gDFyxlyXRROzBxwPcRAlEE6Xcxsy36UUZQvblPUQc_4XR0F9uiPk1kUWuYtY5npK3USDWSvMiz1CJFq03bNGP24PeWCYV_8d3dMmiXr2ZbUnDoGecCio3l3tmJ-HU_Fpe9UQ0RTuDGqrByhloG-bWfq__hqZFD4","source":"ziprecruiter","full_description":"Position: Full-time/ContractSalary: Contract - Competitive RateExperience: 10+ YearsLocation: RemoteVisa Candidate Considered: NoRelocation Assistance: NoNotice: Candidates requiring C2C, H1-B sponsorship, or candidates submitted by other staffing firms will not be considered.DescriptionCraftlogic is building team of developers for a new project. The .NET Backend Developer will use the latest .NET Core. Experience with payments would be an added bonus to your skillset. Experience in T-SQL and SQL Server is a must. Message Queuing with MSMQ, RabbitMQ or similar experience is nice to have. Strong understanding of APIs, writing APIs, and consuming APIs is a must.If you're a strong .NET developer and have a desire to work in a fast-paced, integrated team environment while working remotely, this may the the right position for you.Requirements10+ years of software development experienceStrong API development experience.Strong experience integrating disparate systems and components.You must be extremely technical and have significant experience developing scalable web applications, with a penchant for building elegant and maintainable systems that get the job done with minimal complexity.You must have excellent interpersonal skills and enjoy working in a highly iterative, agile, and open team environment.You must have the desire and ability to build the right product for your customers and pride yourself on delivering products on-time against deadlines.Excellent verbal and written communication skills.Deep hands-on technical expertise in .NET, .NET Core, web development.Ability to handle multiple competing priorities in a fast-paced environment.A strong business and technical vision and the ability to translate these in business and technical approaches to meet aggressive timelines with optimal solutions"}