{"title":"Systems Operations Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIfUBNLIvgmcdsf87IAdSVMOEt2n1B_iDrAZydugGI9aIbTioIyFx7GTpa8JfGp3AMaCbMXIXBL0c7OlhBUhmcvfjKEpc-x8hyvo48lU_b22_YHpTDzAUfgtEBmFM7C-wn5BDtjaq0PBu0DRH3S6CnQiq2T25dDsGQ5g57jAC0w_b5NF8j8RwMwdUWRiOIY","source":"ziprecruiter","full_description":"Job DescriptionImportant Note: During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume when submitting your application for consideration. To participate in some selection activities you will need to respond to an invitation. The invitation can be sent by both email and text message.  In order to receive text message invitations, your profile must include a mobile phone number designated as \"Personal Cell\" or \"Cellular\" in the contact information of your application. At Wells Fargo, we are looking for talented people who will put our customers at the center of everything we do. We are seeking candidates who embrace diversity, equity and inclusion in a workplace where everyone feels valued and inspired.Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.The Consumer & Small Business Banking Technology team, part of Wells Fargo Enterprise Information Technology Group is searching for a highly motivated Systems Operations Engineer. We are seeking energetic and experienced technical service professionals to join our support environment as we grow our business and help our customers' businesses to grow.This person will perform a variety of duties on a day to day basis including production support and troubleshooting, application maintenance, monitoring and/or balancing and security administration issues. Provides support for the most complex technical issues and initiatives related to large-scale applications, systems, databases and/or other technical products and services. Additional responsibilities include the following, but are not limited to:Uses/creates diagnostic, simulation and other tools to maintain, troubleshoot and restore service or data to systems.May act as an internal consultant regarding use of tools and processes.Evaluates service level agreement criteria.Identifies gaps in current technology processes and recommends changes to assure SLAs can be supported.Performs complex migrations from development to production, upgrades, installations and/or configurations.May evaluate or review queries to extract data, create standard databases, or perform limited programming to fine tune systems supported.Completes project sizing; updates/writes documentation and procedures and creates and/or provides related training.Troubleshoots network, hardware and software issues and coordinates resolution with users, vendors and internal service groups.Writes/designs test scripts.Creates change or issue logs.Analyzes performance trends and recommends process improvementsAssesses changes for risk to production systems and assures quality, security and compliance requirements are met for supported areas.Creates, updates and tests the business continuation/disaster recovery plan.May provide team leadership to team or project members in a technology organization.May assign tasks and/or project resources.Provides work direction and monitors work progress and adherence to technical process controls/standards.Provides subject matter expertise to less experienced analysts.May provide input to supervisors on team member performance.Required Qualifications5+ years of systems support analysis experience demonstrated through work or military experience3+ years of experience working in managed services as demonstrated through work, military, or education6+ years of application production support experience6 + years of experience with Windows server operating systems3+ years of IIS experience3+ years of experience with scripting languages such as Bash, PowerShell, Python, Shell, VBScript, or JavaScript3+ years of experience working with XML (Extensible Markup Language)Desired QualificationsExperience supporting an enterprise-level environmentAbility to interact with all levels of an organization; including managementStrong team or technical leadership experienceStrong verbal, written, and interpersonal communication skills3 + years of SQL Server SSIS, SSRS and SSAS experience 3+ years of Splunk experienceExperience resolving and working through escalated and complex customer issuesAbility to lead projects/initiatives with high risk and complexityAbility to coordinate, lead and facilitate group meetingsStrong organizational, multi-tasking, and prioritizing skillsGood analytical skills with high attention to detail and accuracyExcellent verbal, written, and interpersonal communication skillsAbility to work effectively in a team environmentStreet AddressMN-Minneapolis: 255 2nd Ave S - Minneapolis, MNAZ-Chandler: 2600 S Price Rd - Chandler, AZNC-Charlotte: 1525 W Wt Harris Blvd - Charlotte, NCPA-Philadelphia: 101 N Independence Mall E - Philadelphia, PADisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.Relevant military experience is considered for veterans and transitioning service men and women.Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation.Benefits SummaryBenefits Visit https://www.wellsfargo.com/about/careers/benefits for benefits information."}