{"title":"Customer Service - Entry Level Sales","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKDR109uUmUJyJPpZ2EJjSG-xi_6Acr4s-LxxX6JVbYALzF5Xubx4TeNivzL2Az3lnP1bgyMFVz9FVk_skxkM1_nSmE9P0qdusqQeeGMPBnfdYzbXqIRkzFsVgAwcmSUz2oPrudfMJGj4ztQ3XXHD_GQrPcQlKvM0k7xV366RINHXMDsfWU_S-DT3NFhkU","source":"ziprecruiter","full_description":"Customer Service – Entry Level SalesWe are looking for individuals who are self-motivated, persistent, and can communicate confidently with a strong customer service mindset. Our agents focus on providing the best customer service experience as they help their clients navigate through the insurance and retirement planning process. We offer award-winning training on insurance education and sales techniques that in combination with your current skill set will put you on the fast track to a successful sales career. Performance based incentives on top of your earned commission include:Agent Accelerator Program: Earn up to $12,000 in bonuses your first yearQuarterly Bonuses: Earn up to $60,000 in bonuses per quarterHealth Benefits: Earn up to $2,400 in your first year and $6,000 in the following yearsCompany Paid Trips: Germany, Ireland, Bahamas, and more As an Insurance Agent, your responsibilities will range from:Use company-sponsored leads to identify and schedule appointments with your clientsAssist and review a customer’s insurance policy options and plan for their futureIdentify new avenues of business and sales opportunitiesParticipate in branch trainings to understand trends from field researchBankers Life has offered challenging and rewarding insurance sales opportunities for over 130 years with branch offices nationwide. Today, we serve more than 4 million middle-income working Americans.It’s time to put your skills to work for you. Apply today!CA Residents: We collect personal information from you in order to consider you for career opportunities with our company and its affiliates. Please see bankerslife.com/privacy-center to learn more about the information we collect and how we use it. bankerslife.com/privacy-centerBankers Life offers the Financial Representative position through Bankers Life Securities, Inc. Member FINRA/SIPC and the Investment Advisor position through Bankers Life Advisor Services, Inc. SEC Registered Investment Adviser.Bankers Life is the marketing brand of affiliated companies Bankers Life and Casualty Company, Colonial Penn Life Insurance Company, Bankers Conseco Life Insurance Company (BCLIC), Bankers Life Securities, Inc. and Bankers Life Advisory Services, Inc. Non-affiliated insurance products are offered through Bankers Life Securities General Agency, Inc., (dba BL General Insurance Agency, Inc., AK, AL, CA, NV, PA). BCLIC is authorized to sell insurance in New York.Securities and variable annuity products and services are offered by Bankers Life Securities, Inc. Member FINRA/SIPC, (dba BL Securities, Inc., AL, GA, IA, IL, MI, NV, PA). Advisory products and services are offered by Bankers Life Advisory Services, Inc. SEC Registered Investment Adviser (dba BL Advisory Services, Inc., AL, GA, IA, MT, NV, PA).Investments are: Not Guaranteed—Involve Risk—May Lose Value.\""}