{"title":"HIL Hardware Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKUJD4knll_z-iyQo0QlLW2nouZ-DBTmw4dupfuOyFGcD4o9vj7sipV0_K_25XDT2yGq82fGgd8K9V8NwajyuazpkF1Cu5NEvK3eWh-wtcwCBnyzyF93c14_ODyKY0yfbOvDHGiPM6FE4-cUOmTiB8V_TX02PHa0xYZrjmiuEQ4D4Y1dThem0Qsvoz43ig","source":"ziprecruiter","full_description":"HIL Hardware EngineerLocation: Auburn Hills, MIDuration: 9 monthsJob Description:The HIL Hardware Engineer’s duties include but are not limited to:Assisting with the development and support of the HIL system equipment focused on the system hardwareDesigning and testing HIL harness’Design, test, and deploy hardware modificationsAssisting with new powertrain hardware and ECU designs to integrate new features or external devices to the HIL test systemAssisting in harness build and modifications and troubleshooting of HIL hardware issuesRequirements:Bachelor of Science degree in Electrical\\Electronic Engineering, Computer Engineering, or a closely related Engineering degree from an accredited universityMinimum of 5 years of professional engineering experience in electrical/electronics, hardware, software or controls Knowledge and experience with ADAS, EE, electric and hybrid SystemsDemonstrated Hardware- In-the-Loop systems experience (dSPACE, ETAS, NI HIL systems) Experience with model-based development tools such as MATLAB/SIMULINKExperience with C/C++ code generation Experiences with scripting languages (e.g. Python, Perl) Knowledge of CAN stack, SPI, LIN and Flash bootloader integration Experience in diagnostic management: CANalyzer, CANoe Knowledge of Simulation Tool (e.g. CarMaker, ASM)Experience with UDS, XCP protocol Familiarity using trace capture tools, data acquisition and analysis tools such as ETAS - INCA Experience with HIL testing, vehicle integration and validation Outstanding interpersonal and problem solving skillsDemonstrated ability to work independently and in a team environment Strong communication skills, both verbal and written, with the ability to speak with individuals at all levels in the organization Experience working cross-functionallyPreferred Qualifications:Master of Science degree or higher in Electrical\\Electronic Engineering or Computer Engineering Working experience of MIL/SIL validation and verification. Basic knowledge of vehicle dynamics and specific simulation software. Knowledge of AUTOSAR adaptive platform. Knowledge of ROS environment. Experience of working within an AGILE or Scrum framework. Experience in Test Automation. Experience with Ethernet networking protocols such as 802.3, 802.1AS, TSN, and requisite transport layer formats.Experience with HD Mapping protocols such as ADASIS-NG or equivalent. Ability to adapt to changing environment with minimal effect on productivity Strong understanding of the development of embedded softwareAs an equal opportunity employer, ICONMA prides itself on creating an employment environment that supports and encourages the abilities of all persons regardless of race, color, gender, age, sexual orientation, citizenship, or disability."}