{"title":"Android Developer - Security Clearance","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIVK8Se4tfUGPd2RjaqGLiha0QN3LO7RVTMGgAKu_EPPNYkMD-tWqHNRlxYZ4wH0ZddQiKlm_v-IRpmbIm53VXOdh5VZcxzwFjTnJb_6zFUgc6Btp3ktE7W0mSQKBBeYHIdE-NG-zk5hcTuujrimAmsQ05OgEVsumQptA50GIQG2ySPr7486F3czWFy38g","source":"ziprecruiter","full_description":"Android Developer - Security Clearance Recognized by The Washington Magazine as one of the \"50 Great Places to Work\" in the Washington, D.C. area, where our success driven culture focuses on putting our employees first.If you have a passion for pushing mobile technologies to the limits, we are looking for an Android Developer with security clearance, to join our team! Do you want to work on the forefront of cyber with a fun, dynamic company that is in the midst of amazing growth? We are looking for talented folks looking to contribute to our mission focused projects (and we're not talking network defense or basic IT security). Sound like you? If so, keep reading & apply today!Top Reasons to Work with Us1. Flexible hours to promote a healthy work-life balance2. Competitive compensation with full benefits + competitive match on 401K and corporate profit sharing3. Voted one of Washingtonian's Top 50 Employers and Washington Business Journal's Top 100 Employers in 2019What You Will Be DoingBy joining our mobile team, you will be collaborating with a team of passionate, self-motivated engineers. Be ready to roll up your sleeves to continue to learn, grow and help us tackle brand new challenges and assist in solving the toughest security problems. In an effort to support ongoing missions, the ideal candidate will assist in research, design and implement new solutions as needed.What You Need for this PositionRequired Qualifications:Minimum 3+ years of professional software development in the following:- Python- C/C++- JAVAMinimum 3+ years of Android development (Android studio)Top Secret TS/SCICI Polygraph or SCI-- Current security clearance is a must --Desired Qualifications:Knowledge/experience in developing LINUXKnowledge/experience in developing on iOSExperience with advanced debugging and reverse engineering toolsUnderstanding and knowledge of security evasion techniquesWhat's In It for You- Competitive compensation ($105k-$135k DOE)- Competitive Match on 401k and corporate profit sharing- Full medical and dental insurance options- Flexible hours to promote a healthy work-life balance- Access to a company Uber account whenever you may need a ride- Opportunities to travel around the world to conferences and training- Choose your technology- be it mac or windows- Amazing company culture and fun, relaxed office environment (break room includes foosball, shuffleboard, VR games)- Unlimited coffee and espresso bar- Company activities like concerts, barbeques, game nights, etc.So, if you are an Android Developer - Security Clearance with experience, we look forward to hearing from you! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}