{"title":"AI/ML - Hardware Engineer, MI Neural Design","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJjhAWN-VrI1F8i44jrsWylalbvX6ZeB9u9wZYfqKygfUwkxppTlEj00VwjOHrS-myPBPCr9JqRG598HU9TFTJn4QMG4q1PQ_qguhTi5B45PbIxSxxallST7oGI6c-IrwsTVHDWM71JNyWgvbVxMZS_sboBeidAqaJfEHuofDHcf6ZWO8SdUWTuvFabRVZQ","source":"ziprecruiter","full_description":"AI/ML - Hardware Engineer, MI Neural DesignSeattle,Washington,United StatesHardware+ 2+ years of experience working on ultra low power design + Proficiency in Python + Experience with FW development (C/C++) + Strong verbal and written communication and collaboration skills + Proficiency with Verification Methodologies, Environments and Best Practices. Understand and specify board level Requirements for FPGAs and low power CPUs. + Hands on lab bring-up experience, debug, and instrument usage + Experience with different sensors, particularly image sensor, microphone and IMU**Description**As a Hardware Engineer on this team, you will use your background to: - Build ultra low power hardware for AI applications - Come up with novel ideas to improve power consumption to fit the application requirement - Collaborate with multi-functional teams and understand requirements. - Articulate implementation choices, challenges and present results - Collaborate with multi-functional teams in order to define prototype hardware to evaluate new technologies and features - Do failure mode analysis, root cause diagnosis and system-level problem solving - Have hands on bench measurements of prototypes**Education & Experience**Bachelor's, Masters or PhD degree in Electrical Engineering, Computer Science, or a related field**Additional Requirements**+ - 5+ years of experience working on ultra low power design + - Schematic capture and PCB layout design for mixed signal boards (Cadence, Altium, Eagle, etc.) + - In depth experience with FPGA platforms: Xilinx FPGA boards, debug, performance and throughput tuning + - Proven micro architecture development and excellent documentation skills**Apple Footer**Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant (Opens in a new window) .Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. United States Department of Labor. Learn more (Opens in a new window) .Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law. If you're applying for a position in San Francisco, review the San Francisco Fair Chance Ordinance guidelines (opens in a new window) applicable in your area.Apple participates in the E-Verify program in certain locations as required by law. Learn more about the E-Verify program (Opens in a new window) .Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace. Reasonable Accommodation and Drug Free Workplace policy Learn more (Opens in a new window) ."}