{"title":"Scientist II - Analytical Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJoJoQ6L1WcwLQ6Q_RzCcKwNoIgsrFmHFjbNUBxrc2ebKKx1JBHXFh7gCN4_61tRTt4Ww0Mb7ct3jXYZqDiLRrHt3rMro5e5egTfLu3CHdDBfFSim9UyIjToHuWmntC3ZxPtvLzbgh276MBxfVVV_2FYxdb6JQLqSA6HqipwIKdsPG22tK8wEYvzgtk5Y8","source":"ziprecruiter","full_description":"BASF's Bioscience division prides itself as a unique and innovative piece of the global BASF enterprise. With over 150 years of history, BASF has proven to be a thought-leader and visionary moving forward to create chemistry for a sustainable future.  The Enzymes team, located predominately in San Diego, has an environment and culture that puts employees first, allowing for personal flexibility and offers a benefits program that is robust and rewarding. Couple that with the organization's reputation of continued global growth, and the full total rewards as a BASF employee are hard to be matched.  Our research focus is simply stated: We create chemistry for a sustainable future. As a global organization, our employees have a world of opportunity at their fingertips- literally. The pillars of success for BASF Bioscience are as follows: Connecting people and their passion for bioscience with a structured, engaged, and empowered team while allowing for them to find the work life balance needed to connect with loved ones at home and outside of work priorities/activities. Find yourself in the career you've dreamed of with the balance you require. Engaging employees to build a high-performance culture that will drive long-term success for themselves and the company, with an open door to many business units and locations around the world. We offer global development opportunities, as well as, encourage relationship building across the organization.Caring about one another, our customers and stakeholders, and our communities and environment. As part of the BASF Bioscience team, it is our duty to ensure we are driving thoughtful and meaningful innovations for the future. In fact, it stretches beyond our duty...it's our passion. Putting lifelong learning first by offering a wide range of career development opportunities. This will not be like working at your typical R&D or biotech company. We offer numerous training and development courses, tuition reimbursement, and endorsements for our employees to heighten their career aspirations. Scientist II - Analytical Chemist (2100564) - San Diego, CA Where the Chemistry Happens We are seeking a professional like you to join our team.  In this role, you will be responsible for developing, optimizing analytical methods, and executing sample analysis for the needs of projects.  In this role, you will need to react quickly to changing demands and be able to creatively discover analytical solutions and timely deliver analytical results for accurate identification, quantitation, and characterizations of various target molecule types including proteins, carbohydrates, and small molecules.      Formula for Success  Leveraging your strong knowledge and background in utilizing and developing HPLC, GC, LCMS, MALS and CE methods, you will analyze small molecules, carbohydrates, polymers or proteins.Striving for success, you will use your experience in developing high throughput analytical methods, utilizing automated sample preparation, optimizing analytical methods, operating and maintaining analytical instrumentation and providing timely reports of data.Your critical thinking skills and proficiency at researching and learning new techniques will be essential as you perform complex data analysis. Demonstrating your experience in utilizing additional analytical equipment like DSC, DLS, ICP, NMR, NIR, you will tackle the diverse and changing needs of projects.Your strong, honest, and proactive communication will serve you well as you work on fast moving projects and needs. Create Your Own Chemistry: What We Offer You Adding value to our customers begins with adding value to you. You@BASF is the suite of benefits, perks, programs and unique opportunities we offer to support you-the whole you-in all stages of your life and career. With you@BASF, you create your own chemistry. The total rewards that you receive as a BASF employee go way beyond a paycheck. From competitive health and insurance plans, to robust retirement benefits that include company-matching contributions, to making sure you never stop learning, we believe investing in you is investing in our success. Working for a large, global organization, you'll have a chance to grow professionally and personally, expand your network and build a rewarding and dynamic career. BASF provides interesting and challenging learning and development opportunities to help you make the most of your talents and your job."}