{"title":"Embedded Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIYYM4QJQoxcxbaPqZwD4Ja092gFCJRZKxiXkWv7TW1tvQettsUy5Erlx4NQtO3TQ3bmAWgpnygBK3TL6h-lS71A7rgCuof0zrapOrMPqD12URXivToQP06n0aNjzr-zILuEUthVWO_pI2sU2rK9kn28Jdv1iaNa0fNeYqL3HwPBTFyIyA-SjJTAOa9F2yy","source":"ziprecruiter","full_description":"About the Company: Founded in 1970, Kinetico pioneered the development of non-electric, fully automatic water treatment systems. In the years since, we have grown into a global company of independent Kinetico water experts and international distributors serving more than 100 countries. We offer complete water systems that deliver only the highest quality water for general use and drinking. We back every piece of our equipment with industry-leading warranties. Our approach reflects our deep commitment to preserving and conserving fresh water, one of our planet's most precious and endangered natural resources.  About the Position: The Embedded Hardware Engineer works collaboratively with marketing, IT, manufacturing, sourcing and product development engineers to define, design and validate solutions for smart home/connected water softening and drinking water products. S/he will be responsible for leading the specification and design of hardware and firmware for innovative new products.The ideal candidate is enthusiastic about working in a entrepreneurial, hands on environment, and can embrace continual innovation and optimization. S/he will have a keen attention to detail and the ability to take ideas all the way from concept to execution. We are looking for quick learners with proven analytic and problem-solving skills. Key Areas of Responsibility: Design embedded hardware and firmware to interface with laser/ultrasonic transducers, measurement systems, pressure sensors, and similar electronic devicesRealization of complex system requirements to provide robust and reliable hardware solutionsDefine hardware system requirementsDesign circuits and circuit boards for battery-powered systems and power supply designElectronic circuit design and hardware testing, also develop software to test your hardwareResponsible for the design and overall quality of the hardwareHardware and firmware debuggingAble to support/debug system integrationWired and wireless communication interfaceDocumentation of design specifications and implementation detailsCustom test equipment design and developmentPossesses the skills to build / prototype hardware designs to demonstrate proof of conceptsSchematic designLead design reviewsJob Knowledge, Skills, and Experience: BS Computer Engineering or Electrical Engineering or similar engineering fieldMinimum 7 years of experience with embedded hardware design and developmentExperience with battery-powered hardware and firmwareProficiency in programming in CProficiency in testing and debugging embedded firmware with in-circuit emulatorsExperience designing hardware and firmware interfaces to microcontroller peripherals, such as a UART, SPI, I2C, ADC, LCD, etc.Excellent verbal and written communication skillsAbility to work in a fast-paced environmentAbility to understand and modify existing hardware to troubleshoot, isolate, and resolve issuesExperience with tools for issue tracking, documentation, static code analysis, and testingKnowledge of software architecture including experience with database and systems design and testing.Team experience applying modern agile software development practicesGood understanding and personal experience with IoT devices and Smart Home technologyStrong collaboration skills including creative thinking and attention to detail. What We Can Offer You:Medical, Dental, Vision and Prescription Drug Insurance Coverage Employer Provided Life Insurance, Short-Term and Long-Term Disability Benefits401(k) Contribution Matching ProgramPaid Vacation, Holidays and Community Service Volunteer time off benefit Wellness ProgramEducational Assistance Reimbursement Program"}