{"title":"Maintenance Mechanic-PM NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJtmEzikGXg6NZ8agTct__Z9jFiPZwdqC2tXYAOA88DAAu_WTVJZ2c4CCxxx6xSHc2eL8ymKndXIT0pE6OzI1PDgyrUyS_0N1i5gtPpfyQE4QOq2zjv3zQrJ2FplQ9eIGtcGFOB8lCAEmeO9fdgRB4iQHnH7l55jTKVoaAxx2RQzt7yS2eG-nnxqmIawlc","source":"ziprecruiter","full_description":"Who We AreThompson Pipe Group is a privately held family business of engineers, contractors, and manufacturers based in Rialto, California. From the humble beginnings, we built a family of products to meet the needs of all kinds of infrastructure. Each generation of products is better than the previous.Thompson Pipe Group is now the largest and most diverse drainage, sanitary, pressure and trench-less pipe provider, with manufacturing locations across the country and serving not just the US but all North America. Please visit our website at www.thompsonpipegroup.comJob Duties:Performs preventive maintenance such as changing oil, greasing and replacing parts on a scheduled basisUnder supervision, replaces parts and performs minor repairs as necessaryReplaces designated lube fittings and tires utilizing air tools and hand toolsUses schematics, service manuals and parts lists in setting up and performing repairsOperate Fuel/Lube truck to deliver fuel/lube to equipment on sitePerforms other duties as requiredResponsibilities:Performs all duties and activities in a manner that conforms to safety requirementsMaintain work area clean and safe work practicesTakes the initiative to get things done.Checks, communicate and fill necessary fluids (battery, powering steering, and washer fluid)-replace all caps.At times, expected to perform duties and tasks outside of job description to meet business needs.Report to management on any damaged/discrepancies with equipment. Physical Demands:Job requires heavy physical activity performing strenuous daily activities. Must be able to meet all physical requirements including lifting up to 50lbs, standing for long periods of time, climbing step/ ladders up to heights of 15 feet while using fall protection. Must always be able and willing to follow all safety rules and regulations while wearing appropriate PPE. Must be able to work in all weather conditionsMust be dependable, flexible and able to work overtime as neededMust have reliable transportationMust be able to read and write in English.Cannot have a cement allergy Maintains neat and orderly work areas at all times.Required Education and Experience:Hands on experience with lube, oil, filter, brakes, tire (auto, LT truck, commercial, and farm) preventative maintenance fluid flushes.Locate, diagnose and repair most mechanical malfunctions in gas and diesel-powered vehicles and equipment.Must have experience using a standard/metric wrench and socket set, screwdriver s, hammer, impact gun and sockets, pry bar, alignment toe hooks, air hammer, tape measure, vise grips, torque bits, wheel bearing socket set, 12 volt test light, and oil filter tools to perform the duties of the GMT positionMust be able to lift 50 Lbs. easilyLube tech: 1 year (Required)Truck Tire Installer: 1 year (Required)High School Diploma or G.E.D. Minimum 2 years of work-related experience and/or training in skilled trades.What We OfferTop-tier Medical, Dental, and Vision BenefitsLife and Supplement LifeCompany Matched 401K Retirement PlanPaid HolidaysFun EventsTraining and DevelopmentEmployee DiscountsCareer Opportunity!We are located at 800 CR 209, ALVARADO, TX 76009Question about the Position? You can contact us at 817-677-9989 EOE/AA – M/F/Vet/DisabilityThompson Pipe Group – Dallas is an Equal Opportunity Employer"}