{"title":"Military Training Software Simulation Engineer -Relo Texas NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK4o7rMLP8FD2M9P2WvlkhZMQDJ5GRvbMUwEK0FJbzAEebhF7Y1WNmJeKwdRHpGQna7xAUmAZnLGAejTKh8pOtbk-QkVwD0RZaeNBx7YGgigs0M9sRIQopSfE4k8nr8wdNtPEFPFjUJMmRLzxJK5bX-E6wrqUglYh_SJjpgMegZEhSPorRDHaa6r9wjgenB","source":"ziprecruiter","full_description":"Pacific Technical Resources, LLC.IT/Engineering Recruitment Professionals\"Helping to build Great Companies and Great Lives\"We are Seeking an experienced Military Training Software Simulation Engineer for a direct hire position for Billion Dollar Leader in the Defense Industry in Arlington, TexasJoin this Defense Leader in training and simulator and mission modeling technology leadership to assure optimum warfighter safety, performance, readiness and success.Relocation assistance is available.Employer is serious and urgent to hire.Principal activities include extending the capabilities of Modeling & Simulation system, utilizing high-performance computing environments such as Graphics Processing Units (GPUs), massive memory and visualization capabilities, high-speed internal networks and interoperability with external virtual and live systems.These simulations will support military system design/trade studies, performance assessment, and system test. Successful candidates will perform the functions described below by employing listed skills.REQUIREMENTSBachelor’s Degree in a Math, Science, Engineering or other STEM-related12 years Relevant software engineering experienceExperience Developing complex, modular open-systems architectures using a mixture of re-use, COTS, and newly-developed technologiesExperience with US Department of Defense training and simulation systems (desired)Experience with Augmented Reality and Virtual Reality technologiesUS CitizenIf you are qualified and willing to relocate or work in Arlington Texas and seeking a new career opportunity please send your resume to Clara at cfoo@pacifictechnicalresources.com or callClara at 480-559-8998Pacific Technical Resources, LLC. specializes in IT/Engineering Recruitment Placement with roots from Honolulu, Hawaii is headquartered in Phoenix, Arizona.We bring extensive experience with IT/Engineering recruitment along with a holistic philosophy of valuing people. We have special industry expertise with Energy Solutions and Aerospace/Defense.Please visit us on our website at www.pacifictechnicalresources.com"}