{"title":"Sr. Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKF34WRNlcY-e7MwrMqZUA29NfjweGDuQ5sE4Zb89yIsVfI4x3KwlQZes6CTlXreEPLm6Zdq6NxFiE8O8klZdDnWOK0YZIUABXmKCycyYcvlV5cXs7MVIz3CeLg0aPMZgmL1p0dqR-scjShHrNvTGz4PfRCmclnJloOlUwNvedet9eWDqY7CNWgwDmlJpAt","source":"ziprecruiter","full_description":"Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.As a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience.*This is a remote/office based position which may be performed anywhere in the United States except for within the state of Colorado.Oracle is an Affirmative Action-Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veterans status, age, or any other characteristic protected by law.Sr. Software Engineer - Analytics SaaS Applications**Company overview*Oracle is the world's most complete, open and integrated business software and hardware systems company. With more than 100,000 professionals, working in over 150 countries around the world, Oracle is the only vendor able to offer a complete technology stack in which every layer is engineered to work together as a single system. Oracle's industry-leading products give customers unmatched benefits including unbreakable security, high availability, scalability, energy efficiency, powerful performance, and low total cost of ownership. Oracle has the best of breed technology at every layer of the stack. All the way from hardware to applications.*Global Business Unit (GBU) Overview**VISION: To be the leading provider of cloud solutions enabling our customers to connect, engage, and monetize their services.MISSION: Provide integrated cloud solutions for our customers to accelerate their digital transformation journey - from network evolution to digital business to customer experience. Join us in shaping the next generation of cloud services!You share our passion for developing great software and enjoy staying on top of technology trends and best practices? Apply to join our team in Bangalore.This position is for Sr. Software Engineer within GBU for delivering SaaS Analytics applications to our customer base.What To Expect:** We work in small teams using state-of-the-art technologies. We offer a competitive pay and do not watch the clock. We trust you and your skills and do not micromanage. Working at Oracle means being among excellent, competent and inspiring people from around the globe. Ability to learn new management philosophies, technologies, improve skills and develop yourself.Responsibilities:** Develop SaaS applications. Join local and remote agile teams of developers. Take leadership role for projects including product design. Analyze and create implementation strategies and requirements. Use and contribute to the Continuous Integration and Continuous Delivery process (CI/CD). Work with state of the art Cloud technologies. Write well designed, testable, efficient code. Demonstrate Strong Quality Orientation, and get involve in Organizational process that will enhance the Organizational productivity. Demonstrate dedication and responsibility in delivering results and shall be Team Player.*Desired Skills/Experience:** Minimum 8 years of Software Development experience. Good understanding of Cloud Native Architecture and principles. Hands on experience on Continuous Integration (CI), Test Strategies, Git, Jenkins, Gradle, Docker. Proven working experience in Java development Proven working experience with Rest API's Hands on experience in designing and developing applications using Java EE platforms Experience in the Spring Framework Object Oriented analysis and design using common design patterns. Profound insight of Java and JEE internals (Classloading, Memory Management, Transaction management etc) Strong debugging skills from client-side to server-side to back-end. Experience with test-driven development. Knowledge of Agile methodologies and principles. Great interpersonal and communication skills.*Preferred Skills:** Experience in developing SaaS and PaaS and a good understanding of Cloud principles. Knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate) Excellent analytical, organizational and problem-solving skills coupled with a strong work ethic. Experience in Unix scripting, SQL. Contributions to open source projects is a plus.* Sociable, Autonomous and Cooperative.Job: **Product Development***Organization:** **Oracle***Title:** *Sr. Software Engineer***Location:** *United States***Requisition ID:** 2100088P"}