{"title":".NET Software Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALDxbLKZ0YVFH28RnW1oE4MaYHR2fR16tVPmy6xFeu8VsJKSeE6mkRD_ZEz08l2Y1vfiUrQA-OTu6fxxaPo35cp1INk6r_aiqPPX2ECO4pOwA-xxce7aDKy9yV-zUQUias3O7onJR0EiULuJPh2wPk78yKC2Ay93Jo182_jBeYrK2DllxhteCAxbpTN0A","source":"ziprecruiter","full_description":".NET Software Engineer .NET Software Engineer Position - C/C++, C#, .NET, Windows, MFCBased in the Detroit, MI area, we are a mid-size, fast-growing company offering controls system tools to our worldwide clients. Due to demand for our services, we are currently recruiting for a talented Senior Windows Software Engineer to join our team of engineering professionals. You will be responsible for the design and development of our next-generation software using C++, C#, and .NET technologies.What You Will Be Doing- Full life cycle development including new development, maintenance, and design for our existing Win32 MFC based products- Developing next-generation products using .NET technologies- Working in a team-oriented environment where you will have the opportunity to wear multiple hats and advance your careerWhat You Need for this Position5+ years of experience with:- Expertise in most of the following technologies: .NET/C#, C++, MFC, COM, ATL, Win32 API's- Strong written and communication skills- Experience developing GUIs in both MFC, WPF, or Windows Forms.Pluses include:- WPF, SOAP, REST, and DCOM- Networking and communication protocols experience- Experience with communication transport layers such as CAN, RS232, USB, and Ethernet.- Real-time systems knowledge- Matlab or Simulink experienceWhat's In It for YouFor your hard work and dedication you will be rewarded with, but not limited to:- Competitive salary- bonuses- paid holidays and vacation time- full benefits - retirement plan with company matchingSo, if you are a .NET Software Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}