{"title":"Research Scientist-Synthetic Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJHbFbxeKhs7l0s5NiF-pyDVSnsaoGKKDMk9kFJSedlnjMfFChvhLCl3Gvhn9j7q0pEaci1vs0xwErIaRtOIJa4Jko8zxW6lSHp9vgwSh1eGYuxpzHO9Vw9ZKY_5MoY3MRTMAUMr1j9KiRnilGa33xPDQYp30ndrmL4k8qldUxmrA0-jeQnibRhxM9rFZ4","source":"ziprecruiter","full_description":"At Lilly, we unite caring with discovery to make life better for people around the world. We are a global healthcare leader headquartered in Indianapolis, Indiana. Our 39,000 employees around the world work to discover and bring life-changing medicines to those who need them, improve the understanding and management of disease, and give back to our communities through philanthropy and volunteerism. We give our best effort to our work, and we put people first. We're looking for people who are determined to make life better for people around the world.Lilly is passionate about the discovery, development and commercialization of potential new medicines that will impact and improve the lives of patients. Our RNA Therapeutics team is an innovation-focused organization striving to identify, develop and apply the most cutting edge technologies to deliver maximum benefit to our patients. Our agile and diverse team strives to operate as an autonomous 'biotech-like' company within the walls of Lilly. We endeavor to impact our communities, families and patients we serve.In the RNA Team, both basic and applied sciences are vital. We are looking for creative and energetic problem solvers to lead in a multidisciplinary team at the front edge of innovation. Key facets of the role are identifying next generation tissue opportunities, leading teams in design of ligands for specific cellular and tissue delivery and synthesis and purification for sophisticated molecule assembly that progress an innovative preclinical portfolio with focus on scientific precision and portfolio effectiveness. We are building state-of-the art expertise in major oligonucleotide-based modalities and delivery approaches, with an emphasis on innovative approaches with potential for breakthrough efficacy.You will join our fast-paced, interdisciplinary team as we utilize novel RNA/oligonucleotide based therapeutic modalities to enhance the Lilly portfolio. The successful applicant will utilize their knowledge and technical expertise to complement and enable core capabilities and help drive the revelation and development of RNA-based clinical candidates. Do you have an aptitude for innovative approaches and modalities in discovery and development focused on identifying impactful therapies for the patient? We want you on our team!**Basic Qualifications:**+ PhD in Chemistry, (synthetic organic chemistry or oligonucleotide chemistry preferred) or relevant area of study**Additional Skills/Preferences:**+ Experience in the design and synthesis of small molecules, peptides, lipids or carbohydrates and their conjugation chemistries to oligonucleotides. + Highly skilled and knowledge in the areas of synthetic chemistry, reactions and methodologies. + Knowledge or experience in the areas of bioconjugation chemistry, techniques used therein for conjugation to oligonucleotides + Knowledge in the area of oligonucleotide therapeutics including design and synthesis thereof. + Proficiency with analytical and physiochemical characterization of novel biomaterials (ex., mass spectrometry, separation techniques and other biophysical/biochemical techniques) + Excellent communication skills with a proven track record of scientific excellence as evidenced by strong publication record + Confident, execution focused and team oriented with an ability to thrive in an entrepreneurial environmentEli Lilly and Company, Lilly USA, LLC and our wholly owned subsidiaries (collectively \"Lilly\") are committed to help individuals with disabilities to participate in the workforce and ensure equal opportunity to compete for jobs. If you require an accommodation to submit a resume for positions at Lilly, please email Lilly Human Resources ( Lilly_Recruiting_Compliance@lists.lilly.com ) for further assistance. Please note This email address is intended for use only to request an accommodation as part of the application process. Any other correspondence will not receive a response.Lilly is an EEO/Affirmative Action Employer and does not discriminate on the basis of age, race, color, religion, gender, sexual orientation, gender identity, gender expression, national origin, protected veteran status, disability or any other legally protected status.At Lilly we strive to ensure our employees are part of a team that cares about them and our shared purpose of making life better for those around the world. How do we do this? We continue to look for ways to include, innovate, accelerate and deliver while maintaining integrity, excellence and respect for people. We hope that you seek to join us on our journey as we create medicine and deliver improved outcomes for patients across the globe!\\#WeAreLilly"}