{"title":"Mid Level Technical Publication Project Management Specialist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIrUQHq-L2NqnDjwZ9fOJtDe8JN7IIoAoTPDJmJQmwRjSkp57PrWmWYCLzmPLiaB-ylH9pidiXtuH07A1seAY-u-PULaiee1ft99vFMsEoih-BzZAkPnndFNjWascEmEaQ4L4zVBgscjSnRV7a0hikOwIZsOcOEY71g3oR65k1zkR3yCsGwkGtw0d1h9ONP","source":"ziprecruiter","full_description":"Mid Level Technical Publication Project Management SpecialistCompany:The Boeing CompanyJob ID:00000234930Date Posted:2021-03-10-08:00Location:USA - Fort Walton Beach, FL, USA - Long Beach, CA, USA - Saint Louis, MO, USA - San Diego, CAJob Description Summary:Monitors technical data development at the program level to ensure data is developed and delivered on schedule and in accordance with contract requirements. Analyzes, updates and documents processes to ensure technical manual data/procedures are documented and current. Coordinates schedules and develops reports. Evaluates configuration changes for impact to publication data; incorporates changes into schedule. Prepares and negotiates agreements. Prepares pricing quote and resolves issues related to pricing or scheduling requirements. Supports presentations and program management briefings. Makes recommendations for new business and supports implementation of new projects.Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Relocation:No relocation availableExport Control Requirement:This position must meet Export Control compliance requirements, therefore a \"US Person\" as defined by 22 C.F.R. 120.15 is required. \"US Person\" includes US Citizen, lawful permanent resident, refugee, or asylee.Safety Sensitive:This is not a safety sensitive positionContingent Upon Award ProgramThis position is not contingent upon program awardJob Description Qualifications:The Boeing Company is seeking a Project Management Specialist to join the Technical Publications Team in Saint Louis, MO, Fort Walton Beach, FL, Long Beach, CA or San Diego, CA. The candidate will be supporting the U.S. Air Force and U.S. Navy flight manuals.This position will support a portfolio of Development and/or Sustainment projects including all aspects of life cycle planning, product affordability, proposal development, negotiation strategy, integration leadership, and issue resolution. Selected candidate will also support fleet readiness and health of fleet improvement initiatives.Position Responsibilities:Directs and monitors extensive, specialized technical data development from the program level ensuring technical data is developed and delivered on schedule and in accordance with contract requirementsProvides expertise on processes to ensure technical manual data/procedures are documented and currentDirects program scheduling and reporting efforts and resolves complex issuesAdvises management on the negotiation of contracts and develops summary estimates relevant to technical data developmentWorks with customers on complex pricing and scheduling issuesCoordinates information related to configuration changes that impact publication dataThis position must meet Export Control compliance requirements, therefore a \"US Person\" as defined by 22 C.F.R. 120.15 is required. \"US Person\" includes US Citizen, lawful permanent resident, refugee, or asylee. Basic Qualifications (Required Skills/Experience):2+ years of experience collecting, organizing, synthesizing, and analyzing data, summarizing findings, developing conclusions and recommendations from appropriate data sourcesExperience in developing cost estimates for multiple projectsProficient in Microsoft Office SuitePreferred Qualifications (Desired Skills/Experience):Experience/Knowledge of Technical Publications, aircraft systems or technical dataBachelor's degree or higherActive U.S. Security ClearanceTypical Education/ Experience:Education/experience typically acquired through advanced education (e.g. Bachelor) and typically 6 or more years' related work experience or an equivalent combination of education and experience (e.g. Master+4 years' related work experience, 10 years' related work experience, etc.).Relocation:This position is located in a location that does not offer relocation. Candidates must live in the immediate area or relocate at their own expense.Drug Free Workplace:Boeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies.Experience Level:Individual Contributor - 3Job Type:RegularJob Code:GDB9I3 (GDH)Equal Employment Opportunity:Stay safe from recruitment fraud! The only way to apply for a position at Boeing is via our Careers website.Learn how to protect yourself from recruitment fraud - Recruitment Fraud WarningBoeing is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military/veteran status or other characteristics protected by law.Request an Accommodation - Requesting Interview Accommodations Applicant Privacy - Applicant Privacy EEO is the law Poster - EEO is the lawBoeing Policy on EEO - Boeing EEO Policy Affirmative Action and Harassment - Boeing Affirmative Action and Harassment Boeing Participates in E - VerifyEnglish -  E-Verify (English) Spanish - E-Verify (Spanish) Right to Work Statement English - Right to Work (English) Spanish - Right to Work (Spanish)"}