{"title":"Senior Android Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKO4K0v9nmQ4BdS_zDv2_gXBkEzUdtS3cQQez3kGESZX7TaeBon4eSo2dvsUxUHaNYzbRcMj4Y6JrdfvGhGv0wmD_Kt7Db4a7QBCYIQFIY_d_YcqMkX-Fcm9IvE5PmanQpG-K-2wOZ9u5RNlcm7CtELUmHfCvX1CkCCnz4vyw08bLDs3G3_28GXUTbEXiY","source":"ziprecruiter","full_description":"At Bypass (now Fiserv), we are revolutionizing the way WE experience food. Have a favorite sports team? Stop to get coffee in the morning? Love frozen yogurt? You may have used our products and software and didn't know it! Ready to help us revolutionize commerce? Come join us!**What does a Senior Android Engineer do?**As a Senior Android Engineer, you will be a part of a team of people responsible for crafting and maintaining a suite of Android client applications, point-of-sale APIs, and back-of-house web applications in a fast-paced result-oriented environment. A Senior Android Engineer has extensive knowledge and experience related to Android application architecture and uses it daily to mentor others and develop high-quality Android client applications. They lead by example, treat everyone with respect, prioritize quality, maintain an understanding of the constraints and needs of the business, and help define the long-term architecture for the full suite of Android applications.**As a Senior Android Engineer, you can look forward to:**+ Collaborating with Product Development, UX Designers, and QA to build quality products; including resolving complex technical issues related to projects. + Building, testing, implementing and launching the solutions proposed. + Installing, configuring, customizing, upgrading, supporting and troubleshooting all technical issues related to on premise and hosted environments for mobile platforms. + Working directly with third party vendors to define technical requirements and customize, configure and implement solutions to interface with various external systems. + Partnering with senior management to define and implement technical processes and procedures within department focusing on client satisfaction and efficiency + Communicating within your functional team and across Engineering to keep information flowing + Reviewing peer code, designs, and providing mentorship. + Writing tests and automation to advance maturity in product testing + Being a team player, ability to collaborate idea sharing in a strong product setting. + Developing native mobile applications for Android + Working in an agile environment, participating in planning and Scrumban boards. _The above statements are intended only to describe the general nature of the job and should not be construed as an all-inclusive list of position responsibilities._ **Basic Qualifications:**+ Bachelors Degree required. + 8+ years of Android development experience. + Extensive knowledge and experience related to Android application architecture. + Advanced understanding of object orientated design principles. + Solid grasp of software development patterns and their various applications. + An advanced understanding of coding techniques which contribute to the reliability, maintainability, readability, simplicity, performance, and testability of software. + Experienced in the day-to-day practicalities of Software Development Lifecycles such as Kanban. **Preferred Qualifications:**+ Experience with CI/CD pipeline, Gradle/Kotlin DSL's for building Android applications/libraries + Experience developing in Kotlin. **Learn more about Fiserv:** To support the total well-being of our associates, Fiserv takes a broad approach to our benefits. We offer a comprehensive benefits package that provides flexibility and affordability with a variety of medical, dental, vision, life insurance and disability options. We are #FISVProud of our benefits and well-being programs. Our commitment to wellness, wellness education, preventive services and fitness activities are designed to meet you where you are.We're Fiserv, a global leader in Fintech and payments enabling innovative financial services experiences that are in step with the way people live and work today. The company's approximately 44,000 associates proudly serve clients in more than 100 countries, so their customers, members and consumers can move money when and where they need it, at the point of thought.Our Aspiration is to move money and information in a way that moves the world. As a FORTUNE 500 company and one of FORTUNE Magazine World's Most Admired Companies for the seventh consecutive year, we are committed to excellence and purposeful innovation.We welcome and encourage diversity in our workforce. Fiserv is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteranExplore the possibilities of a career with Fiserv and Find Your Forward with us."}