{"title":"Technical Regulation Specialist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ0VD6NniPEpItBaFYkD0GB8zR5sOGTiAwxxSgTZ0HrlZLyu3Gy9zcLG3XqWHSlcW-H6SUT5StgDHey_vueyLFxqyrdbZpDyp3Bj8mFNELWtFfcBEyDviwqT9QxY6McIrBC6gQZfOofg7K2HEBCUlv5MkPJm_QjzPz5aWkS7qFr268s13o7kK05JCPkcMHI","source":"ziprecruiter","full_description":"Technical Regulation Specialist Description Our culture believes in POWERING YOUR POTENTIAL. We provide global opportunities to develop your career, make you community a better place and work with most innovative thinkers to solve world's toughest problems. We believe in flexibility for you to explore your passions while making an impact through meaningful work within our inclusive workforce. That's what #LifeAtCummins is all about. We are looking for a talented Senior Technical Regulation Specialist to join our team specializing in Cummins Compliance and Regulatory Affairs for our Corporate Business Segment in Columbus, IN. Your impact will happen in these and other ways: + Responsible for environmental compliance related activities. Applies specialized knowledge of engineering and/or project management principles and practices across various areas and projects by interpreting, communicating and ensuring all environmental regulations and standards are adhered to as they impact the company products, processes, components or facilities. + Applies technical expertise on complex components or projects and work under minimal supervision for regulatory compliance efforts and other applicable programs.Participates as a key contributor and be accountable for cross-functional project success with various stakeholders. + Analyzes and communicate information to many internal stakeholders as it relates to environmental compliance matters. Identify, establish and/or facilitate meetings and trainings on compliance. Leads small projects or portions of large projects. + Works with subject matter experts from related groups to drive efforts to improve environmental performance or compliance processes and identify opportunities to establish common processes and tools. Supports defining and executing corrective actions + Communicates with and influences key external stakeholders and business leaders, escalates compliance issues as appropriate. Assists with the transfer of knowledge; coach and mentor less experienced compliance personnel. + Demonstrates depth of knowledge of engineering or environmental discipline(s) and leverage expertise on other projects. Proposes innovative initiatives and projects.Escalates and drives resolution to compliance questions and issues; provides technical direction for a project or a project team. Troubleshoots complex problems and recommend appropriate actions. Education, Licenses, Certifications University, or equivalent degree in Engineering, Environmental Engineering, Environmental Science, Business, or related technical or scientific field required. Experience Intermediate level of relevant work experience (4 plus years) required. Experience across organizations and global regions preferred. Knowledge of the function being worked in preferred.  + Understand the regulatory and industry requirements for On Board Diagnostics and Service Information Regulations + Work with regional Regulatory Affairs personnel and Technical Subject Matter Experts to interpret regulations; create/Update translated regulatory elements in Integrity & participate in design review meetings as needed to ensure diagnostic designs conform to OBD requirements + Lead/Participate in OBD regulation translation CCB; track and prioritize global and regional regulatory translation requests; and develop project schedule and resource plan for regulatory translations + Communicate project status updates to key stakeholders and support creation/maintenance of applicable training packages + Provide feedback to teams within PC&RA for continuous improvement opportunities At Cummins, we are an equal opportunity and affirmative action employer dedicated to diversity in the workplace. Our policy is to provide equal employment opportunities to all qualified persons without regard to race, gender, color, disability, national origin, age, religion, union affiliation, sexual orientation, veteran status, citizenship, gender identity and/or expression, or other status protected by law. Cummins validates right to work using E-Verify.  Cummins will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each new employee's Form I-9 to confirm work authorization. To learn more about E-Verify, including your rights and responsibilities, please visit www.dhs.gov/E-Verify . Ready to think beyond your desk? Apply for this opportunity and start your career with Cummins today. Not ready to apply but want to learn more? Join our Talent Community to get the inside track on great jobs and confidentially connect to our recruiting team: https://www.cumminstalentcommunity.com/profile/join/ Job ENVIRONMENT Primary Location United States-Indiana-Columbus-US, IN, Columbus, Commons Office Building Job Type Experienced - Exempt / Office Recruitment Job Type Exempt - Experienced Job Posting Feb 19, 2021, 12:39:55 PM Unposting Date OngoingReq ID: 210000L0"}