{"title":"Strategy, Risk, and Compliance Analyst","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIdyKhKGMTWvqRshhhQxM_ODH886HvUCLpmRcE5Q59kTr85rGYuP0LBT2yy3EWeowOJAVVeCYWtT9yiuC43aPwJKkOE8J_nc5wkfN_6vQ8cSdBY9SdI5Tn-RlALRQYijsG1kWsK_TX-D1B-WBegTMbKXcp_ueu0YllX-HZ8j-mltbee0y0RzgWwNgd-bIc","source":"ziprecruiter","full_description":"Strategy, Risk, & Compliance AnalystRole Summary:The Strategy, Risk, & Compliance (SRC) Analyst will be a crucial member of our Kudelski Security Services business, assisting in delivering services to our clients under the direction of the SRC Practice Leader. The potential candidate will work both individually and part of a team to support client engagements, including security program assessments, build out of security program capabilities (such as risk management, vendor risk, and data security), administration of GRC tools, and support of outsourced security capabilities (such as vendor risk management and compliance as-as-service).Working directly with customers, and as part of the overall service delivery team, to understand their strategic initiatives and the challenges that come in protecting IT systems, the Analyst will assess and assist customers in the establishment of security programs using commonly adopted frameworks such as ISO, NIST, COBIT, and Kudelski Security frameworks (if necessary). The Analyst will also serve as the primary administrator for a suite of GRC tools, including Kudelski Security Blueprint, Allgress GRC, Prevalent TPRM, and ProcessBolt Vendor Risk platforms. The Analyst will also support the Data Security practice in the delivery of data security projects, including implementation of data classification, data management, and data leak prevention capabilities. Role Description: Administer GRC tools utilized by Kudelski Security in the delivery of security services to customers. Includes onboarding new customers and users, building workflows, designing reports and dashboards, and overall tool administration. Deliver strategy, risk and compliance and data security projects under the direction of the Practice Leader or delivery team lead. This includes:o Participate in client meetings, conduct interviews, and prepare meeting notes.o Perform analysis of data and documentation provided by customers.o Conduct any required research using knowledge resources, Internet, and internal sources.o Prepare client deliverables including reports and presentations utilizing Kudelski Security templates and methodologies.o Load data and information into supporting GRC platforms and configure for use by clients.o Deliver training and documentation for client users of GRC platforms. Identify opportunities during client delivery to deliver additional services to customers. Assist in the development of proposals and Statement of Works (SOW) to deliver SRC projects and marketing collateral as directed by the Practice Leader. Role Skill / Experience Requirements: 5+ years of relevant professional work experience 3+ years of experience working in a Cybersecurity role Prior Cybersecurity consulting experience preferred Prior experience in administering GRC platforms Knowledge of industry leading security frameworks such as NIST, ISO, and COBIT and regulatory requirements such as GDPR, CCPA, HIPAA, and NERC-CIP.  Bachelors Degree in a relevant field or equivalent experience  Willingness to travel up to 75% (the U.S. only) and live in a major US city with access to a major airport Speak and understand English fluently Preferred Skills / Experience Requirements:  Big 4 / Top Tier Management Consulting experience Administration experience with GRC tools (e.g. Archer, Allgress, OpenPages) Knowledge of DLP tools (e.g., Forcepoint, Netskope, Proofpoint, Microsoft) Bachelors Degree in a related field or equivalent experience Certified Information Systems Security Professional (CISSP) or similar technical cybersecurity certifications Located in Phoenix, AZ; Dallas, TX, Minneapolis, MN; Atlanta, GA"}