{"title":"Installation Project Manager","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKoJ3pv50RMmLj6QBCgqsc2-S7Ioxw6hhqhcM0SGOIt6BbCssAUL-5ARpTR6xRxJ7Oo6qjLx4PWPDWebWbOj_QMzg7Ae42Lid5T6XFD_1olA_Zt9fWyY7ksAayb1lz2UBqSS0fKVUNr9GdyIeOF-5j4H27lFV0TeInVu1_d-YadfFkK77oezkRTXzQJoeok","source":"ziprecruiter","full_description":"Responsible for providing support to Director of Metering Services, Director of Field Operations and Field Technicians. This includes project tracking, purchasing, scheduling, job cost and billing for installations. Skills & RequirementsHigh School degree or equivalent2-5 years Construction Industry Project Management a plusAccounting backgroundDiverse communication backgroundDutiesPercentage of TimeInstallationProject trackingReceive new project contracts from SalesForce.Set up and maintain project files. Maintain project status in SalesForce. Communicate with project personnel to verify and maintain material needs and project scheduling requirements. Communicate production needs with field personnel and travel needs with scheduling coordinator. Maintain production expectations. Prepare and track change orders as needed.Obtain unit list for project for use when programming central equipment. Prepare project specific documentation (i.e. – PSR, Pre-Const. Meeting Packet, etc)Upon completion of project, audit installation, finalize Project Summary Report, email it to the appropriate personnel and save to project files.Currently - 65%PurchasingDetermine material needs for installation projects based on project requirements. Create PO to order equipment or prepare to ship from office inventory when needed.Update projects in SalesForce with material ordering/shipping/tracking information.Maintain log/shipping paperwork for inventory usage per project.Currently - 10%Job CostInvoices –make sure all costs are coded properly, obtain approval from appropriate manager, and turn in to accounting for payment. Get required approvals for all department costs.Currently – 5%BillingPrepare AIA or project specific billing documents for all projects. Provide billing documents to Manager for entry into UBS. Upon return of billing documents, scan, upload to files and Salesforce, mail originals or email to appropriate party.Lien Releases – Research payment and invoicing history prior to executing Lien Release. Scan and save to project file, email or mail to appropriate party.Payments – Assist accounting with coding payments to appropriate projects.Currently – 15%MiscellaneousParticipate in all Service/Installations meetings.Currently - 5%"}