{"title":"Technical Delivery Manager/Project Manager NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAK28a8j3RFu_NV0mEOf0H5YmE-RnFmo9ByW99h3KYZTaO84wqqNTo1MNbub4iXsKbraioX6jaezgNsmizq2bneErL7aJIzRciXXjCrKsSbuEaBKpAkpeAe-zPTgzz0wZ5ni-jqZTgpOOtQuWZM21BUcb8NHyV1MTCB1jBeG04MYMq4WMFgkFWNQpMGtuTlo","source":"ziprecruiter","full_description":"BCforward is seeking a highly motivated Technical Delivery Manager/PM for the location Charlotte NCHello Hope you are doing good!!Please shae resumesto anil.kumar@bcforward.com or You can reach me @ 317-315-8912Role :Technical Delivery Manager/PMLocation : Charlotte NCDuration :12+MonthsJDResponsible for driving tech delivery and overall solutions, tech changes, etc., that support business priorities and objectives. Ensure the optimization and the flow of stories, bugs/sub-bugs, epics, deliverables, etc., and the value delivered by one or more execution teams, and scrum teams (if applicable). Key responsibilities include coordinating and facilitating train/team ceremonies and execution routines, helping to identify and manage dependencies for the team, providing visibility into team delivery plans and progress, enabling continuous improvement within the team, and driving the work efforts to finalization, ensuring on time delivery. This role ensures that impediments are resolved quickly for the overall release train and assigned execution team, the team follows enterprise standards and processes, and that there is a good relationship between the Product Owner and the team as a whole. Facilitates various release/execution team routines, to include, but not limited to? i.e. iteration Planning, Daily standups, Backlog Refinement, showcases, demos/Reviews, and team retrospectives.This also includes flexibility to transition to Scaled Agile, if required, and facilitate scaled planning for the team - e.g. Pre Planning/ Preparation, PI Planning Events - and represent the team in Scrum of Scrums/ART Syncs. Helps the team define norms/agreements, like a Definition of Ready and Definition of Done, and enforces the agreements. Ensures the team has a healthy product and backlog (in collaboration with the PO). Well versed in project delivery for technology projects and can act as a Delivery Coach, Agile Coach, etc., including promoting and coaching a mindset of improvement based on principles, empowering the team to become self-managing and fulfill their cross-functional potential. Expected to also be an individual contributor to one or more teams. Responsibilities: Owns and guides multiple execution teams of a portfolio of technology-driven initiatives supporting multiple lines of business units/LOBs Responsible for facilitating all team level ceremonies and routines including daily meetings, Backlog Refinement, Demos/Reviews, and Retrospectives Responsible for representing teams in team connects similar to Scrum of Scrums/ART Syncs for AgileResponsible for meeting all enterprise permit requirements and materiality assessments, where applicable. Owns and manages multiple initiatives at the enterprise level working with multiple non agile PMOs in supporting permit needs Required Skills: Ability to serve as SME/Coach for team members that may be new to iterating; expertise with coaching one or more teams on Scrum practices, and developing own understanding of delivery and Agile delivery principles. Well versed with facilitating technical project routines and Scrum ceremonies i.e. release planning and execution, Daily meetings, Backlog Refinement, Demos/Reviews, and Retrospectives. If in a Scaled Agile model, the delivery lead must be able to conduct scaled planning for the team-e.g. Pre Planning/ Preparation, Release/PI Planning Events -and represent the team in Scrum of Scrums/ART Syncs. Seasoned professional that has the experience to help the team norms/agreements, like a Definition of Ready and Definition of Done and enforces the agreements.Ensures the team has a healthy product and backlog (in collaboration with the PO). Facilitates dependency management/risk management/impediment removal for the team. for AgilePromotes/facilitates communication and collaboration within the team to support value delivery and iteration Well versed with facilitating technical project routines and Scrum ceremonies i.e. release planning and execution, Daily meetings commitments.Provides visibility into the teams delivery plans and progress against plan to stakeholders. Enables the team t The Scrum Master facilitates the Agile methodology and activities, manages, leads and directs the work efforts of resources that are functionally aligned as part of the project team.The Scrum Master is responsible for the end-to-end integration of various work streams in order to deliver the intended project solution, the position specific responsibilities include:Manage Project ScopeLeads the daily SCRUM meetings of the Agile project team and partners with the product owner to lead the teamRemoves impediments to the ability of the team to deliver and is keenly focused on the activities and progress of the Agile project teamTimeline and Budget/Expenses; Obtain and align resources to key project roles; establish clearly defined responsibilities and accountabilitiesOversight/Manage/Lead project execution, integration and implementationRisk Management and Mitigation PlanningReadiness/Change Adoption/Stakeholder ManagementQuality Assurance, ensure that all applicable change requirements are satisfied; Acts as the primary point of contact and integration for the projectAbout BCforward:BCforward began as an IT business solutions and staffing firm. Founded in 1998, BCforward has grown with our customers’ needs into a full-service personnel solution’s organization. Headquartered in Indianapolis, Indiana, BCforward also operates numerous delivery centers across North America and India. We are currently the largest consulting firm and largest MBE certified firm in Indiana. Our uninterrupted growth has allowed BCforward to deliver uniquely configured IT staffing and project solutions for over years of catering to our customers’ specific needs. BCforward currently maintains a team of over 5000 global resources. With our additional brand, Stafforward, together we have the capabilities to deliver services for a variety of industries in both public and private sectors which allows us to address your most challenging needs. www.BCforward.com"}