{"title":"Scientist, Analytical Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL8xzRbwT5oWSpH28l32XIioKBLnDh-ZHLPeu64UBvvtsKH-yUk5vQM9VgmvudOr1TSpm2406VI1dD0sVNW77MWVh2av9TkHa0Yx76PQVaoZF1PNMrgUXX8b7eA4I6VSGDIoLU4HJXg9yB_j75eH71MdO0KtkhObWDkuTt7pMbBAxfnn2kBg3zCq3mwG7hx","source":"ziprecruiter","full_description":"External Job Posting Title:: Scientist, Analytical Chemistry Job Summary and Essential Functions:: Regeneron Pharmaceutical's Analytical Chemistry Group, located at Tarrytown, NY is seeking a highly motivated, innovative and collaborative Scientist to join our group. In this role, you will work with LC-MS technologies to guide and support development and characterization of therapeutic protein drug candidates. You will utilize expertise and working knowledge of various LC-MS platforms and applications to solve analytical problems. The ideal candidate will have a background in biological mass spectrometry, strong critical thinking, passion for science, good interpersonal skills and communication an ability to work effectively in cross-functional teams to achieve program goals.A Typical Day in the Role May Look Like: Design, execute, organize and effectively communicate physicochemical characterization of biotherapeutics, including monoclonal antibodies, bispecifics, and other modalities to support drug development. Lead and deliver on characterization activities to elucidate and determine product quality attributes, risk assessment and control strategies, including PTMs, Sequence Variants, and product and process related impurities i.e. charge variants, size variants, etc., to address emerging challenges. Provide in a collaborative manner analytical guidance and support for formulation development, upstream and downstream functional groups, manufacturing to solve real-time development issues in the process development and OOT/OOS investigations. Proactively identify and drive technical innovations that will contribute to future developmental needs, improvements in group efficiency gain. Present work at internal and external meetings; prepares and reviews development reports, memos, and regulatory submission documents in CMC (e.g., IND, IMPD, BLA, MAA, comparability and other study reports.) and peer-reviewed articles for publications. Serve as a team representative and provides the knowledge and expertise of analytics to cross-functional teams.This Job May Be For You If:You are results-drivenYou have an excellent problem-solving mindsetYou thrive in a creative, flexible team environmentYou are highly self motivated, with the ability to own, organize and manage multiple projects in a timely mannerThis role requires a PhD in analytical chemistry, or closely related field with 0-4 years of industry experience, and proven track record of publications in the field of biological mass spectrometry a plus. Strong expertise and working experience (including maintenance and troubleshooting) in mass spectrometry, chromatographic separations, biophysical characterization, equipment platforms (e.g. Thermo, Waters, Sciex, and Agilent, etc.) and data processing software (e.g. Empower, MassLynx, Protein Metrics, Xcalibur, etc) are desired. The ability to be thorough, diligent, and highly organized with strong time-management skills is preferred.  A strong collaborator with cross-functional teams and external partners is desired. Excellent written and verbal communication skills are highly preferred.Does this sound like you? Apply now to take your first steps toward living the Regeneron Way! We have an inclusive and diverse culture that provides amazing benefits including health and wellness programs, fitness centers and stock for employees at all levels!Regeneron is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion or belief (or lack thereof), sex, nationality, national or ethnic origin, civil status, age, citizenship status, membership of the Traveler community, sexual orientation, disability, genetic information, familial status, marital or registered civil partnership status, pregnancy or maternity status, gender identity, gender reassignment, military or veteran status, or any other protected characteristic in accordance with applicable laws and regulations. We will ensure that individuals with disabilities are provided reasonable accommodations to participate in the job application process. Please contact us to discuss any accommodations you think you may need.  Auto req ID: 23747BR Person Type:: Regular Posting Location: United States-NY-Tarrytown Job Category: R&D Sub-Category: Development Science Grade: 12.Metro NY.A"}