{"title":"Senior Front- End Software Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKLITy4qVCk6C3XiN0ak2nGUKTA1wtyD-9g0ckao5yti8yRURayYoqtkvQV05Q_Nfe5qUMp-fxKSPccRrj6PntL9Iv5oXxwhpuSdcZzYRZtrMSGoI8PQlyKrAtSsAMf3vJrPGAjv4OZGD5TR5rCeTEVmNJ-XJXAFdj7h_4vOLQIq77iW2G_AHfcJmqnFqi4","source":"ziprecruiter","full_description":"At Bypass (now Fiserv), we are revolutionizing the way WE experience food. Have a favorite sports team? Stop to get coffee in the morning? Love frozen yogurt? You may have used our products and software and didn't know it! Ready to help us revolutionize commerce? Come join us!**What does an exceptional Senior Front-End Developer do?**As **a** Senior Front End Engineer, you will be a part of small but growing team of hardworking people responsible for creating and maintaining a suite of cutting edge back-of-house web applications, point-of-sale APIs, and Android client applications in a fast-paced results-oriented environment. An exceptional Senior Front-End Engineer merges wisdom in the field of Front-End development with a teaching mindset and an understanding of the constraints and needs of the business to elevate the quality of the output of the entire team over time. They lead by example, prioritize quality, and help define the long-term architecture for the full suite of web applications.**As a Senior Front-End Developer, you can look forward to:**+ Installing, configuring, customizing, upgrading, supporting and troubleshooting all technical issues related to on premise and hosted environments for both desktop and mobile platforms. + Working directly with clients to understand business needs, define requirements, quote projects + Building, testing, implementing and launching solutions as proposed. + Working directly with third party vendors to define technical requirements and customize, configure and implement solutions to interface with various external systems. + Hands on developing and resolving of all technical issues within an on premise and hosted client environment. + Working with senior management to define and implement technical processes and procedures within department focusing on client satisfaction and efficiency. + Collaborating with Product Development, UX Designers, and QA to build quality products; including resolving complex technical issues related to projects. + Communicating within your functional team and across Engineering to keep information flowing + Reviewing peer code, designs, and providing mentorship. + Writing tests and automation to advance maturity in product testing + Being highly motivated \"self-starter\" who is passionate about web development and is anxious to learn from other high-level web developers. + Being a team player, ability to collaborate idea sharing in strong product setting. + Developing front end browser applications in Angular and Vue.js + Following Agile SDLC, participating in planning and Scrumban boards. _The above statements are intended only to describe the general nature of the job and should not be construed as an all-inclusive list of position responsibilities._ **Basic Qualifications:**+ Bachelors degree required. + 8+ years of web development using Javascript based development (Angular, React, JQuery) + 5+ years of experience with modern web UI technologies (HTML5, CSS3) + Strong understanding of asynchronous request handling, and partial page updates. + Experience in Javascript single page application front end development and/or architecture experience. + Advanced understanding of functional/prototype-based programming principles + Experienced in the day-to-day practicalities of Software Development Lifecycles such as Scrum. + Extensive experience expanding and maintaining large data sets. + Experience with CI/CD pipeline, e.g. webpack **Preferred Qualifications:**+ Frontend Javascript experience and understanding in web services, e-Commerce Platforms, and high-volume transactional systems. + Advanced understanding of Angular or React or Vue.js frameworks. + Complex API interactions from single page application frontend. + Streamlining frontend build pipelines. + Experience working and building front ends in Typescript. + Knowledge of popular JS frameworks and libraries (React, React Native, etc.). + Understand core JavaScript concepts like scope/closures, the event loop and asynchronous callbacks. + Experience working with e-commerce, shopping cart, or payment service gateways. + Experience with microservice based architectures. + Experience with AngularJS and Angular4 and/or 5. **Learn more about Fiserv:** To support the total well-being of our associates, Fiserv takes a broad approach to our benefits. We offer a comprehensive benefits package that provides flexibility and affordability with a variety of medical, dental, vision, life insurance and disability options.We are #FISVProud of our benefits and well-being programs. Our commitment to wellness, wellness education, preventive services and fitness activities are designed to meet you where you are.We're Fiserv, a global leader in Fintech and payments enabling innovative financial services experiences that are in step with the way people live and work today. The company's approximately 44,000 associates proudly serve clients in more than 100 countries, so their customers, members and consumers can move money when and where they need it, at the point of thought.We welcome and encourage diversity in our workforce. Fiserv is an Equal Opportunity Employer (Minorities/Females/Vets/Disabled/LGBTQ+) **Explore the possibilities of a career with Fiserv and Find Your Forward with us.**"}