{"title":"Junior Chemist - Research & Development","location":"","salary":"","description":"","term":"$40,000 to $45,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIS10b8eTcEp42-ghon50Ij0O_QjUg2Mc6Q2ONkMWU_o5RVtgrCnyA-_HZhFd-duiQat8-nBJqfCZhXpgO3hjzgikxBLm-Nnf7_AVfw27AEyk0vhwto3Yb973MIFiAb-uSDkDPfNPxSYns-ILGcCEX5_JUXIO3qTa4H18eMnufO_gnjwNQf0Bp_OxIb0S6w","source":"ziprecruiter","full_description":"Position:  Junior Chemist  Department:  Research & Development Lab  Reporting Structure: Reports to Technical Director, Research & Development  Reporting to this position: No direct reports Comprehensive benefits package available: (yearly bonus, healthcare, vision, dental and life insurances; 401k plan; paid vacation, sick days, holidays, and other perks!) BASIC FUNCTION Prepare laboratory batches of personal care, hair care and skin care products as per issued formulations and product specifications from Formulating Team.    RESPONSIBILITIES Prepare submission bench batches for client approvals based on prescribed formulations and product specifications. Compile and analyze test information to make improvements as needed to reach desired results. Operate specialized lab equipment and become familiar with all aspects of technical testing and evaluation based on results. Confer with formulators and provide recommendations to improve or customize formulas, processes or analytical methods. Ensure stability, and efficacy according to project requirements. Issue product specifications as required and maintain relevant data throughout each product’s development. Maintain accurate real time entries on lab notebooks to ensure accuracy and completeness and associated electronic data bases. Analyze information and evaluate results to choose/recommend the best solution for solving problems. Maintain adherence to cGMP’s (current Good Manufacturing Procedures), GLP’s (Good Laboratory Procedures), and SOP’s (Standard Operating Procedures) for the personal care industry. Perform other related duties as assigned.    SKILLS & ABILITIES Strong knowledge of chemistry and chemical interactions for personal care, hair care and skin care products. Strong mathematical aptitude.Professional written and oral communication skills. Computer literate in Excel, Microsoft Word, and Microsoft Outlook. Attention to detail and analytical thinking, ability to apply general concepts to specific problems to produce positive results. Must be familiar with laboratory equipment used in the process of creating bench batches. Has basic working knowledge and understanding of commonly used concepts, practices and procedures within the field. Exercises independent judgment and discretion in matters of significance with relation to matters of importance within the Research & Development company sector.    PHYSICAL DEMANDS: While performing duties of job, employee is occasionally required to stand (for extended periods), stoop, bend, walk and use hands to handle objects, tools and controls, reach with hands and arms; talk and hear .Employee will be required to handle chemicals and solvents as required during course of job execution. Employee may be required to move or lift objects up to 10 lbs.      EDUCATION / TRAINING Bachelor of Science or higher in Chemistry and/or a combination of vocational training, education and experience that is equivalent to the employment standards listed above and provides the required knowledge and skills. Five (5) to eight (8) years’ experience in the personal care, hair care and skin care industry. A minimum of four (4) years in a Research and Development Junior Chemist or Chemist role."}