{"title":"Technical Writer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJLJk52zGA4t4OIJ8osRfWpBe7iDL8kWzJLKH7VM8TaP1LP9ZcXDZg2gLIwEKKvSIUytT2D-GRbkg8BsS-r30cyqWXMW9N7rZsda-VtvncBueas7ozLofA5KLE8HatA4GURaYIjBWRyZITM9KafD57cU9GQw_lfOJ8bUd_0NxcLrSi9xww4dDOsXnNa_pJw","source":"ziprecruiter","full_description":"Overview Knowledge Services is actively seeking a Technical Writer for a contract role with the State of IN's Dept of Revenue in Indianapolis, IN. This contract will last through December 2021 and may be extended. This person will work primarily remotely but local candidates are preferred so that this person can come onsite from time to time. Responsibilities As a Technical Writer, you will be partnering with business subject matter experts to transform complex and sparsely documented operational procedures and expectations into clear and effective documentation for on-the-job reference. This includes integrating the core tax knowledge that drives our processes with the technical steps required to complete the business tasks. The Technical writer and a training professional will work together to create a documentation framework that meets business needs and can be maintained by the business on an ongoing basis. Qualifications The Technical Writer/ Business Documentation specialist should have the following qualifications:Ability to synthesize complex, interconnected concepts and articulate them clearly in writingAbility to organize information in a logical, searchable wayAbility to consult with business SMEs to understand needs and challenges, gather information, and build a framework that they can ultimately maintain; Strong listening and analytical skills required, plus a proven ability to apply creative solutions to identified needsAdvanced knowledge of Microsoft 365 applications and ability to integrate them effectivelyExperience with process-focused financial or legal writing an asset INDITISDKM  We can recommend jobs specifically for you! Click here to get started."}