{"title":"Embedded Hardware Engineer Job","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK_cYnFX89Z8QqvhHRTxO3BV4HesDQBmWxTxVoNmFpbctDTvTZzCoZhVhf1xwnG22uYtRzOboyI9KCbdgGRLO6R98YVW2ChEmw_irBuUHJqTcvOJY1-mIhPcmq3OvFoF9KY96UvqAp9Xj0Fk8jXNywFi2y8Fw33-WwYK-Lalbh-faEMBbUW5Jm3bNzFR3AU","source":"ziprecruiter","full_description":"Embedded Hardware Engineer Job  Apply now Date: Feb 5, 2021 Location: Kirkland, WA, US  #job-location.job-location-inline {display: inline;} Company:  PACCAR Requisition Summary The Electronics Hardware Engineer is responsible for the electrical and electronic component and subsystem design, andelectrical integration into heavy duty vehicles. Job Functions / Responsibilities  Design and release of electrical and electronic components and systems for heavy commercial truck. Integrate vehicle and drive line controls into vehicle electrical systems. Complete engineering change notice documentation to manage old and new parts and use proprietarysoftware to issue part bid requests. Lead electronics engineering and project management processes to maintain schedule, budget, and functionality. Plan and track validation of components. Support launch at truck assembly plants as needed, and resolve field issues as identified. Ensure industry leading quality and reliability is met/maintained/exceeded on all components. Work as part of a multi-disciplinary team with mechanical engineers, manufacturing engineers and otherprofessionals to ensure quality heavy duty truck electrical designs. Investigate and resolve warranty issues for power train electrical related claims. Up to 15% travel. Qualifications & Skills  BSEE or equivalent degree required. Ability to work in a fast-paced, lean, collaborative team environment. Excellent communication and interpersonal skills. Good planning/tracking skills. Competency with standard business software tools (word processing, spreadsheets, etc.). Able to learn and use new processes and techniques and resourcefully solve complex technical issues. Commitment to reliability, value, and quality in all aspects of work; desire to join the World's Best team. Willingness to grow continuously, both personally and professionally and a strong results orientation. Desired Skills/Attributes  3 - 5 years design & release of automotive or commercial vehicle electrical components, includingsoftware, wire harnesses, electronic controls, switches, driver input devices, and/or HMI. Proficiency using Engineering tools (Pro-Engineer, Mentor Graphics, Matlab/Simulink, Rhapsody). SAE J1939 CAN Protocol ISO 17987 LIN Protocol Awareness of heavy duty commercial truck regulations, especially affecting instrumentation, emissions,safety, On Board Diagnostics, and other areas impacting electrical/electronic design, architecture, andfunctionality Experience with supplier management through AlAG processes Knowledge of DFSS tools including FMEA, QFD, etc.Specific experience or expertise in one or more of: Automotive embedded electronic component D&R Embedded real-time systems design and implementation MS in appropriate technical field (CS or EE preferred) and/or Professional Engineering license.Nearest Major Market: Seattle Nearest Secondary Market: Bellevue Job Segment:  Embedded, Informatics, Manufacturing Engineer, Engineer, Electronics Engineer, Technology, Engineering  Apply now"}