{"title":"Medical Technologist - Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKcda-nBeOGMJbt23qn34zc-zTbBk1eJxKIEqUusWu6xLSlv6ixxNvCDyPgo0HcSuRwCO1y6KT2ZnbXTGRuGRVpoxRkd1Ja2Q1esPUWoT96obDJ2z7pWDSq8FxQha331uXzuxw4m6m1g6P1Hjw1QvCzlEF7Vq7rBtrcKMFGs6Jvy5A_Udh3wyAWBF4ufHZC","source":"ziprecruiter","full_description":"Join our award-winning team at UW Medicine - Northwest Hospital & Medical Center. We're proud of the acclaim we've received for our excellence in patient care and safety. Among the local, regional and national recognition we've received are: + The Distinguished Hospital for Clinical Excellence Award+ The Emergency Medicine Excellence Award+ This is the second consecutive year Northwest Hospital has achieved both the Spine Surgery Excellence Award and a ranking among the top 10 percent in the nation for spine surgery.+ The Stroke Care Excellence Award+ Winner of the Health Grades Distinguished Hospital Award for Patient Safety for the last three years in a row, we're also one of the safest places to get care - among the top 5% in the country. UW Medicine includes Harborview Medical Center, UW Medical Center, Northwest Hospital & Medical Center, Valley Medical Center, UW Neighborhood Clinics, UW Physicians, UW School of Medicine and Airlift Northwest. Northwest Hospital & Medical Center is a full-service, non-profit community hospital, offering comprehensive medical, surgical and therapeutic services. With 281 beds, more than 1900 employees and a world-class medical staff, we provide innovative, technologically advanced care on a patient-friendly, easy-access campus just north of Seattle. Our staff not only enjoys outstanding benefits and professional growth opportunities, but also an environment noted for diversity, community involvement, intellectual excitement, artistic pursuits, and natural beauty. As a UW Medicine - Northwest Hospital & Medical Center employee, you will enjoy generous benefits and work/life programs. We're interested in learning more about you and appreciate your taking the time to apply online. UW Medicine - Northwest Hospital & Medical Center is committed to employing a diverse workforce. EOE UW Medicine - Northwest Hospital and Medical Center is an Affirmative Action/Equal Opportunity Employer. We welcome job applications from qualified individuals without regard to race, color, creed, religion, ancestry, national origin, age, sex, pregnancy, marital status, physical or mental disability, or any other protected characteristic. Minorities, women, disabled persons, and veterans are encouraged to apply Testing, includes but is not limited to: + Performs routine and complex technical procedures on biological specimens. + Performs tests accurately, promptly, and efficiently. Follows lab polices and procedures. Maintains cost-effective levels of supplies and reagents.+ Uses computer systems (LIS, network, etc) effectively. Enters results of the analyses into the computer for storage and reporting.+ Operates, calibrates, cleans, and maintains equipment used in testing.+ Follows safety procedures.+ Recognizes and, if so assigned, corrects errors. Documents corrective action.+ Works independently and uses independent judgment, under general direction by the supervisor. + Demonstrates knowledge of expected values, disease states, physiological conditions, interfering substances, specimen quality problems, and interdependency of tests. Uses this knowledge to interpret and confirm results, and to identify and resolve problems. + As assigned, may check and approve the work of other technologists, technicians or lab assistants. Quality Control,includes but is not limited to:+ Utilizes quality control criteria to ensure validity before reports are issued. + Performs all quality procedures as required, such as proficiency testing, temperature control, reagent control, equipment calibrations and function verification tests. Dates and initials controls, calibrators, reagents and test kits when opened, put in use, or reconstituted.+ Completes appropriate QC documentation and records necessary for CAP and Joint Commission accreditation and CLIA licensure. + May assist laboratory management in preparation for inspections.+ As assigned, may assist with establishing and monitoring quality control programs. Identifies questionable data and notifies supervisor immediately. Problem-solving & troubleshooting,includes but is not limited to: + Proficiently remedies basic, intermediate, and complex instrument and procedural problems. + Assists other MTs, technicians and lab assistants with problem-solving.+ Identifies causes of problems (technical and procedural as well as physiological), evaluates alternatives and determines solutions; if so assigned, implements identified solutions.+ Recognizes uncorrectable problems and contacts equipment vendor and supervisor in a timely manner. Research & Development,includes but is not limited to: + Develops new procedures; evaluates and modifies existing procedures. + Collects and analyzes data; performs statistical analysis. Phlebotomy,includes but is not limited to: + If so assigned, performs phlebotomy and/or arterial punctures. Training and leadership,includes but is not limited to: + Trains new employees (demonstrates bench techniques for routine and complex procedures).+ Assists with training students completing their formal clinical internships. This includes delivering theoretical information as well as bench techniques. May assist with developing and evaluating the teaching/learning program. + If so assigned, directs the work of lab assistants and technicians, acts as a resource, and provides input to the supervisor on staff performance. AH123Education Background + Baccalaureate degree in medical technology; or+ Baccalaureate degree in science plus completion of an accredited or approved school of medical technology (for example, accredited by CAHEA); or+ At the discretion of the Lab Director, alternative routes that combine education, training and experience may be considered, if the combination satisfies requirements as \"testing personnel\" (as applicable to the individual's job responsibilities) under State of Washington and Federal regulations and, if in the Director's opinion, the combination is the equivalent of a bachelor-degreed MT. Licensure, Registration, Certification + Current technologist-level certification with CLIA -recognized accrediting agency (examples: MT-ASCP, CLS-NCA, or equivalent); or+ Satisfies requirements as \"testing personnel\" (as applicable to the individual's job responsibilities) under State of Washington and Federal regulations. Work Experience + Requirements vary depending on the position available and the educational background of the applicant:+ Route 1: Medical Technologists with BSMT or relevant science degree and internship: No prior experience required.+ Route 2: Medical Technologists without bachelor degrees: A combination of education and experience, which, in the Director's opinion, satisfies requirements of \"testing personnel\" under State and Federal regulations, and which is the equivalent of a bachelor-degreed MT. Special Training/Skills + Excellent communication and customer service skills required. + Computer experience required. + Able to demonstrate the knowledge and skills necessary to provide care appropriate to the age and condition of the patients served on assigned unit/department. Physical Abilities Physical Demand Level: Sedentary In an 8-hour workday, must be able to-Lift / Carry20 to 50 pounds occasionally10 to 25 pounds frequentlyup to 10 pounds constantly As required, must be able to- Sit, Stand, Walk, Bend, Squat, Kneel, Crawl, Climb and Reach above shoulders Push and Pull Perform fine motor functions Must possess functional vision, hearing, and speech in order to communicate effectively with clients, client advocates, and staff. AH123 AHSL ID: 2019-9962 Department: 7073 Lab: Chemistry FTE: 1.00 Shift: 1st, Days New Grads?: Yes External Company URL: http://nwhsea.org/ Street: 1550 N 115th St"}