{"title":"Technical Writing Intern NEW!","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AALoRB-iB0qal9XZz60sip-UGyT82glZmX18pgd0Bq4SOK9B3yiM3RrqbORmbTzwLU6nRZJHDZ2B9h-DRK4oQa7fGXUk9V8nj0D_Df0Np5NtqO3Qk_NLhmBUf5LMaWNl847wAeZTQ7193FkdiJVTM4ub00ryHIqIsgTKh965B53OQ9zsRUBm-ePBT-i1aTcs","source":"ziprecruiter","full_description":"Responsible for contributing to the creation, editing, and maintenance of technical documentation such as installation, owner's, and service manuals; and product specification documents.ESSENTIAL DUTIES AND RESPONSIBILITIES Analyze and determine the user needs of technical documentation. Research technical input from product managers, engineers, and marketing services. Perform hands-on product testing as required to validate data and procedures. Partner with technical staff to distill complex data into user-friendly communication mediums. Organize and write supporting documents for products. Work with internal teams to define and develop photographs, drawings, diagrams, animation, and charts to increase installer and user understanding of product application, installation, and maintenance. Standardize and organize content included in technical documents. Gather usability feedback from customers, installers, and end-users. Revise documents as new product issues arise. Maintain and control new and existing documents within corporate content management system (CMS). Assist internal customers by updating tests and presentations. Perform other related duties as required or assigned.Skills and Abilities Employs strong grammatical and concise language skills to produce effective, easy-to-use content. Works with electrical, mechanical, and/or physics concepts in order to create simplified, process-based explanations for users.  Reads and understands documents such as engineering specifications, flowcharts, wiring diagrams, and procedures. Establishes mutually beneficial relationships with subject matter experts to gather and develop information. Effectively communicates information and responds to questions in person-to-person and small group situations with vendors, internal and external customers, and other employees of the organization. Solves practical problems and deals with a variety of known and unknown variables in situations where only limited standardization exists.  Works in a team environment using modern structured authoring and modular development principles. Comfortable multi-tasking and supporting several projects simultaneously.Education and Experience Working towards a Bachelor's degree in technology, technical writing, English composition, journalism, or a related field."}