{"title":"Automation Controls Engineer (Experienced) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIHhxkH5bLFnw2AOIY20NHVwh-_4awzSBSSHCa8kiNerNUVPSMwovdp9yIBqAUpCqpscu32s3a3ZylFdwL5tP2LOU3P_D3R9EjYVPaQxxtVOm73JUM0ah1V7MJCMK46p2DzjLbx1PmGfwy_qUtOm_WpID8qFfylglxTFftkSs0LwFvg_PKD1oS0tvRXrROd","source":"ziprecruiter","full_description":"Are you the subject matter expert Controls Programmer? Are you a high-energy, out-of-the-box thinker experienced with designing, programming, and debugging Robotic Automation Systems? Do you like the challenge of analyzing a project concept, objectives, and specifications in order to produce performance standards that meet or exceed the application’s requirements? Do you possess a programming aptitude with knowledge and expertise in innovative solutions for production line applications such as material handling, machine tending, palletizing, parts sorting, pick and place, and die cast handling? Can you demonstrate PLC, HMI, and Robot programming expertise through proven techniques and approaches? Do you enjoy traveling to new cities and states and experiencing different work environments and meeting new individuals? If this sounds like you and you want to be part of a collaborative team of Controls and Mechanical Engineers that provide superior industrial robotic solutions, then apply today!Qualifications and Requirements:5+ years of engineering experience in design, development, programming, and troubleshooting of PLC, HMI, and Robot programs.Capable of analyzing customer requirements and checking project feasibility prior to creating design drawings, bill of materials, and project manuals. Projects may require troubleshooting of design and program issues and corresponding with other departments and customers from project commencement through completion. All these tasks must meet the project’s budget and due date requirements.Demonstrated experience with programming from scratch, editing, debugging, and troubleshooting PLC/HMI/Robot systems.Expertise in integration, editing, and debugging all software and hardware including vision, marking, part traceability, safety PLC, servo drives, fieldbus networks, etc.Design detailed control panels and schematics utilizing AutoCAD Electrical Software.Proficient in Microsoft Office software including Word, Excel, and Project.Experience with Mitsubishi, Omron, and Allen Bradley PLC platforms; Omron, Panel View, Wonderware, and RSView HMI platforms; and Fanuc robots are a plus.Travel to customer facilities following system installation for program modifications, start up, commissioning, and troubleshooting. Per customer policy, random drug/alcohol testing will be required. Travel requirement is approximately 50%-60% with overnight stays, weekend, and holiday work hours."}