{"title":"Mobile Engineer - iOS","location":"","salary":"","description":"","term":"$150,000 to $200,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJAfzSYMzv3YEm_x-uGcK4KyGTASDxDie-oo1t0ncSTog81YLV6W1PJ6R2njc895dd2kWWOvYJCLNO8-uRpPVqQY0mfk6aPNuLcDRNei2FyoJnD1DUQHgAqBNbYYPbTeJ8G3kOGVHAPuajuy6aZE4hDq1Q9SUwLwnVA2oDJAHrqSlkX9IvIBlbTEfOHo1b_","source":"ziprecruiter","full_description":"Mobile Engineer - iOS Job Title: Mobile iOS EngineerJob Location: Manhattan area of NYRequirements: Minimum 7+ years of Engineering experience working/building iOS applications.Based out of the Big Apple, we are a technology start-up that is revolutionizing the way people hear by providing more affordable and accessible hearing care! We just closed Series B funding and have had rapid growth year after year!Our growing Engineering team is looking to expand and bring on a Mobile Engineer who lives and breathes all iOS applications! We are doing a complete rebuild of our native application, so we are actively looking for someone who can help us build it from the ground up. The ideal candidate will be fluent with iOS application development and technically savvy with React Native, React, Kotlin, and Swift.If you have this experience, please apply immediately. We are actively interviewing this week and next for this high profile position.Top Reasons to Work with Us1. New tech-start up in the Big Apple!2. Experiencing rapid growth!3. Very competitive salary/comp plan with a strong Equity plan as well!What You Need for this Position- 7+ years of Mobile Engineering experience with iOS applications- Technically fluent with React Native, React, Kotlin, and Swift- Strong coding background- Experience building out mobile applications in iOS - Prior start-up experience strongly preferredWhat's In It for YouFor your hard work and dedication, you will be rewarded with a competitive base salary, and benefits including but not limited to:- Strong equity package- Dental- Vision- Vacation- Medical- LifeSo, if you are a Mobile Engineer with iOS experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}