{"title":"Hardware Engineer III NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKP6gbKQ3tgQRukIlTKAwqCcbEkcIWmuGqUpSioiAl6qZat88l7B0yZklWjC0JlDz1PZs3oJ87W4RoyvftmBqvrXPe_2y0m7_2euE2mln43PRPWKdcyhS34aG-9Nd8g68TetxmmOkTAKvsDRPh7uGuD5uT2aQahnioh2G_ZX-MhhFr4LjcVOzVvmoKgF7A","source":"ziprecruiter","full_description":"Varstaff is searching for the following:Hardware Engineer IIIJob DescriptionAs part of a small, passionate and accomplished team of experts, you will be responsible for the development and verification of avionics FPGA-based HDL solutions for New Glenn. You will share in the team’s impact on all aspects of avionics FPGA-based HDL design, coding, verification, and integration.To be successful in this role, you need to have previous experience with FPGA design and verification in a dynamic environment to produce spacecraft avionics hardware.  In this role you will take ownership for all phases of FPGA development flow (requirements definition, architecture, design, verification, synthesis, place & route, and timing closure, and release).  You must be able to effectively implement HDL design and verification blocks using Verilog / System Verilog.  You must be able to bring-up and validate circuit boards and FPGAs in lab and production environments.  You will also participate in design and architecture decisions for Circuit Card Assemblies (CCAs) and FPGA solution development.We are looking for someone to apply their technical expertise, leadership skills, and commitment to quality to positively impact safe human spaceflight. Passion for our mission and vision is required!Qualifications:Bachelor of Science in Electrical or Computer Engineering, or related discipline with a digital design focus5+ years demonstrated FPGA/HDL design/verification work experience in Verilog (or VHDL)Experience developing FPGA solutions for embedded systems, including software and hardware integrationSelf-motivated and independent, yet collaborative, individual contributor with strong interpersonal team skills; organizational and communication skillsAbility to earn trust, maintain positive and professional relationships, and contribute to a culture of inclusionMust be a U.S. citizen or national, U.S. permanent resident (current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylumDesired:Graduate degree in Electrical or Computer Engineering, or related discipline with a digital logic architecture and design focusExperience with Riviera-Pro, Modelsim, or Questasim simulators and Synopsys tools for design. vendors: Microchip, Xilinx, and/or AlteraExperience with advanced verification techniques: Assertion-Based Verification, Universal Verification Methodology, and/or Constrained Random VerificationFamiliarity with DO-178, DO-254 and/or other development assurance guidelinesFamiliarity with sensors and instrumentation including accelerometers, rate gyros, pressure, and temperature sensors.Programming and scripting skills: C / C++; TCL, Python; and MATLAB/Simulink.Exposure to fault-tolerant, high-reliability, safety-critical, robust, radiation-tolerant FPGA-based solution development for space-based avionics systems.Exposure to control and/or signal processing solutions implemented on FPGAs."}