{"title":"Maintenance Mechanic","location":"","salary":"","description":"","term":"$22 to $26 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKvueVsqEKpEnHTVxn6nleJ-ELE5lChqrgQH26DTIUZm4pWJgl4R1jt0IWRWfeAYyjeTmhqkh73dmG-tVEBBHsTttMWRf4WUeSGVX5iaJIdutqQVXWvxFehk5pW4LM1daIhbLdCOADNbSk4kkYR5ZV-sf7NOXEd6PwJGBXz09UR46SgNMVwyhz9RQ2Jj4QO","source":"ziprecruiter","full_description":"Position SummaryThe function of this job is to supply technical and maintenance support to the plant and equipment, ensuring that all equipment is maintained in good operating condition, serviced at regular intervals, and minimizing down time.Duties and Responsibilities · Service production equipment, lubricate as per maintenance schedules.· Repair equipment, processes, etc. as required.· Collect, store and maintain waste oils, greases, etc.· Assist in the disposal of waste.· Record and document all maintenance and repair records for all plant equipment.· Fabricate tools and fixtures as directed by Maintenance Manager.· Perform other miscellaneous duties as assigned.· Required to work on-call overtime during maintenance emergencies and maintenance shutdowns.· Perform preventative maintenance tasks on process and facility equipment to ensure efficient operation.ExperienceThree (3) years’ experience in manufacturing maintenance.Education and CertificationsHigh school diplomaCore CompetenciesSafety Centered, Customer Focused, Results Driven, Productively Engaged, and Team Oriented· Ensure that health and safety standards are followed within the Maintenance Department.· Ensure that Lock-out/Tag-out procedures are followed for equipment repairs and adjustments.· Ensure that all repairs are done in compliance with legislation (building, electrical, pressure vessels codes).· Conduct all jobs with an assigned maintenance employee· Dependable with good attendance.· Must have the ability to work productively with minimum supervision.· Good communication skills and the ability to interact with co-workers, customers, vendors and contractors.· Resourcefulness and self-motivating.Functional Competencies· Understanding of processes and materials.· Must be able to understand the operating principles of machines.· Possess mechanical skills and ability to conduct preventative maintenance on necessary equipment· Must have an understanding of 480V AC/DC voltage and AC/DC drives.Physical and Mental Demands· The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.· While performing the duties of this job, the employee is required to stand, walk, use hands to finger, handle or feel objects, tools or controls, reach with hands and arms and talk and hear. The employee is occasionally required to sit, stoop, kneel, crouch, or crawl and climb or balance.· The employee must regularly lift and/or move up to 10 pounds and occasionally lift and/or move up to 25 pounds.· Employ safe lifting techniques with each task, operating within the safety policy of anything greater than 25 pounds requires two people.· Specific vision abilities required by this job include close vision, depth perception and the ability to adjust focus."}