{"title":"Research Associate, Chemistry NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJbFXyH-7jKsavT51yTyPOMU4_DiAc-k8KG_VBqFCZlKnwJJzqY_i3hUS2lHRm3Pkwb3UBz4piGv_I5aECqfnUGn5Cu6aql9Gp_ciy-OjIT68Afox7uUHXKfBARvcy6vpV21VPUv0poWbDxSeM9g1u7Atn7MFfh5xyrLH-VJalEONa6dAAep5lO3ebfM-bs","source":"ziprecruiter","full_description":"Description Summary:  We are seeking an experienced synthetic organic chemist to participate in research projects involving the synthesis of high potency cytotoxic agents and the development of new linker technologies for antibody-drug conjugates (ADCs). This research will involve multi-step organic synthesis and will employ various purification and analytical techniques to enable structure determination and purity assessment. Activities may also include antibody conjugation, biochemical and/or cellular assays, and stability assessments.  Principal Responsibilities: Synthesis and characterization of novel drug-linkers to enable ADC technologies Ability to troubleshoot and optimize reaction sequences Ability to write-up experimental results and prepare presentations Collaborate within the chemistry group and multi-disciplinary project teams to present data and new ideas   Required Qualifications: A Bachelor's or Master's degree in chemistry or related field 2+ years of research experience in organic chemistry, including multi-step organic synthesis, in either an academic or industry setting  Experience with compound isolation and identification (flash chromatography, NMR, HPLC, MS, etc.) Familiarity with use of databases, various software for chemistry (SciFinder, Reaxys, etc.) and electronic notebooks a plus Ability to think critically, learn quickly and work independently Strong work ethic, interpersonal skills, enthusiastic, and team player  As the leading employer in our industry in the Pacific Northwest, Seagen is proud to offer a competitive total compensation package as well as a comprehensive benefits program designed to support the whole lives of our employees and their families. Benefits include medical, vision and dental coverage, group and supplemental life insurance, 401(k) with company match, tuition reimbursement, relocation assistance and much more. To learn more about Seagen, please visitwww.seagen.com. Seagen is an equal opportunity employer. All qualified applications will receive consideration for employment without regard to race, age, gender identity, sexual orientation, color, religion, sex, marital status, national origin, protected veteran status, disability status, or any other status protected by federal, state, or local law. #LI-CM1"}