{"title":"Android Engineer- Rider Verticals","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALasBXUOt623MXNpBuoRuIUP9gISKR3Qh4Hw9_F1V4PzA4dgF7zz1HfD6eB8muK6bTK-vLwJc15dUtdcQTN7-wHD864eik0wden1eqtDMH2KE60ep4I0UYACJ6TAuWzO3hC7-foqBmM7feWjPpaYN7O1LsuacTErAhD7AZKk9joS34VKw3VI1oBnrne4m8u","source":"ziprecruiter","full_description":"About the RoleThe Rider Verticals teams are building Uber's latest brand-new products and services that look to re-define and expand just what it means to \"Uber\". Today ridesharing and \"Uber\" is predominantly seen as a solution for getting from A to B on-demand and in the moment. We are rapidly expanding our group with like minded technical pioneers that are excited on how we can reshape the minds of our customers, and get them to use Uber for more use-cases and moments than ever before. We operate as a large, well-funded startup within Uber, and we are responsible for growing Uber's business and adjacencies rapidly. Our teams have a range of 0 to 1 big bold bets, to more mature and large scale platforms that power our rides business.## What You'll Do  Design & Engineer our latest product solutions and platforms from inception through to delivery at Uber scale.  Your ideas get to shape the direction and strategy in solving some of Uber's hardest problems, you'll have a key seat at the table in how we turn ideas into magical solutions for our customers.  Work through multi-functional partners across Uber teams to drive consensus and ship your features.  Collaborate and brainstorm with peers including Engineering, Product, Operations and Business partners## Basic Qualifications  Bachelor's degree in Computer Science or related technical field or equivalent practical experience  Strong experience in either Kotlin and/or Java * 2+ years of professional experience building in either mobile platform/sdk/dev tools, or mobile consumer facing features## Preferred Qualifications  At least two (2) years of software engineering experience  Strong problem-solving and architectural design skills  Experience coding using general purpose programming language (eg. C/C++, Java, Python, Go, C#, or Javascript) and building large-scale backend systems  Proven experience working on consumer-facing products * Proven experience with driving cross-team and multi-functional collaborations"}