{"title":"Vehicle Network Engineer - Senior - EC1294 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIxJ2M_uyqw6nSeHu4o8tmxCskxmrQk90yOoj8Xrult7LDiWlVcHZ57ANo1uA_3-_MCAWg9jLXeh5SjFEhb3yHTTOBrKv7EqjihdFQrcngFzRUb2pPQe36Lx0PCYSa0VEujI47xoEHhOBxArGxi4FoQjyuW389WPqR7L0WrFI_hfKqj4XrJuwAlJwQyxdk","source":"ziprecruiter","full_description":"Job DescriptionDescription:The Vehicle Network Engineer – Senior will release, maintain and update CAN, LDF communication databases. Responsibilities include but not limited to:• Perform networking tasks related to CAN, LIN and LVDS for specific architectures and vehicle lines.• Work with systems engineers to define CAN and LIN communication for vehicle systems.• Support development of future networking technologies.• Perform bus loading analysis and timing analysis.• Support the network development for multiple areas, which include; Electrical Systems, Powertrain, Electrified Powertrain, ADAS.Requirements:• BSEE degree from an ABET accredited university.• 5+ years vehicle CAN/Ethernet bus signal/message development experience.• 5+ years CANoe /Vector tool experience.• Excellent verbal and written communication skills.• Excellent problem solving skills.• Proficient use of MS Office (Word, Excel, PowerPoint, etc)Preferred Requirements:• Master of Science in Electrical or Mechanical Engineering (or equivalent) from an ABET accredited university.• Experience or background in the development of vehicle electronic architectures.• Experience using tools such as CANalyzer and CANoe.• Experience with Ethernet, CAN, CAN-FD, and LIN.• C and/or CAPL software development experience.• Ethernet, CAN FD, and LIN experience.• Familiarity with Symtavision network analysis tools.Travel and Driving Requirements:• Will be required to drive a company car. Valid driver’s license is required as well as a clean driving record.• Will be required to travel domestically and internationally up to 20%About Kyyba: Founded in 1998 and headquartered in Farmington Hills, MI, Kyyba has a global presence delivering high-quality resources and top-notch recruiting services, enabling businesses to effectively respond to organizational changes and technological advances.At Kyyba, the overall well-being of our employees and their families is important to us. We are proud of our work culture which embodies our core values; incorporating value, passion, excellence, empowerment, and happiness, creates a vibrant and productive atmosphere. We empower our employees with the resources, incentives, and flexibility that they need to support a healthy, balanced, and fulfilling career by providing many valuable benefits and a balanced compensation structure combined with career development. Disclaimer: Kyyba is an Equal Opportunity Employer. Kyyba does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other basis covered by appropriate law. Minorities / Females / Protected Veterans / Individuals with Disabilities are encouraged to apply. All employment is decided on the basis of qualifications, merit, and business need.Rewards:Medical, dental, vision401k Term lifeVoluntary life and disability insuranceOptional Pre-paid legal planOptional Identity theft planOptional Medical and dependent FSAWork-visa sponsorshipOpportunity for advancementLong-term assignment with opportunity for hire by client SELECT AWARDSAn INC 5000 company for 10 yearsCorp! Michigan Economic Bright Spots Crain’s Detroit Business Top Staffing Service Companies in DetroitTechServe Alliance Excellence Award- IT and Engineering Staffing & SolutionsBest of MichBusiness winner in HR Wizards & PartnershipsMetro Detroit Elite Category: Recruitment, Selection & Orientation for 101 Best & Brightest101 Best & Brightest Companies to Work for in Michigan"}