{"title":"Senior Project Engineer - Civil Site Design NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKCPIARgeGwuvzCyKShO7-Nt7PBuvvEqN4rw9943HD80n7IA2mnPuDtQQwiVHhYhpfGpooZjI9X7jfM6npeZEI1kqlZ9sacqIrlzp-4rY2XWz25RqwT-YyeZy43XXuUS-gj_7Li5Azcw-Jaf5ZTbXsehySaFIyA2cXi4oCiN41ApuC8QBc42TIcXVh9SLTF","source":"ziprecruiter","full_description":"The ideal candidate shall have 5-10 years experience as a Professional Engineer with specialty in Civil Site Design with current Professional Engineers license or ability to renew license in the State of Florida within 6 months. The Project Engineer will provide the backbone of design efforts and will coordinate directly with the Contact Manager for proper allocation of company resources to ensure timely completion of all activities and deliverables during the various stages of multidisciplinary design projects. The projects may vary in size and nature.Education /Experience/Licenses:Bachelor's Degree in Civil Engineering from ABET accredited university requiredFlorida Professional Engineers license required (or ability to obtain within 6 months)Experience in preparation of Stormwater model and Hydraulic Grade Line CalculationsExperience in Lift Station/pump designExperience in pressurized water main design and flow analysis Skills and Special RequirementsExtremely strong collaboration and communication skillsStrong organizational skillsStrong project management and time management skillsAbility to oversee numerous projects efficiently and effectively Proficient in Microsoft applications including Outlook, Word, and ExcelAnalyzing and Evaluating various water resource related technical problems to improve the performance of stormwater systemsKnowledge and experience of the hydrologic and hydraulic principles associated with culvert systems knowledge and experience with roadway drainage, stormwater, sedimentation and erosion control, civil site development, and/or watershed modeling a plusGulfstream Design Group, LLC is a full service Civil Engineering firm specializing in land development consulting, design and permitting. Matt Lahti, P.E., LEED AP, a resident in Northeast Florida since 1987, has been providing professional consulting services across Florida since 2005 and founded Gulfstream in 2013. Gulfstream maintains a fully staffed office in St. Augustine, FL and remains committed to providing budget friendly designs enabling suitable growth for the future. Please send resume, salary requirements, and references to lindsay@gulfstreamdesign.com."}