{"title":"Android Developer (Entry/Mid-Level)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALmg1NU-gFAqTqEeAchIYJ6rPqxyiHSxNM2rKvmYBPEzEK0NYzX6kdO3KWbo9rT2ao0P6BFPimB4-01iyhWVof2dGvWCfJLXwkpVpMhDbEWjlYhewki3ZZ-g5h9hP9DPZa4O6kkIOMMGpi_jIZnHNpuFvgWQiN4PVNDEkCw_JbTjiHdupchYIOd42h4FXQk","source":"ziprecruiter","full_description":"Helbiz provides powerful micromobility solutions for urban areas around the world.  We are looking for an Android developer responsible for the development and maintenance of applications aimed at a vast number of diverse Android devices. Your primary focus will be the development of Android applications and their integration with back-end services. You will be working along-side other engineers and developers working on different layers of the infrastructure. Therefore, commitment to collaborative problem solving, sophisticated design, and creating quality products is essential. Responsibilities Translate designs and wireframes into high-quality codeDesign, build, and maintain high performance, reusable, and reliable Java/Kotlin codeEnsure the best possible performance, quality, and responsiveness of the applicationIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatization Qualifications You have a degree in Computer Science or equivalent technical backgroundStrong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizesFamiliarity with RESTful APIs to connect Android applications to back-end servicesStrong knowledge of Android UI design principles, patterns, and best practicesExperience with offline storage, threading, and performance tuningExperience working in agile development with tools such as Jira, Slack, Github actions Helbiz wants to build a workforce comprised of individuals with diverse backgrounds, abilities, minds, and identities that will help us to grow well and fast, not only as a company but also as individuals. Helbiz is an Equal Opportunity Employer."}