{"title":"Heavy Construction Equipment Mechanic Shop Helper NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAInWYJICY3lfwJGdxh7iziHD7Xyho5S804vcCjVtgIR8gUkMpGCQwouE_ivUx7cM4HGO8BcZRFEJEgzyUD5Q-Qh1IalwrTnQP7yhGkNh_nJVDEywUjyyBAXCevqoPbxKVpT0iIUuu-nRwO2AUYiT7d06awpA2WtMIvtKSZHku-FC-jR4vrX5FHZW-Uo77Xi","source":"ziprecruiter","full_description":"SUMMARY:This position is primarily responsible for Inspecting, maintaining and repairing machinery and equipmentESSENTIAL DUTIES AND RESPONSIBILITIES:Core duties and responsibilities include the following. Other duties may be assigned. Basic understanding of Construction Equipment (CE)- Considerable knowledge of the less complex mechanical parts of heavy constructions equipment Work requires general skills and care of constructions equipment parts manuals, hand tools, materials, and procedures for maintenance and repairs Skill in the care and use of required tools and equipment Able for needed parts and materials identification Ability to perform heavy construction equipment Preventive maintenance, and cleaning Able to move/drive/ maneuver constructions equipment units Maintains a high technician utilization with minimal idle time Follow the established company policies and the Service Operational Procedures Ability to understand and effectively carry out simple oral and written instructions Ability to prepare written service reports and simple records Repairs are completed correctly the first time, minimizing service reworks Works efficiently maximizing the established job task time frame Completes all paperwork and reporting; insures all paperwork is submitted within the allowed timeframes, and with complete information Inspects equipment and prepare equipment condition report and service reports for the corresponding supervisors and managers. Assist technicians, supervisors, and managers on service operations as required Observes and be in compliance with the company safety standards in accordance with OSHA and state regulations. Considerable knowledge of the hazards and safety precautions All other duties related to the position and other requested by supervisorPHYSICAL DEMANDS:The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is frequently required to stand; walk and talk or hear. The employee is occasionally required to sit; use hands to finger, handle, or feel; reach with hands and arms; climb or balance and stoop, kneel, crouch, or crawl.The employee must occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.WORK ENVIRONMENT:The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is regularly exposed to fumes or airborne particles; toxic or caustic chemicals and risk of electrical shock. The employee is frequently exposed to vibration. The employee is occasionally exposed to wet and/or humid conditions (non-weather); working near moving mechanical parts; outdoor weather conditions; extreme cold (non-weather) and extreme heat (non-weather).The noise level in the work environment is usually moderate to loud."}