{"title":"Maintenance Mechanic -Manufacturing NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIbhzn_8CUX3J6wMsL63_19Mq5DoBn8ROQaAuzJh7EczMf6T-Xe3zfU9-XKomcVpFt8xSHEuWobMTkLC-WxLV1Egd86MwXHtSGCFDSTL6qr-eRtu7M9V6j2ofo9jwy6tn8lGkeKRnB0pCVtcONvV2M9HVHJM1-MaWXI--1_Ber5A4de_b0cyGQcf3xCYKRp","source":"ziprecruiter","full_description":"Maintenance Mechanic -Manufacturing Always growing organization looking for independent, quick learning worker to join their team - keep reading!Top Reasons to Work with Us- Excellent compensation & benefits- Large organization with plenty of room for growth- Upbeat, casual environmentWhat You Will Be Doing- Installing, maintaining, and troubleshooting industrial equipment: Pneumatic systems, Hydraulic systems, production equipment- Reading prints/schematics to identify problem areas and allow for rapid evaluation and repair- Working with management on evaluation of vendor selection and capital projectsWhat You Need for this Position- Experience with maintaining bottling/packaging machinery- 3+ years of experience working in an industrial/manufacturing environment- Ability to read prints and schematics- Familiarity with Allen Bradley Systems- Experience maintaining and trouble shooting Pneumatic, Hydraulic, Electrical, and Digital Control Systems  PLCsSo, if you are a Industrial Maintenance Technician looking for your next great opportunity, apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}