{"title":"iOS Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIf11xfSdoDMG2VEyzHuqgdaLKBmQaFhf5qZEMhIpBnOeyY4jn-nbYGWb7Lr_3ibW3KcU50dhGF1FfxfpXLuWCWP96mJHNQFTEzRHgmVEkm1BAFMTeOaA2YEX82svE_FJobT-wvQ2n25ZLGOxTCm0H8P8HOIYgNfklAkzD3KvgTiGIhu-d4hvAGsq1kyyjb","source":"ziprecruiter","full_description":"iOS Developer iOS Developer - Skills Required - IOS, SWIFT, MobileIf you are a iOS Developer with experience, please read on!Top Reasons to Work with UsWe are built on the foundation of helping users find the apps that will pay them the most. In the age of the hustle, apps are one of the best ways to make that extra cash that can make the difference. We strive to find apps that reward users the most for the least amount of time, to help everyone make the best use of their time.What You Will Be DoingAs an iOS Developer, you will create wireframes and mockups of mobile applications. You will develop iOS mobile application using Objective-C, Swift, iOS SDK, and XCode. You will support deployments and triage productions issues. You will test and verify that the application meets the initial functional specifications.What You Need for this Position3+ year experience building native iPhone/iPad applications A Bachelor's degree in a computer related field or equivalent professional experience is required Demonstrated ability developing with Objective-C, Swift, iOS SDK, and XCode Knowledge and/or Experience consuming REST web services and communicating with external systems Strong analytical and development skills to troubleshoot and performance tune applications Ability work well in a team/agile development with minimal direction Demonstrated ability to handle multiple tasks and flexibility Excellent written, verbal and in-person communication skillsWhat's In It for YouCompetitive Pay PTO Health Benefits Excellent company cultureSo, if you are a iOS Developer with experience, please apply today!Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.*iOS DeveloperGA-AtlantaJG8-1563758*"}