{"title":"iOS Developer Intern","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AAJ9uGVtmbcA8WFTEHI3yjLE0tlCs0v9e0hg_aCvQHmIts8yUvh0v7DwNG7jzHoUHA4Kx_EzAehzAuluRREBJvlSHcUT-zEfzp7EXzmj2gPlhawA1BM8x7ONfGxkof7e7bMjZqN_WLK8lyjZFSP8MVCXOWiHCc_uevEDjcV9ORw2ywBDQdu9BDnddRs1mtQ","source":"ziprecruiter","full_description":"Great ideas sometimes come from singular inspiration, but more often they’re a result of collaborative effort. Inside Garmin, we like to foster an environment of participation and engagement. We support professional development, offer well-designed career paths and adhere to a policy that prioritizes promoting from within the company to maximize the opportunities for our associates. We are also committed to being a good corporate citizen and providing opportunities for associates to contribute toward a healthy, sustainable world. Forget “special projects” for newbies, our software engineering interns work side-by-side with a mentor, making hands-on contributions to the world’s top-selling GPS navigation and wireless communication products. Our interns learn to develop software in Objective C & Swift. They also test software, perform software releases, quality assurance activities and performance maintenance activities…all on actual Garmin products. Come on, what are you waiting for? Put your brain to work at Garmin. We are looking for an iOS Developer Intern at our office in Olathe, KS. In this role, you'll also be responsible for performing new product design and development and troubleshooting basic issue reports, evaluating technical cause and implementing software solutions. Other essential functions include:Identifies and resolves defects of basic scope using proper engineering tools and techniques such as debuggers, emulators, simulators, and logic analyzers Communicates status of work clearly providing visibility to supervisor or mentorMay be responsible for planning own technical work Applies design standards and procedures to implement basic designsLearns how to use and apply engineering tools as needed for this role Thoroughly documents work in an organized mannerWorks collaboratively and professionally in a team environment  with other Garmin associates to achieve goals Qualified candidates for this role will have completed coursework in Computer Science, Computer Engineering, or a field relevant to perform the essential functions of this job description with a minimum cumulative GPA greater than or equal to 3.0. Other requirements include:Demonstrated strong and effective verbal, written, and interpersonal communication skillsMust possess relevant experience and/or training in a high level language such as Objective C, Swift, C#, Java or other languages relevant to Garmin’s business needsMust possess relevant experience and/or training in data structures or object oriented design methodology relevant to Garmin’s business needsA cumulative GPA greater than or equal to 3.5 and previous experience working in a team environment is highly preferred! Interest in and/or active general aviation pilot is a major plus!    As part of our ongoing commitment to helping associates maintain a healthy balance between work and life, we sponsor company-wide and individual wellness initiatives, as well as world-class sporting events—and even some of the participating athletes. In each of the communities in which we do business, Garmin has a strong philanthropic and civic presence. Our associates benefit from these connections in many ways, including through discounts on products and services, opportunities to attend sponsored events, and even help with work-life initiatives, such as pilot certification and adoption assistance.   Garmin International is an equal opportunity employer.  Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran’s status, age or disability."}