{"title":"Regional Account Manager","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKBF_1HETK8Ykyv9h7KcFUOJn4AoYWk_2sUoHveSXPFzftEGSx-omHC1pj6X73up3bIbe03J7ySj3DDVPmdjwHdBR-QEZuWq6DAdrD4kEsmZWrf61MxX-J31_euwsDaj9pq5b5RlqSUicVJy8uDaHYH1h_gAEtDywdQtWc7KdOBjaghax7ewBNdFYn6P-I","source":"ziprecruiter","full_description":"About NoraxonNoraxon USA Inc. was established over 20 years ago as an industry leader in human movement metrics and biomechanics research solutions. Noraxon’s patented and FDA-approved hardware technology includes high-fidelity electromyography (EMG), 3D motion analysis, pressure, force, and video capture equipment, all of which are fully integrated with its myoRESEARCH ® 3 biomechanics data analysis software platform. Our customers include researchers, physical therapists, sports scientists, and ergonomists. Learn more at www.noraxon.comPosition Overview:We are hiring a competitive field sales representative to develop sales strategies and attract new clients for the South-Central territory. An ideal residence for the Regional Account Manager is in the Texas area. The successful salesperson will source new sales opportunities and close sales to achieve quota. They will play a key role in increasing revenue by managing and negotiating with clients, generating leads, qualifying prospects, and managing sales of products and services.Job Duties and Responsibilities:Selling Noraxon products and services to the Research and Rehabilitation Markets which includes university and hospital research departments, outpatient physical therapy, university sports medicine, and professional sports teams.Prospecting via networking, cold calling, attending assigned conferences, and lead follow up.Provide demonstrations via both in-person and virtual.Manage sales pipeline including forecasting and moving prospects through the sales process.Meet personal and team sales targetsResearch accounts and generates or follow through sales leadsAttend meetings, sales events, and training to keep abreast of the latest developmentsReport and provide feedback to managementManage sales pipeline, forecasting, and activities through company CRMMaintain and expand client database within your assigned territoryRequirements:Minimum of 6 years of capital sales experienceProven sales experience meeting or exceeding quotaExperience working with a CRM system salesforce preferredComputer and technical expertise a mustFamiliarity with different sales techniques and pipeline managementStrong communication, negotiation, and interpersonal skillsSelf-motivated and drivenBA/BS DegreeMust be able to travel 50-70%"}