{"title":"Senior Electrical Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALyJvIKmTaSHOZjTVD3fJQJIFvbT6Js94evVl0Lsuf2EgFHA-rblFrkI6MRvSsuY3qQBKUM3PO0CE-AFCpnqUuXVfOGMiSK6bG6lpwDV7VrEhy3E_2jILmVa3eI8ASbeSrxp0eIE-pWUrUtYpJIDxuU92IuCWp2wV2C3NsdhmE_HOTAMAxXKHqih6iVsHeX","source":"ziprecruiter","full_description":"Why We're Rad (about us):  Rad Power Bikes is a leading consumer-direct ebike manufacturer specializing in high quality yet affordable electric bikes for weekend warriors, hardcore commuters, and family cyclists. Madly growing and headquartered in Seattle, WA, we are seeking a full-time Senior Electrical Hardware Engineer to join our team. If you enjoy working in a collaborative environment and are looking to support a dynamic team, this might be the role for you!  The Senior Electrical Hardware Engineer will report to the Senior Electrical Hardware Engineer and be responsible for developing next generation Rad Power Bikes products as well as supporting existing product lines. The Senior Electrical Hardware Engineer will define requirements, detail specifications & develop hardware with a system level/holistic approach to optimize performance/cost from input to output. The successful individual will demonstrate teamwork within the existing cross functional team and design to high performance standards with accuracy and consistency. Why You're Rad (about you): Develop, prototype and test analog/digital mixed signal circuit designs for eBike control, communication and user interfaces.Design and define products ensuring compliance with all relevant regulatory certifications for both US and international marketsDesign robust, maintainable, elegant, and lasting solutions to meet a wide variety of requirements and feature sets while working closely with product management, mechanical, firmware, quality, validation and other teams to deliver world class productsAssure a high standard of quality in your own work and in the work of others on your team via good design principles, process improvements, safe, clean designs and iterative validation while balancing a variety of tasks and prioritiesCollaborate directly with production partners to communicate and resolve any technical issues during the specification and development cycles Additional Requirements: Bachelor's degree in Electrical Engineering with 5+ years industry experience in electrical circuit design and development; OR 9+ years industry experience in electrical circuit design and developmentStrong understanding of discrete circuitry and physics fundamentals; circuit theory, simulation and power electronicsKnowledge of processor architecture, various communications protocols such as I2C, UART, SPI, etc. FPGA experience is a plusExperience using Electrical/Electronics CAD, circuit simulation, schematic capture and PCB layout toolsExperience designing and releasing products that meet US and international compliance and safety regulations such as UL, CSA and CE. You get bonus points for: High volume consumer product development experienceAutomotive, EV, eBike or similar vehicle related experienceExperience partnering with contract and remote (Asia) manufacturers Had you been with us last month, the top 5 things you would have impacted are: Designed and owned electric projects through entire product life-cycle, from definition and creation, through design, production, and next-gen improvementsPerformed physical testing and assisted with developing testing protocols and ensured that new product is functional, safe, and appealing to the target marketDeveloped and monitored project timelines, ensuring projects are completed on time and within cost objectives and in accordance with company objectivesHelped guide the selection, installation, and calibration of equipment for company product development workshopGenerated testing reports through evaluation and validation of programs/systems and specifications for new and existing products, ensuring adherence to applicable industry and business standardsAdditional duties & overtime as requiredSounding good? Read on to understand what matters most to us: At Rad we take our company values seriously. They are lived out into everything we do. Our RADICAL values really do frame what our expectations are for each and every team member. We are:    - Responsible to our environment, community and team   - Accountable, we take ownership, bias to action, seek and provide feedback   - Diverse, inclusive of experiences, backgrounds and skills, we value every voice   - Innovators, we challenge ourselves and the status quo, we are original   - Customer driven, completely, we do the right thing for our riders    - Approachable, kind, we collaborate and are always willing to help   - Learners, we grow our skills, we are humble and seek to improve Does this sound like you? Please apply and join us!Rad Power Bikes is proud to be an Equal Opportunity Employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.If you need assistance or an accommodation due to a disability, you may contact us at 800-939-0310 or jobs@radpowerbikes.com. Recruitment Agencies: Although we value the services you provide, at this time we are not leveraging external 3rd party recruitment resources for this search.  Should those needs change, we will seek your assistance directly."}