{"title":"Senior Level Unity Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ-rEFzUkinYWrUJKSkKD4puFKgB8Dpoi35A62k5DkdIzs_lY6rB58Qgg_pTEsmtslSNt5ESrN2wIssNLEMpua4eEd5C_U94OoW0Ooy8nPR-1JjmRm-vAfc6hBJotX5UmdOmGdKnHhC1rIosr0smtaelYl3tW6H_7fjtTln6R0m3UEgjz_mt8MnAuhJHgCo","source":"ziprecruiter","full_description":"Overview i3 is seeking a Senior Level Unity Developer. Candidate should have experience developing code for training software and systems. You should possess excellent communications and analytical skills; knowledge of computer systems and integrated software application programs, instructional system design, and modeling and simulation exposure. You will work directly with supervisors, designers, and engineers in the support and creation of interactive mobile, web, augmented reality, virtual reality, desktop training systems, serious games, and distributed learning simulations - primarily working within the Unity3D game engine. You will perform mid-level to senior level development, test, analysis, and validation of software; quickly adapt to changing workloads, collaborate and lead with your team and other business units to provide software solutions, following best practices ensuring a high quality standard. You should also have experience reading and translating technical information and conceptual ideas into high-end interactive multimedia training solutions. This is a fast-paced work environment with plenty of room for creativity and expression.Candidate must supply access to an online portfolio, demonstration reel, or equivalent. Qualifications Required education, experience, and skills:BA/BS Degree in Game Development, Computer Science, Engineering, with five+ (5+) years' relevant experience - OR - eight+ (8+) years' related professional experience may be substituted for a degree.Experience of C# programming and/or other relevant object-oriented and type-safe programming languageAbility to work well within a dynamic, cross-discipline, and iterative team environmentSelf-motivated, collaborative, excellent interpersonal and communication skillsPositive attitude and an ability to receive and provide objective feedbackExcellent written and verbal communications skillsSecurity Clearance: Candidate must have the ability to obtain a SECRET security clearancePreferred skills:5+ years' experience with the Unity3D platformExperience leading, training, facilitating, and coaching a team on ScrumExperience using Jira software for task management and reportingExperience using source control tools, such as Bit Bucket, GIT, or PerforceExperience building custom editors, inspectors, and tooling within Unity in a professional productiOS and/or Android software development expertiseExperience with Unity specific performance analysis and code optimizationExperience with Shading language such as HLSL for use in Unity is a HUGE plusReal passion for games and/or game industry experience"}