{"title":"Embedded IOS Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKs4JYt-gCOACnz8XW8C8NBHuHz0ToSC-_3YVRLLWDGeFT072MNdddiYLw7NS4Laj9Fcm62WBbbnky9vuaMmRTWuV69JnbZp6XAKjodiKoHI5s91O0iGnGaKCv1ogxj3Tnq1LNzx1JEGxVZIvUivoMSPKJQbPMsEnUX7OHuejXA-lbOXsVEI0D4z00I6jsf","source":"ziprecruiter","full_description":"Embedded IOS EngineerSan Diego,California,United StatesHardware+ C/C++/Python experience + Proven debugging ability + Unix command line experience + Development experience on Unix, Linux, or Mac OS X Effective interpersonal skills + Experience in designing multi-threaded applications Objective-C and Cocoa knowledge is highly desired Experience developing Embedded Systems is highly desired Experience debugging OS and hardware interaction is a plus**Description**As an Embedded iOS Engineer you will be responsible for building and maintaining internal software running on all of Apple's current and future iOS devices. You will have responsibilities spanning all aspects of the product development and test cycle: - Developing and debugging applications, protocols, frameworks, and command line utilities for internal use - Maintaining existing apps and tools across software update cycles - Interacting with Hardware, Software, Test, Operations and various other cross- functional teams throughout Apple - Triaging and debugging hardware and software issues on iOS devices - Supporting hardware development builds locally and remotely (travel optional)**Education & Experience**BS/CS/EE/CE or relevant work experience**Additional Requirements****Apple Footer**Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant (Opens in a new window) .Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. United States Department of Labor. Learn more (Opens in a new window) .Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law. If you're applying for a position in San Francisco, review the San Francisco Fair Chance Ordinance guidelines (opens in a new window) applicable in your area.Apple participates in the E-Verify program in certain locations as required by law. Learn more about the E-Verify program (Opens in a new window) .Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace. Reasonable Accommodation and Drug Free Workplace policy Learn more (Opens in a new window) ."}