{"title":"Python Programmer NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAL0e-CDIll3qxhK6Hlw3J7WAL6OLihMTTGGEsJRioRvQvu1NbN0lPrN0vrrDuW6bsYDrn2mjW81lXtIvlXgie3gO-GuRf9ObmsmBHRY5KwoAz5uNNamMeIOZpiaS0gfR4eIEuek2fsGjhCPemhA6ve5qAT2iTyl4H0Xg6vZWSxGzDIdN1qiuVqLC9o8TuY","source":"ziprecruiter","full_description":"We are currently accepting resumes for a Python Developer in Columbus, OH.The selected candidate will perform the following duties:- Python programming to implement the system and payment processes - 70%- Assist with report creation utilizing Python – 15%- Business analysis, creating requirements and specifications from business rules – 15%- Design a new data processing system and architecture to perform multiple recurring, time sensitive, and mission critical funding processes, each involving multiple programs, calculation steps, and/or data sources. Goals to improve over the legacy system include, but are not limited to:- Replace all COBOL and SAS code with Python 3 code, potentially augmented with ODE owned reporting tools (e.g. SoS HTML template and JSON data, JavaScript (and HandleBar templating), Django Template Language, PowerBI)- Make most data calculations reusable across multiple payment processes (e.g. as a Python package)- Make the processes configurable so that simple changes (such as constants or multiplication factors that may change each budget biennium) can be changed at run time without requiring code changes and a formal software release.- Make the processes configurable so that different calculation modules and data sources are leveraged depending upon run time parameters such as state fiscal year and payment number.- Producing run time logs for tracing batch file execution- Produce business and operational reports, such as payment change tolerances and exception handling.- Identify, recommend, and assist with implementing a Python 3 distribution (CPython, Pandas, etc.) appropriate for ODE's needs.- Work with ODE personnel to review existing legacy COBOL and SAS code to document business rules, system process flow and identify process re-engineering opportunities.- Replace legacy COBOL and SAS code by writing Python 3 code/modules to implement the business logic within the context of the new reusable and configurable system architecture. - Assist and/or replace legacy COBOL code that generate dynamic financial reports on the ODE web site with modern technologies (e.g. Python, SoS HTML template and JSON data, JavaScript ( and HandleBar templating), Django Template Language, PowerBI)).- Leverage the Microsoft Visual Studio IDE and Team Foundation Server for source control, release management, and system build. - Mentor ODE programmers as they make the switch from COBOL/SAS to Python, assisting them as needed in rewriting legacy COBOL and SAS code and assisting with establishing Python 3 team development standards.Required Skills and Experience: - Bachelor’s degree in computer science, management information science, or related field- 7+ years of Python programming experience, at least 4 of which Python 3 must have been the primary programming language used- Experience with SQL server databases- Experience with JavaScript Object Notation (JSON)- At least one project migrating a substantial legacy code base to Python.- At least one project designing and implementing a software architecture for batch script execution.Preferred Skills and Experience: - Experience with Python in Microsoft Visual Studio- Experience with Microsoft Team Foundation Services (TFS) for source code control, work item management, release management, and/or build processes- Experience with Pandas for PythonUNICON International, Inc. is an Equal Opportunity Employer.If you are interested in working for an organization where honesty, integrity and quality are among the core principles then click apply today!Keywords: Python programming, SQL, JavaScript Object Notation (JSON)"}