{"title":"Software Engineer, Full Stack NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALLuE3rEgJ_rtWOnuVfGqMxOqD-e6f8z6mp_iGic7IoM2TIAFAoYKO_43_js48Rz-uHqSx4qxwBfyL-V_UXe2tURtO4KWXYIT1Oltl5DVJz11hYwIGjddJ804uhdhkdp9vDgb6ujkjxlZWqllkzHhN1m86mBoWWcPDvCr92r6r_9pXOeoUvC7fqOuoWsyg","source":"ziprecruiter","full_description":"You can apply to the job with this email address: software_engineer___full_stack_7sn7vk1u2@ivy.greenhouse.ioCompany OverviewCome join a higher calling and find a deeper purpose! As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking. While inventing the framework of Autonomous Driving, our current fleet of autonomous Trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy. TuSimple was founded half a decade ago with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable Autonomous Freight Network. Example projects we are working on include:Building pipeline scheduling and execution platform, as well as the corresponding frontend to manage and interact with the platform, to do analysis of our simulations and datasets;Developing on-premises cluster projects as well as utilizing public cloud computing infrastructure services;Building front-end Web Interface for engineers and testops to control and monitor the onboard system, that visualize in real time, the perceived surroundings and decided routes of our autonomous driving system;Building web-based tools to optimize the labelling of our datasets to greatly increase the efficiency and correctness; Opportunity Overview:Discover and optimize performance bottlenecks in existing backend systems, such as database queries, storage solutions, to increase the responsiveness of user queries;Architect, implement and maintain performant and scalable data processing backend systems that can handle tremendous amount of data generated daily;Work with various teams globally, such as prediction, simulation and onboard runtime, to build web-based tools to facilitate their development lifecycle;Work with SRE team to identify issues to increase the stability and performance of our private computing service;Experience & Skills Required:BS/MS in Computer Science, or related majorsExperience with Python or C++ developmentExperience with modern standard of Javascript development, with frameworks such as Node.js/npm, Vue.js, react.js, etc Experience with web frameworks such as Flask, Django.Experience with cloud services, such as AWSGood understanding of containers, build systems, and infrastructure automationPassionate about discovering drawbacks of existing systems and working with users to improve the experiences;Preferred Skills and Experience:Experience with 3D Graphics (WebGL, OpenGL, three.js)Industry experience of building autonomous vehicle onboard visualization systemProficient with Vue.jsTuSimple Benefits100% employer-paid healthcare premiums for you and your familyWork visa sponsorship availableRelocation assistance availableBreakfast, lunch, and dinner served every dayFull kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and moreStock options / equityGym membership reimbursementMonthly team building budgetLearning/education budget Employer-paid life insuranceEmployer-paid long and short disabilityTuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above listed items.You can apply to the job with this email address: software_engineer___full_stack_7sn7vk1u2@ivy.greenhouse.ioBrown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,"}