{"title":"Technical Writer HSEP3 NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJNVU47LJBFgW-zpxeyZX-YbrBwBGT7s0BHkKYmpkq-NJ79SGSyzyGIB8MfHt9dJtQH6tt8bhjkVchA7uRlZ49DNxfY434VCzlnbSoiTx9oWVSOJrjIPj3N5N9uad-Zidvw8Z4Y5VWHc_czbjifrxwkqMFiJGlrEp3W2KZs1b3fAXUTzqMpNLNlUxQmwSY","source":"ziprecruiter","full_description":"Avantus Federal, a NewSpring Holdings Company, is a mission-focused services and solutions company headquartered in McLean, VA. Drawing upon its heritage companies’ histories of consistent growth and high performance in the federal services market, Avantus ensures eminence is earned, sustained and grown. Avantus’ services and solutions are designed, tailored, and executed based on our long history of helping our Homeland Security, Defense, Intelligence, and Federal Civilian customers solve complex challenges. Our capabilities include Project & Portfolio Management, Facilities, Acquisition & Sustainment, Systems Engineering Technical Services, Operations & Analysis, Transformation & Advisory Services, Data & Software Solutions, Digital Innovation, and Augmented Intelligence.Avantus Federal is looking for a highly qualified technical writer to support the construction, formatting and management of design standards documentation for a large PMO. The successful candidate must have the ability to understand both End User and Engineering expert's needs to be able to clearly translate these into well written supporting documentation. The successful candidate will work well independently, and possess a well-developed combination of communication, analytical, and interpersonal skills.  Technical Writer responsibilities will include:Writes, edits, proofreads, and formats operational and technical design standard documentation to build and update design artifacts for the PMO (from draft to final product);Performs quality control activities on engineering/design documents;Reviews written correspondence and artifacts to ensure final delivery is understandable to a first-time reader who possesses little knowledge of materials;Conducts research and ensures the use of proper technical terminology;Organizes material and writes detailed copies according to established standards regarding order, clarity, conciseness, style, and terminology;Selects photographs, drawings, sketches, diagrams, and charts to illustrate material;Provides formatting for deliverables to include addition of tables, illustrations, captions, indexing, cross-referencing and spelling and grammatical checks. BA/BS 8 plus years experience.Must be able to pass government background check (Public Trust).Ability to communicate effectively, both orally and in writing.Strong technical writing: Vast knowledge of the structure and content of the English language including the meaning and spelling of words, rules of composition, and grammar.Proficiency in Microsoft Office to include Word, Access, Excel and PowerPoint.The ability to effectively manage several projects simultaneously.Team player with the ability to interact with customers at all levels of government.Ability to work in deadline-driven environment and efficiently handle multiple priorities.Must be a US Citizen Avantus Federal is an equal opportunity employer and Vietnam Era Veterans Readjustment Assistance Act (VEVRAA) federal contractor. All qualified applicants receive consideration for employment without regard to race, color, religion, gender, national origin, age, sexual orientation, gender identity, protected veteran status, status as a qualified individual with a disability, or any other category protected by law. Avantus hires and promotes individuals solely on the basis of their qualifications for the job to be filled."}