{"title":"Analytical Chemist III","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKTwy0htk2DCQNvG7Z-zYtqJ44KoJl82E4_SSiEEpdKpijXksF670NtPw9t9YB6WZdHiZ_A3w1fX0mwP1cF3LApxWh_55nITzkA50ADy5vsIwmLesL1lS3HJFUzmBprOiIR9gL88PQuRDDqhTh76gaDzmxfMfWl6ldq6NB7A44uqtqa40RL7QUXRd8JVqlR","source":"ziprecruiter","full_description":"Job DescriptionPosition Overview: Catalent hires people with a passion to make a difference to the health of millions of people globally. Your expertise, coupled with Catalent's advanced technologies and collaboration with thousands of innovative pharmaceutical, biotech and healthcare companies, will help bring life-enhancing products to the people you know and love. Your talents, ideas and passion are essential to our mission; to develop, manufacture and supply products that help people live better, healthier lives. Interested in learning more about life at Catalent? Start hereCatalent Pharma Solutions is looking to hire an Analytical Chemist III for our San Diego, CA team and is responsible for the analytical development for solid oral and injectable drug candidates for human clinical studies, as well as preclinical drug products. An individual at the level of Chemist III will be expected to take responsibility for the completion of projects under minimal supervision.The individual will be expected to develop timelines and plan series of experiments as required by service agreements and then coordinate and possibly delegate responsibilities to meet Client's expectations. The individual must have demonstrated proficiency in the development of analytical methods for one or more drug product dosage forms. The individual must have demonstrated proficiency in the development and qualification of analytical test methods, particularly HPLC stability indicating assays, dissolution methods, product specific cleaning methods, and water content methods. The individual should also have proficiency in physical characterization techniques such as TGA, DSC, PXRD, GVS, and SEM. The individual may be required to assist in the creation and/or revision of company SOPs and to participate in continuous improvement projects. The Chemist III will be increasingly sought for training and mentoring of other colleagues, and may supervise a lab assistant. All duties will be performed in compliance with company standard operating procedures (SOPs) and GMP regulations, as appropriate.Catalent San Diego is a premier pharmaceutical chemistry development and manufacturing organization supporting the pharmaceutical and biotechnology industries. Catalent San Diego focuses on bringing client drug compounds from discovery to the clinic with services that include analytical development, preformulation testing, formulation development, GMP manufacturing and stability storage and testing. At Catalent San Diego, we recruit and develop exceptional individuals with a passion for science and determination to excel. We offer a technically challenging and stimulating environment and the opportunity to learn from the best. We provide a generous benefits package, on-site gym and fitness programs, team sports, activities and competitive compensation.The Role (daily responsibilities)Complex experimental design and execution will be performed independently with minimal supervisor assistance.Develop strategic experimental plans and timelinesExercise technical discretion and critical thinking in the design, execution and interpretation of experiments independently with minimal supervisor assistance. Data interpretation should be conducted with guidance on complex issues only.Collaboration with other departments to troubleshoot technical issues.Clear and accurate record keeping in laboratory notebooks and secondary review of other colleagues' work for scientific accuracy and complianceIndividuals will contribute to discussions with clients and peers on strategic matters.Primary responsibility for individual client projects with strategic support from supervisor. Lead discussions with clients on technical topics relating to their project. Supervisor may not need to attend all meetings.Individuals should have a good general foundation of scientific principles, chemistry concepts, and be proficient in core analytical scientific techniques, GMPs, and technical writing.Maintain a high level of professional expertise through familiarity with scientific literatureComply with good housekeeping and safety practicesSupervisory duties for a laboratory assistantThe Candidate (requirements) 4 year degree in a physical, chemical, biological, or pharmaceutical science requiredBS with 3 to 5 years of experiencein analytical developmentMS with 2 to 4 years of experience in analytical developmentPhD with 0 to 2 years of experience in analytical developmentCatalent's standard leadership competencies that are used to interview and for Performance & DevelopmentLeads with Integrity and RespectDelivers ResultsDemonstrates Business AcumenFosters Collaboration and TeamworkChampions ChangeEngages and InspiresCoaches and DevelopsPosition BenefitsAwesome employee activities: Movie day, Monthly Birthday Celebrations, On-site Fitness Center with machines, on-site yoga and HIIT classes, Sponsored Sports Teams, and several other company sponsored events that encourages positive employee comradery, which contributes to effectively building positive employee relationships, overall creating a positive work environment;Environmentally friendly with on-site practices as well as regularly participating in Beach Clean-up activities;Catalent match employee donation to charities;High visibility to Senior Leadership daily;Medical, Dental, Vision and 401K are all offered from day one of employment;19 days of paid time off annually and 8 paid holidays;Tuition ReimbursementCatalent offers rewarding opportunities to further your career! Join the global drug development and delivery leader and help us bring over 7,000 life-saving and life-enhancing products to patients around the world. Catalent is an exciting and growing international company where employees work directly with pharma, biopharma and consumer health companies of all sizes to advance new medicines from early development to clinical trials and to the market. Catalent produces more than 70 billion doses per year, and each one will be used by someone who is counting on us. Join us in making a difference. Catalent is committed to the health and safety of its employees, visitors and the customersand patients we serve. As a result of the global pandemic, we have modified many of our recruitment and on-boarding processes to maintain everyone's safety. The Human Resources teams will communicate all necessary safety processes and procedures throughout each stage.personal initiative. dynamic pace. meaningful work.Visit www.catalent.com/careers to explore career opportunities.Catalent is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation or gender identity. If you require reasonable accommodation for any part of the application or hiring process due to a disability, you may submit your request by sending an email, and confirming your request for an accommodation and include the job number, title and location to DisabilityAccommodations@catalent.com. This option is reserved for individuals who require accommodation due to a disability. Information received will be processed by a U.S. Catalent employee and then routed to a local recruiter who will provide assistance to ensure appropriate consideration in the application or hiring process.Notice to Agency and Search Firm Representatives:Catalent Pharma Solutions (Catalent) is not accepting unsolicited resumes from agencies and/or search firms for this job posting. Resumes submitted to any Catalent employee by a third party agency and/or search firm without a valid written & signed search agreement, will become the sole property of Catalent. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral. Thank you."}