{"title":"Information Technology - Developer Specialty - Software 4","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAImShJMye8V_tuLx-oe0DeVDzt4mR85aMpbVXhu4m1V62kIsUnp1h90AKSwUkMhTM5LoAnerGdx_QYIsv1Uh7r7BmX8ABMzrMeB8YNp2SBtx2vPZcD7LlUjyYNULhQCcW1oE8dn_uaV9t-Hwg8jfjRWjOlnCYIgNykqEr5atCIZ2dLpfWQM7k1kZl9L-dkr","source":"ziprecruiter","full_description":"About US: Established in 2006, Orpine Inc is an international Minority Business Enterprise (MBE) consulting company with offices in Georgia, North Carolina, California and India.  When it comes to staffing solutions, our strong ties to various talent pools allow us to fulfill the contract and permanent positions for any size company, ranging from Global 2000 Companies to implementation partners. Currently we are hiring for below mentioned position that our client has.Description:Education: May need bachelors or relevant work experience of 8+ years in USAAndroid TV Developer We are looking for talented and passionate software engineers to join our professional services team to who will help drive the advancement of digital TV technology. We have a reputation for innovation at the leading edge of the pay TV and broadcast industry. At CommScope we have an affinity for engineering principles and in this role you'll have the opportunity to join an experienced team of software engineers working on the latest digital TV technologies and work on projects that could potentially reach millions of customers' homes on TVs, mobile devices, and desktops. In this role you will be required to design (visually and technically), develop, and implement features as requested by customers and partners. You will also follow approved life cycle methodologies, create appropriate documentation, and write automated tests. Candidates will be able to solve difficult issues with minimal support and be comfortable working by themselves or as part of a small team. You will be expected to resolve technical issues through debugging, research, and investigation and be familiar with standard concepts, practices, and procedures in Android development. A degree of creativity and latitude is required.Must Have Skills Android In depth experience designing, developing and maintaining Android applications [5+ years of experience]. Kotlin Experience developing and troubleshooting applications [4+ years of experience]. Java In depth experience developing and troubleshooting applications [6+ years of experience]. Self-Starter Proven ability to take ownership of demonstrable functionality from receiving requirements, development, unit test writing through implementation with a high attention to detail Strong communication and interpersonal skills.Nice to Have Skills Android TV Experience designing, developing and maintaining Android TV applications. Agile Experience as a member of an Agile development team; actively participating in ceremonies to refine requirements, demonstrate functionality, and provide process improvements. DevOps Experience configuring and troubleshooting build and development environments and tools, including experience with Jenkins, Git, and Gradle, or similar tools. Familiarity with set-top box platform interactions.Responsibilities Design, code, test, debug, document, build, maintain, and modify computer programs of high complexity, significance, and risk. Design and implement new features and bug-fixes. Resolve technical issues through debugging, research, and investigation. Perform unit and system testing of application code as well as execution of implementation activities. Work closely with our partners to develop integrated solutions for our customers (new end to end systems and adding SDK's into existing applications). Ensure that expected application performance levels are achieved. Be involved in future product direction and development by collaborating with other members of the CommScope engineering and management team.For more exciting opportunities join us on linkedin https://www.linkedin.com/company/orpine-inc/ https://www.orpine.com/searchjobs/"}