{"title":"iOS Mobile Development Intern","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AAKg2rk6iIGWsBxqtduSVthtduTeKHQPzxusPi7gDV-E4DNP--TZ0L7pPUlOButRvIX-70SirnX-WIY5UfT-jPMWcL6mWIgMIatolO_Qm2BLeevHSkug8MTTJr-2GPMYoZVZFk7YdufaWm6BOk6KEdeEXisOiVaJE9iOB0dFlvZjG9lgulFFika1W_Tq4kNf","source":"ziprecruiter","full_description":"Digital Health Technology team powers digital experiences and engagement to enhance the lives of millions of people every day through connected care. We build, deliver and manage a portfolio of data management platforms and mobile offerings in support of our core businesses. We thrive on simple and elegant architecture and agility. You'll be immersed in a dynamic high-growth environment and empowered to excel, take informed risks, and drive ingenuity across the enterprise.This is a 3 month internship with an expectation of 40 hours of work weekly.ResMed is the industry leader in providing innovative products and services that improve the lives of millions of people worldwide who have respiratory disorders.We are looking for an individual with the drive to help manage the rapid growth of ResMed 's systems and technologies. If you think you have what it takes read on.Let's talk about ResponsibilitiesYou will work on the mobile app development team, and will have the opportunity to work within all the phases of software development within our iOS team.You will provide valuable extra help for maintaining our CI system, ensuring continued high efficiency and frequency product releases.Additional duties include research upcoming areas and technologies which the team will use and incorporate into the platform going forward.Let's talk about Qualifications and ExperienceRequired:A self-starter who loves to innovatePassionate about learning to solve business problems with dataWillingness to learn new languages and technologiesAttention to details and concern of accuracyFamiliar with any major programming languages like Java, Python, JavaScript, GoStrong computer science fundamentals, including data structures, algorithms, and software designPreferred:Experience in application development in Objective-C or Swift for macOS or iOS a plusEducation & ExperienceCurrently enrolled in a degree-granting program pursuing a B.S. or M.S. in computer science, computer engineering, or closely related fields with equivalent experience.#LI-DS1Joining us is more than saying \"yes\" to making the world a healthier place. It's discovering a career that's challenging, supportive and inspiring. Where a culture driven by excellence helps you not only meet your goals, but also create new ones. We focus on creating a diverse and inclusive culture, encouraging individual expression in the workplace and thrive on the innovative ideas this generates. If this sounds like the workplace for you, apply now!"}