{"title":"Maps: Senior Software Engineer, Mapping NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL7CR2XEb30zdbQVmp6GQGwZI0wUqveIX9xdLY-eTUqgWyJbh81DFnu6qzV0IJFLC6Vh2oiDwU6ZaEGQWfjRAITLbT8fno7WT04EJxbbwCaMxJ3RxHPgi-MxRt-t13UyECsf0HAlg88HefQzWiTMreO8q1f0vQbKwJR73sUhJoDniDtlrOu9-Mdi_4nvfo2","source":"ziprecruiter","full_description":"This role is located in San Diego, CA. Remote friendly during COVID-19Email your resume directly: senior_software_engineer__mapping__731d063d2us@ivy.greenhouse.ioCompany OverviewCome join a higher calling and find a deeper purpose!As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking.While inventing the framework of Autonomous Driving, our current fleet of autonomous Trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy.TuSimple was founded half a decade ago with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable Autonomous Freight NetworkOpportunity OverviewTusimple is the self-driving technology company with a mission to bring automation to the trucking industry. HD Maps are a key component to building self-driving technology. Here in Tusimple, the Map team is responsible for developing the cutting edge algorithms to produce highly accurate, up-to-date and realistic representation of the roads. The results are a critical input to the downstream localization, perception, and planning modules.Example projects we are working on include:Building map elements both in real-world and semantic levelWorking on pipeline and infrastructure for large scale map buildingRole ResponsibilitiesDesign, build and optimize efficient pipeline and tools for building the mapDevelop efficient map data storage and querying techniquesInvestigate and experiment GNSS technology to improve robustness and precision of positioning serviceCollaborate with other engineers to conduct system integration and testsConduct performance and code reviewsExperience & Skills RequiredMaster/Ph.D in Computer Science, Math/statistics or other related field2+ years of industrial experience in map related projectsProduct-quality code in Python and/or C++Preferred Skills and ExperienceFamiliarity with tech stack of autonomous drivingKnowledge and experience in one or more of the following topics: mapping system, computational geometry, GPS/GNSS surveying, coordinate systemsRelated industry experience is a plusTuSimple Benefits100% employer-paid healthcare premiums for you and your familyWork visa sponsorship availableRelocation assistance availableBreakfast, lunch, and dinner served every dayFull kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and moreStock options / equityGym membership reimbursementMonthly team building budgetLearning/education budget Employer-paid life insuranceEmployer-paid long and short disabilityTuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.This role is located in San Diego,CA. Remote friendly during COVID-19Email your resume directly: senior_software_engineer__mapping__731d063d2us@ivy.greenhouse.ioBrown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,"}