{"title":"Sr. Software Engineer, Full Stack - Mapping NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK5OZehRD8Bm2pYDmS8S4j0cxVZeJ_NUCCOqqGBE9wrVoLEWwyZWJZgjLYy2EcuJBiQq96CJw7MHo_xhxFAvtY-adnDzdXAMw6cTjxk4ZVhh3ZWabKxqlank04rTOdohPYnalNmjRZHB6iQEBt5yqGGPyMBTVxaEjSdGmHcmQSnFy7__VnQrmUGmb0ZvTcI","source":"ziprecruiter","full_description":"You can apply to the job with this email address: swe__senior_c___software_engineer__sae_team_4fab24622us@ivy.greenhouse.ioCompany OverviewCome join a higher calling and find a deeper purpose! As a multi-national Artificial Intelligence Technology Company, we are at the epicenter of the Autonomous Vehicle Universe. Our breakthroughs are leading the industry in autonomous trucking. While inventing the framework of Autonomous Driving, our current fleet of autonomous Trucks are helping communities receive much-needed supplies and medical equipment around the clock. Our people are some of the most talented engineers and contributors who are leaving behind a historic legacy. TuSimple was founded half a decade ago with the goal of bringing the top minds in the world together to achieve the dream of a driverless truck solution. With a foundation in computer vision, algorithms, mapping, and Artificial Intelligence, TuSimple is working to create the first global commercially viable Autonomous Freight NetworkJob DescriptionSoftware Architecture and Engineering(SAE) plays a critical role in autonomous driving systems. As the C++ experts at the SAE team, you will responsible for designing, developing frameworks and modules that provide the next-generation platform and environment for the autonomous driving system.ResponsibilitiesResearch and identify opportunities for improving platforms, libraries, and pipelinesEngage with teams across the organization to architect innovative solutionsLead the implementation of high-performance, highly-available, mission-critical systemsAdhere to modern C++ standards and industry best practicesResponsible for integrating multiple modules and systems into one platformDeveloping and maintaining key integrating tools and monitoring performance Design, develop, test, debug, and deploy software modules in autonomous driving system, and/or in related platform and tools software.Experience5+ years of production coding experience in C++14 or laterKnowledge of STL best practices, memory safe and thread safe design patterns, TDD or BDD, and ABI/API compatibilityProfiling and debugging tools to resolve performance and stability issuesDesign and architect systems to meet complex user and developer requirementsBonus PointsExperience at a growth-stage startupExperience in Linux kernel.Experience in ROS.Experience on ARM Cortex-A architecture.Experience in the autonomy, automotive, or robotics industriesTuSimple Benefits100% employer-paid healthcare premiums for you and your familyWork visa sponsorship availableRelocation assistance availableBreakfast, lunch, and dinner served every dayFull kitchens on every floor with unlimited snacks, drinks, special treats, fruits, meals, and moreStock options / equityGym membership reimbursementMonthly team building budgetLearning/education budget Employer-paid life insuranceEmployer-paid long and short disabilityTuSimple is an Equal Opportunity Employer. This company does not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed items.Brown University, California Institute of Technology, Carnegie Mellon University, Columbia University, Cornell University, Dartmouth College, Duke University, Georgia Institute of Technology, Harvard University, Harvey Mudd College, Massachusetts Institute of Technology, North Carolina State University, Northwestern University, Princeton University, Purdue University, Rice University, Rose - Hulman Institute of Technology, Stanford University, Tufts University, University of California — Berkeley, University of California — Los Angeles, University of Illinois--Urbana-Champaign, University of Maryland--College Park, University of Massachusetts--Amherst, University of Michigan--Ann Arbor, University of Notre Dame, University of Pennsylvania, University of Southern California, University of Texas Austin, University of Washington, University of Wisconsin--Madison, Williams College, Worcester Polytechnic Institute (WPI), Yale University, MIT, CMU, Waymo, Uber, Facebook, Uber, Amazon, Cruise, Tesla, Argo AI, Baidu, DIDI, Zoox, Nutonomy, Nuro, Aptiv, Pony.Ai, Kodiak, Toyota, Nissan, GM, Ford, VW, Autonomous Car, Autonomous Driving, Robotics, Artificial Intelligence, Machine Learning, Deep learning, Perception, Prediction, Planning, Control, Anduril Industries, Sift, Nauto, Tempus, Salesforce, Automation Anywhere, SenSat, Phrasee, Defined Crowd, Pymetrics,Siemens, Socure, AEye, Rev.com, Suki.ai, Verkada, DataVisor, People.ai, AlphaSense, Icertis, Casetext, Blue River Tech, Nvidia, Bright Machines, Orbital Insight, Brighterion, H2O, Intel, Clarifa, X.ai, Zebra Medical Vision, Iris AI, Freenome, Neurala, Akamai, Zoho, ServiceNow, SalesForce, Oracle, Tableau,Splunk,Cvent, Veeam,Atlassian, DocuSign, Dropbox, Veeva Systems, Proofpoint, Cornerstone, Qualtrics. New Relic, Okta, Intralinks, MuleSoft, Freshworks, Slack, Twilio, Anaplan, Stripe, Workfront, Smartsheet, Zuora, OutSystems, Coupa, Cylance, Elastic, Zoom, SailPoint, BlackLine, iCIMS, Digitate, Qualys, Kareo, DataStax, DiscoverOrg, Siteimprove, Druva, Centrify, Looker, SimilarWeb, Odoo, Kyriba, Sumo Logic, Sisense, PagerDuty, DigitalOcean, Liquid Web, Zaloni, Databricks, ServiceTitan, Fastly, SnapLogic, Mendix, Couchbase, Egnyte, Seismic, Bill.com, Justworks, Collibra, ActiveCampaign, Schoology, SalesLoft, Cylynt,You can apply to the job with this email address: swe__senior_c___software_engineer__sae_team_4fab24622us@ivy.greenhouse.io"}