{"title":"Senior Electrical Engineer","location":"","salary":"","description":"","term":"$130,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJbg9Eo5pRbwXZU8dJ_NjpRgr4NhnfzzHqJtVJPldF-6RyW-fISAJraWiefHfv5JmYSx-XjzbrGDRdHcFPsCb8ZeWlDJc-BdxpkcZAJwtLIlLWn3QpgavVEgwwREXJEayn1hbcLue9iKDu5oEJYWa3NnvR3YyFYmjhOsa7dGsxhZxt0gKp4yKN69zbwdw","source":"ziprecruiter","full_description":"Volt is seeking a Senior Electrical Engineer in San Diego, CASummaryDesigns, develops, modifies and evaluates electronic parts, components or integrated circuitry for electronic equipment, and/or other hardware systems. Determines design approaches and parameters. Selects components and equipment based on analysis of specifications and reliability. May also review vendor capability to support product development. May use computer-assisted engineering and design software and equipment to perform assignments. Applies principles and techniques of electrical engineering to accomplish goals. Works on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors. Relies on extensive experience and judgment to plan and accomplish goals. A wide degree of creativity and latitude is expected determine methods, techniques and evaluation criteria for obtaining results. May supervise the activities of others.Essential Duties and Responsibilities include the following. Other duties may be assigned.Provides analysis related to the design, development, and implementation of electronic parts, components, or integrated circuitry for hardware systemsDevelops test strategies, devices, and systemsPlan and implement research methodology and procedures to apply principles of electrical theory to engineering projectsAnalyzes equipment to establish operating data, conducts experimental tests and evaluates resultsPerforms stress and performance tests on a variety of computer hardware including circuit boards, processors and wiringOperate computer-assisted engineering and design software and equipment to perform engineering tasksPrepares and studies technical drawings, specifications of electrical systems, to ensure conformity to standards and customer requirementsGenerates architecture for functional components and assists with product architectureDelivers hardware designs through prototype, beta, and production release in compliance with product development process and quality practicesSupports existing products by troubleshooting and failure analysisGenerates architecture for functional components and assist with product architectureParticipates in technical design reviews of existing designs and peer reviewsCompile data and write reports regarding existing and potential engineering studies and projectsDocuments and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, and chartsProvides information by collecting, analyzing, and summarizing development and service issuesAwareness and understanding of advanced technology and its applicability to company productsDevelops statement of work, prepares related schedules for broad set of engineering activities within discipline or related disciplineDevelop budgets, estimating labor, material, and construction costsBriefs others on deliverables, status and progressDaily availability to include evenings and weekends when necessary to reach goals and deadlines.Qualifications To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Education and/or Experience Bachelor's degree (B.S.) from four-year college or university in a related field and 10-15 years of directly related experience and/or training; or equivalent combination of education and experienceLanguage SkillsAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulationsAbility to write reports, business correspondence, and procedure manualsAbility to effectively present information and respond to questions from groups of managers, clients, customers, and the general publicMathematical SkillsAbility to work with mathematical concepts such as probability and statistical inference, and fundamentals of solid geometry and trigonometryAbility to apply concepts such as fractions, percentages, ratios, and proportions to practical situationsReasoning AbilityAbility to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization existsAbility to interpret a variety of instructions furnished in written, oral, diagram, or schedule formComputer SkillsKnowledge of applicable database and ERP software; MS Office including PowerPoint, Publisher, Outlook, Excel, MS Project, and Word applicationsVolt is an Equal Opportunity Employer"}