{"title":"Full Stack Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKLLIkDDjerEVt_7wMooFgz15YCshRCnRgnZ_elhwy22IEfppG6jXjSR-3OL8iWpAhAh2NHunnvSAdqOPMTqH9yntaFMGuvZmvn-5JKZbstE-DBC62FJwS8HVdjGn4nre0ySpKgs7xbN5xeLDmqzYUnZgJByooHpV8f2kQiiDeswE4HFuVXUhM3UYuBTms","source":"ziprecruiter","full_description":"Job Title: Full Stack Engineer (All Levels)Location: “Work From Anywhere” in the Continental United States (WFA-Remote) with the ability to travel to the Greater Washington D.C. Metropolitan Area from time to timePosition Type: Full-Time, W-2 EmploymentSalary Range: Market competitive. Salary range dependent on skills and experience.Total compensation includes a competitive salary, cash and strategicincentives, professional development and comprehensive benefits.Experience: Looking for all levels of engineers with at least 4 years of experience;more senior candidates will have 8 or more years of relevantprofessional experience.Education: Bachelor’s degree in a highly quantitative field (Computer Science, Machine Learning, Operational Research, Statistics, Mathematics, etc.) OR 3+ years of directly related experienceCitizenship and Security: U.S. Citizenship is required along with the ability to obtain a government sponsored Secret security clearance.Role Overview: The Full Stack Engineer performs engineering and development-oriented tasks to planand support the integration of data and systems into a coherent whole as part of a broaderdevelopment team. This team includes data scientists, analysts, engineers, and subject matter experts.The Full Stack Engineer will support and learn to employ leading edge development technologies,including functional programming languages, containerization, cloud-based architectures, andmicroservices environments. Work with a high performing team with other experts in the field to listen,expand upon, and implement enterprise technology solutions. Agile team-based environment where theclient and support team are all remote leveraging modern development and collaboration tools.Development environment will focus on Continuous Integration and Continuous Development (CI/CD)using Test Driven Development (TDD). Most engagements will support a microservices environmentworking in cloud-based technologies using containerized solutions. Our development team also prefersengagements in functional-based programming languages such as Clojure and ClojureScript, butexperience or familiarity in these technologies is not required (but a healthy interest and curiosity is).Minimum Required Experience:● Experience in full stack development to include Java, web services, databases, and/or webapplication development;● Experience with agile and lean philosophies;● Experience with DevSecOps tools and processes to include, but not limited to Git, Concourse,SonarQube, Fortify and ThreadFix;● Experience with XP, CI/CD Integration, and Test Driven Development (TDD);● Experience with container technologies such as Docker or Kubernetes;● Ability to present work to stakeholders and teammates, in varying degrees of technical detail;● A willingness to share and learn in a collaborative, peer/paired programming environment,inclusive of mob programming and Agile-based project management and mentoring techniques;● Possess a general interest in data science and data engineering, as well as related analytictechnologies, inclusive of Artificial Intelligence (AI) and Machine Learning (ML).General personal traits we know will connect well with the team:● A positive, willing attitude;● An ability to think on your feet and solve problems quickly;● Can learn new technologies on the fly;● Enjoys working in an agile team environment;● Technology and methodology agnostic, but knows when to apply the right tool to therequirement;● Self-starter.About ATA: Our core business as “The Full Stack Data Science Company” focuses on unifying data,infrastructure and analytics bringing the same rigor and automation to the development anddeployment of Artificial Intelligence and Machine Learning (AI/ML) models, data and data scienceapplications as one would to any modern software project. We are successfully engaged with a numberof commercial and government organizations working in a variety of functional disciplines, including:Finance, Logistics, Manned and Unmanned Aviation, Command and Control, Intelligence, Cyber, andHigher Ed/Humanities. We believe this diversity of infrastructure, data, and application experience isvaluable and is one of the attributes that sets ATA apart.Summary of Benefits: We expect each member of our team to fully engage creatively and workcollaboratively and perform each day to the best of their ability. To support this, we have created abenefit package focused on professional growth, achieving a healthy work-life balance, and participationin the long-term success of the company. Our benefits include: unlimited PTO days; an EmployeeStakeholder Strategic Incentive Program (ESSIP); continuous learning culture with PlusOne (mini-TEDx-like events), Internal Investment Projects (IIP), meet-ups and other professional development activities;performance incentives that include spot bonuses and recruiting bonuses; 3% 401k Safe Harborcontributions; Medical/Dental/Vision, Long & Short-term Disability, AD&D insurance, and Life Insurance.Each team member is also provided a benefits addendum that are added benefits tailored to your roleto help you be more successful on day one."}