{"title":"Field Service Technician - New York Metro Area NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAILvDXQFxMVrrGI-U_4RNababOt2uyJOO_hnT2fZg-gYfQ0S9hfDBC5ZwJNYNEZdUt9ES2IaXyJM1N0lunyGKWSxfKQbIlMBnALpQqAk7CYRwQz16z6ZDLjGdYo0DIazxSW8S2yCAe-7J9JjtNN4a-6CbkBWR_SgMln-u9QT3eBdOtH0izGy2J2P9Vz9sA","source":"ziprecruiter","full_description":"POSITION SUMMARY:This position will be responsible to manage the Diversey business on an assigned territory, meeting contracted service level agreements included, but not limited to the following application areas: Laundry, Kitchen and Housekeeping, Industrial Food Safety, and Sanitation Audit completion.The Technical Specialist communicates our Value Proposal, builds and maintains strong relationships with customers. the survey, Install, Maintain and Repair Dosing and Dispensing platforms and Dish Machines on lease at customer sites. Properly train End-Users on products, cleaning procedures, and safe equipment use to ensure best results in cleaning and sanitation.This position uses emerging electronic technology for communication, reporting, and auditing.RESPONSIBILITIES:Communicate our value proposition to the customer and ensure an outstanding experience with the Diversey cleaning and sanitation program.Establish excellent relationships at all customer organization levels (end users /supervisors/managers).Ensure an environment of total security by full adherence to policies, procedures, and better working practices raised by the EHS department.Surveys and Installations: Install Dosing equipment following Standard Operating Procedures.Routine visits: Visit customers per plan, following service level agreements. Maintain our existent dosing equipment platforms in working conditions. Demonstrate safe equipment use. Training customers on Safety Data Sheets, cleaning procedures, product Information, inventory/PAR stock /Purchasing Orders/ Diversey program compliance. Recap areas of focus, pending issues follow up, customer satisfaction - Voice of CustomerBreak/Fix: Diagnose and resolve technical problems and/or conditions driving poor results/customer complaints. Repair Diversey Dishwasher machines and Dosing and Dispensing Equipment following priorities and time responses agreed on the service level agreement.Administrative Duties: Complete timesheet daily. Follow up on equipment and parts purchasing orders. Manage adequate inventory levels in Truck and Storage units. Document consumption of equipment and parts at customer sites. Review the weekly customer visit plan with your manager.Complete paid annual training program. Safety training is mandated.REQUIRED QUALIFICATIONS:High School diploma or G.E.D. required.1+ years field service experience, maintaining industrial equipment / mechanical problem solving, or 2+ years experience selling cleaning solutions or equipment for Hospitality, Food Service business.Availability to support business needs (emergency calls) which may happen during the evening/night, weekends, and over holidays.Computer technology experience - Email, Excel, Word, Google Apps, Cell Apps.Possess a valid US Driver's License with a good driving record and the ability to drive for extended periods.Physical Requirements: lifting/carrying objects up to 40lbs and executing precise work with hands in limited spacesADDITIONAL QUALIFICATIONS:Experience with Salesforce (FSL) preferred.Ability to use hand and powered tools.Plumbing and electrical skills are required.Professional attitude and be self-motivated/directedAttention to detail, Time management, communication skills, decision making, interpersonal relationships, computer, and organizational skills.Ability to work cross-functionally to achieve company goals***PLEASE NOTE THAT THIS IS AN EVERGREEN POSTING.***All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability or protected veteran status.As an equal employment opportunity employer, Diversey provides reasonable accommodations to qualified individuals with disabilities to enable them to be considered for any position to be filled unless the accommodation would pose an undue hardship. Should you require a reasonable accommodation in order to complete the hiring process, please contact our Human Resources Department athrquestions_us@diversey.com."}