{"title":"Laboratory Research Specialist (Medicinal Chemist)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ4h5xsqvGOvA5W0Gbcy4DpnUGZSKpbfxVRj5Lzxbjuslzg3FqUS8yTNGdBPcEA8dSCqOxOvG9n_YewpqiDUjWDNvJsjJPrEIxJXNgz21b1hZ0TMO9VGpbPA77Y9w6mFQXfowsxc93Pgc1g28tWkZUP6WvL26RINdbVneMe_UiKG37LuCR-QHQzNyazcyXA","source":"ziprecruiter","full_description":"Job DescriptionDepartmentCLINICAL PHARMACOLOGY (IN-CPHR-IUINA) Department InformationWe are seeking a highly motivated, passionate, and proactive chemist to perform early drug discovery research within a dynamic and innovative academic setting. Alzheimer's Disease (AD) is a major cause of death and disability in the United States. The National Alzheimer's Project Act has created opportunities to build upon National Institute of Health (NIH) efforts to revitalize and accelerate drug development with a goal of identifying treatments for AD by the year 2025. In order to meet this ambitious goal, the IUSM-Purdue TREAT-AD Center was established to generate high quality lead molecules against novel biological targets emerging from the NIH AMP-AD initiative. The Medicinal Chemistry and Chemical Biology (MCCB) Core was established as a nexus point of the Center to achieve our primary objective of designing high quality lead molecules suitable for further optimization into drug candidates. The MCCB Core complements the deep AD biology expertise and core technologies of the Center with the medicinal chemistry expertise required to create a diverse portfolio of drug-like small molecules. Given the academic, biotech-like nature of our Center, the cultural fit of a successful candidate is an important criterion for success. Desired characteristics include a \"can do\" attitude, a high level of curiosity and self-motivation, and the ability to work independently and collaboratively with others.Job SummaryIn this position your primary responsibilities, in collaboration with other Center scientists, will be to evaluate promising AD targets, develop strategies to synthesize small molecule ligands for these targets, review physicochemical and biological data, and optimize leads for sufficient target engagement in vivo. You will also be responsible for establishing medicinal chemistry labs within the IU School of Medicine's Biotechnology Research & Training Center (BRTC) on the near-west side of Indianapolis. The labs, along with supporting facilities, include a combined working area of approximately 10,000 sq.ft. and includes 6 chemistry labs, of approximately 2,800 combined sq. ft., for synthesis. You will participate in applying for and maintaining external funding. Along with the establishment of the new labs and obtaining external funding, you will have the opportunity to hire, supervise, mentor, and provide training for staff as well as partner with external collaborators and contract research organizations.Leads the planning and development for a variety of research projects and initiatives, including but not limited to, designing and executing experiments, conducting high-level scientific problem solving, and applying for and maintaining external funding. Supervises, mentors, and provides training for less experienced staff. May partner with external companies and agencies for information sharing or product development. Requires comprehensive knowledge and understanding of principles, practices, procedures, and skills necessary to perform in profession or area of specialization. Requires advanced understanding of organizational technologies and practicesThis position requires the ability to identify and resolve increasingly complex problems/issues/ assignments Requires advanced problem-solving skills and techniques. Often responsible for resolving unclear situations utilizing expertise in specialized field. Requires the ability to exercise sound judgment and apply expert analysis techniques within area of specialization to make decision. Decision-making authority extends beyond the functional area to include unit/team Sets priorities and/or sequence of tasks to achieve objectives with minimal oversight.Required QualificationsMust meet one of the following qualifications: Master's degree in science and four years of research experience; ORBachelor's degree in science and six years of research experience. Proficient communication skills. Maintains a high degree of professionalism. Demonstrated time management and priority setting skills. Demonstrates a high commitment to quality. Possesses flexibility to work in a fast paced, dynamic environment. Seeks to acquire knowledge in area of specialty. Highly thorough and dependable. Possesses a high degree of initiative.Preferred QualificationsPh.D. or Master's degree in organic chemistry, medicinal chemistry, chemical biology, or a closely related field. Knowledge of general chemistry, organic synthesis, and related laboratory techniques. Expert in synthetic methodologies, retro-synthetic analysis, purification, and verification of chemical structure. Experience in designing and synthesizing sets of compounds for structure-activity relationship (SAR) studies. Experience with a wide variety of analytical techniques and methodologies (e.g. HPLC, UHPLC, LCMS, gas chromatography, NMR, mass spec, FT-IR, etc.). Basic skills in communication, word processing, database searching, data entry, and data analysis (e.g. ChemDraw, Reaxys, SciFinder, Microsoft Office365, including Word, Excel, and PowerPoint.).Job ClassificationCareer Level: AdvancedFLSA: ExemptJob Function: ResearchJob Family: Laboratory Research Click here to learn more about Indiana University's Job Framework.Posting DisclaimerDue to the COVID-19 pandemic, there may be differences in the working conditions as advertised in our standard job postings (e.g., the ability to travel from one campus to another, etc.). If you are invited for an interview, please discuss your questions or concerns regarding the working conditions at that time. This posting is scheduled to close at 11:59 pm EST on the advertised Close Date. This posting may be closed at any time at the discretion of the University, but will remain open for a minimum of 5 business days. To guarantee full consideration, please submit your application within 5 business days of the Posted Date.If you wish to include a cover letter, you may include it with your resume when uploading attachments.Equal Employment OpportunityIndiana University is an equal employment and affirmative action employer and a provider of ADA services. All qualified applicants will receive consideration for employment without regard to age, ethnicity, color, race, religion, sex, sexual orientation, gender identity or expression, genetic information, marital status, national origin, disability status or protected veteran status. Indiana University does not discriminate on the basis of sex in its educational programs and activities, including employment and admission, as required by Title IX. Questions or complaints regarding Title IX may be referred to the U.S. Department of Education Office for Civil Rights or the university Title IX Coordinator. See Indiana University's Notice of Non-Discrimination here which includes contact information.Campus Safety and SecurityThe Annual Security and Fire Safety Report, containing policy statements, crime and fire statistics for all Indiana University campuses, is available online. You may also request a physical copy by emailing IU Public Safety at [ Link Removed ] or by visiting IUPD.Contact UsRequest SupportTelephone: [ Phone number blocked ] Qualifications: We are seeking a highly motivated, passionate, and proactive chemist to perform early drug discovery research within a dynamic and innovative academic setting. Alzheimer's Disease (AD) is a major cause of death and disability in the United States. The National Alzheimer's Project Act has created opportunities to build upon National Institute of Health (NIH) efforts to revitalize and accelerate drug development with a goal of identifying treatments for AD by the year 2025. In order to meet this ambitious goal, the IUSM-Purdue TREAT-AD Center was established to generate high quality lead molecules against novel biological targets emerging from the NIH AMP-AD initiative. The Medicinal Chemistry and Chemical Biology (MCCB) Core was established as a nexus point of the Center to achieve our primary objective of designing high quality lead molecules suitable for further optimization into drug candidates. The MCCB Core complements the deep AD biology expertise and core technologies of the Center with the medicinal chemistry expertise required to create a diverse portfolio of drug-like small molecules. Given the academic, biotech-like nature of our Center, the cultural fit of a successful candidate is an important criterion for success. Desired characteristics include a \"can do\" attitude, a high level of curiosity and self-motivation, and the ability to work independently and collaboratively with others., Must meet one of the following qualifications: * Master's degree in science and four years of research experience; OR * Bachelor's degree in science and six years of research experience. Proficient communication skills. Maintains a high degree of professionalism. Demonstrated time management and priority setting skills. Demonstrates a high commitment to quality. Possesses flexibility to work in a fast paced, dynamic environment. Seeks to acquire knowledge in area of specialty. Highly thorough and dependable. Possesses a high degree of initiative., Ph.D. or Master's degree in organic chemistry, medicinal chemistry, chemical biology, or a closely related field. Knowledge of general chemistry, organic synthesis, and related laboratory techniques. Expert in synthetic methodologies, retro-synthetic analysis, purification, and verification of chemical structure. Experience in designing and synthesizing sets of compounds for st..."}