{"title":"Lead Structural Engineer - EPC Industrial Systems for Ag Prod. Fac. NEW!","location":"","salary":"","description":"","term":"$100,000 to $120,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIiXwfSbzltCfgsatvmhlpYAS4citD9ZOGiOO4FEZe_GYPUOJXKOGFlMulT7UttebWHM4-or8pbt-LrLMTzjkQQZKi8dyP1sHiGowk4GjB7IbHvX4_UXtvb-t5o4uUxmVS4a6AMsUzYNmWX13eyT4m66Y07BsYnXv80rAnQxsAOIWRnWrqHGJu5V3DMYjUn","source":"ziprecruiter","full_description":"Lead Structural Engineer – EPC Industrial Systems and Fabrication Packages for Agricultural Production FacilitiesLarge Design-Build Protein Production Facilities – Ag Industrial SystemsLocation: Remote Based – up to 25% travel. Ideally Midwestern basedCompensation: 100-120K + vehicle and full benefitsAbout this Opportunity:We’re looking for an innovative structural engineer that breaks the mold…someone that doesn’t engineer for the sake of engineering alone but as a collaborator on a design-build team which treats every owner/client project as a new opportunity to build a higher performing production environment. This is a career defining role with a national leader of agricultural industrial design-build construction projects where you can shape new conceptual design ideas and follow them through to completion.· This is an opportunity to build something special as part of a high growth business unit in a stable, financially strong privately help business.· Empowerment and support of a great leadership team. Opportunity to grow not only in job function, but also as a leader under the coaching of great leaders.· Collaborative, healthy company culture focused on making a difference in the lives of others.· Excitement of shaping an industry vertical (protein production) in design-build, first of its kind projects through collaboration directly with end-users and their production processes.· Break free from the adversarial plan/spec. world and experience the energy of a collaborative internal/external team focused on creating higher order value for end-user owners.· Career Visibility – Finding a better way to build always requires the security of a well-engineered framework. This role is the cornerstone of that provision. Creative yet sound. In collaboration with the integrated project delivery team, the result is an unusual combination of higher order client value and precision project outcomes.What we are looking for:· Bachelor’s degree in Engineering (Civil, Structural, Construction related)· 5+ years of design engineering for structural steel applications (wood structural experience also a plus).· Ideal backgrounds include but not limited to Steel Fabrication packages, Pre-Engineered Metal Buildings, Post Frame buildings, Engineered Truss packages, Industrial Fabricators, Millwright contractors etc.· PE valued but not required· Value Engineering - An eye for sustainable quality and low life cycle operating costs in a less restrictive building code (Ag exempt) environment.· Design-Build – able to translate engineering into constructability and broader facility operating purposes beyond singular engineering elements· Proactive Problem Solver – Anticipates what the client left out and/or how to accomplish design rigor with better long term solutions.· Connection to Agriculture – passionate about the contribution of agriculture in our society and the importance of bringing innovation to scalable, cost effective, environmentally conscious food production practices.· Some travel – up to 25%· Remote based options – though there is a preference for a candidate located or able to locate in the Midwest for national scope agricultural projects marketsOpportunity begins with dialogue. If this sounds like a role you would like to discuss, please send me your qualifications or contact me, Rebecca Crowl, at (855) 267-7446 x 207. All inquiries will be treated confidentially and your resume will never go anywhere without your authorization and awareness."}