{"title":"Android Engineer (USA)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIBOgEQowjgbDEv8rZAPdADz8sf3qdklBF-0VWn9_Bjilmopk-Pb-wKEYv8fXSurpcWiUUwsKQ_Vl1fM-8woEdWuggb5a7bmEjVd1QnWmqCin0V5kxvoYxCuszzYZZuSFtkGDi1Zd6xFpFxM6fS-F629ugap5wnC9oE1INBYiReAXwYeGWXiXLI95UXF6s","source":"ziprecruiter","full_description":"BlockFi is a high growth startup building bridges between traditional finance and digital markets that enable growth for all participants. Our mission is to provide liquidity, transparency and efficiency to digital financial markets by creating products that meet the needs of consumers and corporations across the globe.This is fully remote role affiliated with our team based in the US/LATAM.Who We NeedWe're building the mobile apps our clients use to interact with BlockFi's products. We're looking for experienced Android developers to join our Mobile product team to help design and develop our native Android app! If you have experience developing Android apps with either Kotlin or Java (we use Kotlin) we'd love to talk to you!About the RoleThe Mobile product team at BlockFi is responsible for UX, Design, Development, Release, and Support of our native Android and iOS apps. On the Mobile product team, you will:Collaborate with Product Managers, Designers, and Developers on the design, usability, and development of the BlockFi Android appDevelop, Test, and Release updates to the Android app together with a small team of Android developersWrite performant, non-blocking code that provides a pleasant user experience for BlockFi clientsDevelop features that visualize or summarize information about Cryptocurrency for BlockFi clients using the Android appProvide mentorship and guidance to fellow teammates, and likewise receive mentorship and guidance from themAbout YouExperience developing native Android applications with Java or KotlinAn understanding of asynchronous programming on the JVM and how that relates to Android performanceAn appreciation for Material Design and a desire to adhere to its design principlesWhy BlockFi?BlockFi has experienced incredible growth since our launch in August 2017. From raising over $100MM in debt and equity capital to helping thousands of clients (and growing!) do more with their crypto assets, we have established a dominant position as the debt and credit crypto market leader in the U.S. As we expand our product suite and geographic footprint, our addressable market will grow exponentially.BlockFi's leadership team has decades of experience in the traditional financial services and banking world, and we take a conservative approach to regulation that will position us well for sustainable long-term growth and expansion.Our team consists of highly motivated professionals from diverse backgrounds. We are aiming to become the leading lender in crypto and are poised to redefine the global financial ecosystem for the better. In addition:BlockFi is one of the first companies to ever offer crypto-backed loans and the only company whose founding team has an institutional understanding of the debt capital markets and regulatory landscape in the U.S.$4.3MM of seed funding and $50MM in capital for funding loans$100 MM of Series A, B, and C funding led by Valar Ventures with participation from Susquehanna, Winklevoss Capital, Fidelity, Galaxy Digital, Akuna Capital, and Morgan CreekWe are moving quickly and have already deployed substantial capital into the space, proving our ability to execute and capture customer demandWe OfferCompetitive salaryUnlimited vacation / sick days (which we actually want you to use!)Work alongside an enthusiastic, collegial, and driven team in a diverse and equitable environmentTo read more about our mission and values, check out our company website.Above all, you should enjoy the journey. We, at BlockFi, genuinely like each other and enjoy the work we do - so should you!"}