{"title":"Raw Materials Specialist - Chemistry NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKTciduSRXNe4YWIW9s2wYtB0jI8_NTAMQ--INk8u2AqcZypjFFTHE1mGW5qAxGifY2dttkcCMi_afxq7MXQW2h1EEIuAbgUnVsqrsF9dp6VhDxagt5XZb8ZoiQIX8vPMaRm4D7PSyJ61cbCe_CyKUZCswGxIcNmq43c7ogHqyh6B4cY_tGJBTPSnVB_Q","source":"ziprecruiter","full_description":"Raw Materials Specialist - ChemistryPosition OverviewATL is seeking a dynamic Raw Materials Specialist - Chemistry to join our team of dedicated professionals focused on client service and quality. Major Responsibilities:Management and storage of raw material documentation related to consumer goods productsIdentifies what supporting documentation is needed to support a raw material including technical specification, certification of analysis, compliance with limits/regulations, etc.Reviews current documentation versus a checklist, identifies documentation gaps and outlines what is needed to manage the gap via gathering the supporting documentation; collaborates with the contract manufacturer to obtain the documentation as neededConducts literature searches to identify safety data to enable toxicologist to make a safety assessmentUploads and manages raw material documentation and supporting project documentation into agreed locationRequirements:Associates degree in Chemistry, Biology or related scientific disciplineExperience in searching scientific literature and publications will be very helpful in this roleExcellent computer skills- (excel, Word, internet searching), strong biology/chemistry background and experience in literature searching (science journals)Strong attention to detail and proficient problem solving skillsExcellent communication skills – written and verbalRequires ability to work collaboratively with several groups to compile the data into and understandable formatAbility to summarize the data to ensure no mistakes are madeCompany OverviewAt ATL, we don’t just do the science, we have the opportunity to transform organizations. We need people who want to grow with us and contribute directly to our clients’ success. As scientific sourcing experts, the largest and most respected companies in the world ask us to create innovative solutions to big problems. We have more input and influence, so we can have a significant impact on brand-name products and visible projects. And you can play a bigger role.Interested and qualified candidates, please apply with a resume and salary requirements.ATL offers a comprehensive benefits package including: Medical, Dental, Vision, Life Insurance, Short Term Disability, Long Term Disability, Pet Insurance, a 401(k) Retirement Plan with company contribution, Paid Time Off, and an Associate Assistance Plan. In addition, we offer a competitive salary and the advantage of a professional environment that supports your development and recognizes your achievements. ATL is an Equal Opportunity Employer (EOE) and strongly supports diversity in the workplace."}