{"title":"Network Engineer/Sr. Systems Administrator (#1706559) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJCu4w2xWwLqFiZkI_bj6K3nyAR8uXiIoP3CPCrFzyyxvvsdooXToxCY--Y8HBzyrw20pXBp7PyAz1Yza25XIwL6h7I5gk8mnR5oatBxaatXtaW8qrWzlllDlYqUWPN9Rl0_C3NM8RFyiPT7uTPf10rSINWhFwZgSoNORDoF6VUxCOdpQT-S3sqx1yAr6I","source":"ziprecruiter","full_description":"PeopleTec is currently seeking a Network Engineer/Sr. Systems Administrator to support our Huntsville, AL location.-The candidate will provide System/Network Administration and Cyber Security support for the Aviation Systems Integration Facility (ASIF) team in the S3I directorate of CCDC. Responsibilities include: design, deploy, configure, secure, and maintain all ASIF lab infrastructure components. The ASIF is an air-gapped unclassified testing data center created and maintained to provide project access to Army Aviation components to test/simulate software and communications scenarios. The candidate will also support the successful RMF reaccreditation of the ASIF lab network.-Required Skills/Experience:Networking/ Cisco, Microsoft (Server, Infrastructure, and Workstation), VMware ESX-i, VMware V-Center Server, Data Center/Enterprise storage networks10 years experience in systems administration / cybersecurity / networking Security+ CertificationTravel: NoneMust be a U.S. CitizenAn active DoD Secret clearance is required to perform this work. Candidates are required to have an active Secret clearance upon hire, and the ability to maintain this level of clearance during their employment. -Education Requirements:Bachelor's of Science or Engineering with 10+ years of experience-Physical Job Requirements:Ability to physically configure network and IT components to include servers, computers and other ancillary equipment as well as pull cables and develop cable runs-Desired Skills:Former military or defense contractor experience Security+ CompTIA Advanced Security PractitionerCisco Certified Network Professional Hyper-converged solutionsVarious Network troubleshooting utilitiesDISA SCC, DISA STIGS, ACAS, Nessus, Solar Winds, WSUS, Active Directory, NAS/VMFS/VSAN, RMF, Linux-People First. Technology Always.PeopleTec, Inc. is an employee-owned small business founded in Huntsville, AL that provides exceptional customer support by employing and retaining a highly skilled workforce.Culture: The name \"PeopleTec\" was deliberately chosen to remind us of our core value system - our people. Our company's foundation was built on placing our employees and customers first. With an award-winning atmosphere, we have matured into a company that boasts the best and brightest across multiple technical fields.Career: At PeopleTec, we value your long-term goals. Whether it's through our continuing-education opportunities, our robust training programs, or our \"People First\" benefits package, PeopleTec truly believes that our best investments are our people.Come Experience It. #cjpost #dpostEOE/Minorities/Females/Veterans/DisabledPeopleTec, Inc. is an Equal Employment Opportunity employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in its job application procedures. If you have any difficulty using our online system and you need an accommodation due to a disability, you may use the following email address, HR@peopletec.com and/or phone number (256.319.3800) to contact us about your interest in employment with PeopleTec, Inc.All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, genetic information, citizenship, ancestry, marital status, protected veteran status, disability status or any other status protected by federal, state, or local law. PeopleTec, Inc. participates in E-Verify.Employment Type: FULL_TIME"}