{"title":"OSP Field Engineer I & II or III","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALwgNUM50WRL1MPssrKXUyj6dO_E1xiPt7E25IruUKMzVHYnhN0r-NuwqtWU6VAmzBHRvdNTaEkAT2ujwiZEeVMsOEFuhBBigarHB4tAyTfcM06g3Z5D6s91Abt_YEDgBaZ04fy9-i5mFgq-49GJvHNUwDnrp2Obl1GBpAX8zRk-gyHMqWgKlkqkLZ5BAqE","source":"ziprecruiter","full_description":"MetroNet has an immediate opening for an energetic; OSP Field Engineer!At MetroNet, we pride ourselves on providing cutting-edge technology combined with outstanding customer care. We are a fast-growing telecommunication company, offering 100% fiber-optic technology. MetroNet specializes in fiber to the premise TV, voice and internet services that provide our customers with some of the fastest internet speeds in the world. Recognized for being one of the Best Places to Work in 2020 by Glassdoor. We are committed to revolutionizing the industry by enhancing the overall customer experience and optimizing the talent of our valued associates. We’re looking for tech-savvy, innovative thinkers to join our team and help us create what’s next!What is in it for you?Competitive total compensation package80% of Medical premiums paid for by companyCompany paid Disability and Life insurance401(k) company match and 100% vested on day 1Discounted MetroNet service in our serviceable areaCell phone allowanceLocally owned, friendly, fun atmosphereJob Summary:Accurate and safe construction of MetroNet’s network to MetroNet’s standards is vital to the success of MetroNet’s future. MetroNet’s OSP Engineer is on the frontline. They are the boots-on-the-ground for MetroNet. The OSP Engineer insures construction is built safely and to the required standards and specifications.One of MetroNet’s values is delighting the community in which we work. We realize our future customers come from those neighborhoods where we are doing construction. It is therefore important for the OSP Engineers to respond quickly to neighborhood complaints and actively work to resolve the issues. An OSP Engineer will find themselves in many various roles throughout a typical day. They need to have skills, experience and behavioral traits that are necessary for their role as an inspector, an investigator, a leader and manager of construction crews, an ambassador on behalf of MetroNet to resolve complaints within the community, and other various roles.What you will be doing:Maintains clear understanding of MetroNet specifications, standard practices, and safety complianceConducts walkouts with contractors of completed construction to inspect completed work for accuracy and qualityApproves all unitized completed work done to MetroNet’s standardsManages the OSP Construction TrackerMonitors the approved budget for each of their work ordersPhysically completes inspections of completed work which will require walking long distances, and potentially uneven and/or less than ideal ground conditions each day with contractorsResponds to utility strikes, conducts investigation, completes documentation of said strike within 24 hours and retrains the contractor or terminates them if necessaryConducts a weekly audit for each contractor of their safety, construction, and quality practicesIdentifies contractor training needs and arranges for the contractor to get the trainingEnsures contractors have a weekly safety and communications tailgate meeting with their employees and will assist the contractor in scheduling periodic damage prevention tailgates conducted by the local gas utility in the language which the employees are fluentWhat You Need For This Position:A High School Diploma or general education degree (GED); or three (3) to five (5) years related experience and/or training; or equivalent combination of education and experience.Ability to work independently with minimal managerial supervisionWorks well under pressureMust have great diplomacy skillsCommitted to and driven by quality and safetyAbility to apply common sense understanding to carry out instructions furnished in written, oral or diagram form.Ability to distinguish between general audience information and confidential information and to maintain confidentiality at all times.Ability to manage multiple tasks at the same time and recognize which tasks are more urgent or require more attentionMust have and maintain a valid driver license and a clean driving record (no DUIs or serious traffic violations).If you have a strong desire to impact, the success of our organization by ensuring we continue to attract and retain committed professionals, please apply today!MetroNet is an EQUAL OPPORTUNITY EMPLOYER#ZR"}