{"title":"Field Service Technician","location":"","salary":"","description":"","term":"$22 to $25 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALBwUDEzbMHvhTLrh6yg7UJG-H47nlEncIvRkoUMBvzLmqWwFZODUyPefV_bMbrqdvaFb4a01Vz_SBNhW9P2AzBwY0F-X1UwcjrISbOAQaHAQPWO11Bg0DpxVXWyYjSWHkbDp2ec802aF0oakmn7qiFvnT9krHyVKwZs2JovkmcistToCqV3Rjelz0r1w","source":"ziprecruiter","full_description":"We are in search of self-starters to help support our bank customers throughout the greater Puget Sound Region. We are a growing family-owned company based in Seattle, Washington. The ideal candidate for this position is comfortable with diagnostic tools and possesses a strong aptitude for technical troubleshooting of software interfaced with mechanical hardware. The equipment we install and support is mechanical for automating the processing of cash and interfaced to customer systems with proprietary software. Candidate must be willing to regularly drive several hours from one client to the next. Must also be able to travel (paid) for training, especially immediately after hire. Candidate will be trained on the job and then be expected to configure Windows based software, firmware of equipment, strong understand of network environments, and repair of mechanical equipment (automated cash vaults, currency counters, coin sorters, document scanners, and other banking and document processing equipment). Candidate will have access to ongoing internal and external support. This position is a hybrid of software configuration and support along with hardware configuration and support.The ideal applicant will be able to demonstrate:Ability to handle multiple service calls efficientlyEfficiency in problem-solving and multi-taskingAptitude and interest in mechanical operation of electronic equipmentProficiency with newest computer programs (e.g. Windows 7,10)Experience with Microsoft Office applicationsDesire to learn other software applicationsAbility to operate independentlyEffective written and verbal skillsAbility to demonstrate time management and organizational skillsEffective research capabilitiesAbility to work as a team memberAdditional RequirementsAbility to read, write, and speak English fluentlyAbility to lift up to 50 lbs.Have a reliable car or truck (Mileage driven for work is reimbursed)All applicants must be authorized to work in the United States and pass a pre-employment background checkWe will be reviewing resumes and scheduling phone interviews with some applicants. In-person interviews will then be scheduled for qualified and interested candidates. We have an immediate opening for this position. Experience is not required as we are more interested in finding a quality candidate and helping you grow and succeed within our company.Protecting staff and customers due to COVID-19 is still our top priority. We have strategies and procedures to serve the essential banking industry. We have a strong sense of duty to do our part in protecting the communities we support. We look forward to adding a great person to our strong team"}