{"title":"Research & Development Technician NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ4gnh0wrkAvQYhHxEzpM_zm1QH3Xp7w26qvn2QGKTE9Zyo9QdBxlUGLxWu3UR0X54XDerS60TAWs64DCEb8RElbPFenb8WFl3VsL9KeO0TfP4BGU5pbYYocjm707ohFKxFUUYRRHNa0wsg4l6YYS8z9oGXIGk2SOhzjpjYRbFpQX2rhWGvuA-ySjf174ya","source":"ziprecruiter","full_description":"MetroNet has an immediate opening for an energetic Research & Development Technician!At MetroNet, we pride ourselves on providing cutting-edge technology combined with outstanding customer care. We are a fast-growing telecommunication company, offering 100% fiber-optic technology. MetroNet specializes in fiber to the premise TV, voice and internet services that provide our customers with some of the fastest internet speeds in the world. Recognized for being one of the Best Places to Work in 2020 by Glassdoor. We are committed to revolutionizing the industry by enhancing the overall customer experience and optimizing the talent of our valued associates.We’re looking for tech-savvy, innovative thinkers to join our team and help us create what’s next!What is in it for you?Competitive total compensation package80% of Medical premiums paid for by companyCompany paid Disability and Life insurance401(k) company match and 100% vested on day 1Discounted MetroNet service in our serviceable areaLocally owned, friendly, fun atmosphereJob Summary:This position is primarily responsible for evaluating customer premise equipment and ensuring the network interoperations with our service delivery platforms. The evaluation includes initial discovery as well as periodic retesting for software updates and new service configurations. This position requires the creation and execution of test plan documentation and operational support documentation. New products and services require coordination with multiple teams including our Network Engineering, Business Operations, Field Services, Customer Care and Management Information System teams.What you will be doing:Must be highly organized and have a focus on attention to detailKnowledge of fiber internet, IPTV, and VoIP/SIP servicesAbility to create test plans, maintain test records, and communicate test resultsAbility to assemble and test according to general guidelinesAbility to develop operational support documentation aimed at the Business Operations and Field Operations teams, including but not limited to instructions on how to deploy, configure, install, troubleshoot, and support our products & servicesAbility to participate in cross-functional projects as scheduledInterface directly with multiple department’s engineers and managersUpdate and develop testing proceduresEvaluate telecom software and hardwareCapable of meeting deadlinesWorks well with others as well as independently; acts as an owner and drives projects to completionWhat You Need For This Position:3 yrs of related telecommunications or product testing experienceBS in Electrical Engineering or Computer Science or equivalent Military training is a plusLAN and WAN hardware configuration experienceWireless/WLAN Technologies - 802.11n,ac,axNetwork protocols – IPv4, IPv6, DHCP, DNS, IGMP, SIP, POTS, OSPFNetwork Analysis Tools - Wireshark, NMAP, Iperf, Wireless Spectrum AnalyzersSub netting, routing, switching familiarizationNetwork Security fundamentals and best practicesSome experience with Windows/Linux ServersMicrosoft Office Suite including Excel, Visio, Word, PowerPointTechnical aptitudeAttention to detailIssue managementCommunication skillsOrganizational skillsEntrepreneurial spiritPersistence, can-do attitudeCritical thinking skillsIf you have a strong desire to impact, the success of our organization by ensuring we continue to attract and retain committed professionals, please apply today!MetroNet is an EQUAL OPPORTUNITY EMPLOYER"}