{"title":"Software Developer I","location":"","salary":"","description":"","term":"$80,000 to $85,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKubG47hho-iRbKlM117HR8hG9g_fr6yCHlY1WTM9K8ASLdjuzojKRJMA9EMIn600yiWMvUvBKwGjzu0qrw8PtLbnLkO0bCzFH3wL5ZwKGGWVcIfJUux9T7vSadhvkU34U97I4kUe9BfO2cvOo6ZePvs_8F4u2zIxL_aBH4STb7m6rRAy-X5UTTZCKxXXdl","source":"ziprecruiter","full_description":"Solvere is looking for a Software Developer to provide support on NIAPS (Navy Information Application Product Suite). NIAPS delivers maintenance, logistics, administrative, training and management applications to users at sea. NIAPS is designed to maximize the use of limited bandwidth by providing afloat units with access to applications while disconnected from the internet.The Software Developer shall create physical and virtual software images in preparation for installation on shipboard systems. Work with the Systems Engineering team to ensure that the latest version of NIAPS is used to create software images. Work with Information Assurance team to ensure all the latest security patches are included in each image build. Coordinate with the Advanced Planning team for correct image structure based on platform.Job Requirements:Work and interact within a SaFE AGILE HYBRID Team to provide support in the design, development, maintenance and enhancement of software solutions and reports.Understand the software development life cycle, strong analysis skills, experience in designing, developing, implementing testing .NET based business applications.Microsoft SQL Server development culminating in a MS SQL 2016 support for Navy CANES SW3 development.Demonstrate knowledge and understanding of the .NET MVC Framework.MVVM (Microsoft's Model/View/View Model) pattern desired.Experience developing in one or more of the following: ASP, ASP.net, VB6, VB Scripting, COM+, C#, Windows Applications, HTML, XML, XSLT, JavaScript, and JSON products.Understand the software development life cycle, strong analysis skills, experience in designing, developing, implementing testing .NET based business applications.Demonstrate expertise in requirements generation and analysis used to write, edit and test programs in the aforementioned technologies.Design, develop, integrate, and maintain multi-tiered Microsoft .NET based web applications supporting Navy Logistics Distance Support projects.Microsoft Full Stack Development and MVC5 (MVC Design Pattern) toward MVC6 in a C# environment is the position target.Design software tools and subsystems to support software reuse, domain analyses, PKI integration for authentication, and manage their implementation.Work with minimal supervision and guidance with C# Programming and PowerShell scripting.Develop system components including services and user screens.Assist with system testing Application and System deployment.Work with the project stakeholders and end users to elicit, understand, analyze, and document the requirements for a system in order to solve a given business problem.Generate technical specifications and user documentation for all Naval Information Application Product Suite (NIAPS) programming work.Meet with customers to discuss specific software needs and new requirements.Perform maintenance of programs and correct defects that have been identified and recommend solutions to defects and problems that may have been detected.Analyze and investigate problems that have been reported by the client and document the results.Responsible for program design, coding, testing, debugging, and documentation.Responsible for quality assurance review and evaluation of existing and new software products.Job Qualifications:Bachelor’s degree in related discipline, or 1 to 3 years of directly related experience.CompTIA Security+ certification (or equivalent) required.Windows 10 certification or equivalent requiredWindows Server 2012/2016 certification or equivalent required.Experience creating both physical and virtual images preferred. Experience with HyperV or ESX Server.Familiar with shipboard IT technical data systems both shipboard as well as ashore site.Experience supporting the updates of technical drawings and publications; Agile Software Environment experience.Excellent technical writing, reporting and communication skills. Reporting in Agile.Must have technical writing, reporting and communication skills.Must have ability to properly document work.Security Requirements: Must have an active DoD Secret security clearance.Travel Requirements: Occasional travel-up to 5%"}