{"title":"Technical Software Support Representative (Medical Device Manufacture)","location":"","salary":"","description":"","term":"$17 to $18 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AALBxgSCNXrz2JXUFNbcK3pbSTdj3PEK-FjB7l5sSKm8Yg9Em4DknlSjjoYa7OVwAQa6rAiHdLtC5n4wiOJprfU7YvPeH2v8nWmqNfN5L1VLynI8bpqOOrBh1fgX7VT_1s2ZchbKeuyUt0w9FmqIraI258wUN00FsdJDL9ZHHKdQ0kiKhei8I5iZ7IMNXedh","source":"ziprecruiter","full_description":"This Technical and Software Support Representative will be primarily responsible for supporting Technical Support, LIS applications, managing system workflows, system upgrades, liaising between development teams and end-users, and on-going maintenance and/ or enhancements of Histology, Labeling, and Digital Pathology equipment.The specialist will provide technical guidance in activities associated with the identification, prioritization, and resolution of reported technical, application and software problems. He or She will operate as a liaison between technical personnel and the application users as well as work directly with other support analysts to resolve reported issues. The specialist is expected to triage support issues and flag them as systemic or operational. He or She will be expected to escalate systemic issues and application design requests to the project management team along with report a summary of each days support issues.Duties include troubleshooting and resolving customer problems primarily via phone. Customers may include; end-users, direct sales team, direct Field Service, distributors/channel partners, BioMed representatives, or third-party service providers. The position includes full use of Service Max and/ or Salesforce for documentation and follow-up.• Responds to users' problems by listening, clarifying, and responding within the scope of responsibility.• Receive and process customer calls and emails, providing technical assistance, troubleshooting support, and follow-up.• Record daily calls and all appropriate information in the Service Max system. Provide technical support for Order Entry, Field Service, Customer Service, and other client personnel regarding product complaints, inquiries, availability, and catalog numbers.• Develop and monitor testing scenarios and methodologies to demonstrate LIS system effectiveness.• Assist with calls regarding product discrepancies, document appropriately, and follow-up where necessary.• Acquire basic use of computer systems for purposes of information retrieval and order entry.• Work with Product Managers to keep product information up to date, and to keep Technical Service Department informed of product up-dates • Interface frequently with other departments to provide seamless support to customers and the field sales organization• Provide in-house personnel with information on product requests and other competitive activities.• Troubleshoot, investigate, repair, and document customer complaints of physical inventory within the department for quick turnaround.• Provide support in executing revenue opportunities when applicable.• Prepare, Track, and ship units to the correct address. Install end-user applications using predefined processes.• Evaluate and Implement Process Improvements• Attend professional workshops and seminars as assigned• Participate in team coverage of on-call during non-business hours"}