{"title":"Hardware Engineer--Filter NPI","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALJKa3ZpPpgtJzse8gG_MqmITCv7HLBc-8n3UzRtUL-8H_IPLSVXAVG-Lhsgztph3Xa42-T8FgCdKTh41y8_11zpH7snu-TICn1J8KTm1oMdQDP-1rmcICasvgjgieariBQlx7Yu_1SnrghivuR6YP-XHltnT9a2bd5oddnW9Gr3SOEjjxhX3mSiN9rAs4","source":"ziprecruiter","full_description":"Company:Qualcomm Technologies, Inc.Job Area:Engineering Group, Engineering Group > Hardware EngineeringJob Overview: Qualcomm is a company of inventors that unlocked 5G ushering in an age of rapid acceleration in connectivity and new possibilities that will transform industries, create jobs, and enrich lives. But this is just the beginning. It takes inventive minds with diverse skills, backgrounds, and cultures to transform 5Gs potential into world-changing technologies and products. This is the Invention Age - and this is where you come in.GENERAL SUMMARY:In this highly visible role, you will be responsible for the development and release of RF filters (SAW/BAW) for RFFE modules. Evaluate filter performance by collecting, analyzing in-line electrical data. Setup filter test cases and perform filter-to-module correlations to derive filter specs. Provide feedback to process, designers, and reliability team to drive the improvement of the designs, yield and quality of the products that are in development. The responsibilities of this role include: + Working under close supervision.+ Taking responsibility for own work and making decisions with limited impact; Impact of decisions is readily apparent; errors made typically only impact timeline (i.e., require additional time to correct).+ Using verbal and written communication skills to convey basic, routine factual information about day-to-day activities to others who are fully knowledgeable in the subject area.+ Completing most tasks with multiple steps which can be performed in various orders; some planning and prioritization must occur to complete the tasks effectively; mistakes may result in some rework.+ Exercising some creativity to troubleshoot technical problems or deal with novel circumstances.+ Using deductive problem solving to solve moderately complex problems; most problems have defined processes of diagnosis/detection; some limited data analysis may be required. The responsibilities of this role do not include: + Financial accountability (e.g., does not involve budgeting responsibility).+ Influence over key organizational decisions.+ Role in strategic planning. PRINCIPAL DUTIES AND RESPONSIBILITIES: + Develops test cases for RF filters (SAW/BAW) to evaluate the performance of the product over various operating conditions.+ Evaluate the effect of process variation on the electrical performance of filters.+ Gather large volume statistical data and assess yield improvement options.+ Perform filter linearity, power and reliability test and identify compatibility issues, and/or compliance issues under the supervision of more experienced engineers.+ Perform filter to module correlation to establish filter specifications for the release of filters to high volume production.+ Release filters to production for large volume manufacturing.+ Reads device specification sheets and interprets basic details required to design various hardware features with minimal guidance from more experienced engineers.+ Troubleshoots basic issues with product designs.+ Provides reasonable schedule for own tasks to project lead.+ Develops understanding of Qualcomm products.+ Seeks basic knowledge of industry trends, competitor products, and advances in various engineering fields from publically available information; requires minimal consultation with more experienced engineers to understand and apply advanced concepts. REQUIRED COMPETENCIES:(All competencies below are required upon entry) + Analytical Skills - The ability to collect information and identify fundamental patterns/trends in data. This includes the ability to gather, integrate, and interpret information from several sources.+ Building Trusting Relationships - The ability to build trusting, collaborative relationships and rapport with different types of people and businesses. This includes delivering on commitments and maintaining confidential information, as well as being approachable, showing interest in the other person, and relating well to people regardless of personality or background.+ Communication - The ability to convey information clearly and accurately, as well as choosing the most effective method of delivery (e.g., email, phone, face-to-face). This includes using a technically sound communication style both verbally and in writing.+ Creating the New and Different - The ability to be creative. This includes the ability to produce breakthrough ideas, being a visionary, managing innovation, seeing multiple futures, having broad interests and knowledge, and gaining support in order to translate new ideas into solutions. This also includes the ability to plan and implement unconventional ideas and speculate about alternative futures without all of the data.+ Decision Making - The ability to make quick, accurate decisions. This includes the ability to weigh alternatives and take into account the impact of the decisions on people, equipment, or other resources.+ Documentation - The ability to appropriately document software and/or hardware specifications and processes to promote knowledge transfer to other engineers.+ Getting Work Done - The ability to be organized, resourceful, and planful. This includes the ability to leverage multiple resources to get things done and lay out tasks in sufficient detail. This also includes the ability to get things done with fewer resources and in less time, work on multiple tasks at once without losing track, and foresee and plan around obstacles.+ Hardware Design - Knowledge of and the ability to understand advanced or complex hardware design elements in order to carry out designs, upgrades, and technology roadmaps.+ Hardware Infrastructure - The ability to implement and integrate IT hardware for use in business environments and assist in designing its main features according to business needs. This includes the ability to track and report operational problems. This also includes the ability to compare IT hardware across one's own organization and its competitors.+ Project Management - The ability to use organizational skills for purposes of planning and decision-making. This includes developing and communicating objectives, timelines, assignments, and goals. This also includes the ability to scope projects, orchestrate multiple activities at once, and use resources efficiently across functional areas within the enterprise. MINIMUM QUALIFICATIONS: + Bachelor's degree in Engineering, Information Systems, Computer Science, or related field. PREFERRED QUALIFICATIONS: + 1+ years experience with circuit design (e.g., digital, analog, RF).+ 1+ years experience utilizing schematic capture and circuit simulation software.+ 1+ years experience with hardware design and measurement instruments such as oscilloscopes, spectrum analyzers, RF tools, etc.+ Knowledge of SAW/BAW filters, understanding of microelectronic fabrication, statistical background and good understanding of RF is desirable PHYSICAL REQUIREMENTS: + Frequently transports between offices, buildings, and campuses up to mile.+ Performs required tasks at various heights (e.g., standing or sitting).+ Monitors and utilizes computers and test equipment for more than 6 hours a day.+ Continuous communication which includes the comprehension of information with colleagues, customers, and vendors both in person and remotely. Applicants: If you are an individual with a disability and need an accommodation during the application/hiring process, please call Qualcomm's toll-free number found here (https://qualcomm.service-now.com/hrpublic?id=hr\\_public\\_article\\_view&sysparm\\_article=KB0039028) for assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities to be able participate in the hiring process. Qualcomm is also committed to making our workplace accessible for individuals with disabilities. Qualcomm is an equal opportunity employer and supports workforce diversity.To all Staffing and Recruiting Agencies: Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.EEO Employer: Qualcomm is an equal opportunity employer; all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or any other protected classification.Our Work Experience is the combination of everything that's unique about us: our culture, our core values, our company meetings, our commitment to sustainability, our recognition programs, but most importantly, it's our people. Our employees are self-disciplined, hard working, curious, trustworthy, humble, and truthful. They make choices according to what is best for the team, they live for opportunities to collaborate and make a difference, and they make us the #1 Top Workplace in the area. Employment Notices for US-based Job Postings Equal Employment Opportunity (https://www.eeoc.gov/sites/default/files/migrated\\_files/employers/poster\\_screen\\_reader\\_optimiz..."}