{"title":"Hardware Developer - Optical Networking, Ethernet, 5G","location":"","salary":"","description":"","term":"$130,000 to $160,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJjgeDcPa7jXFvHFwtRJuJbhx56C2YbS7Z6CelX16s-dVO4LwqcCmbaJjs8eq2bA9YA2Vs4HjkpjKebmZCcRe4L-48eIWEY1TDRLmtCY4tkoDIR03vE9okvGyVVOUHHEZp5un16Q-3IfEllmGsiVHMymbpgGA-HwzCTqktpYQDI2b25mmWMoQPObUUCoA","source":"ziprecruiter","full_description":"Hardware Developer - Optical Networking, Ethernet, 5G If you are a Hardware Developer with Optical Networking, Ethernet, & 5G system development experience, please read on!Job Title: Hardware Developer - Optical Networking, Ethernet, 5G Mobile TransportJob Location: Plano, TX - (Candidate may start remote but will be expected to work out of our Plano, TX office post-Covid)Compensation: $130K - $160K+ base salary plus comprehensive benefits packageWe are a global provider of leading-edge access, 5G transport, and enterprise communications platforms that enable the emerging hyper-connected, hyper-broadband world. A pioneer in disaggregated platforms, SDN, and virtualization, service providers and enterprises look to us for the innovation that leads to future-proof networks and outstanding performance. Over 1200 service providers, operators, and enterprises in over 120 countries have leveraged our innovation, open solutions, and agility to arm them with the network resources and deployment freedom they need to lead in their markets and deliver an unrivaled communications experience. With manufacturing, engineering, service and support centers of excellence spread across the globe, we are positioned to bring next-generation technologies and world-class solutions to service providers and enterprises who are poised to transform, compete and win.Top Reasons to Work with Us1) Competitive Compensation ($130K - $160K+ base salary Depending on Experience)2) Comprehensive Benefits package!3) The chance to join a rapidly-growing global provider of leading-edge access, 5G transport, & Software-Defined Networking solutions!What You Will Be Doing- Define, Maintain, Enhance and perform work in adherence of the ISO/TL9000 Quality Management System- Define system, product and subsystem requirements based on customer, CTO, PLM and industry standards.- Evaluate hardware/component technologies for inclusion of new product offerings.- Develop and maintain product architecture and system level designs for new product offerings.- Develop Proof of Concept hardware and firmware development as required to prove new technology concepts.- Work individually and with your team to develop exceptional products that are industry leading and meet required performance specifications while meeting cost, quality and manufacturability metrics.- Create and execute test plans - unit test, integration test to facilitate handoff of hardware to the software development team.- Generate, analyze, report on in-process metrics and key performance indicators (KPIs).- Focus on defect prevention, defect removal and continuous improvement of processes and product offerings.- Work with internal and external functions (suppliers, CTO, PLM, Operations, Architects) to drive continual product cost reduction.What You Need for this Position- Hardware & component technologies for new product offerings (Gigabit Ethernet, Optical Networking, 5G Mobile Transport)- System, product, and subsystem level design- Hardware & Firmware Development- Optical Networking Product Development- Familiarity with Software-Defined Networking (SDN) / Network function virtualization (NFV)So, if you are a Hardware Developer with Optical Networking, Ethernet, & 5G system development experience, please apply today! or send an updated copy of your resume to Mike.Vandenbergh@CyberCoders.com for immediate consideration! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}