{"title":"Lift Maintenance Mechanic NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI5FWvKzLyTNuRimZWw5WzRDYW8mX4TNs4e6AkM7hMbMexAcP_lpGdgMfaUOdDlDpu-qw-BkE6GVaUoVFa2-3n7Qn6eMCBHHkTAnoUinB_57H4PTTfmxf0kCdDlCtr2YuiUYPcTNgaDp8N2sojVIOrDJ7nkZJyeG5iWvdYccIFqnXxXnmq0c5j4CiI35jrP","source":"ziprecruiter","full_description":"Job Title:                      Lift Maintenance MechanicType of Position:        Full-time, Year RoundSchedule:                    Four 10 hour days per week, year round  Weekends/holidays likely required during winter seasonPay Range:                 $17.00/hr - $25.00/hr, based on qualifications and experience.Want a skilled position where you can learn a maintenance trade and also work in the great outdoors, skiing/riding and being in the mountains?  If you are mechanically minded and have a passion for helping skiers and riders access the slopes, this job is for you! SummaryThis entry level position is responsible for ensuring safe and reliable uphill transportation of Loveland guests onto our slopes.  Every employee is responsible for providing a positive experience for our guests and employees, with safety and fun as our top priorities.  Essential FunctionsResponsible for scheduled and unscheduled maintenance and repairs on lift equipment, and for maintaining assigned tools and work areas.Responsible for safe daily operation of equipment.  Perform lift Inspections (daily, weekly, monthly and annually), including documentation.  May assist in the determination of the discontinuation of operations for any lift due to mechanical, weather, or other concerns.  Run lifts on auxiliary or evacuation diesels.  Perform snow removal and other snow work around lifts (winter only) Perform all duties of Lift Operator, when necessary (winter only) Operate snowmobile and other company vehicles safely, following LSA protocol, ensuring proper condition of vehicles at all timesMaintain work in compliance with company policy and procedures; CPTSB, ANSI, US Forest Service, and OSHA regulations; and insurance underwriters' rules and regulations. Assist with development of job hazard assessments, training procedures, etc., ensuring safety is at the forefront, and helping to document and continuously improve lift maintenance procedures and protocols.Requirements/QualificationsMust be at least 18 years old.High School diploma or equivalent.Experience in industrial maintenance or related field, desirable. Experience in Lift Operations and/or Lift Maintenance, preferred.Possession of (or ability to obtain) a valid Colorado Driver's License, with an acceptable driving record.  Ability to obtain climbing certification.General mechanical aptitude and capabilities, proficiency with basic hand tools, ability to identify and troubleshoot mechanical problems.Ability to communicate clearly in English - speak and understand verbal and written communications.Ability to work at high altitudes, on high structures, outdoors and in extreme weather conditions.Ability to lift/carry up to 100 poundsAbility to push/pull up to 160 poundsIntermediate level or better skier or snowboarderWhat's in it for You?This position is eligible for benefits including Medical, Dental, Life/AD&D, FSA Reimbursement Plans, 401k Plan, vacation time, sick leave and holiday time.  This entry level position provides ongoing training and step progression opportunities, leading to a potential career.  Check out the many additional PERKS of being in the Family by clicking here !    Why Loveland?The Loveland experience is like no other. We have stayed true to the sport, our guests and our employees. Our experience is simple and straight forward. Our goal is for everyone to feel at home and to become a member of the Loveland family.   Start your day at 10,800 feet, where an average of 422 inches of snow falls annually on 1800 skiable acres - all only 53 miles from Denver!  Come join our family, share your passion for safety and the outdoors, and be a part of something special! This job description is not designed to cover nor contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job.   Duties, responsibilities, and activities may change at any time with or without notice.  Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of the job.   Loveland is an equal opportunity employer.  All qualified applicants will receive consideration without regard to any status protected by law."}