{"title":"Network Engineer II(CISCO OR Fortinet, Dell Sonicwall,Palo Alto,Meraki","location":"","salary":"","description":"","term":"$20 to $34 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKp9rCYapTzRPcQWIbxmU15OOflvW0ABYIQKn4NUWZirINRcKE3-CYvEImGaSMdfrON5Ct8Mi3SEFp2pbZMLUjrvSUNKoA3aWXCtiz1VDcrB8xlK7-SD15d48uJzx2exAhaZBaJL7WNkalbZzytC8YugrNcEwMBxanjGf1LtmQmFwahMWwyJsNjjk_BN_o","source":"ziprecruiter","full_description":"Need 2 Network Engineer II (CISCO OR Fortinet, Dell Sonicwall, Palo Alto, Extreme switching, Mearki products, HP switching, Dell switching, Aerohive) / Almost REMOTE Role Cranford, NJ The majority of the work is remote. There are some customer in the NJ area that onsite visits maybe required.Working from the office is optionalJob DescriptionAssists in the development and maintenance of network communications.Uses knowledge of LAN/WAN systems to help design and install internal and external networks.Tests and evaluates network systems to eliminate problems and make improvements.Requires a high school diploma and a certification in area of speciality and 2-5 years of experience in the field or in a related area.Familiar with standard concepts, practices, and procedures within a particular field.Relies on experience and judgement to plan and accomplish goals.Performs a variety of tasks.Can work independently with limited supervision.A certain degree of creativity and latitude is required.Typically reports to a supervisor.We are mostly a Cisco shop, but work with various network vendor network equipment such as Fortinet, Dell Sonicwall, Palo Alto, Extreme switching, Mearki products, HP switching, Dell switching, Aerohive etc.Experience with Cisco Call Manger is a plus.Required SkillsH. S. diploma. A. S. computer science or 2+ years’ experience working Network administration roles.Experience with one or two of the technical areas listed in the job description.Required EducationRequires a high school diploma and a network certification (CCNA, CCNP)Required Years of Experience2-5 yearsDesired Skills-Cisco ASA w/ Source Fire (CLI and FMC)-Fortigate firewalls-Dell Sonicwalls-Cisco, Meraki, Aerohive, Ubiquity and Aruba Access Points and Controllers-Experience with Cisco Call Manger is a plusDesired EducationDesired Years of ExperienceAdditional Information3 months of project work with a possibility of a full time position.Engagement Terms:· Cranford, NJ The majority of the work is remote. There are some customer in the NJ area that onsite visits maybe required.Working from the office is optional· Rate: $20-34/hr· F2F interview strongly preferred· Openings: 2· Shift/Schedule: 9AM-5PM Mon-Fri· Duration: 3 months of project work with a possibility of a full time position.· Need to clear Background & Drug Screen checks before starting· Must have A “Valid” Driver License, Valid Passport, or Birth Certificate.· Should be willing to submit to an extensive background, criminal history, and drug test before starting the project.If you are interested in becoming part of our winning team please APPLY NOW!Are you a Network Engineer II (CISCO OR Fortinet, Dell Sonicwall, Palo Alto, Extreme switching, Mearki products, HP switching, Dell switching, Aerohive) that loves the fast paced, ever changing environment? Do you want to be a part of a company that believes that the heart of our dedicated Team is what makes us successful? Then join our team!If you are interested in becoming part of our winning team please APPLY NOW!Thanks & Regards,M V SrikanthPatriot Staffing & (IT Solutions {Sister company} )E: itrecruiter at patstaffing dot comPhone: Seven three two – six two nine – eight six six one"}