{"title":"Systems Engineer III","location":"","salary":"","description":"","term":"$78,692 to $104,923 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ8RvackloJGfXNXk1a2OoFAdvMT5oa1luy7_ZcRlnb-QLD3jIuInD-XHAXTSAYo6rcw0EiQd_0vRhMr_fpt9LeWxEPmhW2kWKmWaXJpV5dPvcrMKC7gUNfqKmaAj2Rv6xgLny1pukSadPIqCuyPDbp6Gz44NqSHzz7BnqVsoGQ0fkzBH1hjtOA5zS3sw","source":"ziprecruiter","full_description":"The Systems Engineer III is part of a highly visible, projects centric team delivering complex enterprise solutions to a multi-state organization. The ability to think strategically, visualize system relationships and drive multiple projects to successful completion is paramount to this position.The System Engineer III is required to perform the system analysis and design necessary to install divergent systems and still maintain high levels of performance and up time in an enterprise environment. This includes interaction between complex systems to maintain high security levels and data protection techniques as required in our highly regulated market. The System Engineer III role is also expected to be able to perform many project duties required for enterprise-level projects.The System Engineer III is responsible for the monitoring, maintenance, and repair of all ModivCare IT Systems. This responsibility includes, but is not limited to, Server Hardware, Windows Servers, VMWare, Citrix, Cloud Services, SAN and NAS storage, MS SQL Server, DB/2, and Microsoft 365.In the role of System Engineer III the employee will be in constant contact with all levels of the ModivCare organization. At all times the employee is expected to uphold the highest level of customer-service and communication. They must maintain open communication with the customer throughout the completion of any service request or project.A System Engineer III is expected to, on a rotating schedule, be \"On-Call\", during which the employee is responsible for answering system-down calls on their cell phone. These calls must be taken immediately and treated as \"IT Emergencies\". For any such emergencies that cannot be immediately resolved it is expected that the employee notify the appropriate IT manager(s).ESSENTIAL FUNCTIONSStrong understanding of Server hardware platforms Enterprise high density and stand-alone server hardware platforms.Strong understanding of Windows Server and Linux operations and roles.Strong understanding of VMware vSphere, vCenter, and ESXi hypervisor operations. Strong understanding of other virtualization platforms such as Citrix Xen, Microsoft Hyper-V, and cloud services, and SaaS.Strong understanding of LAN, WAN, and storage network technology. This includes hardware devices and software protocols and services.Strong understanding of local, SAN, and NAS storage technologies from vendors such as Pure, and EMC.Familiarity with public cloud offerings such as AWS, GCP, and Azure.Experience in DevOps culture, including familiarity with automated testing, continuous delivery, and infrastructure as code.High-level understanding of Development tools, including Azure DevOps, Visual Studio, Jenkins, Git, etc.Administrative knowledge of MS SQL Server, DB/2 and other databases. Knowledge of clustering, high availability, backups, and log handling is also required.Strong understanding of Microsoft 365, including mailbox management, database management, high availability, clustering, security, and anti-spam products.Recommend, review and implement new technology solutions.Be able to design, implement, and troubleshoot Enterprise class solutions.Maintain minimum security baseline requirements for all IT systems.Maintaining a clean and organized Server room, and work area.Respond to network, server, and application outages. Communicating these outages to management and seek assistance to resolve the problems in a timely manner.POSITION QUALIFICATIONSEducationCollege degree preferred (will consider experience in lieu of degree)Skills & Experience5-8 years of experience in/with the followingEnterprise Infrastructure or Data Center teamRedhat LINUX and clusteringWindows Server design, administration, installation, automation and supportEnterprise storage solutionsScripting technologiesSQL or DB/2 technologiesVirtualization design, implementations and upgradesEnterprise IT Security principlesCitrix productsMicrosoft Desktop and Server OS certification a plusOther industry related certifications a plus Ability to work independentlyExcellent verbal and written communications skillsExcellent organization skillsAbility to lift 25lbsWe value our team members and realize the importance of benefits for you and your family.ModivCare offers a comprehensive benefits package to include the following:Medical, Dental, and Vision insuranceEmployer Paid Basic Life Insurance and AD&DVoluntary Life Insurance (Employee/Spouse/Child)Health Care and Dependent Care Flexible Spending AccountsPre-Tax and Post --Tax Commuter and Parking Benefits401(k) Retirement Savings Plan with Company MatchPaid Time OffPaid Parental LeaveShort-Term and Long-Term DisabilityTuition ReimbursementEmployee Discounts (retail, hotel, food, restaurants, car rental and much more!!)Salary: $78,692 - 104,923"}