{"title":"Technical Writer - NISSC II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJwi2HMxbNKc9zRT3ADs2_J6AtsdGG5veNn9tufqelfJtWiqQWJ8iFS8Ef59DilbHaSg_AHUYJ2ml4wVKTdPjTtakGxkSD9pcYyGLgXaCM7JcefWg2MlaqBWY-nt7YYx8OZfVU4lIBcv-pVHAWEW94LXnGZZf960lNacUxbrfc3qP5q63NfEi9c0Cc6pDM","source":"ziprecruiter","full_description":"Jacobs is seeking a qualified Technical Writer to support the newly awarded NISSC II contract. Your career at Jacobs enables NISSC to fulfill its mission to \"provide classified communications and processing for Command and Control (C2) capability in organizational work centers at NISSC sites.\" As a member of our team, you will support corporate and customer mission to provide world-class IT services and support that connects systems and users across NORAD in the areas of software development/maintenance, network services, cyber security, systems administration, and other mission-critical areas.The Technical Writer coordinates/monitors for compliance with contract objectives a wide variety of complex administrative programs and projects. Conducts study in procedural matters and administrative problems; involves investigations and administrative research within a wide area of responsibilities. Determines, maintains, and revises priorities for others in order to meet contract objectives. Researches, compiles, prepares, and distributes a wide range of information. Documentation is consistent with precedents and defensible with the law and regulations. Provides advisory services for administrative operations of the company. Furnishes analysis, appraisals, recommendations, and comments on operations. Ensures that costs charged to contracts conform to terms and applicable regulations. Interprets directives from the customer, both internal and external, and provides direction, coordination, and monitoring for implementation. Assures effective management policies, determines and recommends new and revised policies, and implements appropriate administrative procedures which will provide maximum efficiency. Serves on a variety of committees, panels, or investigative teams to resolve administrative problems. This position is expected to pay $56,000 - $70,000 annually; depending on experience, education, and any certifications that are directly related to the position.Jacobs health and welfare benefits are designed to invest in you, and in the things you care about. Your health. Your well-being. Your security. Your future. Typical benefits offered include education reimbursement, retirement benefits (401K match), employee stock purchase plan, health benefits, tax saving options, disability benefits, life and accident insurance, voluntary benefits, paid time off and paid holidays, and parental leave.2 years of college with courses in business administration, industrial management, or appropriate discipline, and 6 years progressive experience, or any equivalent combination of relevant education and experience. Good oral/written communication skills and analytical capabilities required."}