{"title":"Hardware Engineer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALLNNWD57qjRQst8-dcJPXp2ZDM6NVyUmsBorJI1hw_MbhCCXG9Aba6DUDZvZ5j37DxYzOyvNhnNbE9BRMVPphtbOEL-fRAeh7H-r7b4_9okusUgkJmqj71nsgt-95GsDjtP3A5jxLx0E7WmsgEBEhf_EhDWSVjgwWXYoNEvxoBurwZLyRGMb-AkeUqyn4","source":"ziprecruiter","full_description":"Hardware Engineer Hardware Engineer  Apply online now Location: Lynnwood, WAJob ID: 314351 Operating department: CYSC ATV MC TPD PTEHire4IFX: No Job descriptionIn your new role you will:Validate and characterize new productsPerform hardware / test silicon debug using bench tools (Labview, oscilloscopes, function generators, etc.)Develop hardware and debug test programDrive failure analysisDrive reliability qualification testingSupport high volume manufacturingDebug customer returns and drive root cause failure analysisYour profileYou are best equipped for this task if you have:Programming skills (C/C++, Perl, Python, assembly)Failure analysis experienceAn understanding of analog and digital functionsAn understanding of embedded systemsRelentless problem-solving skills and knowledge of FMEA, DOE, SPCStrong written/verbal communication skillsPart of your life. Part of tomorrow.We make life easier, safer and greener - with technology that achieves more, consumes less and is accessible to everyone. Microelectronics from Infineon is the key to a better future. Efficient use of energy, environmentally-friendly mobility and security in a connected world - we solve some of the most critical challenges that our society faces while taking a conscientious approach to the use of natural resources.Cypress Semiconductor Corporation is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), gender identity, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition, family care status, military or veteran status, marital status, domestic partner status, sexual orientation, or any other basis protected by local, state, or federal laws. Applicants with questions about access or requiring a reasonable accommodation for any part of the application or hiring process should contact the Talent Network by phone at (408) 503-2194.Employment at Infineon is contingent upon proof of your legal right to work in the United States under applicable law, verification of satisfactory references and successful completion of a background check and drug test, and signing all your on-boarding documents .In some instances, if applicable, U.S. export control laws require that Infineon obtain a U.S. government export license prior to releasing technologies to certain persons. This offer is contingent upon Infineon's ability to satisfy these export control laws as related to your employment and anticipated job activities. The decision whether or not to submit and/or pursue an export license to satisfy this contingency, if applicable, shall be at Infineon's sole discretion.IMPORTANT NOTICE:Infineon Technologies takes data privacy and identity theft very seriously. As such, we do not request personally-identifiable information (PII) from applicants over the internet or electronically. Please kindly refrain from disclosing your PII electronically during the application process or to unauthorized websites that may purport to be Infineon or any of our affiliates. Does this sound like just the right challenge for you? If so, we look forward to getting to know you! Apply online now (It only takes 90 seconds)"}