{"title":"R&D Supervisor - Analytical Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJrq8QWb0ZzJ-fAaOuC0U6gNqJXput-PMvm2xnw0dI5AyBK7BpTGsUPsfWmsNUGcpra0HmUJAMZiFJtALZS1Q5FaUVL_NRNgWh65XQmHpaeQ7vPunBJG6UtBGVyOHyW8tDt8iKsZUjYu1o8wLwTqzHdSQEaf5_0SI5Kvj7RH6UR6AGcgJM_pOW6TkHOBGw","source":"ziprecruiter","full_description":"R&amp;D Supervisor – Analytical ChemistryPosition OverviewATL is seeking a dynamic R&amp;D Supervisor - Analytical Chemistry to join our team of dedicated professionals focused on client service and quality. The ideal candidate will be motivated, energetic, forward thinking, and possess outstanding leadership development and/or technical skills, organizational awareness, and a commitment to excellence.Essential Functions:Leading the BusinessEnsure that regulatory compliance, data integrity, quality control, and client standards are met including but not limited to auditing test procedures, documentation, QA meetings regarding laboratory investigations/OOSs, client follow up and corrective actionProvide support for analytical testing, method validations, data recording, instrument and method troubleshootingExercises sound decision-making that positively impacts the lab and is in the best interest of ATL, the associate and the clientSchedules and oversees efficient laboratory workflow and delegates tasks to assigned analysts.Maintains a training matrix for the lab to ensure all associates are trained on necessary lab protocols; provides or delegates cross-training to meet business needs and lab coverage during staffing shortagesMaintains the laboratory budget and inventory, responsible for timely order placement of lab supplies to ensure business continuityProactively adapts and responds to changing business needs, shifting priorities as necessaryLeading OthersBuilds, develops and manages laboratory team and oversees associates regarding staffing needs, project management, training, professional growth, associate behavior, corrective action, succession planning, work scheduling, compensation administration and payroll submission.Recruits, selects, trains and onboards new associatesFosters a positive and safe work environment, adhering to safety standards at all timesCommunicates expectations to team and holds associates accountable for delivering service standards and behaviorsLeads with a positive attitude-demonstrates commitment to associates and providing exception client service. Ensuring high quality and timely delivery.Addresses associate performance concerns and implements the appropriate level of corrective action with guidance and alignment from HR and General ManagerLeading SelfLeads by example according to the service standards of ATL’s leadership frameworkUses effective communication to relay information using the ATL brand voice-optimistic, approachable and wiseIdentifies and appropriately addresses actions that do not align with our culture, service framework and values to ensure a positive work environmentAssesses situations, seeks to understand and gathers all relevant facts to determine best course of action to resolve problems.Utilizes critical thinking to find solutions to complex problems; escalates to General Manager for assistanceServes as a culture champion that cares intensely about ATL’s successRequirements:Bachelor’s degree in Chemistry with hands on analytical chemistry lab experience in a regulated industry (consumer goods, pharma) including previous troubleshooting responsibilitiesIncoming experience with chromatography and mass spectrometry techniques required: sample preparation, LCMS &amp; GCMS instrumentation, ICP-OES and ICP-AES, Flame AASFamiliarity with bioanalytical chemistry and molecular techniques, including: ELISA-based assays, LCMS, HPLC, spectrophotometers, gel electrophoresis.Previous direct management experience with hiring, terminations, progressive discipline, and associate development responsibilitiesMust be able to support the efforts of a young and enthusiastic work force-maintaining the highest quality output of data while consistently creating exceptional client experiencesExceptional problem solving and conceptual thinking abilities requiredExcellent written and verbal communication requiredAbility to assess, summarize, and prioritize highly complex projects while meeting deadlinesCompany OverviewAt ATL, we don’t just do the science, we have the opportunity to transform organizations. We need people who want to grow with us and contribute directly to our clients’ success. As scientific sourcing experts, the largest and most respected companies in the world ask us to create innovative solutions to big problems. We have more input and influence, so we can have a significant impact on brand-name products and visible projects. And you can play a bigger role.Interested and qualified candidates, please apply with a resume and salary requirements.ATL offers a comprehensive benefits package including: Medical, Dental, Vision, Life Insurance, Short Term Disability, Long Term Disability, Pet Insurance, a 401(k) Retirement Plan with company contribution, Paid Time Off, and an Associate Assistance Plan. In addition, we offer a competitive salary and the advantage of a professional environment that supports your development and recognizes your achievements. ATL is an Equal Opportunity Employer (EOE) and strongly supports diversity in the workplace."}