{"title":"Staff Accountant","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALTk_WX44aT0y4_Sx3QNLmqZKFL1kvEM84un0c3Axif3wY0tekxIkCiAYZ_G8U4R7ABGZ5tmNEREAKsJUZiIsHk2P6MBIPrvfAoDSNcJ06Z1mIGdfX7WQMyhbQIOc9owseNfwnqSsM_EkHFg81lTih2oQqs2Hf8r6b2mCYaHZEcLkl-EPDYEStkPsWBKubt","source":"ziprecruiter","full_description":"About Clean ChemistryFounded in 2012, and headquartered in Boulder, Colorado, Clean Chemistry discovered safe, effective production and use of Reactive Oxygen Species (ROS) for water treatment and industrial applications. Using proprietary, patented approaches, this new family of chemistries represents a significant disruption to the current inefficiencies in the production, distribution and performance of oxidation and disinfection chemistry. With success in the Permian Basin exceeding expectations, Clean Chemistry is expanding its capabilities to E&amp;P operators and water management partners in the Permian and other regions where high performing, safe water treatment is a major factor in completions operations.About the RoleThe Staff Accountant will be responsible for providing accounting and some administrative support to the CO office of Clean Chemistry. The ideal candidate will be excited about wearing many “hats” in a relaxed small business environment. You will work directly with the Payroll Manager and Controller, both of whom bring many years of public accounting experience and are eager to train the right candidate. The position will also help with a small amount of office administrative tasks. The list of responsibilities below is not comprehensive. The ideal candidate will be detail oriented, eager to learn, and will look for other areas to be helpful if the workload is smaller than expected. ResponsibilitiesAccounts PayableAssist with the scanning, uploading, and entering of invoices into ConcurRequest bill approval by managers through ConcurReconcile AP and open purchase orders at month-endAccounts ReceivableAssist with the preparation of invoices, including inventory double check and dose calculations as neededSubmit field tickets and/or invoices to appropriate customers when applicableWeekly and monthly reporting, as neededReconcile various accounts including AR, AP, and fixed assetsPrepare various month-end closing journal entriesMonth End Closing Support Monthly bank reconciliationsFacilitate Credit Card expense submissionGeneral office organization; shipping and receiving, monitor and take appropriate, timely action with incoming and outgoing mail and packagesAnswer low volume phone callsOther functions and projects as neededRequirements2+ years of accounting experienceBachelor’s degree in accounting or other applicable field strongly preferredAbility to work with minimal supervisionComputer / tech savvy (Excel and G-suite are used extensively)Protect company’s value by keeping information confidentialAttention to detail, thoroughness, and follow-throughCan do attitude / team playerStrong verbal and written communication skillsMust possess valid driver's license and working vehicleMust be able to sit for long periods of time, working on the computerMust be able to pass a pre-employment drug screen and maintain compliance with company drug policyCompensation and BenefitsSalaried, full time position, anticipated 40+ hrs per weekBenefitsCompany wide bonus initiativesClean Chemistry is an Equal Opportunity Employer"}