{"title":".NET Senior Software Engineer (work at home / remote / home office eligible)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIBqZVyOe4e_ApZp__gI9xaoBbmdmwRWk1q-0rmKY4t01O_G8r2St14U4EtWKiMvYBEud6FaBfTRgDGa_ra-cbWX85LRPuK-IK8fUL8rUXmmZ95-ScB3DxWMH99ijn9Meyffz49utjJNvxAyVGrq6GxRI0vfziPfblo9pZZOu5NXn-bbCu3mBFln8fXCTEY","source":"ziprecruiter","full_description":"DescriptionThe Senior Software Engineer codes software applications based on business requirements. The Senior Software Engineer work assignments involve moderately complex to complex issues where the analysis of situations or data requires an in-depth evaluation of variable factors.ResponsibilitiesThe Senior Software Engineer standardizes the quality assurance procedure for software. Oversees testing and debugging and develops fixes. Researchesincidents and makes necessary adjustments and/or recommendations to resolve complex software related issues. Begins to influence department's strategy. Makes decisions on moderately complex to complex issues regarding technical approach for project components, and work is performed without direction. Exercises considerable latitude in determining objectives and approaches to assignments.               Required QualificationsBachelor's Degree in Computer Science or related field or equivalent experience5 years of experience designing, developing, and testing of software applications and/or infrastructure.Net / C#Web ServicesWCFWorking with MVC patternSQL ServerPreferred QualificationsMaster's DegreeFamiliar with MedicareAzure cloud practicesAdditional InformationThe following policy applies ONLY to associates working in the state of Arizona:Humana is committed to providing a safe and healthy work environment and to promoting the health and well-being of its associates. Effective July 1, 2011, Humana has adopted a tobacco-free hiring policy that will promote a healthier workplace and will not hire users of tobacco and nicotine products. If you have any questions, please consult with your recruiter.Scheduled Weekly Hours40"}