{"title":"Senior Software Engineer, User Platform NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK83SJ1EaKZ-QfJVzBwW04e7S4GrgOdWFLo7OnC0FNncuByvUUz_S2tGMYz-xiB1tF029IoFs7UTnFBxf4kXCEueg0YEQwGdxpGZ2ZerJVNnPxJpKciWu0WdloPBMLwr3_MmePBrvmS0XIaEOtjVj4tmQIseuVXgdv3bXbH9cLfs3wfqatM44UUrx9qWlGB","source":"ziprecruiter","full_description":"Senior Software Engineer - User Platform TeamCustomers want two simple things as they interact with brands. Firstly, they want brands to delight them by providing great user experiences. Secondly, they want brands to protect them from fraud, breaches and privacy violations. The User Platform team helps Peloton do both. Our vision is to provide people with secure access to our applications in one click or less. We are looking for curious, excited, boundary-pushing team members. So, if you're a big thinker who is nimble and adaptable, Peloton may be an ideal place for you to shine.  The UP team develops advanced authentication methods for various devices to help our customers frictionlessly connect to Peloton applications.  They also develop new APIs to capture and maintain user profile information. They enhance security of user profile data by introducing capabilities such as geo-based anomaly detection, brute force protection, malicious bot detection and more.It is one of the most central and crucial pieces of application in the Peloton ecosystem. We are looking for an engineer to join this new team and help develop and ship new products.What You'll DoCollaborate with other engineering teams to implement new authentication mechanisms and protocolsCollaborate with Security Engineering teams to incorporate strong security controls, and mitigate security vulnerabilities.Design, build, and maintain APIsTake an iterative approach to development, dividing long-term goals into incremental milestones and react to customer feedback quickly.Develop analytics capabilities to capture customer insights Be on-call and debug production issues across multiple levels of our stack.Required Qualifications:7+ years of experience with one or more object-oriented programming language like Python, Ruby, Java etc Knowledge of authorization mechanisms and protocols such as OAuth, SAML, Sessions and moreStrong leadership, collaboration and communication skills. Nice to Haves:Experience working in the space of identity and access management (IAM) Experience with API Gateway technologiesExperience with CIAM tools such as ForgeRock, Auth0 ABOUT PELOTONPeloton is the largest interactive fitness platform in the world with a loyal community of more than 2.6 million Members. The company pioneered connected, technology-enabled fitness, and the streaming of immersive, instructor-led boutique classes for its Members anytime, anywhere. Peloton makes fitness entertaining, approachable, effective, and convenient, while fostering social connections that encourage its Members to be the best versions of themselves. An innovator at the nexus of fitness, technology, and media, Peloton has reinvented the fitness industry by developing a first-of-its-kind subscription platform that seamlessly combines the best equipment, proprietary networked software, and world-class streaming digital fitness and wellness content, creating a product that its Members love. The brand's immersive content is accessible through the Peloton Bike, Peloton Tread, and Peloton App, which allows access to a full slate of fitness classes across disciplines, on any iOS or Android device, Fire TV, Roku, Chromecast and Android TV. Founded in 2012 and headquartered in New York City, Peloton has a growing number of retail showrooms across the US, UK, Canada and Germany. For more information, visit www.onepeloton.com."}