{"title":"Senior Backend Software Engineer","location":"","salary":"","description":"","term":"$120,000 to $160,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKEzc3MSqkUouH4Y6UsnJUPqfAtQDVoBw84umapUS07cYfdSETISvSFViD9JOxBwcJ2EDTLh-sNXJcXNn75mMWabEU-a7Ecv6yJZXNf189ME1FeVznjP-ZGapB0SMoqfC8aybneaVImXzyXH7mpC6xH72RDoIosmP01jV2cLh_U_osR0eQVGxmtVLgYtpk","source":"ziprecruiter","full_description":"Senior Backend Software Engineer If you are a Senior Backend Software Engineer with experience, please read on!Top Reasons to Work with UsLocated in the major tech hub of Seattle, we are leaders in digital currency exchange. We have created a stream-lined, efficient, and secure way to buy, store and transfer digital currency. We are a GROWING company looking to add an impressive REMOTE Backend Software Engineer to our team!What You Will Be Doing- Delivering new features and enhancements to our platform- Develop new APIs for our rapidly growing cloud-based cryptocurrencyservices platform - Develop APIs for use by our 3rd party integration team - Implement automation testing along with new feature development thatplug into our CI/CD pipeline- Continuous improvement in developing the engineering teams in-house Java/ Kotlin expertise and practices- Continue to drive operational stability and security into all layers ofplatform- Agile team engineering leadershipWhat You Need for this Position- Java- Spring- Spring Boot- Kubernetes- Payment Processing- FintechWhat's In It for You- Vacation/PTO- Medical- Dental- Vision- Bonus- 401kSo, if you are a Senior Backend Software Engineer with experience, please apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}