{"title":"Advisor, Chemistry","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALygklk4BnyXruubXgUlaffNJxuxsgw_OcMQ2Mvv6BrMzDw0OZflKp_lHovM0-8D6IeMCtwP0R-o75o8zqKf0dxOrqIgxs_9_BJxTh6ktLNCgaVUKkHEQzlA2dKh_jW6323Iuy7sJyrEOUf2DnLyQbiWiUtKC4MCIiJ6OaAMm848bV6HeqAePtPDRJ1LWs","source":"ziprecruiter","full_description":"**Req Number** 8360Job DescriptionJob Description Coordinates activities in clinical chemistry. Provides diagnostic services for patients. Performs educational and administrative duties within the department.Job Responsibility+ Provides strategic advice and guidance to the Chemistry function. Shares in the planning, development, and coordination of operations in Clinical Chemistry. + Provides professional input to ensure completion of departmental goals, compatible with the overall needs and policies. + Shares in the recruiting, selection and supervision of staff. + Carefully analyzes the need for additional personnel to ensure an adequate and efficient staff for the Division of Clinical Chemistry. + Assists in the selection of new staff ensuring minimum qualifications of the position are met as delineated by the position description. + Participates in the performance evaluation process of each employee reporting to him or her on an annual and semi-annual basis. + Shares in determining the need for facilities, equipment and supplies. + Aims to ensure the physical facilities meet the current technological requirements for optimum operation through routing evaluation of productivity of the section. + Ensures there are adequate supplies and equipment to meet the needs of the Division. + Performs related duties as required. All responsibilities noted here are considered essential functions of the job under the Americans with Disabilities Act. Duties not mentioned here, but considered related are not essential functions.Job Qualification+ Bachelor's Degree required, or equivalent combination of education and related experience. + 10+ years of relevant experience and 2+ years of leadership / management experience, required."}