{"title":"Software Engineer, Mid NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJXXfs4Yl81_B_hGARhhweFZpWo6cOx2QP1qPyk2MafE8StpbARzZSfiVHHcKCDSewzUyWkY0NE6RAbLxObelItrIyRJro6GIojFoBOsWOV71Me_Mo7Ae5TWZ9WfVz4WEbmCGFz2-GN_jbTcckOwD2NXc5RP0GcQc9_NBRdCOAkDceuQqyCqIQPji8iN5ek","source":"ziprecruiter","full_description":"Software Engineer, Mid Buckley AFB,CO,US Apply + Be you+ Be Booz Allen+ Be empowered+ Learn MoreJob DescriptionLocation: Buckley AFB, CO, USJob Number: R0067447Share job via: Share this job: Share Share Software Engineer, Mid with FacebookShare Software Engineer, Mid with LinkedInShare Software Engineer, Mid with TwitterShare Software Engineer, Mid with a friend via e-mailSoftware Engineer, Mid The Challenge:Are you looking for an opportunity to not just develop software, but to help build and maintain applications and systems that will have a positive impact in the intelligence community? As a software engineer, you can solve a problem with a complete end-to-end solution in a fast-paced environment. We're looking for a software engineer with the skills needed to analyze and develop agency mission-critical applications and possessing a wide range of capabilities, including numerous engineering, business, and records management functions. This role is more than just coding. We need a software engineer who will use their passion to learn new tools and techniques and identify needed system improvements. You'll research operating systems-level software, compilers, and network distribution software for industrial, military, communications, aerospace, business, scientific, and general computing applications. You'll set operational specifications and formulate and analyze software requirements. You'll apply principles and techniques of computer science, engineering, and mathematical analysis. You'll develop plans for automated information systems from project inception to conclusion including systems requirements determination and design subsystems to support software reuse and domain analyses and manage their implementation. You'll perform hardware and software tuning, analyze workload and computer usage, maintain interfaces with outside systems, and analyze downtimes and proposed system modifications, upgrades, and new COTS. You'll define the problem and develop system requirements and program specifications, from which programmers prepare detailed flow charts, programs, and tests. You'll ensure proper implementation of program and system specifications through close coordination with programmers and develop system alternative solutions. Join us as we build systems to change the intelligence community for the better.Empower change with us.Build Your Career:A challenging and dynamic work environment isn't all we have to offer. When you join Booz Allen, you can expect: + access to experts in virtually every field+ a culture that focuses on supporting our employees+ opportunities that provide stability while offering variety You'll also be exposed to a wealth of training resources through our Digital University, an online learning portal featuring more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, onsite boot camps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We'll help you develop the career you want, as you chart your own course for success.You Have:-5+ years of experience with supporting systems engineering efforts in system design and evaluation, solution engineering, software development, or system administration -5+ years of experience with Java, C, C++, or Python development in an academic or professional work environment-Experience with Linux and Windows OS-Active TS/SCI clearance with a polygraph-HS diploma or GED-Security+ CE, SSCP, CCNA-Security, or GSEC Certification or obtain within 6 months of hireNice If You Have:-Experience with working in an intelligence community environment-Ability to work in a fast-paced and collaborative team environment-Possession of excellent analytical and problem-solving skills-Possession of excellent oral and written communication skillsClearance: Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance with polygraph is required.We're an EOE that empowers our people-no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, veteran status, or other protected characteristic-to fearlessly drive change. #LI-AH1, APC4, CJ1, NSG1"}