{"title":"Senior Full Stack Developer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL_qUTxXiYuzTvbdv85nSKU_ZFulNrXlq9yH7sMgZE4sKY9LYPW2vWcocz6cjafxOn759hUnHFuGtbYDqTizmRQUtNtAdtjXh6xVjaCbUptcmHrgFcGaBEVhJw1NfwVhuwdka2154giIAn0j5-DGRGGS8mxXHLSrDeEcYCoovoJmwvzk7j8O6nSAV55rPc","source":"ziprecruiter","full_description":"Keller Offers is…Keller Offers is an affiliate of Keller Williams Realty International. We leverage technology to train and equip Keller Williams Agents with the tools necessary to empower their clients with an ever-growing list of options to sell their homes in a way that best suits their individual needs. We have already launched our Cash Offer option, where home sellers are provided a fair market value, cash offer, to move on their timeline. We’ve also had a limited launch of our Ready to Sell Program which handles upgrades needed to take their client’s home to market and generate top dollar. We are currently in preparations to roll out additional Keller Offers divisions so we can one day fulfill every consumer need all in one convenient location. We distinguish our offerings from competitors by remembering the consumer experience is our north star and the elevation of the industry and brand are our guiding principles.We believe…Keller Offers values an open, collaborative work environment that provides a positive work/life integration and believes the unique gifts and attributes of each member of our team elevate the collective to offer us all a company with which we are honored to be associated.A Senior Full Stack Developer (AWS DevOps)…The Senior Full Stack Developer (AWS DevOps) will have a strong background in AWS micro-service architecture, with the ability to listen to the team's needs and architect a solution from the ground up. This position requires deep experience working in the AWS ecosystem building micro-services and terraform IaC resources from scratch.The ideal candidate will demonstrate strong experience in:Typescript, Terraform (AWS), NextJS, Serverless, LambdaRedux (legacy) → GraphQL Apollo Client (current)Node.js (RESTful APIs - legacy) --> GraphQL, NestJSWe are seeking…A highly skilled Senior Full Stack Developer (AWS DevOps) who is comfortable with both frontend, backend, and IaC (Terraform). You will be responsible for developing and designing frontend, backend, and infrastructure while working alongside the development team, among other duties. You will be required to see out a project from conception to final product, requiring organizational skills and attention to detail.Minimum of 4 years of Typescript and React requiredMinimum of 2 years Terraform (AWS) required (i.e SQS, IAM)AWS cloud technology (S3, EKS, Lambda...)Understanding of React HooksExperience with application state managementRedux / GraphQL / ApolloExperience with RDBM / PostgreSQL database schemaModern authorization mechanisms / CognitoBonus Skills:B.S. in Computer Science or comparable knowledge of cloud application engineeringExperience with GitLab or CircleCiExperience with NoSQL / MongoDBKeller Offers perks and benefits…Earn a competitive salaryTake advantage of our amazing health benefits which include a large percentage of employer-paid health coverage as well as 100% employer-paid employee dental coverageParticipate in our company-sponsored 401(k) planDon’t stress over a formal business wardrobe - our dress code is smart casualExcel in your career with our advancement opportunities for outstanding performersBe a part of our growing and collaborative teamDo you seek to be a part of an exciting, collaborative environment on the cutting edge of industry transformation? If your answer is yes, apply today!We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}