{"title":"Senior/Junior Software Developers","location":"","salary":"","description":"","term":"$70,000 to $110,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKB0SouH83mvn5mPYUJ-yLjLF7slZ9iH_Ej1T155Y83DYp7a5gFHPGcKkcM-Gn7J-KBNnkSjCzsnMqqM86D6FuDvSERntMXrsP5lBvlBTC_ib3l7HaAKcImtoLHuCAGzFeeNVF6WlVkKE7KZQkzyNzAPk8G3rP7S7UBkgxXvDIfl3AgYxz1Lb7XTMlsRhx0","source":"ziprecruiter","full_description":"SENIOR/JUNIOR SOFTWARE DEVELOPERFort Wayne, IN | $70K-110k+/- Great benefits & perks— Fun & Innovative CultureFULL-TIME, PERMANENT, ON-SITE, DIRECT HIRE OPPORTUNITY!(hiring company is not able to sponsor visas or offer remote work)Now's your chance to join the team, as a Software Developer!Loving what you do for a living is important…and so is loving the company your work for and team you work with! This locally owned and operated company has grown from a small family owned business with one office to 800 staff members reaching across the country. They have been recognized in the top 100 companies in America and named a Top Employer within their industry!WHY YOU WANT TO WORK HERE:Flexible work/life balanceRoom for career growthCompany stabilityContinued education/skills developmentAutonomy within a teamCollaborative and positive environmentGood benefits plan!SENIOR/JUNIOR SOFTWARE DEVELOPER RESPONSIBILTIES:Join a close, collaborative, and growing IT/Software team within one of Ft. Wayne’s best known and well-liked companies! The goal is to automate processes and systems and have continual improvement. Everything they do is to make the lives of clients and staff easier.IDEAL CANDIDATE WILL HAVE:Good culture fit:Team playerSteady, calming presence with a healthy sense of urgencyReliableSelf-motivated, efficient, effectiveNaturally organizedCan handle switching directions/focus quicklyCommunicates effectively with tech and non-tech peopleAbility to make good decisions and meet deadlines.Can handle many projects and details simultaneously; holds self to a high level of quality.Flexibility to adapt to peak periods of heavy workload and pressure.EXPERIENCE & TRAINING3+ years software development experience in:VB.Net/C Programming environmentGit/SVN/Mercurial preferredSQLMobile Dev (Android & iOS)Proprietary softwareBachelor’s degree in a relevant field preferredFor more information about these Sr./Jr. Software Developer opportunities, please email your resume in strict confidence to Maggie Dillon at mdillon@cfstaffing.com today!KEYWORDS: C#, VB.NET, Information Technology, Software Developer, Software Engineer, Programmer"}