{"title":"Automotive Mechanic Technician NEW!","location":"","salary":"","description":"","term":"$20 to $35 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAK9YZP2GlDYU-QnWW6We1OiM2ZMUx_78stb-NyosEoH-glxZcp4WciciVtL1hAQDKHht51aUTlBU4ahFbb6Mw1NbC5DcZAvLiUJuI0xqEdPGCvzWUf5xG_KPMWKR5t7x0DgMH3gkrXF0vL2sgHXgjejVGtFEa4cIhtePlq3__URm7GNSoSZoH0wXEHwY0w","source":"ziprecruiter","full_description":"FELDMAN AUTOMOTIVE GROUP HUGE CAREER FAIRDATES: Monday & Tuesday, March 15th-16th.LOCATION: 3372 Highland Rd, Highland, MI 48357TIMES: 9:00am-5:00pmREGISTER: We Will ConfirmWE ARE SEEKING TOP AUTOMOTIVE MECHANIC/ TECHNICIANGuaranteed Face to Face InterviewsExtremely busy auto group seeking certified technicians.We pay top dollar for the best techs.If you spend your days concerned about lack of work, unfair dispatching, unsafe equipment, dirty shops or lousy moral you owe it to yourself and your family to schedule a 100% confidential interview.Dealer experience is not required but a hunger to earn more than you ever have is.We have enough work for a tech to average 80-100 hours per week with a great mix of CP and warranty work.We are the fastest growing dealer group in metro Detroit and we got that way by hiring the best and treating them right.We are looking for a skilled Auto Mechanic to maintain and repair vehicles. You will be responsible for troubleshooting issues and fixing them aiming to maximum reliability and functionality. An excellent auto mechanic has good eye-hand coordination and manual dexterity. They are well-versed in complex mechanical or electronical systems of vehicles and have excellent problem-solving abilities. They must be good communicators to provide advice to customers.Auto Mechanic/ Technician ResponsibilitiesInspect vehicle engine and mechanical/electrical components to diagnose issues accuratelyInspect vehicle computer and electronic systems to repair, maintain and upgradeConduct routine maintenance work (replacing fluids, lubricating parts etc.) aiming to vehicle functionality and longevitySchedule future maintenance sessions and advise motorists on good vehicle useRepair or replace broken or dysfunctional parts and fix issues (e.g. leaks)Provide accurate estimates (cost, time, effort) for a repair or maintenance jobKeep logs on work and issuesMaintain equipment and tools in good conditionAuto Mechanic/ Technician SkillsProven experience as auto mechanicExcellent knowledge of mechanical, electrical and electronic components of vehiclesWorking knowledge of vehicle diagnostic systems and methodsAbility to handle various tools (e.g. pliers) and heavy equipment (e.g. lift)Willingness to observe all safety precautions for protections against accidents, dangerous fluids, chemicals etc.Excellent physical conditionHigh school diploma is preferred; Certification from a vocational school or completion of apprenticeship is preferredValid certification (e.g ASE) is a definite plusJob Type: Full-timePay: $35,000.00 - $100,000.00 per year"}