{"title":"Technical Support Specialist (Help Desk)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIGhgDagYB-FrFVPSWJm5KkFQR6CvtE3B6xniV2hlsmVpyQ3p0CdhoCbWfKEbH-BJelKMgVSFQ-TqptpPbYEEDt6WUzL22jKt4IOuyPIZAJt-YQmjCaquh4SCzvId1D2Xm9p7JldVkrOdWLLSCY7sv15RuLcuDaRMx4QhaAR32SwySkCO6xaTXQf0PjEBQt","source":"ziprecruiter","full_description":"We are seeking a Technical Support Specialist 2 at our headquarters in Kansas City.  In this role, you'll provide first and second level IT support to internal end users and respond to their needs and/or alerts through moderately complex troubleshooting, resolution, or escalation steps.  Manage and implements initiatives or change controls. Other essential functions include: Install and maintain desktop technologies (Desktops, Laptops, Phones, Monitors, Printers, etc)Assist in person, or remotely, in the resolution of support issues among company sites to ensure timely distribution of knowledge and positive impact on user satisfactionMaintain printing and assist with network printer system maintenanceResearch, resolve, and respond to questions received via telephone calls, e-mail, walk-ups, incident tickets and callbacks in a timely manner, in accordance with current proceduresAcquire and maintain current knowledge of relevant IT product offerings and support policies in order to provide technically accurate solutions to Garmin associatesMonitor conference room performance, scheduling and maintenance Assists associates in IT Specialist 3 role on projects, initiatives, and complex support issues as assignedManages and implements initiatives or change controls in an Agile environment with ITIL best practicesMakes recommendations for process improvements and self-service initiativesIdentifies interdependencies in system and application componentsCreates work instructions and knowledge base articles to empower associates and transfer of knowledgeDemonstrates proficient use and IT knowledge of standards and proceduresProvides reliable solutions to a variety of problems using sound problem techniques including performing root cause analysis and identification of corrective action for given problemsCommunicates in written and verbal form effectively in a large team or departmental setting Serves as a mentor and trainer to less experienced IT SpecialistsResponsible for working after hours in an \"on call\" capacity based on a rotation shared by the Help Desk and Technical Support Specialist TeamsPerforms other duties as assisgnedTravel to other Garmin locations to provide onsite support as neededQualified candidates possess a High School diploma or GED and coursework towards completion of an associates degree OR a minimum of 4 years IT or technical experience.  Other requirements include: Outstanding academics with the demonstrated ability to apply learned knowledgeDemonstrates moderate familiarity with troubleshooting and research tools for Mac, Linux and Windows SystemsDemonstrates moderate familiarity with asset, service, monitoring, and documentation tools (eg ITJira, Confluence, Sharepoint)Previous experience working in a business team environment preferredA+, Network+, Security+, HDI Desktop Advanced Support Tech, Apple Certified iOS Tech and Linux+ CertificationsModerate knowledge with network support tools, fundamentals and technology to include, TCP/IP, DHCP and DNS client and printer configurationModerate Linux fundamental, powershell, shell scripting, SCCM, Jamf and SSHPrevious experience working with IT vendors and partnerDemonstrated strong and effective verbal, written and interpersonal communication skills in a small team settingGarmin International is an equal opportunity employer.  Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran’s status, age or disability."}