{"title":"SR. Field Service Engineer - Packaging, Conveyor, Food - Automation, PLC, F","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKF6Qhu31wesJ9YGSc0fol0JlFGFMJy2WsPHfKx-WwMCuO4fO7IfBKeWMJp-ObjH8ubIPOhKUZ5dcJCBe_Hn6m61xX6ge2y0uf7AR_9yDht7jzgQLOjHeRBfXYBxsARNGaiIXoyGmDNq23Ex6efoFKC1KA2T6uGmxSqWqE79huryvdisjFi9b92EC4ysbw","source":"ziprecruiter","full_description":"SR. Field Service Engineer – Packaging, Conveyor, Food – Automation, PLC, Fanuc $36 – 44/hr ($75 - $90k) plus OT, paid travel time – Direct Hire - Sr. Field Service Engineer with 3 or more years experience - Automated Industrial Machinery – Packaging, Conveyor, Palletizing, Food Processing - National Territory based from home An international, highly rated OEM manufacturer of industrial automated equipment used in multiple industries is searching for a Field Service Engineer with 3 or more years of experience on a direct hire basis.  The Company50-year-old OEM manufacturing company of automated machineryThis position is open due to growth and expansionInnovative industry leader that has the latest technologiesA strong focus for the company is on service and high quality - main reason for sustained growthExcellent compensation – up $75k - $90k plus OT.  The PositionPerform installation, commissioning, pm and repair to industrial automation equipment for 3 or more years – (Prior experience as a Field Service Engineer is required)Mechanical, Electrical, Pnuematics and Hydraulics backgroundFanuc, robotics, PLC troubleshooting is very desirable for the positionDispatch from home work is throughout the U.S. primarilyNote: There are times when you would need to be on site for an installation/commissioning for 1 – 2 weeks or more at a time The DetailsField Experience with Automated Machinery, Packaging, Food Processing, Palletizing and  knowledge of PLC is neededRobotics, Fanuc is highly desirableAbility to travel up to 80% or more throughout the US and sometimes internationallyMust have valid driver’s license, a passport (or gain one), ability to pass a background check None"}