{"title":"Senior Business Intelligence Developer NEW!","location":"","salary":"","description":"","term":"$95,000 to $125,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJoeDNSoU3yTMK1KJ0oDVDOPm3qTnLozyi_fJn4TM4d-XN2f9xkd2jWDgpzdt46GEwRTJcGGMUWnqzNPd558dTGJxZklTJkJAsqq_d-nokSEKKP44xB2SCLKXV59xHmVKf_jBLcKm1CeDwFpxH2FhI4NIrAaf9FG-m97HrosV5-1Dvz9vjA3wp5PZJ2XKg2","source":"ziprecruiter","full_description":"Senior Business Intelligence DeveloperOur Fintech client’s vision is to transform the way companies are doing business together, by accelerating next generation digital payments and creating a network to make billing and payments easy for buyers and sellers. They have built an exceptional 200+ person team dedicated to delivering a customer-centric accounts receivable experience for our clients and their end-customers. Our client is seeking team members who are hungry, humble and smart to help drive the next level of growth in finance transformation.Our client is actively seeking a Senior Business Intelligence Developer (Data Engineer) who is functionally knowledgeable in cloud platforms such as Azure/AWS/GCP and has hands-on experience in designing, architecting, and implementing large scale data processing/data storage/data distribution systems. This is a full-time permanent position and although the position will be “remote / telecommute” for the foreseeable future, the ideal candidate will reside within a reasonable commute to the North Atlanta Suburbs (ideally Roswell/Alpharetta). Post COVID – the vision is for this position is to come into the office one (possibly 2) days per week.The Senior Business Intelligence Developer will be collaborating with business leaders and IT to create and implement innovative and high-quality solutions. You will provide best-fit solutions for connecting to data platforms including data lakes, data warehouses and APIs. You will collaborate with fellow Analysts and Senior Technologists in developing complex end-to-end Enterprise solutions.The Senior Business Intelligence Developer will also contribute in a variety of roles in thought leadership, architecture, data modeling and design, ETL/ELT for cloud computing environments, testing, debugging, and documentation.How the Senior Business Intelligence Developer will make a huge impact here - and on your career:Build scalable and reliable Data Warehousing solutions using architectural best practices for internal and external application data sets.Create optimized data models (star schemas, snowflakes) for data warehouse solutions.Design and build facts, dimensions, snapshots using python, spark, informatica integration solutions.Develop ETL/ELT data pipeline which are easy to maintain and monitor.Identify opportunities to automate and improve existing data processes which bring high leverage to the firm.Possess a good understanding of project estimation as well as team run functions to deliver solutions as well as troubleshoot and fix data queries and issues.Collaborate with multiple teams using various agile methodologies to deliver world-class analytics solutions to business stakeholders.Arbitrate critical decisions correctly considering data best practices, system realities, and numerous stakeholders’ feedback.Mentor and develop other technical leaders; creating opportunities for those around you.What the Senior Business Intelligence Developer will bring to the team (ie Requirements):Experience designing and building large-scale production data solutions utilizing modern data technologies. Ideally, the candidate will have 5+ years of experience as a BI Developer, Data Engineer or Data ScientistExperience across a variety of cloud and data solutions, including Snowflake/Redshift/SQL DWH (Synapse), Kafka, Spark, Fivetran, Airflow, Matillion, Looker, TableauA command of various programming languages to collect and manipulate data, such as SQL, Python, and R.Comfortable operating in environments subject to regulatory, compliance, and risk-based security requirements with Fintech industry experience highly preferred..A strong focus on monitoring data resiliency, integrity, and availability through processes and systems.The Senior Business Intelligence Developer should have experience designing service management, orchestration, monitoring and management requirements of cloud platform. Professional Cloud Certification in one or more of the following technologies preferred: Cloud, Database, Big Data, BI, Data Science, Machine Learning, Artificial IntelligenceExperience with running Machine Learning experiments a plus.A passion for evangelizing how data can impact decision-making.The technical aptitude, enthusiasm, and desire to adapt to change, learn new technologies and understand relevant industry and cloud trends.The ability to thrive in a collaborative environment while also being a strong individual contributor with a proactive mindset.Preferably a degree in Computer Science, Information Technology, Engineering, Applied Mathematics, or related field.This role is a very hands-on / heads-down development role and the ideal candidate will thrive in this type of role."}