{"title":"Electrical Engineer II (Firmware)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIBFTXzFYKhMnNrZUdsmmKKqznYRT_WnHaueI5BgJjD24WS6B4anPxAvvpQ0429fSfN2aagOvxWugQWtHA55r0oo55HMEn6B1vHnhkWjW6MEzwQFlOH-EjsgoH3_tKLNARvbrnjw8reL0uz4h2_YUtE6uU5F1V49fCdCex-4RqLw0gn-6vUwoFfjp027Ebn","source":"ziprecruiter","full_description":"Headquartered in Arlington, Virginia, Technology Service Corporation (TSC) is an employee-owned company that has been providing high-quality technical services and solutions for our customers’ for over 50 years. Our diverse portfolio includes providing full lifecycle support in Precision Strike and Area Effects; Area Protection; Airborne Sensors and Intelligence, Surveillance, and Reconnaissance (ISR); Vehicle Protection; Electronic Warfare Systems; Air and Missile Defense; Space Systems, and Intelligence and Information Systems. TSC offers a professional working environment, a competitive salary, and an excellent benefits package. Come and join our team. TSC Indiana Operations is looking to hire an Electrical Engineer specializing in firmware development (Electrical, Computer, or Software Engineer) with experience supporting automated test and control systems. The successful candidate will support the requirements gathering and documenting; implementation, testing, and integration of software; and ongoing feature support to customers. Responsibilities: Work with team members and customers to develop system requirementsImplement software/firmware for electronics systemsFollow best practices in development to provide quality softwareWork with customers to integrate software application with hardware Provide documentation to support ongoing development and/or use of the test systemsRequired Qualifications: Bachelor’s Degree in Electrical, Computer, or Software Engineering3+ years of experience developing firmware using C, C++, or other languagePreferred Qualifications: Object-oriented programming experienceMicrocontrollers and/or FPGA development experienceLabVIEW programming experienceStrong communication skills, both written and oralSelf-motivated, independent, detail oriented, responsible team-player Excellent teamwork and interpersonal skills Ability to manage customer relationshipsAbility to support multiple concurrent projectsEligibility to Obtain a DoD Security Clearance Required for this Position: Yes, must be able to obtain and maintain a government-issued security clearance of secret level or higher; interim may be required before starting Job Type: PermanentSchedule: Full-timeTravel: YesRelocation Assistance Available: YesPosition Contingent Upon Award of Contract: NoTSC Benefits: TSC offers a stable work environment, a competitive salary and a comprehensive benefits package; including ESOP participation, 401k Plan, Flexible Work Schedules, Tuition Reimbursement, Co-Sponsored Health Plan, Paid Leave and much more. Applying to TSC:Only those candidates invited for an interview will be contacted. Employment at TSC is contingent upon the successful completion of a comprehensive background check, security investigation, and a drug screening. TSC is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity Employer/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability or any other protected class.#zr"}