{"title":"Research Technician/Lab Manager, Department of Chemistry - Georgetown College","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALbwVESKZA0uqUX-ARiNPMyoo3Xl8evHisfITtJqDLufMpFvHluyUfnRH20bePE_YJxnVekxz6kz2kh940nbiB_flu-QfzykUp_tQyf78KrsAToIKCsXrIKEWSVV8KQw9V02uf8zpIAcby8dYsf1TG0T08lp2l1-9lWU2M1TntAk7o6ccmWvQRu8-q019w","source":"ziprecruiter","full_description":"Located in a historic neighborhood in the nation's capital, Georgetown offers rigorous academic programs, a global perspective, exciting ways to take advantage of Washington, D.C., and a commitment to social justice. Our community is a tight knit group of remarkable individuals interested in intellectual inquiry and making a difference in the world.RequirementsResearch Technician/Lab Manager, Department of Chemistry - Georgetown CollegeThe Department of Chemistry (https://chemistry.georgetown.edu/) in Georgetown College, at Georgetown University offers many exciting learning and research opportunities in core and emerging interdisciplinary areas of chemistry that are at the forefront of modern chemical sciences. The Department regularly boasts an annual productivity of more than 60 peer-reviewed papers in top chemistry journals. International collaborations in South America, Europe, and Asia, the opening of the state-of-the-art New Science Center (http://college.georgetown.edu/about/college-initiatives/regents-hall/) , and the planned increase in the number of faculty and students will further enhance our department's cutting-edge research opportunities.The Biochemistry Laboratory of Professor Esther Braselmann has core research areas that include molecular biology, tissue culture and fluorescence microscopy, as well as the opportunity for students at all levels to participate in the research enterprise. Reporting to Professor Braselmann, the Research Technician/Lab Manager has duties that include but are not limited to:Lab Management + Orders chemicals and materials, serves as main contact for vendors, and maintains internal database of chemicals and materials.+ Oversees tissue culture operation - ensures that equipment is functional, prepares common media and stock solutions, trains students in common procedures, and orders and stock materials.+ Oversees common equipment, supports Dr. Braselmann in simple equipment maintenance tasks, and coordinates access to equipment for lab members (e.g., set up Google calendars and maintain access).+ Onboards new students (develops checklist for safety trainings, adds new members to internal online groups, and supports Dr. Braselmann in training students in simple lab protocols).+ Oversees and coordinates access to common equipment, trains students in common techniques, oversees onboarding of students in the lab, ensures that inventories of research outcomes are up-to-date (data organization, fridge/freezer organization and inventory), and supports students in day-to-day trouble shooting of common techniques.+ Interacts with the University's Environmental Health & Safety, and maintains existing safety protocols, records of student training, and protocols and lab procedures. Laboratory Research + Conducts laboratory research in close collaboration with students.+ Performs experiments guided by research goals outlined in grants in the Braselmann lab, including molecular biology, cloning, tissue culture, and fluorescence microscopy.+ Collaborates closely with students at both graduate and undergraduate level.+ Participate in lab meetings. Qualifications + Bachelor's degree in Chemistry, Biochemistry or a related field+ Minimum 3 years of relevant experience+ Experience in a research laboratory setting in the field of biochemistry or a related field+ Experience in tissue culture and molecular biology+ Experience in leadership - demonstrated in different ways, such as hands-on mentoring, training other researchers in techniques, and/or developing protocols and procedures that other researchers execute. Preferred + Experience in microscopy and image processing+ Experience in laboratory management The position of Research Technician/Lab Manager is an initial 1-year term position.With your application, please upload the following (preferably in a single PDF): + Cover letter+ CV Current Georgetown Employees:If you currently work at Georgetown University, please exit this website and login to GMS (gms.georgetown.edu) using your Net ID and password. Then select the Career worklet on your GMS Home dashboard to view Jobs at Georgetown.Submission Guidelines:Please note that in order to be considered an applicant for any position at Georgetown University you must submit a cover letter and resume for each position of interest for which you believe you are qualified. These documents are not kept on file for future positions.Need Assistance:If you are a qualified individual with a disability and need a reasonable accommodation for any part of the application and hiring process, please click here (http://ideaa.georgetown.edu/ada) for more information, or contact the Office of Institutional Diversity, Equity, and Affirmative Action (IDEAA) at 202-687-4798 or ideaa@georgetown.edu.Need some assistance with the application process? Please call 202-687-2500. For more information about the suite of benefits, professional development and community involvement opportunities that make up Georgetown's commitment to its employees, please visit the Georgetown Works website (https://georgetownworks.georgetown.edu/) .EEO Statement:Georgetown University is an Equal Opportunity/Affirmative Action Employer (https://policymanual.hr.georgetown.edu/https%3A//policymanual.gudrupal.georgetown.edu/201-Equal-Employment-Opportunity-Affirmative-Action) fully dedicated to achieving a diverse faculty and staff. All qualified applicants are encouraged to apply and will receive consideration for employment without regard to race, color, religion, national origin, age, sex (including pregnancy, gender identity and expression, and sexual orientation), disability status, protected veteran status, or any other characteristic protected by law (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf) .Benefits:Georgetown University offers a wide variety of comprehensive and competitive benefits. Benefits packages include comprehensive health, dental and vision plans, disability and life insurance coverage, retirement savings programs, tuition assistance, voluntary insurance options (including group legal, accident, and critical illness), and much more. Whatever your need, the Office of Faculty and Staff Benefits will be standing by to support you. You can learn more about the benefits offered to eligible faculty and staff at https://benefits.georgetown.edu or view the online interactive benefits guide (https://s3.amazonaws.com/georgetown/2019/2019-Benefits-Guide/index.html) for more information.Georgetown University is one of the world's leading academic and research institutions, offering a unique educational experience that prepares the next generation of global citizens to lead and make a difference in the world. We are a vibrant community of exceptional students, faculty, alumni and professionals dedicated to real-world applications of our research, scholarship, faith and service.Established in 1789, Georgetown is the nation's oldest Catholic and Jesuit University. Drawing upon the 450-year-old legacy of Jesuit education, we provide students with a world-class learning experience focused on educating the whole person through exposure to different faiths, cultures and beliefs. Students are challenged to engage in the world and become men and women in the service of others, especially the most vulnerable and disadvantaged members of the community.These values are at the core of Georgetown's identity, binding members of the community across diverse backgrounds."}