{"title":"EHR Clinical Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIVuYtIQf1xFksHz5HBepDxa2mXnwNThj9xbEzN-eSSx9CWnbLFYRQLQs15chmgcTeE1I6-SAzInbaknWsB0Ob596zMlN1Ut1N3WqEh8WEjRnbDuKCsAChH4FStD4y9EeexVtAUYaqQTIjlHlGT-bWhlmcVFQmjeAgu0meftOLiWohhSebgXvKiyvjEBw","source":"ziprecruiter","full_description":"OverviewCenturion Health is a leading provider of comprehensive healthcare services to correctional facilities, state hospitals, and community mental health centers nationwide. We are proud to be the provider of comprehensive healthcare services to the Kansas Department of Corrections.  We are currently seeking an EHR Clinical Developer to join our Kansas Regional Office Team in Topeka, Kansas.Available ShiftFull-Time ResponsibilitiesUnder the direction of the EHR Project Manager, the Electronic Health Record (EHR) Clinical Developer will work with the Centurion EHR Department to design, conduct, and evaluate EHR related educational programs. This includes developing curricula and materials and delivering classes, in-services, orientations, workshops, seminars, and other training services for staff. Additionally, the EHR Clinical Developer will monitor course completion and training feedback and provide any support to EHR users as needed. BenefitsWe offer excellent compensation and comprehensive benefits for our full-time team members including:Health, dental, vision, disability and life insurance401(k) with company matchGenerous paid time offPaid holidaysFlexible Spending AccountContinuing Education benefitsMuch more...About UsCenturion Health contracts with state and local governments nationwide to provide comprehensive healthcare services to correctional facilities, state hospitals, and other community settings. Our dedication to making a difference and our passionate team of the best and the brightest healthcare employees has made us one of the leaders of the correctional health industry. Whether you are driven by purpose and impact or on a journey of professional growth, our opportunities can offer both.QualificationsExperience managing, developing, and implementing education and training programsExperience in a correctional environment preferredExperience with Correctional EHRs, NextGen preferredSkilled in use of computer software for developing professional trainingAbility to pass background investigation and obtain agency security clearance where applicableindmhm #PPMHM Services, Inc. d/b/a Centurion Group, Inc. (“Centurion”) is an Equal Opportunity Employer."}