{"title":"Electrical Engineer (in KY) NEW!","location":"","salary":"","description":"","term":"$75,000 to $85,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIHFmWKmFm_ZVEqTi6GYsyEdhK2WXjwgzBJ44JzzC1aAuYvmTsLaD500eAFBwH4tpWIAVEhKumRTLBqQXvE51kSQsTpDLXIMDyq8o21A3sJWzTCtgIs781YU_wVqk2f0jvgY4iC-N-TULYZyb7dhNdBjVpVPE-qPcpP1xyB5u_nrL0-WUWU_muDP7xfoDc","source":"ziprecruiter","full_description":"We are looking to fill a full time Electrical Engineer position with an automotive supplier located in the area of Franklin, KY. 2- 5 years of Electrical Engineering experience within a manufacturing environment is required.Salary Range: $75k to $85k DOE plus relocation assistance. Great Benefits.Job Description:Support manufacturing through design and implementation of automation solutions to increase efficiency, ensure quality and minimize scrap. Serve as a technical resource for the manufacturing business units. Support the engineering department with assistance on capital projects as needed. Support the Maintenance Department with PM activities and function as a technical resource, whenever required. Support the plant’s ongoing Continuous Improvement efforts, as necessary.Qualifications:· B.S. in Electrical Engineering or Electrical Engineering Technology is required· 2-5 years of hands-on Electrical Engineering within manufacturing work experience is required.PLC programming and robot experience is required· Must have hands on work experience with all common electrical diagnostic equipment: meters, scopes, testers, etc., in addition to practical experience with low voltage power distribution and electrical/electronic/electro-mechanical control principles. Proficiency with PLC programming in a manufacturing environment is required. Experience with Mitsubishi PLC hardware/software, Mitsubishi touchscreens/software, and Motoman robots is highly desirable.Preferred Skills:· Technical· Troubleshooting Ability· PLC Programming· HMI Programming· Electrical Controls Design· AutoCAD Proficiency· Root Cause Analysis· Mistake proofing· Cost justification· Proficiency with common software (MS Excel, Word, Access, etc.)PLCMotormanMitsubishiHMIElectrical controls"}