{"title":"DSP Software Developer (Cincinnati, OH)","location":"","salary":"","description":"","term":"$60,000 to $140,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIUfqpkaXZ1YpWNW21xKOjP-KrFq1ZLvZJsa4DNW3H8YDf7bioWWmYWj8tc6aEL4CFO2v9gcy0ZTmKRk1-wyo6Q4_nY8J2EYsicU86giFb9UturCp_JbZz3GuDnVJ-Im_bs-eVmkEsJp58UWqBMG8f8_v3CkLK7aJLVaRSXPVLXJlAmr9mI_RzYr1vnfyY","source":"ziprecruiter","full_description":"3dB Labs is seeking skilled software developers at all experience levels who love to solve challenging digital signal processing problems. The ideal candidate is creative, smart, and able to work effectively on their own or with a small team. Our work provides the opportunity for a unique mix of theory-based algorithm development and implementation of software-based high-performance processing solutions. Our work environment is dynamic and fast-paced with a focus on quick-reaction responses to our customers' needs. Our products are technically compelling, operationally relevant, and deployed around the globe.Our employees are typically BS/MS holders in electrical engineering, computer engineering, software engineering, or computer science, but we will consider anyone with demonstrated skills and interest in software development and/or signal processing. The following experience areas are particularly of interest:Desired Programming languages/frameworks/platforms:C++ (highly desired, as it is our primary development language; all versions from C++98 onward depending on the project)Python 2.x/3.x (not strictly required; useful as a complement to our C++-based tools)GUI development using Qt 5 frameworkGPGPU software implementation using CUDADevelopment of software for Linux operating systems (our primary target platform)Desired Experience with our target application domains:Digital signal processing and signals and systems theoryBackground in software defined radio and digital communication theory is a major plusWorking knowledge of communication systems design and/or RF system design is desirableAlgorithm implementation using multithreading and SIMD techniques, mostly on x86 platformsProven strong analytical and critical thinking skillsAbility to work independently with freedom to develop your own creative technical solutions to our problemsCurrent or past US security clearance is a major plus3dB's small but growing team enjoys a great work environment, a flat organization without red tape, competitive compensation, and benefits that include:100% coverage of employee and dependent medical, vision, and dentalCoverage of co-pays and deductibles401k, profit sharing of up to 25% of your salaryFlexible hoursBank of holiday and PTO hoursUS citizenship is required for all of our positions. This job is located in Ohio."}