{"title":".NET C# Engineer with cloud experience No C2C No Visa options NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIsA3DaEG3P0pwoe24lJ-QeDVaYeche1zlzZ7i47nkdrdeEp6hrr_kAl8aE1YjhbE9cdjsqMYU9QL3pccRcgf-0EXWijIGeSMws1uRXcAvruKQh_1JhOwdCiNzCQuPbdRWsgscoT93jnh9GF4aFBGZH35-gOvmlZ3eY-bftVhP-JF6zN0TUBsYZqom0wCA","source":"ziprecruiter","full_description":".NET / C# Software Engineer with AWS experience is a bonus - HVisa is not an option....Perm job NO C2C please......This key Senior Full stack .Net C# Engineer will have the responsibility of developing a large and complex applications. This leader / self-starter will be responsible for bringing websites and apps to life. They will take the vision from designers and execute on that using the modern technologies. Working under experienced technical architects and leads, this is an opportunity to join an exceptional team.· Designs, develops, tests, and delivers software solutions using one or more commercial languages as well as, open source tools. Develops and delivers software in an Agile/Scrum environment.· Engages with key stakeholders to ensure requirements, schedules and all expectations are understood by the development team and stakeholders for assigned software solutions and software maintenance. Keeps manager and stakeholders apprised of progress. Knows when to escalate.· Develops and executes automated unit testing for all assigned software solutions.· Supports infrastructure and network teams in analysis and resolution of issues that are software solution related.· Performs all functions necessary to take software solutions from planning to implementation. Escalates appropriately if deadlines are in danger of being missed.· Coordinates with management to ensure identification of appropriate schedules, goals, design criteria, methodology, etc.· Shares knowledge, lessons learned and best practices among the team.· Supports and guides the delivery of software solutions. Provides appropriate documentation.· Follows all defined software solution methods, processes, and procedures.· Performs other duties as assigned and modified at manager’s discretion.KNOWLEDGE, SKILLS AND ABILITIES:· Expert full-stack developer using .Net/ C# tools· Expert across the full SDLC in an Agile / Scrum environment· Experience developing and delivering single page applications Web applications· Extensive experience with continuous integration & deployment· Demonstrated ability to work effectively as a team member· Experience with object-oriented design· Experience with Test Driven Development· Database modeling and design experience in relational database· Experience writing stored procedures, views, functions, and triggers in SQL Server environment.· Stays current with technology trends to provide best options for solutions· Ability to work with minimal supervision (Weekly Check-Ins)EDUCATION AND EXPERIENCE CRITERIA:· Bachelor’s degree in computer science, Computer Information Systems, Software Engineering, Software Development, Mathematics or a related field OR additional experience above the minimum will be considered in lieu of the required education on a year-for-year basis required.· At least (4) years full-time, professional job experience coding"}