{"title":"Senior iOS Engineer - Super Follows","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKCZtz7nbZFOgpDOp7qxL3P1Xsvw88X9uT6BGbNdoAzjDaSdURqGexI64y7Ef1E9f8QGXltcixd80m-mZpPtQHzFUqXlLtzlwxOAvzzvg2isrs1ZEOO_mH8g6x2VUavyjm9C7ST9ulN7DUegy24MJwjYvT4rA3OPi3ivYieeLiS2qygmxbcOx8epK2ODLRl","source":"ziprecruiter","full_description":"We bring the features of Twitter to iOS. This team impacts hundreds of millions of users, which brings with it interesting product and technical challenges at that scale. We keep development lightweight and agile, make data driven decisions, and release with high quality and velocity. Come be a part of our team!*Who We Are:*Our teams love using the latest web and mobile technologies for all features on Twitter, such as Tweets, Fleets, DMs, Live Broadcasting, Media and more. We build rich experiences that create new forms of content and improve the mechanics and comprehension of conversations on Twitter.On the client team you have the opportunity to have significant ownership and impact over major user-facing features that hundreds of millions of people love to use.*What You'll Do:*As part of the team you'll be responsible for using your creativity, excellent problem solving and technical skills to enable Twitter for iOS to reach every person on the planet. You'll instrument, measure, optimize and build high quality architectures and code in feature areas such as Tweets, Fleets, DMs, Live Broadcasting, Media and more.As an iOS engineer, you will work closely with designers, user researchers, data scientists, product managers, and the engineers that support the developer platform and infrastructure. You will use your passion and in-depth knowledge of all things iOS to craft the client components and features that will shape the future of Twitter for iOS.*Who You Are:*You are an experienced mobile engineer looking to make Twitter for iOS one of the best mobile experiences out there. You're someone who excels at user-centric product development and has a real passion for making beautiful, smooth, and delightful mobile experiences.* You are customer-focused and understand that shipping impactful software involves trade-offs and collaboration.* You want to apply your knowledge of iOS to work on a small team whose work impacts millions of users every day.* You get stuff done and thrive in a collaborative environment that allows you to interact effectively with others.* You have a strong sense of ownership and a curiosity to understand how things work, even if they take you outside your area of expertise.* You have experience with, and enjoy building, new products and features, and enjoy working with product managers and designers.* You are familiar with standard software engineering methodology, e.g. unit testing, code reviews, design documentation.* You bring thoughtful perspectives, empathy, creativity, and a positive attitude to take on problems at scale.* You are an advocate for the principles of accessibility, and build interfaces accessible to users with disabilities* You have empathy for your users and are interested in understanding the human impact of your work across all cultures and walks of life.*Requirements:** 4+ years experience developing mobile applications (on iOS with Objective-C and Swift)* Completed schooling in computer science or a related field, or equivalent work experienceJob opportunities should be equal. We don't discriminate. Period. In legal terms, that means: Twitter is an equal opportunity employer and doesn't discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any other legally protected status.San Francisco applicants: In response to the San Francisco Fair Chance Ordinance, we'd like to mention that we consider qualified applicants with arrest and conviction records.All your information will be kept confidential according to EEO guidelines."}