{"title":"Chemistry Co-op (Fall 2021)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKl6CELLw1VFmgZth0de84rpkSbkmEBo-BdJIdPBFSIy7f2c8UB78jCkpk4BSd5gZgYH5kO4jBkoi-QDY3sKnPNFOmuHvME85UiD0M1m1mp1nHslNmT9zNtJ_m1IjbeEQQFPTi7Zgas-8wVi_s2AXwqWyk_9I85FLurkXWAkeM8FRxZpVdLKCJSRKTjK_A","source":"ziprecruiter","full_description":"Battelle's founding mission \"to translate scientific discovery and technology advances into societal benefit\" is as relevant today as when we opened our doors over 90 years ago. Our science and technology enhance society's well-being and create critical innovations that drive scientific advances for the future. We conduct groundbreaking research and development, design and manufacture leading-edge products, and deliver critical services for commercial and government customers. Our work meets the needs of the nation when it matters most, and Battelle is committed to driving innovation today and for generations to come.We are currently seeking a Chemistry Co-op for Fall Semester 2021 . This position is located in Columbus, Ohio .JOB SUMMARY The selected candidate will work with our Advanced Materials group specializing in synthesis, formulation and processing, testing and evaluation of organic or polymeric materials.MAJOR RESPONSIBILITIES + Literature review + Organic Synthesis + Formulation of materials such as adhesives, sealants, and coatings + Physical and chemical property testing of materials (HPLC, GC, NMR, IR) + Testing and evaluation of materials such as rubbers, plastics, and metals + Will safely work in a collaborative fast-paced, team environment + Keep accurate records of lab experimentsTHE FOLLOWING IS REQUIRED + Must be currently enrolled in a bachelor's degree program in a science-based discipline, such as chemistry or chemical engineering + Sophomore standing or higher + GPA of 3.0 or above + Knowledge of lab procedures and capable of keeping accurate lab records + Knowledge of testing and characterization equipment + Ability to prepare and deliver written reports and presentations + Must be US CitizenTHE FOLLOWING IS DESIRED + Experience working in a laboratory or previous related internship experience preferred + Course work in polymer materials is preferred + Course work in organic chemistry is preferredLEGAL DISCLAIMER The above statements are intended to describe the nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, activities and skills required of staff members. No statement herein is intended to imply any authorities to commit Battelle unless special written permission is granted by Battelle's Legal Department.BENEFITSBattelle's competitive benefits program includes comprehensive medical and dental care, matching 401K, paid time off, flexible spending accounts, disability coverage, and other benefits that help provide financial protection for you and your family.Battelle provides employment and opportunities for advancement, compensation, training, and growth according to individual merit, without regard to race, color, religion, sex (including pregnancy), national origin, sexual orientation, gender identity or expression, marital status, age, genetic information, disability, veteran-status, or any other characteristic protected under applicable Federal, state, or local law. Our goal is for each staff member to have the opportunity to grow to the limits of their abilities and to achieve personal and organizational objectives. We will support positive programs for equal treatment of all staff and full utilization of all qualified employees at all levels within Battelle.For more information about our other openings, please visit www.battelle.org/careers"}