{"title":"Senior Software Engineer - NodeJS, Serverless","location":"","salary":"","description":"","term":"$120,000 to $140,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIynoWeLYSh5ahR7udNxa0jv9XptyGR-rL5wTrBidyGEE6D7DccAT_ZlqrSysWnRlKYMeXucF8NSxWc_pQ9uNkL72JJR25HQx-dXKcvSI4d8Pg4ByIAvQXboCFgTsCjxhcASr_tEiRF4xCfT9DWQnnnIQtgDONnCsLxlLXd3ZfN7tdrTK-BSbvsziy9fAE","source":"ziprecruiter","full_description":"Senior Software Engineer - NodeJS, Serverless If you are a Senior Software Engineer with NodeJS experience, please read on!Located in Indianapolis, IN, we're a well-funded startup developing and offering multiple products, both SAAS and consumer-facing. Work-from-home flexibility, pre-IPO stock, a competitive salary, and comprehensive benefits for a newly created, permanent Senior Software Engineer opening! Potential for relocation assistance!Top Reasons to Work with Us- Awesome, purpose-driven, tightly-knit team and great work environment!- Work-from-home and schedule flexibility!- Self-funded company by a 5x successful Founder who sold his last company for over $1 billion!- Offering pre-IPO stock that could end up being QUITE lucrative!What You Will Be DoingLocated in Indianapolis, we're a well-funded startup developing and offering multiple products, both SAAS and consumer-facing. We already have a live app with 25K+ downloads and a 4.8 star review within <6 months.You will work with our growing team of backend developers to build web and/or mobile applications from scratch through production in Node.js within AWS cloud infrastructure.Tech Stack:- Node.js (React on front-end)- DynamoDB- Aurora (RDS)- MySQL- PostgreSQL- AWS LambdaWe utilize machine learning, \"infrastructure as code,\" and continuous delivery techniques, and we value automation and security.What You Need for this Position- Bachelor's degree (ideally Computer Science) strongly preferred- 3+ years' experience in software engineering- Strong knowledge of Node.js- Understanding of serverless / cloud-based development with AWS, Azure, and/or Google CloudNice to have:- GraphQL experience- Docker or Terraform experienceWhat's In It for YouWe offer full, generous benefits including medical, dental, vision, life, long-term disability, 401K, PTO, holidays, and more!So if this sounds like you and you're interested in growing with an amazing company, apply today! - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}