{"title":"Analytical Chemist III NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKwGmJBUH_75CTG6gjG0aRhdzcqYAygTilAB3QLtw6EIRtpGKmQiVL9tEBejoZHV7qWdGotXIs5SZ_bnH4nt-QQAuMMpoTczdfYiQhFW0VaTK1nfKGEJuqiXG-dZk75AGBnQzpLWNoPc6O2BAXEhf6ij9y5ituPdXC9H15vV7eFqYLWqwnT3wkewo_mvAlY","source":"ziprecruiter","full_description":"Driven by a commitment to research, quality and service, PDI, Inc. provides innovative products, educational resources, training and support to prevent infection transmission and promote health and wellness. Encompassing 3 areas, our Healthcare, Sani Professional and Contract manufacturing divisions, we develop, manufacture and distribute leading edge products for North America and the world. We have several locations across the US and are looking for new Associates to join our team!  POSITION PURPOSEResponsible for assuring the accurate analysis of incoming raw materials, bulk liquids, and finished products utilizing Standard Operating Procedures (SOPs), Work Instructions (WIs), Nice Pak's Test Methods (NPTM) Good Laboratory Practices (GLPs), and Good Manufacturing Practices (GMPs). Assures tested raw materials, bulk liquids, and finished products have met the required specification criteria prior to release.  Investigate out of specification results to determine final disposition.  Maintain accurate, complete and traceable documentation related to analysis and disposition.  Ensure the effective and efficient functioning of the Analytical Laboratory.  Designate appropriate and trained personnel to perform required tasks.  Review documentation to ensure adherence to internal and external requirementsESSENTIAL FUNCTIONS AND BASIC DUTIES Testing Requirements:Performance of diversified chemical testing as needed by using current USP,  Standard Operating Procedures (SOPs), Work Instructions (WIs), Nice Pak's / PDI Test Methods (NPTM on raw materials, bulk liquids, and finished products.  The testing may include but is not limited to: pH determination, viscosity, refractive index, specific gravity, etc.  Conduct wet chemical titration to determine the percentage of activity on various solutions and raw materials, bulk liquids, and finished products.By the use of instruments (GC, HPLC, IR, UV, Auto-titrator, etc.) determine the percentage of various components as required by specifications.Perform identification of various chemicals or formulations as per methodology USP/NF and other test requirementsCoordinate release of liquid batches including designation of reassay/expiration date.Assist in the sampling, testing and release of raw materials when neededDetermine the toxicity and pH of waste tanks at designated intervals REPORTING & ANALYSIS:Ensure that all results are accurately recorded in appropriate laboratory logs or other designated formsReview all data generated by the laboratory associated with the manufacturing of Drug and OTC productsPerform investigations into laboratory Out of Specification Results (OOS). Lab Maintenance:Ensure that all instruments that perform analysis are validated and calibrated.Ensure that all Analytical Methods utilized for analysis of Drug and OTC products, at the least, are validated according to International StandardsPurchase analytical suppliesPrepare solutions and titrants when required.Clean laboratory at specified intervalsPerform calibration, reading, and recording of instruments within the Analytical Chemistry LabPrepare and maintain laboratory test solutions Additional Requirements:Determine products' dispositionComplete necessary formsLead, Direct and Train lower level Chemists ( I, II) in the use of instruments, methodology, SOPs, WIs, GLP, GMPs, etcFurnish report to QC Lab Manager on a continuous basis.Assign workflow in the laboratory in conjunction with Analytical Chemist Senior Level. SPECIAL PROJECTS:Handles special projects and assignments as delegated (method transfer, method validation).PERFORMANCE MEASUREMENTSTest raw materials, batches, and finished products in a timely manner.Ensure release of raw materials, batches, and finished products are done efficiently.Maintain Lab cleanliness in a timely manner.Ensure proper new / refresher training of Analytical I Chemists.QUALIFICATIONSEDUCATION/CERTIFICATION:Bachelor's degree in Chemistry, Analytical Chemistry, or other related scienceREQUIRED KNOWLEDGE:Knowledge of Analytical techniques and able to incorporate them into daily tasks.Computer literate.Demonstrate ability to perform work accurately and be able to follow test methodology.Ability to perform well under pressure and work with minimum supervision.Some supervisor skills required.Able to delegate the required testing to competent and trained chemistsEXPERIENCE REQUIRED:A minimum of 5 - 7 years experience in a laboratory environment (Analytical Chemistry Lab preferred)At least three years in a regulated laboratory setting.WORKING CONDITIONSNo hazardous or significantly unpleasant conditions."}