{"title":"Electrical Controls Engineer","location":"","salary":"","description":"","term":"$90,000 to $130,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIzXM0UE5TLcaVKjqlLzRYIuD88GwSSzc5nxdCQlQHTmoOx7NaF4mdyAaR05wrfQqy4T0w610-nwe75LW-v3pl5ai33uHhieoa4SZZ-esMHN2BSFn-Edd5TY4AuFvf905hh_wVa3iQeE9ZqR79YEwN4fq2q77ApW_xpza867Yo7NZT1mrsR6c_BZop1288","source":"ziprecruiter","full_description":"Electrical Controls Engineer If you are a Electrical Controls Engineer with experience, please read on!Salary Range: $90k - $135k+ (Depending on expereince) Location: Overland Park KSRelocation: YesWe are an Industrial Design/Build, Original Equipment Manufacturer (OEM) supplier of process equipment for APC (Air Pollution Control), Dust Collection, Hazardous Gas Emission Mitigation, Pneumatic Material Transport, and Bulk Material Handling Systems.In addition, we provide Replacement Parts and New Equipment Components for Baghouses and Bulk Material Handling Systems. We supply complete engineered systems, as a Total Turnkey Provider, equipment sub-systems, and provides selected new equipment for replacements and new systems.What You Will Be DoingComplete electrical design of electrical systems, electrical installation design, and control system design. The Electrical Engineer will work across a variety of functional groups that are directly involved in engineering and implementation.- Design duct bank, embedded conduit, cable tray, grounding, and lighting systems from concept to completion.- Develop and/or review schematics and one-line drawings.- Control System panel and cabinet design.- Controls & Instrumentation; sensor selection and setup- PLC & HMI design- Review specifications, drawings and vendor equipment documentation.- Organize, integrate, review, and approve buyout parts and devices.- Organize, develop, and maintain drawings and bills of materials.- Utilize applicable engineering national and local codes.What You Need for this Position- 3+ Years of Controls and/or electrical design experience. - PLC Experience (Siemens / Rockwell Preferred) - HMI design experience- AutoCAD Electric experience- Experience with Control System Panels and cabinet design- Experience with sensor selection and setup (Controls and Instrumentation)You should know some of the following- Duct Bank, Embedded Conduit, Cable Tray, Grounding, and lighting systems. --Bonus--- low & medium voltage power distribution- equipment/protective device sizing- Programmable Automation Controller (PAC) Programming--We would love the candidate to have similar experience in the industrial field industry similar to Steel, Cement, Food Aggregates, Frac Sand. We would like the candidates to have a strong background on Motor Control Centers, PLC Cabinets, Cable Tray, and Condit Sizing.--What's In It for You- $90k-$135k+- Great work environment- Amazing/Generous compensation package- Generous PTO- Full Benefits+ More!If you're interested, please provide the following to get the ball rolling:1) Updated resume2) Salary requirements (a range would suffice)3) Interview availability this weekMy email is Justin.Johnson@cybercoders.com. - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}