{"title":"Senior Software Engineer - High frequency trading systems NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJfFeDM-JrBsptlkZZW4Wk3bLB6bYyK4Oo7d3yNsoOHkx307Cti2gOrzoiB6qpJNcnuIr9LW1juWTQssiC2ZJ8xhZsGf0v3nya0qSnXvGJ5IAmq-_WLnct99OnhP_zt3guwU3Vy0CjL2yt-7Cb_406RsBgQ2CpZ0OZ6LE0UFUJiWRfoxX_KICWhITNim_0","source":"ziprecruiter","full_description":"Senior Software Engineer - High frequency trading systems Senior Software Engineer - High frequency trading systems - Skills Required - Node.js, REACT, Go, C++, AWS, Ethereum, SolidityTHIS ROLE IS 100% REMOTEWe are a brand new trading platform for digital currency exchanges and because of the big boom around bitcoin, we've been successful in getting our users the best prices with the best liquidity. Our team is still fairly small and we're definitely in startup mode. But because of our small team, you'll be able to make a huge impact!This is a brand new opening for someone who has: - Five years software engineering experience - Strong experience developing large-scale concurrent, event-driven distributed systems - Prior working experience with public key cryptography (and blockchain) - Server side and blockchain experience is a plus - Experience with javascript, Go, and C+- Strong CS fundamentals, including good working knowledge of algorithms, data structures, distributed systems - Good practical knowledge of sql in general and mysql in particular - Rigor in engineering processes and best-practices (e.g. code reviews, automated testing, OOP) - Passion for innovation and for working in early stage startupsWhat You Need for this PositionMore Than 5 Years of experience and knowledge of: Node.js - REACT - Go - C+- AWS - Ethereum - SolidityWhat's In It for You Vacation/PTO - Medical - Dental - VisionSo, if you are a Blockchain Developer - 100% REMOTE with experience, please apply today!Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.*Senior Software Engineer - High frequency trading systemsNY-New York CityGB1-1499891*"}