{"title":"Senior Software Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK4s3v92ediZDwR1RWcCnOoJ1Q7RMKmrDeJVmUWb-_nXDOS-w-7aCFtuAb0uSvbg_YwJ7xx9jaFW6ItqWxkFrnYiro8x6qbcvhvI6pnOK5k5rmF6tbSzgqPGehxmslzZC_KEaDeuSvuy_FF21NL6C_lcW_Q2RXxPueHJuuYai-S5TzwrMWW5uJ4E1dvHmxi","source":"ziprecruiter","full_description":"Senior-Level Software Developer - JavaOASYS, INC., a Leading-Edge Government contractor in Huntsville Alabama, is seeking a Senior-Level Software Developer to support our Army customer on Redstone Arsenal. Job Responsibilities include: Work as a member of a team in the construction and maintenance of large complex software systems including real-time simulations and PC based tools. The selected candidate will be responsible for performing the design, implementation, unit testing, and regression testing of software modules while following existing processes and development standards. The selected candidate must be able to clearly communicate efforts to peers and more senior engineers. The selected candidate's primary goal will be the development of documented, reliable, well-tested, extensible and maintainable code. Minimum Requirements:7-15 years' experience in software developmentExperience programming in Java, C#, C, or C++Experience working in a Unix/Linux environmentExperience with git for Software Configuration ManagementActive DoD Secret clearance is preferred.The selected candidate must be able to clearly communicate efforts to management, peers, and more junior engineers.Preferred Skills:Experience with Android development and/or Android StudioExperience using JIRA or Stash (Bitbucket)Education Requirements: A Bachelor of Science Degree in Computer Science, Mathematics, Engineering or similar technical discipline is highly desired however, experience may be substituted for a degree. Eligibility: Ability to obtain a US DoD Secret Clearance is required. An Active DoD Secret Clearance is preferred.About OASYS, INC.: Located in Huntsville, Alabama, OASYS, INC. is a technology services and products company dedicated to delivering the right solutions to our government and commercial clients. Our innovative solutions combined with today's technology and our subject matter expertise help to provide full lifecycle support for our client's needs.www.oasys-incorporated.comEOE AA M/F/Vet/Disability Equal Employment Opportunity is the Law: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdfResumes may also be mailed to 650 Pratt Avenue NW, Suite C, Huntsville, AL 35801Job Posted by ApplicantPro"}