{"title":"Software Engineer - iOS / Swift","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAI2R_aKBm25n7f3li9FfgPzIKW99yrNH_Pw-VCzWzBu_fD20F75IUs7C9mXpIN5RselmlN4WSAvR0I4MYzGErqWu9Jx9AKO_MlrQv115rAGFGbTfRoBJVhSw6YyXRYlfvVyFe0I1cgFFNohgRiR1hIS-MocbJ2AhDCHbBVK26qazWp6-Aooll-CXIfSr0bX","source":"ziprecruiter","full_description":"Position at PhunwareSince our founding in 2009, we've relentlessly worked toward a vision of a future powered by Phunware. We spend our days obsessing over how best to design, build, launch, promote and support branded apps that engage, compel and delight the world's most discerning audiences. For over a decade, we've helped Fortune 5000 businesses throughout the mobile app lifecycle with data-backed decisions at every step. If you share our passion for innovative mobile app experiences and dream of a world empowered by seamless, one-to-one interactions, we want to hear from you. Get in touch with us today-our Phamily always has room for one more!Job Summary:Phunware is seeking iOS Software Engineers for the above locations. Remote work is possible for the right candidate. The candidate must be a strong, senior-level iOS developer capable of ramping up quickly. At Phunware, we focus on delivering category-defining mobile experiences and measure everything we do against that goal. We're looking for exceptional, like-minded engineers who want to help us in that mission.In this role, you'll join our roster of top talent and work collaboratively to create the greatest end-user experiences. You will put your Android development skills to the test by planning, designing, and writing high-quality code alongside our passionate team of developers.We're proud to work with the world's largest brands, delivering high profile applications for major players in spaces such as Media & Entertainment. We work on cutting-edge technologies through partnerships with Apple and solve problems that will challenge even the most seasoned iOS developers.This position is Full-time. Candidates for this position must be authorized to work in the United States and not require work authorization sponsorship by our company for this position now or in the future.The ideal candidate is proactive, responsive, and demonstrates excellent verbal/written communication skills. He or she is well experienced in iOS development and has a strong track record of deploying successful, high-quality apps to the App Store.What You'll Do:Code custom, cutting-edge iOS apps, from scratch, with minimal supervision. If we ask you to do it... you can do it! Quickly, well-structured & with top quality.Create prototypes that demonstrate value and functionality of emerging technologies.Work with Product Management to take detailed story-driven requirements and implement them using modern design and coding best practices.Work both solo and in an organized team-oriented environment with shared responsibilities.What You'll Bring:Bachelor's Degree in Computer Science or equivalent experience5+ years of professional software development3+ years professional native iOS development experience using Xcode and SwiftSignificant contributions to multiple feature-rich iOS appsExperience working with backend APIsExcellent troubleshooting and analytical skillsStrong technical leadership and guidance skillsResponsible, organized and hard working with excellent communication skillsFamiliar with Agile Development ProcessBonus Points For:Local to Austin, TX or Irvine, CA or San Diego, CAExperience as a Technical LeadExperience mentoring junior developersExperience writing unit tests or other forms of automated testingFamiliar with Continuous Integration tools, such as JenkinsCompensation and Benefits:Fun, casual, fast-paced work environment filled with talented colleaguesCompetitive salaryRestricted Stock UnitsFlexible paid time offFull range of benefits, including 401(k) and medical, dental and vision coverageEverything You Need to Succeed on Mobile - Transforming Digital Human ExperiencePhunware, Inc. (NASDAQ: PHUN), is the pioneer of Multiscreen-as-a-Service (MaaS), an award-winning, fully integrated enterprise cloud platform for mobile that provides companies the products, solutions, data and services necessary to engage, manage and monetize their mobile application portfolios and audiences globally at scale. Phunware's Software Development Kits (SDKs) include location-based services, mobile engagement, content management, messaging, advertising, loyalty (PhunCoin & Phun) and analytics, as well as a mobile application framework of pre-integrated iOS and Android software modules for building in-house or channel-based mobile application and vertical solutions. Phunware helps the world's most respected brands create category-defining mobile experiences, with more than one billion active devices touching its platform each month."}