{"title":"8 Full time & Entry Level Openings - Customer Service Representative NEW!","location":"","salary":"","description":"","term":"$36,000 to $43,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAK7qSBl8gBf3RzS-MaSymkodCieXzVD-p17D41bZpKCOGHDv38eCW05_y0llFnPUR1v5bvJZhCmOswj21I5IF5wf5I3he1k52ZCqA0WSs36GRDjYJNmbX4sCUvz2TuHkpIb_qCnn7fiycQccffC6gSuwZHdIZFS4ZDlCvEeDFqVB2GKe0tIqNQpnabBwmm5","source":"ziprecruiter","full_description":"At Royal Management, we recognize that our GREATEST asset is our Customer Service Associate team. That is why we provide team building activities, competitive compensation, and holiday closures to spend time with your family. If that isn’t enough? We also offer various merit-based opportunities for professional development and growth WITHIN the organization. If you are seeking a professional career at a world-class consulting firm (not any old 9-5) and enjoy solving complex challenges, Signature's Customer Service Associate team is for you!Our Customer Service Associates: Manage challenging or emotional customer situations and respond promptly to service requests and exceed customer satisfactionEstablish and maintain long-lasting customer accountsMatch client needs to products and servicesAssist in the acquisition of verbal orders from external customers in a professional and courteous manner compatible with applicable company policies & proceduresGain knowledge of our clients and stay up to date with new sales promotions by attending daily meetings with the Management and Sales teamAct as the main liaison between our company and clientsA Customer Service Associate with us has: A high school diploma or equivalentPrior experience in customer service, sales, retail, food service or related fieldsProfessional and confident demeanor with a very warm and sociable attitudeFlexibility and adaptability to change with exceptional time managementThe ability to multi-task and to respond well under pressure and treat others with respectWhat’s in it for you? NO MORE HOLIDAYS!Full trainingGrowth opportunities withinDiverse and fun work atmosphereTrips in and out of the USCompany funded parties and eventsCandidates with the following experience are encouraged to apply: Customer Behavior, Customer Insights, Customer Engagement, Customer Relationship Management, Customer Service Sales, Customer Rep, Customer Service, Customer Care, Customer Relations, Build Customer Relationship, Customer Acquisition, Customer Development, Customer Relationship, Customer Support"}