{"title":"Automotive Technicians, Mechanics, A and B Levels, Earn $80K Plus! NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAILdlTNxbenETzsC0W4-5xq3CB9RUdU2WLf8fgP-uNllSljq_guCA6En--s-wPcKf_DiKJXVcsz3V3L9Kx19yWYJkNrK_UyJfQrhuA0h9x1ZkwVcBpl7Z6tMwfZoFYjzLHDdfRhtyLHRIq8aKf8ygfLvwHhxUNBbGhj6xE0cnkGZ65tKZsWU6713xn-olA","source":"ziprecruiter","full_description":"4237 Millenia Blvd., Orlando, FL 32839Automotive Service Technicians / MechanicA and B Level Techs NeededExperience RequiredNissan and INFINITI experience is a huge plus! Earn $80K+Flat Rate Pay, We will Certify, Flexible Scheduling If you do not have Service Tech / Mechanic experience, please do not applyOrlando INFINITI has one of the largest and most varied INFINITI inventories in Central Florida. Come join our team and help us keep our great customer service reputation! DealerRater awarded us the 2020 Consumer Satisfaction Award and in 2019 CARFAX named us top-rated Dealer. We believe culture makes a difference and we strive to build lasting relationships with our employees, customers, and the community.We are looking to hire Level A and B Service Technicians/Mechanics. INFINITI or Nissan certification is preferred, but we will train and certify! If you want to be appreciated for your hard work, look no further! Apply online today!We offer:$80K+ OpportunityFlat Rate PayMedical, Dental and Vision insuranceDisabilityBenefits after 90 days401(k) retirement planPaid vacationBest work/life balance in the businessFlexible SchedulingClimate Controlled FacilityCareer advancement opportunitiesResponsibilities - Service Technician:Perform work as outlined on repair order accurately in accordance with dealership and factory standardsDiagnose cause of any malfunction and perform repairEfficiently repair automotive systems, including engine, transmission, electrical steering, suspension, brakes, air-conditioning, etc., in accordance with dealership standardsCommunicate with parts department to obtain needed partsExamine the vehicle to determine if additional safety or service work is required. Notify service advisor immediately if additional work outlined is not needed or requiredNotify service advisor immediately if repairs cannot be completed within the time promisedDocument work performedKeep shop area neat, clean and be able to account for all dealership-owned tools at all timesMust follow all company safety policies and procedures and immediately report any and all accidents to a manager or supervisorQualifications/Requirements - Service Technician:INFINITI or Nissan certification is preferred, but we will certify!Candidates will be experienced in all aspects of maintenance and repair, from simple brake pad replacements to detailed engine overhauls.Ability to read and comprehend instructions and informationMust be a team playerValid driver's license and good driving recordResume must be uploaded, and online assessment completed for immediate consideration.Must be authorized to work in the U.S. without sponsorship and be a current resident.Must pass pre-employment testing to include background checks, MVR, and drug screen.We are an equal opportunity employer. All qualified applicants will receive consideration for employment regardless of race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."}