{"title":"Senior Android Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIHqb9iSzHziOBpAJm9hFq8tHl2DoBq4JPxdd8Vik-qSFxVvLntUsEVIC7qgFvXjC3JbkZ_7UwIDA_M36lu3Ted5RhQss2sXeLqB9C83pkZnUXofP4dmKA1RDONVrZGOoCdtRZDsDdKuaYQo2yQMGKF5mbvndgMKS8cLpR3zb-nqaFHIR0nf7FFxdmFsQtP","source":"ziprecruiter","full_description":"Android Senior Developer Job Description Unique opportunity at a growing technology company fundamentally changing the way we access secure services at the convergence of digital, physical, and AI worlds. TruU is seeking a talented senior Mobile Engineer to help build, design, and code TruU's mobile (Android) apps and SDKs. You will be a co-located member of the engineering team, working with both internal and sourced mobile app developers driving a consistent high quality product across Android and iOS for customers. Our current mobile solution handles secure actions, notifications, asynchronous transactions, and leverages various device hardware and security from biometric capabilities, Bluetooth communication, accelerometer & gyroscope data, as well as secure enclave storage. Self-motivation and a personal strive for building great things is a must for this role. As TruU is a start-up, your input and contributions in other various aspects of the company will be expected and valued. Android Senior Developer Responsibilities: Designing and building mobile applications for Google's Android platform Collaborating with the team to define app features Ensuring quality and performance of applications Identifying potential problems and resolving performance bottlenecks Fixing application bugs Designing and implementing application features Participating and sometimes leading the architecture of new features Teaching and mentoring other team membersMaintaining the release process for making the app available on the Play store Android Senior Developer Requirements: Bachelor's degree in Computer Science or Software Engineering 3-5 years of experience writing Android applications Experience with an enterprise application supporting thousands of users Proficient in Java and Kotlin Thorough understanding of memory management and the Android application lifecycle Experience with retrieving data from a backend service using OkHttp Deep understanding of concurrent programming and the tools available on Android Knowledge of Material design principles and components Competent in the use of Android Studio for both writing code and debugging Experience with Git for version control Additionally, it could be valuable if you had any of the following: Experience developing for iOS devices To be successful in this role, you must be a highly motivated individual who is experienced enough to plan ahead and document your work amidst a fast-paced environment.About TruU TruU is a cyber security company that is transforming the way users are identified in order to provide digital and physical access as a frictionless experience. We are solving the problem of giving users trusted access to digital and physical sites without the need for passwords. We are a startup environment that is focused on empowering the team to architect and implement elegant solutions to the interesting and challenging problems before us, in an enjoyable environment that fosters our own professional and personal growth."}