{"title":"Sr Software Engineer - C++, Ada, Java NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ7jXAu2fqKyt_kc9NVJYrvR2B8IBWuhR8RiHV-KjPlWoeofvhzRhbxThHVdLvR07odsSay-W-yjNTkL0Xg7kjiK13uqlEDuT0JsX_V7puHP3NbQw1yVhgMu0Td39T7xvmuf3iPC_bDNZKo8QUCjY2w4es3w2nAKMsU_itlZmIA3h7GOpCQO49D3MiRxAjO","source":"ziprecruiter","full_description":"Sr Software Engineer - C++, Ada, Java Sr Software Engineer - C++, Ada, Java - Skills Required - Software Engineer, Agile, Embedded Software Development, IV&V synthesisIf you are a Senior Software Engineer with experience, please read on!Top Reasons to Work with UsAre you a self-starter, a passionate learner, team-wide and independent problem solver, with a steadfast desire to support and lead the charge in the development and enhancement of our nation's defensive capability? If this is YOU, and you play and work well with humans and machines, this is a career-making opportunity for a Senior Software Engineer at a firm that is pushing the boundary beyond the current state-of-the-shelf!What You Will Be DoingAs a Senior Software Engineer, a typical day might include:Working with a team of energetic engineers and analyst under a very successful agile development framework. Development and performing unit testing IV V synthesis and software forensics for critical systems Embedded software development for processor-specific applications Support custom compiler developments Decomposing existing source code using requirements, design, and test documents Writing test and data capture frameworks to exercise the software Recommendation of existing code optimizations and performing unit testing for verification Outside of the 10-minute agile tag-ups, no long boring meetings! Team staff takes care of meetings, paperwork, and the other boring stuff so you can focus on what you enjoy -- Software!What You Need for this PositionAt Least 3 Years of experience and knowledge of: C++, Ada, Java - Agile - Embedded Software Development - IV V synthesisSo, if you are a Senior Software Engineer with experience, please apply today!Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.*Sr Software Engineer - C++, Ada, JavaAL-HuntsvilleAM17-1557791*"}