{"title":"Formulation Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJcmjei0FCNv1T-4NtkvB4HwBz_0GufkGLIO8pvNHExDyfScVUMPBvAhstIEeNi-SuW1sJP8uD9jkH_UtNKZ_0-1Lrow2xeoCtpZgXO4ojBMDjSXqv1AIRxRKxkcquIATILCkbwlegUUBjCET0oOTSg9MUJW0bSzTWkUg-wFpTezB4N-RhnNU6RMpw3Nx4","source":"ziprecruiter","full_description":"Location: Oak Brook, ILAre you an experienced formulation chemist? Are you looking for an opportunity to work with a team of talented chemists in the health and beauty field? Blistex Inc. is seeking your expertise. The R & D Formulation Chemist is responsible for assisting in the development of new products and improvement of existing products. Responsibilities include:Performing physical evaluations of stability samples, and archiving stability data.Performs instrumentation analysis as part of pharmaceutical development (e.g., HPLC, GC, FTIR, etc.).Conducts specific development laboratory and pilot plant tasks as part of formulation development (e.g., mixing, filling, lab batch for formula evaluation and stability testing, but not limited to).Provides detailed and accurate record-keeping of all experimental details and results.Provides general laboratory support (e.g., routine instrument cleaning/maintenance, solution preparation, chemical inventory, etc.)Ensures timely and accurate completion of technical tasks required for meeting internal and external project development and pilot manufacturing timelines.Develops and presents to the Section Manager, R & D matters requiring his/her decision.Keeps abreast of current trends, practices, developments and regulatory changes, which would impact Blistex Inc. products, procedures or packaging.Ensures the maintenance and/or adherence to good laboratory practices and all safety regulations.Strengthens the R & D Department by contributing innovative ideas, expertise, knowledge, high professional standards, team spirit and pride in the Company.Provides documentation on new product development projects (e.g., status reports, timelines, specifications, procedures, etc.).QUALIFIICATIONS:Bachelor's degree in chemistry or related disciplineTwo to three years formulation experience in a consumer pharmaceutical or related healthcare industry.Proven good working experience in developing lotions, ointments, creams, gels, liquids and balm products is requiredIn return, we offer a competitive wage with excellent benefits plus profit sharing. Blistex Inc. has been producing quality products since 1947. Join our team of talented staff that make us a global leader in personal care products."}