{"title":"Sr Android Developer NEW!","location":"","salary":"","description":"","term":"$130,000 to $160,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJ01f0h-KoC4q6Sr90oAA_riXH9BsUGVcZkaesZbJAML4nQqejU9JPGZJOfLL5-muPdwM2WiEN7i-d9q0-sVsiae3qvnsIJmjoikya51DaMIMg7aFNsW3ykTu0N2ilT05gtdFjn6Iu2mNa4vfdupTVaBymuwTAcd_yk28-t3WXhU2QymrsP2Ybe7YurlCo","source":"ziprecruiter","full_description":"You will be a co-located member of the engineering team, working with both internal and sourced mobile app developers driving a consistently high-quality product across Android and iOS for customers. Our current mobile solution handles secure actions, notifications, asynchronous transactions, and leverages various device hardware and security from biometric capabilities, Bluetooth communication, accelerometer & gyroscope data, as well as secure enclave storage. Self-motivation and a personal strive for building great things is a must for this role. Android Senior Developer Responsibilities: Designing and building mobile applications for Google’s Android platformCollaborating with the team to define app featuresEnsuring quality and performance of applicationsIdentifying potential problems and resolving performance bottlenecksFixing application bugsDesigning and implementing application featuresParticipating and sometimes leading the architecture of new featuresTeaching and mentoring other team membersMaintaining the release process for making the app available on the Play storeAndroid Senior Developer Requirements: Bachelor’s degree in Computer Science or Software Engineering3-5 years of experience writing Android applicationsExperience with an enterprise application supporting thousands of usersProficient in Java and KotlinThorough understanding of memory management and the Android application lifecycleExperience with retrieving data from a backend service using OkHttpDeep understanding of concurrent programming and the tools available on AndroidKnowledge of Material design principles and componentsCompetent in the use of Android Studio for both writing code and debuggingExperience with Git for version controlAdditionally, it could be valuable if you had any of the following:Experience developing for iOS devicesTo be successful in this role, you must be a highly motivated individual who is experienced enough to plan ahead and document your work amidst a fast-paced environment."}