{"title":"Hardware Engineer (FPGA)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJG5qBVaFB6_qXpN29dba-9HzPIpYn2hGgYOkS0KuU1OtOHc2CoUjsV0VR1r8jfFkmnP2GJ1TtKjPW5-wSg77HyKnBxjwvECopoavpAqQlU7RCIlZFQNcSlEsbbOJU4I34Jg9N_ijiCzHAm90CGjBAa7JLL11WQZUn_mOAIEAZJ_D4Yw3zue0fc0gJ0ZSv9","source":"ziprecruiter","full_description":"Virtu is a leading financial firm that leverages cutting edge technology to deliver liquidity to the global markets and innovative, transparent trading solutions to our clients. As a market maker, Virtu provides deep liquidity that helps to create more efficient markets around the world. Our market structure expertise, broad diversification, and execution technology enables us to provide competitive bids and offers in over 19,000 securities, at over 235 venues, in 36 countries worldwideTHE ROLEThe Virtu Financial Hardware Design team is responsible for the design, verification and deployment of many complex FPGA applications. This technology forms part of the firm's proprietary, low latency trading platform. The environment and being a part of this team presents stimulating, challenging and rewarding work within a collaborative, international work environment.We are looking for an FPGA Engineer to join the hardware team. The ideal candidate will be a creative and ambitious senior hardware engineer excited to work on the design and verification of our low latency trading infrastructure. As a member of the team you will take a lead role in:Enhancing the company's capabilities in Hardware system design and verificationDeveloping solutions for demanding problemsContributing to complex aspects of the projectProviding a leading role in defining the technical basis for future productsInnovating and introducing new solutions and methodsPlanning, scheduling and execution of projectsVirtu offers a dynamic, meritocratic environment with a flat hierarchy. No finance background is necessary or expected. This is a great opportunity for the right candidate to kick start a career in the financial technology space.THE CANDIDATEBachelor degree in Electrical or Computer Engineering with 5+ years of experience, or Master degree in an Engineering or Numerical Science Discipline with 4+ years of experienceSuccessful track record in hardware projects FPGA or ASICDemonstrated experience in complex verification environment in Systemverilog, UVM, OVM, VMMExpertise in IC Design flows, specifications, Verilog or VHDLGood knowledge of high performance bus protocols, for example AXI, USB, SATA, PCIe, etcStrong problem solving and communication skillsDESIRED BUT NOT REQUIREDAny experience of embedded C/C++ development is beneficialAdvantageous to have previous experience with Constrained Random VerificationTHE PROCESSIf applicant passes an initial resume screening, we will send an online programming test via email. After passing the online test, we will contact you to arrange a phone screen."}