{"title":"Sr. Hardware Developer Summer Intern: 2021","location":"","salary":"","description":"","term":"","detail":"https://www.ziprecruiter.com/k/l/AAJMhJazj3zc0KNVljlscToECPmgs3Lg9hISoSLt8IpqjV3kCE6Nqx5FD2cyM2zZhUZzBDZquDwZo9aBEPa8leN5Uf6FAgG10oMoy0IAt79WZPKjuOrt-51DFkV1uDlTPRWlEDNY6WSVGEOtiD314cHKH9SQOOmHrQ4CNQw_khffAz8qvQhEdR81rhcWs5wr","source":"ziprecruiter","full_description":"Introduction As a Hardware Developer at IBM, you'll get to work on the systems that are driving the quantum revolution and the AI era. Join an elite team of engineering professionals who enable IBM customers to make better decisions quicker on the most trusted hardware platform in today's market. Your Role and Responsibilities IBM Systems has openings for Hardware Development Engineers to develop, test and provide client support for hardware, firmware and semiconductors that comprise our industry leading IBM Systems products. We are a world class development team that pioneers innovations for the cutting edge microprocessors and hardware used in IBM Systems including IBM Z Mainframes, IBM Power Systems, IBM Storage, and IBM Quantum Systems. Development engineers participate in various aspects of the development, test and support process, such as: Physical design and layout Electronic Design Automation Signal integrity and analysis Microelectronics packaging Materials analysis and characterization Mechanical design and technology integration Printed Circuit Board Physical design and layout Thermal design and testing Voltage regulation and power delivery Performance modeling Processor and system test and validation Processor, component, and system characterization Client and Field Engineering support Ideal candidates will possess demonstrated design, test, and communication skills. Team based experience in hardware design, verification, analysis and testing is a plus. Candidates with at least three to six months of team based work experience with hardware products are preferred but not required. Candidates chosen to become a part of our world class development teams will help advance IBM's leadership to develop the highest performing computers and game changing hardware solutions. Come THINK with us!  These are office-based positions in IBM locations including: CA- San Jose NY- Poughkeepsie, Hopewell Junction MN- Rochester VT- Essex Junction, Williston NC- Raleigh TX- Austin Opportunities in these locations will vary based on business demand & will be deleted as filled. Required Technical and Professional Expertise Fundamental education in hardware or test Strong communication skills Passion to pursue career path in engineering Preferred Technical and Professional Expertise Bachelors and/or Masters Degree in: Electrical Engineering, Computer Engineering, Computer Science, Mechanical Engineering, Materials Science, Chemical Engineering, Physics, related majors. About Business Unit IBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the world's most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio designed for cognitive business and optimized for cloud computing. Your Life @ IBM What matters to you when you're looking for your next career challenge? Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust - where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible. Impact. Inclusion. Infinite Experiences. Do your best work ever. About IBM IBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. Location Statement We consider qualified applicants with criminal histories, consistent with applicable law. Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}