{"title":"Technical Writer II NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALJrH0PdAL582ehfVv6BDFJ6M1yINAhNQumQ9JLCQfJUjKZwn0EL-WwSM7aC1zJglR4g-WhzOY7rhb_3eAxhb9PFlhJ_KFnKVTzqyBbBqmaolf8joSD4mjvtPurcH0NqjsIBTHykq4zs2D16LejJtq24sNRM7cA-RlOBMVu1Gt7cHvSDOZAXkD9w4ttcs-s","source":"ziprecruiter","full_description":"Who are we?Amazon Go is a new kind of store with no checkout required. We created the world's most advanced shopping technology so you never have to wait in line. With our Just Walk Out Shopping experience, simply use the Amazon Go app to enter the store, take the products you want, and go! No lines, no checkout. (No, seriously.)At Amazon Go we offer a curated selection of delicious ready-to-eat breakfast, lunch, dinner, and snack options made by our chefs and favorite local kitchens and bakeries. Our selection of grocery essentials ranges from staples like bread and milk to artisan cheeses and locally made chocolates.To learn more about Amazon Go, check us out at amazon.com/go.Who are you?We are looking for an outstanding technical writer to help us deliver documentation for Amazon Go. Amazon is looking for a customer-obsessed Technical Writer with experience of documenting complex standard operating procedures (SOPs).The successful candidate will be expected to own the creation of documentation and material using a variety of authoring tools and technologies.Joining our team will give you endless opportunities to use your passion, ingenuity, experience, and pragmatism to be part of very cool software and business teams that affect many people within and outside Amazon.Key Responsibilities: Be capable of juggling multiple complex documentation tasks with little or no oversight, while also working effectively within a documentation team to support varying workloads. Be very hands-on; work with the engineering team and key business users to produce world class product documentation. Communicate clearly and effectively to a wide range of target audiences, including technical operations and development teams Responsible for documenting the over-all systems documentation as well as producing user documentations. To be successful you'll need to have proven experience with writing user documentation and leading projects. Assist engineers in drafting user-facing content. Interpret business process, process narrative, and configured system to determine the simplest set of instructions for completing a specific task. Create, edit and proofread procedural instruction documentation. Participate in process and system walk throughs as needed. Conduct technical reviews of documentation to ensure accuracy. Collaborate with a technical writing and training team."}