{"title":"Senior Civil Municipal Engineer NEW!","location":"","salary":"","description":"","term":"$110,000 to $150,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAL0cQw6IY6L_HHwrxYTEoLCQOa1Yc_LFQROCEXSq8YUei23eT-Nsui7sdF0GrGeXBbuIj_btzNrz6egyU1wMtObHSyiQSHr7bo0H9Ec1beSbeubyboo07LW0nF24Y9VsphOk-rv0g9Iy2HZqE85lJUSn685Tx8X1XiZdqUKqBYrlXJVyX2G9AVgHKASaRE","source":"ziprecruiter","full_description":"SENIOR CIVIL MUNICIPAL ENGINEERMurfee Engineering Company (MEC) is a consulting company committed to excellence, efficiency, and integrity that has an exciting opportunity for the right candidate with experience in water, wastewater, and drainage infrastructure projects. Candidates must be self-motivated, licensed as a Professional Engineer (or able to be licensed in Texas), and have a minimum of 10 years project design experience. The successful candidate will work with a design team on a variety of municipal water and wastewater infrastructure projects including treatment works, pump stations, storage facilities, transmission and distribution facilities. The successful candidate is expected to step into a design role and produce complete sets of construction plans for water and wastewater treatment facilities.Education:· Bachelor’s Degree in Civil Engineering or equivalent from an accredited university.· Master’s Degree is preferred but not a requirement.Qualifications· Licensed Professional Engineer in the State of Texas (or become licensed via reciprocity);· 10 or more years of experience in municipal water and wastewater project design. Must have a proven record of design experience in treatment works and pump stations;· Well-developed critical thinking and analysis skills;· Excellent written and verbal communication;· Experience moving projects through design and preparation of construction plans, specifications, and contract documents and into construction;· Experience in construction administration including processing of submittals, pay applications, contract closeout, etc.· Proficient in software including Microsoft Office Suite, Adobe Acrobat Pro or Bluebeam, etc.· Beneficial software experience includes ArcGIS, HEC-HMS, HEC-RAS, Civil 3D, AutoCAD, BioWin, and/or hydraulic modeling software.Responsibilities:· Production of project deliverables including plans, specifications, memoranda and reports.· Oversee and maintain project organization and methodical execution.· Oversight and review of delegated task work· Coordinating work efforts to meet project schedules.· Manages deadlines and prioritizes assignments for design and production team."}