{"title":"Auto Mechanics / Technicians, A Level, Signing Bonus","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALm-iQsnGSI_tal-AK60Df_QuktHbhAjiewSyPJ6m3pbH3-ogkYPwH-EdttzFLPrVnuZV_s95qG6Sa6aurWpd7rJGwC7byioGCSFSjNRSdKSLK508hwWHFh-Wx-QwyMlv_jwpzVfDd05LG1QhQVtxUUfzAwRw33pcBdFpwrDSCSn4upqyF_QY1V9siKnekK","source":"ziprecruiter","full_description":"1330 S Conwell Ave., Willard, OH 44890Automotive Service Technicians / Mechanics A Level Techs NeededCompetitive Pay Plan & Great Benefits!Sign on bonus for the right candidate!Experience from other Brands Welcome!ASE Certified a PLUS!We will certify!Apply Online & Attach Your Resume Today! Walk-in Applicants are also Welcome!Sharpnack Chevrolet Buick Cadillac needs experienced B and C Level Service Technicians/Mechanics now! Our Service Department has a high volume of business, so we are adding to our service team. We have lots of hours of work available! Our Service Tech position offers Top Pay!Service Tech - Job Responsibilities include:Perform quality repair and maintenance work that meets dealership and manufacturer standardsClearly write and communicate needed repairs/maintenance and the parts and time needed to repairRepair broken or worn mechanical and technology componentsMaintain repair and service recordsInstall equipment, components, and systemsTest vehicles both before and after repairRepair electrical wiring, circuits and fixturesOther duties may be assigned according to expertise and certificationsService Tech - Job Requirements:Auto repair experience required!GM Experience a huge plus!ASE certification a Plus!Ability to be analytical and multi-taskGood work ethicValid driver's license and clean driving recordService Tech - Job Benefits include: Competitive pay planHealthcare, Dental and Vision insurance options401(k)Automobile purchase programFast-paced work environmentAbout Us:At Sharpnack Chevrolet Buick Cadillac Ford, it’s our pleasure and honor to help the community that we’re so proud to be a part of. We have been family owned and operated since 1949 and are involved with many local charities and organizations here in Ohio, and we just love watching the local community thrive. We offer excellent customer service to all our customers in Ohio, from Norwalk, Mansfield or beyond. We are an Equal Opportunity Employer. Applicants must pass pre-employment testing to include background checks, MVR, and drug screen."}