{"title":"Sr. Network Engineer - Automation NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIzOck3YNeSXCqR2nRoWjZR8LCe57LXHw7MoyQVasZeMkGZO1Gw2oGfMFpLnyZTjh_REfVPDquDd0_vrZFZmS6yhuabXSLNOJT7f7h9Gc1c3MvkH6ZVppH9kQxxpCnjIIH8yoTRJ8NF8CiJKxhFqbThFJJExvGxWUp_7eSlmmY5AT9NdSLzFDtvy4Y10jk","source":"ziprecruiter","full_description":"DISH Wireless is building a next-gen 5G network to disrupt the wireless industry and fuel innovation in transportation, health care, education, sustainability, city management, and agriculture. We're driven by curiosity, pride, adventure, and a desire to win - and we're looking for people with boundless energy, intelligence, and an overwhelming need to achieve. Join us as we embark on our greatest adventure of all. Opportunity is here. We are DISH Wireless. We're looking for experienced network professionals to join DISH's Wireless 5G Network Engineering Team. The Network Engineer will join a team of other passionate engineers and bring a start-up spirit to evaluate, test, deploy, and optimize DISH's future standalone 5G network. The candidate should also be innovative, analytical, a planner, have strong execution skills, and have the ability to learn, teach, and work in a team environment. Primary responsibilities will include: + Design and engineering of effective and scalable network systems and solutions+ Participate in evaluation, testing, selection, and deployment of foundational network elements for a nationwide greenfield network buildout+ Ensure that solutions adhere to defined standards and best practices and/or assist in the development of these standards and best practices+ Effectively communicate engineering solutions through detailed high and low level diagrams+ Routinely research, analyze, test, retest, and troubleshoot complex problems+ Able to work in a fast-paced environment, under pressure, with strict deadlines, both as an individual contributor and team player+ Participate in knowledge transfer, documentation and information sharing while staying abreast of new technology/technical areas A successful candidate will be able to: + Provide advanced technical leadership for complex project work, including functional subsystem upgrades for mission-critical network devices and services as well as strategic upgrades to the network+ Design, plan, and implement complex LAN/WAN/RAN configurations at nationwide scale+ Supply advanced technical direction and leadership to the organization through the planning and implementation processes+ Establish requirements, provide analysis for network and services specifications, network design, network partitioning, and network architecture definition+ Provide advanced expertise in the development of network test, validation, and integration plans on projects, and assurance of network integrity+ Work independently with vendors to understand, test, and drive new innovative features Candidate should have extensive knowledge in the following areas: + IP routing across a multi-site, hierarchical architecture+ Architecture, design, and engineering of automation for zero-touch-provisioning (ZTP), configuration management, and operating software management+ Network configuration scripting with Pearl/Python/Bash/Ansible/other + Design and implementation of automation tools+ Configuration hardening of network and peripheral devices+ IPv6 - SLAAC and DHCPv6+ Server virtualization - VMWare, Openstack + Solid understanding of the OSI model, routing and switching protocols, network security, IPv4 and IPv6 networking, subnetting, and operational experienceEducation and Experience + Bachelor's degree in Electrical/Computer Engineering preferred+ 7-10 years of professional experience in large enterprise or carrier space+ Professional networking certifications a plus+ Public cloud certifications a plus - Advanced Networking, Cloud Network Engineer, or equivalent Compensation: $89,500.00/Yr. - $130,000.00/Yr. From versatile health perks to new career opportunities, check out our benefits on our careers website (https://careers.dish.com/life/investing-in-you/) . Employment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test."}