{"title":"Sr Chemist - Charlotte, NC","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK-cO2s171EddFb9semL-IZol_RX0GEakj9uVzlQC7K-HyF-jvtk-5ojFFKMaRkpu6ktvkN64a9vAbiaBj5W7jtNmlGH0meI5nxK-MImFMC7YMKwnAhUFmErKP0x-8pcI7dThRy5d1u5wAJBMt_-2DPcVWn9m8sVjrClk4-8-7GwXqdxqvcEsc1RppMtPKb","source":"ziprecruiter","full_description":"Apply now  Title:  Sr Chemist - Charlotte, NC  Location:   Charlotte, NC, US, 28208  #job-location.job-location-inline {display: inline;}  Company:  Univar Solutions USA  Requisition ID:  20135 Want to work for a company that is reimagining distribution?  Join Univar Solutions, the premier global distributor of chemicals and ingredients.  Our goal is to function as a direct extension of our customers' teams; to serve as an ally in their quest of business success.   At Univar Solutions, we're building on our more than 90 years of experience  and drawing on deep resources - inventory and logistics experts, scientists, PhDs, procurement, customer service, sales and marketers-to deliver consultative services and an unmatched portfolio to solve customers' formulation and operational challenges.  When you work for Univar Solutions, you'll play an important role in shaping how we deliver more than chemical and ingredients.   Position Description:Formulation of  SIM, customer and brands team formulation projects. Helps produce the bulk  samples of cosmetic formulations for SIM, customer or brands projects promoting Univar Solutions push products matching the market trends or specific requirements submitted by product managementCoordinates with the global team on formula selection and ingredientsWorks with NA PMM, marketing and global Technical team on establishing the technical training program for NA Clear understanding of formulation trends and interworking of the BPC global market to help drive campaign ingredient strategy with global marketingCoordinates 3rd party contract manufacturing and all other vendors related to formulation sample production  Responsibilities:Develop stable SIM, brand and customer formulations. Coordinate the samples for SIM campaigns using defined push products which meet customer needs and market trends Keep up to date with market trends, new raw material launches (maintain awareness of competitive products), any changes related to the legislationCreatively integrate market trends into Univar Solutions product promotionExecute multiple development projects: prioritize and complete projects in a timely and efficient manner Technical support to the TAM/technical account managers (support by mails / phone calls/ joint visits) and technical responsibility for specific supplier partnersOversee the maintenance of an updated inventory of raw materials and packaging stockUnderstand the safe operation of all equipment used and focus on health and safety within the laboratoryResponsible for the care and maintenance of all lab equipmentEnsure health, safety and environmental policies are understood and adhered to Job Requirements:Master's degree in Biology, Chemistry, Chemical Engineering or other science related fieldMinimum of 10 years industrial formulating experience - Must have strong knowledge of Personal Care formulations through product development experience on the benchFluent in English. Considered a plus the knowledge of another language listed here: German /  Spanish / French / Portuguese.Computer skills including Microsoft applications (Word, Excel and Power Point)Must have the ability to handle multiple projects, prioritize a workloadTravel Requirement of ~10% Univar Solutions is an equal opportunity employer.  All qualified applicants will receive consideration for employment and will not be discriminated against based on their race, gender, sexual orientation, gender identity, religion, national origin, age, disability, veteran status, or other protected classification. We offer comprehensive benefits to employees including medical, dental, STD, LTD and life insurance, 401k, generous PTO and much more.Nearest Major Market: Charlotte Job Segment:  Technical Support, Technology  Apply now"}