{"title":"Senior Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJlpto0qum6S3fJtYoJ-uH3YDs9E6wLfW_cyesU3AaSebLOW2k4Gnor3Syh925YG7yV2gcWQvnofpj_eUwnVWrbgZKfd0GsWI9N-SRLK_Cgz74xlHq7efvRdBCsGjGMMb8A1p2QmY4MBQDXlkupaI78ldtcGUlS0jxekMKlxd07ZQXAmdMXq6DTCKk0dyk","source":"ziprecruiter","full_description":"DescriptionStatus: Full-timeClassification: ExemptCompensation: $65,000 to $100,000; BOEJob Location: Seattle, WAJob Description Summary:The person filling the Senior Chemist role within NewFields will be responsible for conducting research and development of various innovative water treatment methods, applying creative principles at a laboratory and proving such concepts at pilot- and field-scales.  In addition, this person will provide technical input on various projects being conducted by NewFields, conducting trade-off studies of alternative water treatment systems (including laboratory experiments), assisting in selecting preferred treatment systems (in conjunction with our clients), and assisting in designing, optimizing, and overseeing installation of the selected system to meet specific performance criteria.  In completing these duties, the Senior Chemist will: prepare portions of technical scopes of work, budgets, and schedules; occasionally conduct field investigations; analyze water quality data; liaise with clients and other stakeholders; and, work with a broader team of engineers, scientists, and managers in accomplishing specific project and research objectives.  This position requires superior written and verbal communication skills to effectively interface with staff personnel, clients, and vendors.   The person in this role will be mentored for multiple years by an experienced Senior Chemist within NewFields to ensure a smooth transition of duties and responsibilities occurs.  In addition, the Senior Chemist would be expected to prepare and deliver professional papers on water treatment concepts and experiments conducted to appropriate professional publications as well as work with NewFields business development team in giving presentations to and making contacts with prospective and existing clients to secure new assignments as well as providing input to proposals. RequirementsEducation Requirement: Ph.D. in chemistry, geochemistry, or related fields.Experience Requirement: A minimum of five years of experience working in an analytical laboratory, research program, or related occupation. Software: Position requires applicant to have working knowledge of Microsoft Office software including Access, Excel, Word and Outlook.  Proficiency using certain predictive modeling programs is advantageous.Potential Travel: Occasional travel (less than three weeks total per year) to project sites located in the Western United States, and elsewhere, both domestic and international.Position Location: Seattle, Washington.  NewFields operates a research laboratory at this location and the successful applicant would be required to work in this facility.Physical Demands: Position may require sitting for long periods of time, extended hours working on a computer and/or at a laboratory bench and lifting up to 30 pounds. Field assignments are located in a variety of climactic conditions and may require standing, squatting, bending, the use of machinery and a variety of tools.Essential Functions:Develop innovative concepts for treating a variety of water types and conduct laboratory and other research to prove out or discount such, utilizing a laboratory and other means to conduct experiments. Develop technical scopes of work, budgets, and schedules to perform various work tasks or projects and manage certain assigned tasks to ensure deadlines and budgets are met.Complete trade-off studies of alternative water treatment systems, including development of selection criteria and analyses of the various systems to arrive at a preferred remedy.Complete a variety of chemistry-related analyses (both laboratory- and desk-based) to provide technical input to achieving specific objectives established for NewFields projects.Perform as a member of a broader scientific- and engineering-based team to accomplish specific goals. Actively participate in securing new clients, work assignments, and grants to support the NewFields Water Treatment Group and its desired growth objectives and achieve its profitability goals. Manage laboratory technicians to ensure specific assignments are accomplished in a profitable manner and all assigned employees are always productively busy either performing research or project-related tasks.Prepare accurate and professional technical memorandums, reports, presentations, and scientific papers.Ensure the all work conducted within the laboratory is completed safely and is of the highest quality, accordance with the NewFields Laboratory Operations and Safety Manual.Benefits:NewFields believes that in order to attract and retain the best and brightest employees, we need to offer an outstanding benefits package. We provide paid vacation, sick and parental leave, along with ten (10) paid holidays.Company Benefits Provided by NewFields:Medical and Prescription Drug CoverageHealth Savings Account (HSA)Telemedicine401k and RothDental InsuranceVision Insurance401(k) MatchBasic Life / Accidental Death & DismembermentLong Term CareShort Term Disability (STD) InsuranceLong Term Disability (LTD) InsuranceSupplemental Life and AD&D InsuranceSupplemental Income ProtectionSupplemental Long-Term Care InsuranceDependent Care Flexible Spending AccountEqual Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}