{"title":"Pre Sales Engineer (Solution Engineer) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJssZEJBVtJ8DBkCuCDCHNS1J4G0SpnPhFPb8fI6rbirMJ7Fi4-gXY4QfEAj1H_dK6_JAT2aIUpgeGHf1SY4_Kwb_lR0GfDb1MRcI_MmKyjqrd_5M8mqfH_aefD59XE8mZ6RhFkLqaTtGMCxp6T-vsQS274AJbjN_uYUln54m5FgBiUVNbSlR2uZMLfJxA","source":"ziprecruiter","full_description":"PreSales EngineerOur Sales Engineer is the primary technical resource for the company’s Business Development team. The Sales Engineer is responsible for actively driving and managing the technology evaluation and configuration stages of the pre-sales process. They work in conjunction with the Business Development team as the key technical advisor for our products and services. The Sales Engineer must be able to explain and communicate IT Product & Services to both business and technical users. The Sales Engineer must be able to maintain and develop strong client relationships, identify all technical issues of potential and existing clients. The Sales Engineer will provide IT Solutions & Service planning and proposals to existing company clients that do not have a Business Development team member assigned.Qualifications:The ideal candidate is self-motivated with knowledge of Microsoft, IT Networking, Hyper-V, VMWare, Server (HP & Dell) hardware, SonicWall, Ubiquiti Wireless, and IT Service Plans.They must have a proven ability to provide IT Solutions for a wide range of client segments in several Commercial Business verticals & Non-Profit organizations.Must possess strong presentation skills, business relationship-building skills, and be able to communicate professionally with existing and potential clients.Organized, motivated, and technology savvy, with excellent communications skills.Responsibilities:Accountable for the accuracy and completeness of potential Client proposed solutions.Work with the Business Development team to qualify client opportunities and build solutions to solve a client or potential client’s technology needs.Development of proposals and presentations that represent the proposed business client or non-profit solution.Work with the Business Development team to represent the technical resource during a sales meeting.Scheduling IT planning with existing Clients for the continuation of existing IT Support & Services.Responsible for communicating to the Technical teams and Project Management teams the proposed solution presented to the new or existing client.Ability to work in a team structure, supporting other account teams and contributing to the overall business development process.Understanding of Private Cloud, Microsoft Cloud, IT Network Infrastructure, Server Infrastructure, SAN, Wireless and Firewall solutions.Required Qualifications:5+ years’ experience in Engineering or Sales Engineer role.Strong technical understanding of Microsoft, SonicWall, Networking and Hardware Infrastructure.Strong technical understanding of Private Cloud Networking, Microsoft, Microsoft 365, and Virtualization technologies.A Bachelors in Computer Science or Related Certification preferredA clear background check and drug screen required.WHAT’S IN IT FOR ME?Health, Dental, Vision Insurance100% Company-paid Disability Insurance/Life InsuranceOpen Paid Time Off401K MatchingPaid Certification TrainingBusiness Casual AttireLAN PartiesTeam Building (camping, Breakout Games)Monetary Tenure RecognitionCommunity Involvement / Career Development DayFree Professional Employee CounselingPeer to Peer AwardsFlexible workspace optionsProfessional OverviewIn business since 1984Rated a Best Place to Work in KY for the last 7 years!170+ employees with over 100 technical resourcesLarge regional business with 9 locations across the Southeast RegionRanked as a top MSP in the World by MSP MentorMember of 35B association; offerings services throughout the USProfessionally managed using Best in Class metrics and procedures"}