{"title":"IT Technical Analysis NEW!","location":"","salary":"","description":"","term":"$27 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJle8st1xTmESHIOH3THbXmitL-CqV9f4Kk6A_8e3Cro_nJB-hbM59-jlBQeYCYSusRJoObBWdUY-BiWN7B_OzCG0TStLJBbzMdYD-GT3IvpxcTFuhKo8BCw6gqmXAGUduH2R-hiOhgooZF0AFSiwO2C0Zo6SGjFw8mdzBvHJkzLpzAPaqyVDZFNa3GKDd1","source":"ziprecruiter","full_description":"IT Technical AnalysisAssignment Overview:The candidate will work onsite as part of a team of 8 onsite, 16 totals in North America that images and deploys PC to employees throughout the country, as well as handling PC returns and end of life processing, bench/depot repairs, etc. A subset of the 100 in North America IT Support organization.Support HW and SW, Windows 10 - PC imaging, PC Request administrative work within Service Now.Shipping and receiving PC equipment and updating various tracking tools.Day-to-Day Activities:Work on feet most of the day. Moving stacks of equipment by hand. Packing pallets. Packing PC's into individual shipping boxes. Typing and using a PC to perform administrative tasks (closing work orders in ServiceNow).This is the core of the work involved in the position.Experience Required:Must be able to lift up to 30 pounds.Work on feet most of the day.Moving stacks of equipment by hand.Packing pallets. Packing PC's into individual shipping boxes.Typing and using a PC to perform administrative tasks (closing workorders in ServiceNow).Understanding and 1-2 years’ experience supporting MS Windows and applications.Comfortable working in a warehouse environmentExperience Required:1-2 years’ experience supporting MS Windows and applications.Comfortable working in a warehouse environment.ESSENTIAL REQUIREMENTS: Must be able to lift up to 30 pounds. Work on feet most of the day. Moving stacks of equipment by hand. Packing pallets. Packing PC's into individual shipping boxes. Typing and using a PC to perform administrative tasks (closing workorders in ServiceNow). Understanding and 1-2 years’ experience supporting MS Windows and applications. Comfortable working in a warehouse environment.About Advantage Resourcing Advantage Resourcing is committed to providing equal employment opportunity for all persons regardless of race, color, religion (including religious dress and grooming practices), sex, sexual orientation, gender, gender identity, gender expression, age, marital status, national origin, ancestry, citizenship status, pregnancy, medical condition, genetic information, mental and physical disability, political affiliation, union membership, status as a parent, military or veteran status or other non-merit based factors. We will provide reasonable accommodations throughout the application, interviewing and employment process. If you require a reasonable accommodation, contact us. Advantage Resourcing is an E-Verify employer. This policy is applicable to all phases of the employment relationship, including hiring, transfers, promotions, training, terminations, working conditions, compensation, benefits, and other terms and conditions of employment. All employees are directed to familiarize themselves with this policy and to act in accordance with it. All decisions with respect to employment matters and other phases of employer-temporary employee relationships will be in keeping with this policy and in accordance with all applicable laws and regulations."}