{"title":"Senior Analytical Chemist NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIKBdMtQjX6T3ez-vRqywjhaQh_8NPUHJT1jPaHvk9z3o9-eqANfI8LyJERs9w9jJQxSubJiYotZF6LFx4vqXPBNENI70GY_-obOO4fD8fMGREw2WNDG7wSUfi6pv8b9KyzSD1rwgdwX6k0W5BpWLnw-v7sFwHCvBMAVkpmJvt_48E3z8yw_DYs0MT5pSym","source":"ziprecruiter","full_description":"Title: Senior Analytical Chemist Location or division: Matthews Job Description and Requirements: Summary Provides innovative analytical services in support of commercial and manufacturing activities. TASKS & RESPONSIBILITIES   Direct and/or perform evaluations and analytical experiments to develop solutions on time and in full to internal and external customer problemsDevelop, document and implement tests, standards and procedures to ensure that products and services perform to customer specifications.Clearly communicate results, analyses, interpretations, theories, models, and conclusions to management, commercial group, operations and customers as appropriate.Evaluate new materials, develop test methods and write specifications as required.  Maintain an updated hard copy and software IR library of reference spectra.Develop ALTM's and QCTM's in support of PD, manufacturing or Analytical activities.Investigate, evaluate, purchase and manage training on new instrumentation, as appropriate. Adheres to EHS, Quality Management and Regulatory Compliance rules.Professional Background 1-5  years Commercial or industrial laboratory experience using high-throughput automated analytical instrumentation.Proven ability to identify and \"troubleshoot\" problems by application of scientific principles and established analytical techniques within the company and through 3rd parties as necessary.Experience within coatings, coated films or laminates industries are a plus.EducationAdvanced Chemistry degree desired, with a PhD preferredMinimum BS degree in Chemistry or closely related field required, with 1-5 years of experience in manufacturing support laboratoryProfessional Competencies               Gas Chromatography (Theoretical & practical knowledge and maintenance of wide bore capillary columns, headspace GC a plus).GPC (Theoretical & practical knowledgeInfrared Spectroscopy (sample preparation techniques, interpretation).Karl Fischer Titration, Laser Light Scattering Particle Size Analysis.Highly skilled in characterization of polymers, polymeric coatings and adhesives essential.Demonstrated hands-on, high energy, proven problem solver across multiple analytical disciplines.TC Transcontinental, Making Impressions CountTC Transcontinental is a leader in flexible packaging in North America, and Canada's largest printer. The Corporation is also the leading Canadian French-language educational publishing group. For over 40 years, TC Transcontinental's story has been one of innovation and transformation to meet our customers' evolving needs. Our strong family values, entrepreneurial spirit and long-term vision have always been at the heart of our success.  With our 3 business sectors of Packaging, Print and Media, we continue to optimize, transform and grow while making impressions that count! TC Transcontinental Packaging brings a distinctive blend of Art, Science and Technology to create flexible packaging that preserves our customers' products and accentuates their brands on the store shelf. The Packaging Sector has over 4,000 employees and 25 facilities worldwide specializing in extrusion, lamination, printing and converting of plastic products.  We share the Ellen MacArthur Foundation's vision of a circular economy for plastic, where plastic never becomes waste and have committed, by 2025, for 100% of our plastic packaging to be reusable, recyclable or compostable. And most recently, we joined the United Nations Global Compact - a voluntary initiative of signatory companies committing to social responsibilities around human rights, labor standards and environmental protection.  You will join a high-performing team that is dedicated to sustainability and passionate about our people, operations, communities and products.Learn more about us https://tctranscontinental.com/en-us/packaginghttps://www.facebook.com/TC-Transcontinental-Packaginghttps://www.linkedin.com/company/tctranscontinentalpackaging/ talent@tc.tc #INDUS#LI-TH1  Requisition number: 7618BR Job Function: Manufacturing Full/Part-Time: Full-time Job status: Regular Sector: TC Transcontinental Packaging Province or State: North Carolina (US) Legal Note: TC Transcontinental is proudto bean equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity and/or expression, sexual orientation, national origin, genetics, disability, age or veteran status."}