{"title":"Technical Writer I","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKQqg7bEMrxYVrqcIKXzwakm8gZFGholowDdqe-TGArYuJBYUfjioOk8wTw4Pau2tLOd7gid3BB16M5DHat4ZkJZCX4XoZcHetYRi7FUm60bVhjWs7meTtLG_u8hHKCNzWxU329YB-wDw2Q0oIIIC0Lzo_0qnV2tmi5YrBi9-eL7Zt0Cce-BCh44N8Sfjys","source":"ziprecruiter","full_description":"Job Req #: #: 21-01920Job Description: Technical Writer ILocation: Broomfield, COPosition Type: Shot-Term ContractMy client is the second-largest U.S. communications provider to global enterprise customers. With customers in more than 60 countries and an intense focus on the customer experience, my client strives to be the worlds’ best networking company by solving customer's increased demand for reliable and secure connections. The company also serves as its’ customers trusted partner, helping them manage increased network and IT complexity and providing managed network and cybersecurity solutions that help protect their business.Description:We are looking for a Technical Writer to document data flows and accounting business processes for intercompany revenue and expense transactions originating in five primary billing systems that interface into our SAP general ledger.The consultant will work with finance (accounting) and information technology subject matter experts to understand and document the end-to-end intercompany revenue/expense transactions including sample accounting entries.The consultant will collaborate with the Sr. Director of Accounting Process and Quality Assurance to identify process breakdowns and recommend improvements.The technical writer will should have an understanding of ERP systems, finance business processes, as well as accounting transactions.Anuj MarwahaTeam-Recruitmentanuj.marwaha@acsicorp.comAbout Ascent:The Ascent Services Group (ASG) is a nationally recognized technology staffing and consulting firm whose fundamental business is providing staffing services to Small, Medium, and Large Enterprise clients in our core market verticals: Financial Services, Healthcare, Technology, and Life Sciences. As consultants for ASG, you will have access to many of the top clients within the industries we serve. Our goal is to deliver innovative talent through proven best practices and effective resource optimization. Become one of ASG’s candidates and experience the difference."}