{"title":"Licensing Administrator","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJjJ0G7JaSXnECOfRg4keXs3hd-sd7lDV9jZbX9VNMqpE-AdAAwahUQNFQ7hbh7OnwzoJhDr3pvIEMkiC4sXdx7LaySevROAbmMRmEOtk3wgV46PXi4_dc6VtKhxt6NUJrMqNHQTwGVviPYkDxVZuHH7m70gmiLhlBGRu_5iwKIw0Qwq8sCP1e6z_pVNi9-","source":"ziprecruiter","full_description":"Job Summary: The Licensing Administrator is responsible for coordinating and completing all government, regulatory and internal compliance licensing activities and storing of associated documentation. S/he must be familiar with standard concepts, practices, regulations and procedures within the cannabis industry. S/he performs a variety of tasks under the direction of management. Duties and Responsibilities: Responsible for the management of licensing and renewal documents and document archiving.Obtain, prepare and submit cannabis (medical and adult-use/recreational) licensing applications, renewal documents, and permit applications for each license in CO, NV, and MA.Ensure all documentation is prepared in a timely manner, with all the correct signatures and attachments for submission to local and state regulatory agencies. Submit documents to regulatory agencies for licensing renewals.Scan, upload, and store compliance documentation in accordance to regulatory requirements.Perform employee background investigations.Monitor employee MED badges in Colorado, and process employee registrations and renewals in Massachusetts and Nevada.Support compliance department with other duties as assigned.Job Requirements (Education and Experience)High school diploma or GEDMust have or obtain CO and MA occupational badgesQualifications (Knowledge, Skills and Abilities)Knowledge of the cannabis industry, METRC, and processes involved in cannabis productionDetail-orientedAbility to work in a team environmentAbility to multitaskPositive attitudeThis job description is intended to explain the general nature and level of work being performed. It is not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified.Good Chemistry is an equal opportunity employer.Applicants must currently be qualified to work in the United States."}