{"title":"Android Developer (PT) NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAL8IshOpSXozXBMqlk9ySyQDIGMS9UuySd1CpJBe6xbYpFD7CBjSxeI9cDfTsc__4WDxKw51-dad6sKFJgxTk6G4S0jl0uV0CYLgM4evKk0pN_EHRiZHSqO1PT80gF9GLOULwEfIL-U1WnFjJrt49lYzf2vVwaCNP4otn5hiirnolBi_WihTuGNRXUf6tqn","source":"ziprecruiter","full_description":"This is an opportunity for a creative and technical contributor with Android development skills and the ability to work attentively with UI/UX research and design. You will be building apps and libraries, collaborating with designers to bring new ideas to fulfillment, with talented team dedicated to achieving innovation and delivering UX/UI expertise to enterprise digital projects.  The successful candidate for this role will have Android technology experience along with a zeal for good design and artistic taste ResponsibilitiesPartner with creative and technical teams to deliver first class user-centric experiencesDevelop high-fidelity interactive prototypes for deployment on multiple device typesInterpret UI/UX design and research for translation into deliverable code and graphic artifactsBuild and maintain interactive style guides and UI component librariesExplore new technologies through research and applied innovationActive participation in agile ceremonies as part of project executionExplain how a solution meets user needs, business goals, and technical constraintsUnderstand and adhere to best practices for UI deliverables and processAdvocate for the end-user  Required Skills/Experience3+ years in Android development and a Bachelor Degree in a relevant field (i.e. Human Computer Interaction, Computer Science, Graphic Design, or New Media)Strong examples of pertinent workExperience with code repository tools and concepts such as GitHub or BitbucketExperience with building and consuming shared libraries such as Maven RepositoriesKnowledge of technical platforms and concepts (i.e. REST, API, CMS, etc.)Positive, proactive and helpful attitudeExperience with graphic production tools (Photoshop, Illustrator and/or Sketch)Strong listening, organization, and communication skillsPassion and appreciation for art and design  Preferred Skills/ExperienceBackground in graphic design and/or interaction designFamiliarity with the principles of animationKnowledge of the software development lifecycle including CI/CDExperience with project tracking systems such as JIRA, Confluence, etc.About Harvard Partners, LLP, Trusted Advisors to IT:Harvard Partners is a management consulting firm focused on helping companies more effectively leverage their IT investment. We engage with the C-Suite and Technology Team to help them better understand their IT infrastructure and process in order to align the technology strategy and organization to reach the firm’s strategic business goals.Some of our practices include:• Program/Project Management and \"PMO as a Service\"​• IT Assessments• Business Continuity/Disaster Recovery• Optimized Infrastructure• Concierge Managed Services• Data Center Strategy, Transformation, and Migration• Cloud Management Programs• Security Assessments and Remediation• Staffing, technical & tacticalWorking with the client’s staff, vendors, and consultants, we deliver supportive and collaborative engagements where direct dialog, simplified reporting, productive meetings, and clear responsibility and accountability encourage active participation resulting in consensus-based business outcomes."}