{"title":"Manufacturing Engineering and Maintenance Senior Manager NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKbWq_y8i8yJVeToMCJ0K67SsrGqVQcLeEwr5R8PrpFFn33ZKGLlwz1Hlbp67Ctv6w89HMXDE0MSIMZeksJv0lFBsl9Ey2XihBGEzPSPwFGOKlOVabem5T1KWKDJBLzYP--H17usr0ls9pxuYbI2YsX3Cf8Cv57U0eSyHwkx2_z94VA7giCIGRf8kohQ8lU","source":"ziprecruiter","full_description":"Summary:The Senior Manager leads a team of 5 Managers/Supervisors in the Manufacturing Engineering and Maintenance areas. Holds responsibilities in all aspects of manufacturing engineering ranging from collaboration with cross functional teams on development programs, transition of those programs to production launch, and continual improvement in production operations and processes.The Senior Manager also manages a cost-effective, service oriented team of Associates responsible for the Maintenance of company equipment, molds, dies, fixtures and facilities in order for manufacturing to implement continuous improvements and achieve its goals.Responsibilities:Support and advance our existing safety culture.Lead team members in developing, managing and achieving performance objectives that align with the company’s objectives.Ensure appropriately skilled resources are available to support the production floor. Hire, train, and mentor engineering and maintenance team members. Provide promotion and disciplinary recommendations, as well as performance evaluation and feedback for direct reports.Contribute to the creation and implementation of best practices, manufacturing strategy, policies, processes and procedures to aid and improve operational performance (safety, quality, delivery, and cost).Analyze and approve plans for work force utilization, space requirements, workflow, and design layouts of equipment for maximum efficiency.Provide estimates of production times, staffing requirements, and related cost information and propose recommendations to top management in order to ensure sound decision making.Review and approve capital expenditure and facility maintenance projects. Ensure projects are properly planned and executed.Prepare departmental budgets and cost estimates and manage performance to those ensure objectives are met.Recommend solutions to business problems and/or identify opportunities for improvement, and present ideas to top management.Other duties as assigned by leadershipExperience and Skills Desired:Bachelor’s degree in Engineering preferred15+ years of plant manufacturing experience in Manufacturing Engineering, Maintenance or both.8+ years of managerial experience.Proven drive in meeting and exceeding department and company objective results.Effective oral and written communication skills.Toyota Production Systems (TPS) working knowledgeAbility to interact positively with people of diverse cultural backgrounds.Strong critical thinking, problem solving and decision making skills."}