{"title":"Technical Support Specialist-Med Tech","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAK-Z6FMDoqhoRAs-_9Le9W3JRGSOGS3-Y_S_kquu-rtk6-dnsj1NcmzmlHlCJ6uVPK4OwACRGo_W1FN3VzX1U1NZs76JR6ypnuO0NaUV5HXGNPwgpkD2kQTSWfY_1vfg8x8OMTM-dNerlCZact69JrRtK744nv5n_aWxg1Okwsn1Zs6OuyzC7575aU9cWI","source":"ziprecruiter","full_description":"DescriptionSummary: Provides field technical support to Internal and External customers for the complete STAGO line of reagents, consumables, products and systems (Instruments and Middleware) within a specified territory, but not limited to that territory. Provides support to Sales as requested to assist in the Pre- and Post-Sale activities to maintain customer satisfaction.Essential Duties & Responsibilities Demonstrates the highest level of product knowledge to support both internal and external customers. Completes method verification for all instrument purchase orders to ensure the system(s) are brought live in an efficient time period to meet the customer's expectations. This includes all the Stago reagent, instrument and middleware product lines.* Completes lot conversions as requested and verified by contract commitments for new reagents in an efficient time period to meet the customer's expectation. This can be on site or remote with a focus for the customer to use the middleware Accreditation tools. Assists with problem solving for internal and external customers including but not limited to: reagents, instruments, middleware, and software as needed following Stago's escalation SOP. Provides support to Sales when performing live lectures, demonstrations or evaluations to ensure that Stago is positioned to best meet the customer expectations to win the new contract or renew the existing one as requested. Utilizes materials provided on Prolifiq or as provided by Marketing for all Stago product lines as well as competitors. Messaging will be consistent to drive the Stago brand. There is no developing your own PowerPoints, if you feel there is a need for something missing send to Director TSG. Maintains contact with the customers within assigned territory on a regular basis, but ensure that any travel to another territory the follow up is efficiently transitioned to the local teams. Utilize CRM to record all customer activities and keep current so that reports can be pulled on the last day of the month. Maintain CRM data so it is current, so contacts should be reviewed each time you go into the account. Any changes to account name, address or instrumentation you must complete the proper paperwork and submit to Sales Admin. Provide to customers only the most current CLSI SOPs as developed by Training. Performs customer on-site evaluations/demonstrations/lectures as requested. Represents Technical Support Group and Stago at seminars, conventions, meetings, and wet workshops as requested. Responsible for learning the activities that have been handled by TSRs and SASs so that you can perform the same functions. Furnishes leads to the Sales Team based upon technical calls and interactions with existing client base to expand current testing menu or upgrade instruments. Interacts TSMs, RSS and TSS II for advanced training and trouble shooting through the escalation process. Supplies appropriate telephone support. Manages expenses by adhering to company T&E policy. Works on special projects as assigned by management.Education and Requirements: Bachelor's degree in related field from four-year college or university or equivalent required. MT(ASCP) Certification or equivalent strongly preferred. Minimum of five years' experience as a medical technologist with coag exposure; prefer experience with Stago products Current driver's license is mandatory. More than 80% travel based on territory and company needs, including overnight stays and air travel.Skills: To perform this job successfully, an individual should be familiar with Excel and Windows Office Suite Applications. Ability to read, analyze and interpret complex documents; respond effectively to technical inquiries and customer complaints. Ability to write and deliver effective and persuasive technical and non-technical presentations to senior management, sales and service staffs, and customer representatives. Ability to work with mathematical concepts such as fractions, percentages, bias, ratios and proportions to practical situations. Ability to apply clinical knowledge to data analysis. Ability to define problems, collect data, establish facts and draw valid conclusions. Ability to interpret an extensive variety of technical instructions. Ability to deal with non-verbal symbolism (formulas, scientific equations, graphs, etc.).We offer an extensive benefit and compensation package that includes medical, dental, vision, FSA, 401k, PTO, life and disability insurance, as well as a comprehensive leave program. Pay anticipated for this position in Colorado is from $58,000-$75,000, depending on a number of factors. This role is also anticipated to be eligible to participate in a bonus plan and an automobile plan which are associated with this position . In the ordinary course of business, compensation and benefits programs may change based upon the Company's needs.All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability or protected veteran status. Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities. Please view Equal Employment Opportunity Posters provided by OFCCP here.* The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-1.35(c)Requisition Number: 20-0007Post Date: 3/3/2021Title: Technical Support Specialist-Med TechCity: DenverState: CO"}