{"title":"R & D Chemist - Printing Inks","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALK3St0-QjGACjDlAeNTWw9xFwMmnmj0VpaJHlUucrFCOm0_dvNxcIt-rsP48LAEyqTcL2ravT5bvlfIzsp3tQwLMjKiHU_6fe9w72ZiBGOyoNEBMbm0Os_QPzNfXKJDIv_gfvKA3jYc0Frvpmb3HVtH8vp8bTz7qm_or9TC6uJydwFFiWXkrD7Hw9x8w8","source":"ziprecruiter","full_description":"Overview Welcome!  Are you seeking a global, well-established and innovative company that's part of an industry with exciting growth potential?  Then, start your Colorful Career with INX! INX International is the third largest producer of inks in North America with full service subsidiaries in Europe and South America. We offer a complete line of ink and coating solutions technology for commercial, packaging and digital applications.  As a leading global manufacturer of inkjet inks, we provide a full palette of digital ink systems, advanced technologies and integrated services. At INX, we believe we can only grow our business as well as we grow our teams.  The average employee has been here over 13 years. We offer a competitive salary with excellent benefits including medical, dental, vision, life insurance, disability, 401(k), and more.  We are looking for new talent with new ideas as we continue to provide quality, service and innovation to the printing and packaging markets. Our company is an essential business since we are part of the supply chain for food packaging, pharmaceutical packaging and print media used for vital communications.  We are very busy fulfilling commitments to our customers, while still following safe practices related to hygiene and social distancing. INX is hiring and seeking talented candidates to support our business development, and we encourage you to apply. We have an opening for an R&D UV Chemist at our facility in Edwardsville, KS.  If you are a chemist that enjoys solving problems and creating solutions in constantly growing and evolving market, this position is a great opportunity for you!  Why you will love working at INX:Our R&D has a strong knowledge base33% of our Chemists have over 15 years of experienceINX has cutting-edge innovation and technologyCollaborative teamsAutonomous work environmentGrowth potential Please view the video below at our R&D Center in Illinois which shows the type of work this job entails.  Responsibilities Develop & improve Energy Cure printing inks and coatingsConduct research into composition, structure, properties of printing inks, coatings, and raw materialsCollect, record and interpret data. Reach conclusions and report resultsPrepare standards and specifications for products and QA testsCoordinate work with other chemists or technicians assigned to specific projectsUnderstand the procedures for and use Laboratory testing equipment Qualifications (Skills - Education - Experience) 1 to 3 years experience with Bachelor's degreeBachelors Degree in Chemistry or equivalentMinimum Associate's Degree in Chemistry with Energy Cure ink formulation experienceExcellent math, computer, communication & organizational skills are requiredAbility to analyze and interpret general technical procedures, or governmental regulations Additional Qualifications Requested or Helpful: Knowledge of Energy Cure pressroom applications would be extremely helpful.Previous UV or EB Ink coating and formulation experience is desirableAbility to define problems, collect data, establish facts, and draw valid conclusions We require a post offer pre-employment drug screen, physical and background check.  Equal Opportunity Employer - disability/veteran"}