{"title":"Structural Engineer in Training NEW!","location":"","salary":"","description":"","term":"$53,000 to $69,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJJCqYoIRWFJLZeMyZvcWevXWyWoGQJMOrW4ertQvazBXl2itRx-fwYXMgRjxhL0C14EipnldgumEvsX1_YxgZQKJYN4khQipcFkMKgO-6ipF4R6gyMOx12QnlXMc5T1JOfiALk5HAxncAytzHHO0gUQxl13mmnfDSqos-nhxiu9dqKcuzm5rdFeIyiDuc","source":"ziprecruiter","full_description":"Do you love to see your designs come to life in the real world? Do you enjoy the challenge of working on a variety of project types? Are you interested in gaining engineering experience in a fantastic firm located in Denver's LoHi neighborhood? If so, we may have the perfect job for you!Anchor Engineering, Inc., a full service consulting structural engineering firm located in Denver, CO, is seeking a Structural Engineer in Training with 2-3 years of structural engineering experience and Revit proficiency.Why Anchor Engineering?Friendly, team environmentCompetitive salaryBeautiful LOHI office location in Denver, COGreat benefits packageComprehensive trainingJob Description:Assist Project Engineers and Project Managers in the design of projects which consist of calculations packages, structural plans and details, and specifications.Develop feasible design alternatives.Identify and analyze principle structural design features and major design alternatives that satisfy the project's purpose and needs.Collaborate with project design teams in the review of details, final design plans, calculations, and specifications in accordance with the applicable Building Code, project requirements, and internal office standards.Coordinate technical recommendations, assess the cost-effective constructability of the project and generally evaluate the quality of the project design.Provide day-to-day guidance and input to technical and/or support personnel.Utilize Autodesk Revit to create building Construction Documents.Other duties as assigned.Ideal Candidate:2-4 years of Structural Engineering experience.At this time, we are only accepting candidates with Structural experience and working knowledge of Revit.Graduation from an Accreditation Board for Engineering and Technology (ABET) college or university with a degree in Civil or Architectural Engineering and Professional Registration as an Engineer-in-Training (E.I.T.)Working toward achieving Professional Engineering License.Experience designing utilizing a variety of materials (concrete, structural steel, masonry, and timber.)Knowledge and experience in the area of structural analysis and design using conventional hand-calculation methods, structural computation and modeling software, Excel, Word, various structural design software programs, and computer aided drafting software including AutoCAD and Revit.Please email a cover letter and your resume. No phone calls please. Anchor Engineering is an equal opportunity employer."}