{"title":"Q02 - QC Chemist (53111)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAL5Z9IGkPel1lpAhKmDN10odTVtL28B1mbu1dba5aOLe1bUsAPU6GgTzR3IhwPM8e2ZtT-y-UE4M7erffdTnnLBwVohpIHXBr1s4HaPp1l0yWv9P567iIxSoAF13SkN3HKQuMkgKyMkBlzBhD5g-Im9nbhG3PeUoG2--cDVgxf2DvkFQVW2o1bEObpha0Q","source":"ziprecruiter","full_description":"Job purposeThe job of the \"Chemist\" is simple described as an individual contributor who performs testing of samples of various types using various techniques or equipment in the QC laboratory. The job itself may befurther modified with respect to the department, group, etc., as exemplified in the \"Department\" on an individual assigned basis to a sometimes specific testing group. The role may be further modified based upon individual education, training, experience or a combination of all three.Generally, modifier designation with respect to experience for Chemist are as follows. However, combination of education, training, and special skills will determine the assignment of Level to a specific individual:Level 1 : O to 3 yearsLevel 2: 3 to 5 yearsLevel 3: 5 to 10 years Senior: more than 1 O yearsChemist reports to Section Head or aboveDuties and responslbllitiesThe general duties and responsibilities of the \"Chemist\" include but are not limited to the following:Conduct routine testing or other analysis in a specific group or department setting.Conduct advanced testing and/or critical testing, as required.Operate specialized equipment or conduct specialized skill testing.Participate in investigation activities.Ensure compliance to all data integrity and cGMP practices, procedures, and expecations.Ensure compliance with all good documentation practicesOther duties and responsibilities assigned by the Head of the Department.Qualifications Bachelor's degree (BS or BA), physical sciences preferredMaster's degreeProficiently speak English as a first or second languageProficiently communicate and understand (read and write) scientific work in EnglishHave excellent organization, learning and teaching skills required to work in teamsAbility to understand and analyze complex data sets.Working knowledge of Microsoft Office programs and other scientific based softwareWorking conditionsThis role works in a cGMP laboratory or manufacturing environment, where personal protective equipment is required, which may include uniforms, lab coats, safety glasses, respiratory protective equipment, hearing protection, etc. Work with or around solvents, powders, or other materials commonly found in a pharmaceutical laboratory or manufacturing facility is required.The role may be assigned on a work-shift basis, where required (Day, Evening, Night). Weekend or Holiday work may be requested or required.Physical requirementsWork standing or walking unassisted for 75% or greater of an 8-hour period. Unassisted lifting up-to 10 kg, may be required.Able to wear appropriate personal protective equipment at all times, when required.Sitting at a desk and/or working at a computer or other \"screen\" 75% or greater of an 8-hour period."}