{"title":"Senior iOS Engineer (Remote anywhere in the USA) NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIavBfHXYjIausEU5sWnGqd0X7FGNCubXmHJpgoqNVaY10IN1V0Ipmx_ViMg98p5V5vzFkNOCqUMufn2vXrQYqVg62i0IIgLE1hGbvcD2D26vDYWbiTTIjDDcPQnTomDcA4svL-L5Z8kI1ZgsXUJva7RRkI1iPZod_nABhU12TprPW-E8SVx6XvXQ-AqU7h","source":"ziprecruiter","full_description":"The Job in ShortWe need your mobile technology skills to push our product to its limits. You will become part of a continuously transforming environment that influences the banking experience of millions of users around the world.Meet the JobTake the initiative and collaborate across various teams in order to boost the quality of the core product to global customer-friendly standards. Backbase omnichannel app is a continuous product, which means continuous improvement and expansion.You will have to come up with technological advancements that are rock solid and able to survive for generations. Your innovative ideas will speedily turn into daily tools for our customers and will add-on to already existing features.You enjoy when \"things are being done and they are being done well\" and so do we at Backbase.How about You?Undoubtedly, your mobile development for iOS knowledge combined with excellent code reading techniques is an absolute necessity for this position;You should be comfortable in a Scrum team, using lean and Agile methodologies;Experience in TDD, unit testing, continuous integration or Jenkins would be an extra plus. Moreover, you are familiar with Objective -C and Swift;You should be able to boast of a few apps that you have successfully developed yourself;You will dedicate yourself to testing, checking codes quality, reviewing other people's code and compiling documentation using Agile methodologies;You are a self-starter and enjoy finding out things for yourself;You are ready to engage with a product that will never be finished.Preferred Skills:Advanced iOS platformAdvanced SwiftNetworking HTTP, SOAP, and RESTTesting frameworks (XCTest/XCUI)OOPMVC/MVVMSOLID principlesUIkitURLSession (Apple's internal HTTP solution)"}