{"title":"QC Chemist I","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAIfJtDBsoH2tdh-5KwJV0zZKYIwCzaTOwUqYdV-UbDFFC9POAyO1uxIeFrX73-5RPtpquR7VDShAE58mbdRTe3g_vsWYCqYWhpwDmuYCFxBgBN-h6j154Ot1UyHYFlOfgWaDPXbe9l857Ty0rdj2OfoMiWYKs4qcgEWyOgIVKpajnYmhvRGBW8nH1GeETtm","source":"ziprecruiter","full_description":"Job DescriptionPosition Overview: Catalent hires people with a passion to make a difference to the health of millions of people globally. Your expertise, coupled with Catalent's advanced technologies and collaboration with thousands of innovative pharmaceutical, biotech and healthcare companies, will help bring life-enhancing products to the people you know and love. Your talents, ideas and passion are essential to our mission; to develop, manufacture and supply products that help people live better, healthier lives. Interested in learning more about life at Catalent? Start herePosition SummaryThe QC Chemist I reports to the Sr. Manager, QC.Catalent Pharma Solutions is looking to hire a Quality Control Chemist I for our San Diego, CA team. The individual for this position will be responsible for performing various analytical techniques and common standard lab practices in order to assess the quality of pharmaceutical products under cGMPs (as applicable) and limited supervision. This entry level position gives opportunities to broaden analytical understanding and learn the common operations in a fast-paced, early Phase-focused, dynamic Quality Control group.Catalent Pharm Solutions in San Diego is a premier pharmaceutical chemistry development and manufacturing organization supporting the pharmaceutical and biotechnology industries. We focus on bringing client drug compounds from discovery to the clinic with services that include analytical development, preformulation testing, formulation development, GMP manufacturing and stability storage and testing. We recruit and develop exceptional individuals with a passion for science and determination to excel. We offer a technically challenging and stimulating environment and the opportunity to learn from the best. The RoleIndependent execution of various standard laboratory techniques, including but not limited to H/UPLC, dissolution per USP <711>, water content analysis per USP <921>, appearance assessment, water activity per USP <922>;Independent preparation of samples, solutions, instrument set-up and breakdown;Independent preparation of data packets and creation of stability data sheets and Certificates of Analysis to summarize analytical testing;Assisted participation in Out of Specification investigations and the documentation of analytical deviations along with Qualified Investigators and management;Understanding of cGMPs, ICH and FDA Guidelines, Catalent SOPs and Catalent systems applicable to work performedThe CandidateB.S. degree in a scientific discipline, Chemistry or Biochemistry preferred with 0-2 years of applicable QC laboratory experience, some GMP exposure preferredPosition BenefitsAwesome employee activities: Movie day, Monthly Birthday Celebrations, On-site Fitness Center with machines, on-site yoga and HIIT classes, Sponsored Sports Teams, and several other company sponsored events that encourages positive employee comradery, which contributes to effectively building positive employee relationships, overall creating a positive work environment;Environmentally friendly with on-site practices as well as regularly participating in Beach Clean-up activities;High visibility to Senior Leadership daily;Medical, Dental, Vision and 401K are all offered from day one of employment;19 days of paid time off annually and ten paid holidays;Tuition ReimbursementLeadership Competencies for Performance and DevelopmentLeads with Integrity and RespectDelivers ResultsDemonstrates Business AcumenFosters Collaboration and TeamworkChampions ChangeEngages and InspiresCoaches and DevelopsCatalent offers rewarding opportunities to further your career! Join the global drug development and delivery leader and help us bring over 7,000 life-saving and life-enhancing products to patients around the world. Catalent is an exciting and growing international company where employees work directly with pharma, biopharma and consumer health companies of all sizes to advance new medicines from early development to clinical trials and to the market. Catalent produces more than 70 billion doses per year, and each one will be used by someone who is counting on us. Join us in making a difference. Catalent is committed to the health and safety of its employees, visitors and the customersand patients we serve. As a result of the global pandemic, we have modified many of our recruitment and on-boarding processes to maintain everyone's safety. The Human Resources teams will communicate all necessary safety processes and procedures throughout each stage.personal initiative. dynamic pace. meaningful work.Visit www.catalent.com/careers to explore career opportunities.Catalent is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation or gender identity. If you require reasonable accommodation for any part of the application or hiring process due to a disability, you may submit your request by sending an email, and confirming your request for an accommodation and include the job number, title and location to DisabilityAccommodations@catalent.com. This option is reserved for individuals who require accommodation due to a disability. Information received will be processed by a U.S. Catalent employee and then routed to a local recruiter who will provide assistance to ensure appropriate consideration in the application or hiring process.Notice to Agency and Search Firm Representatives:Catalent Pharma Solutions (Catalent) is not accepting unsolicited resumes from agencies and/or search firms for this job posting. Resumes submitted to any Catalent employee by a third party agency and/or search firm without a valid written & signed search agreement, will become the sole property of Catalent. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral. Thank you."}