{"title":"Technical Lead with Unity Experance NEW!","location":"","salary":"","description":"","term":"$35 to $60 HourlyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAL21cvPL_EjI6iNvA7wzqfkTtr53bnbdOMOm4k9WPoxUbz1BBZIHD-EE3tfXWx5krpF5v5g-cWHgUPI-K0fqjgKcwHlS94IVlyvdpXX2pxJzMyRVdlEyU84RSXxfp6syFo6Perxauz98PYkc46LggX1tL9anXhBwCh6CXL5L1235i9rzWnmCcBhRjgl7ms","source":"ziprecruiter","full_description":"Technical Lead Role DescriptionThe Technical Lead is responsible for planning and overseeing the technical aspects of a project, you will report to and work with the Project Lead. You must be able to take technical concepts, describe them to the Project Lead as well as provide task breakdowns, project architectures, and time estimates.You must have experience with mobile app development with at least some exposure to the Unity game engine. Full Stack, games, AR, or VR development experience is a plus.You will be expected to virtually attend team and client meetings. Consistent internet and clear verbal communication is a requirement. This is a full-time position, and we expect the workload to be up to 40 hours a week. You will be expected to be available to attend daily stand-ups, coordinate with a distributed multidisciplinary team, and complete all tasks on time and to specification. This is a remote work contract, but the worker must be available for 6 hours of overlap time with California (PST) daily, preferably between 9 am-2 pm PST. Role OverviewCreate architecture, task lists, and technical design documents for assigned projects. Implement high-quality code.Attend team meetings, including project kick-offs, stand-ups, and additional meetings as required.Work in partnership with a non-technical Project Lead to keep the Project Lead informed on the technical aspects of the project. Qualifications & Skills:The ability to step into a project and determine the best technical ecosystem for that project’s needs and then move into operating in that ecosystem is the most important skill for you to have. Past that;Experience in MongoDB, Express, React, Node. Unity, C#, Flutter and Firebase are preferred.Write clean, efficient, well-documented code.Strong written and verbal communication skills, including the ability to communicate issues and report project design and status to a diverse non-technical audienceMust be detail-oriented, quality-driven, straightforward, self-motivated, and proactiveAble to work independently, creatively, and track multiple deadlines to successAble to accept constructive feedback on your workProven ability to multi-task and manage multiple complex initiatives simultaneouslyProven history working in collaboration with multidisciplinary teamsPrevious experience in developing games or applications and implementing best practicesExperienced with software development methodologies as well as build and release proceduresExperience with project management or task trackings systems such as JIRA, Trello, or Pivotal Tracker preferredMust have at least 4 hours overlap with the Studio time 9am to 5pm PST.About Robot Sea MonsterWe are a digital production studio with an extensive background in games, AR/VR, and commercial application development. Founded in 2012, the studio has successfully shipped over 38 products, serving major brands such as Blue Shield, Pearson, LO3 Energy, Occipital, and Sizzle Entertainment. Our work has been profiled in major media outlets, such as The New York Times, CNBC, TED, and more.Working ConditionsWe are a fully remote company with team members across the globe. Team members are expected to have high-speed internet suitable for both work and voice calls. Team members must have a functional microphone withclean audio to communicate with the rest of the team. Additional tools required for the position must be supplied by the team member with exceptions only for exceptionally proprietary software or hardware required for a project. Expected Hours of WorkSome flexibility in hours is allowed, but all team members must be available during the “core” work hours of 10:00 a.m. to 3:00 p.m. (PST) Monday through Friday. Workers must be available via Google Hangout, email, and Slack during designated work hours. Additional hours may be required when project completion deadlines must be met as well as for periodic client meetings. Hours will fluctuate based upon the number of projects, project scale, and project timelines."}