{"title":"Quality Control Chemist (Pharmaceuticals) NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAJwnfyC08B75n86hYxfD5PdvJWpQYSdM6Z79YV_9LhQIYkS44nbCOOj37L51iT8z-UgRbXRloaSb4R4woQ3JgkV5ig-8f5I5Egkkwb8QBWLdXzQSyXMrQ7XK7Vdw3EgiF76QRj3_1dPUnxbX54BscdOSoTGEZL9phg_Aj7sw38vmWMS1vLO9jv0KIXxF3o","source":"ziprecruiter","full_description":"Quality Control ChemistLocation: Largo, FL (33771)Contract Length: 4 months (with opportunity for extension)Objectives:The QC Chemist II is responsible for supporting the company's Quality Control related requirements. This includes the performance of area responsibilities necessary to ensure that Laboratory activities are in accordance to cGMP's and FDA requirements. This individual performance must be aligned and consistent with company objectives, applicable department programs, including training, documentation, standard operating procedures, and company policies and procedures.Performs analytical testing of raw materials, in-process samples, finishedproducts and stability samples in accordance with company SOPs and established cGMP and safety guidelines.Responsibilities:• Assist with maintenance of lab consumables inventory (e.g. - reference standards, columns, reagents, test solutions, solvents) including procurement, receiving, labeling, storage and disposal consistent with standard operating procedures as well as disposal of related packaging material• Prepare Test Solutions as per established test methods and/or compendial requirements• Prepare/Standard Volumetric Solutions as per established test methods and/or compendial requirements• Conduct advanced, compendial-based wet chemistry testing of raw materials and components (e.g. - <231> Methods I and II, potentiometric titration, dissolution) consistent with established methods/specifications as well as USP/NF• Conduct basic chromatographic analysis (e.g. - HPLC/GC assay) as part of raw material/in -process/ finished product testing• Execute compendia I method verification protocols and report results to the QC Analytical Support Group• Train QC staff, where qualified to serve as a trainer• Initiate change controls and document change requests as directed by laboratory management and ensure their timely approval/closure• Documents the procedures and results obtained in laboratory notebooks/logbooks according to established procedures consistent guidelines.• Assists in calibration and maintenance activities of instruments as directed by lab management.• Demonstrate proficiency in QC Chemist I job requirements.• This position may require the labeling, packaging or movement of hazardous (flammable, corrosive, toxic, etc.) waste within the facility. If so, this employee would be trained in these subjects as per applicable local, state and/or federal regulations.• Adheres to alt applicable procedures, cGMP's, company policies, and all other quality or regulatory requirements (OSHA, DEA, FDA, HS&E, etc.). Ensures all work is performed in a safe, effective manner, and in compliance with the appropriate industry and regulatory (FDA, DEA, OSHA) standards, and Departmental, Plant, and Corporate quality and Safety goals.• Quality Management, as required, may assign and require other duties and responsibilities not previously mentioned above.• Preform all other duties as may be assigned by management.Education:BS Degree or higher in Chemistry or related science field (or equivalent) at least three years of related work experience in a pharmaceutical, chemical or related industrial experience. An equivalent combination of education, training, and experience may substitute."}