{"title":"5G Core Network Engineer NEW!","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJGrbWqr8mKNoFpvvwyojGXfY3DBdQNmdqsQyWkhN6AMZnTDCPNKAR6ra2vhanu8-MMe9PiBDZjAWM3NCxYSj3LB87Yl3VbhUtkrrliAOCWl9PRbE7HBG-iep9eA6D1yckVdTiH90qQfYBRKtw5yvoNYiSDu8HY1-LsJ2YOdkwROZoAYalNesE45-gzZPQ","source":"ziprecruiter","full_description":"DISH Wireless is building a next-gen 5G network to disrupt the wireless industry and fuel innovation in transportation, health care, education, sustainability, city management, and agriculture. We're driven by curiosity, pride, adventure, and a desire to win - and we're looking for people with boundless energy, intelligence, and an overwhelming need to achieve. Join us as we embark on our greatest adventure of all. Opportunity is here. We are DISH Wireless. As part of the DISH Wireless Core Team, the Wireless Core Engineer will join the team of passionate engineers with start-up spirit to test, deploy and debug DISH'S standalone 5G network. A Succesful Core Engineer will establish and maintain close relationships with internal peers, (Fellow Core and Network Engineers, Development Engineers, Product Engineers, Security Engineers, and PMs), as well as the Leadership team. Primary responsibilities fall into the following categories: + Deploy and support core network functions across a cutting edge cloud native standalone 5G network. + Engage with vendor personnel regarding new services and features as well as upgrades.+ Participate in the investigation of innovative 5G technologies to improve the network virtualization infrastructure.+ Ensure that solutions adhere to defined standards and best practices and/or assist in the development of these standards and best practices.+ Able to work in a fast-paced environment, under pressure, with strict deadlines, both as an individual contributor and team player.+ Participates in knowledge transfer, documentation and information sharing while staying abreast of new technology/technical areas. #LI-SL3 We are hiring all levels of Engineers from Level I through Principal, please apply if you have any of the skillsets below: + Bachelor's degree in Telcomunications or Electrical/Computer Engineering. Masters Degree if entry level. + Theoratical knowledge or hands on experience with 5G core network design and implementation, including how 5G differs in scope and technology from previous generations. + Knowledge and/or documented work experience in the following core functions: SMF / UPF / AMF / NRF / NSSF / PCF / UDM / AUSF / MME, SAEGW, SPGW, or ePDG.+ Work experience or understanding in implementing, integrating, and deploying solutions in the EPC (Evolved Packet Core).+ Cloud Native Architecture experience including microservices and containerization. + Familiar with DevOps and CI/CD methodology.+ Proven work experience in 5G / CUPS / LTE.+ General understanding of standard networking protocols and components such as HTTP, DNS, SRV6, TCP/IP, ICMP and load balancing. Compensation: $86,400.00/Yr. - $120,200.00/Yr.From versatile health perks to new career opportunities, check out our benefits on our careers website (https://careers.dish.com/life/investing-in-you/) . Employment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test."}