{"title":"100% Remote Software Engineer (C# / SQL)","location":"","salary":"","description":"","term":"$75,000 to $95,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAJlY03T1pCO4dCNaJv06p2oxkkrrwtKDU92RJ0Rs0pvkvRmaq-1pZZF6JzdepEZmyFL3MurTE3K2niVt6fVniWCv7zRJCFhO6BqLontci8YHzvcJi0BjO1KvtyEDgKD8lNvosRR_T8pMhNeNj6ZP4so0WvGt5fzU-9Ea7YW8Ui3DXNb4MZL4Em9ZYy5SAM","source":"ziprecruiter","full_description":"100% Remote Software Engineer (C# / SQL) If you are a 100% Remote Software Engineer (C# / SQL) with experience, please read on!Salary Range; $75k-$95k+ (Depending on experience)Remote: 100% RemoteTeam size: 10+ DevelopersWhy is it open: GrowthWe provide the right blend of practical and innovative HR and risk management solutions to enhance businesses while helping them manage costs and maintain compliance. Our software provides HR and risk management solutions including payroll processing and tax filing, HR management, HR outsourcing, workers' compensation, safety/risk management, time and labor management, benefits administration, and ACA compliance.What You Will Be DoingWe are currently undergoing a complete overhaul of our legacy client-server application and replacing it with a new Micro-Service oriented 100% web-based application(s). You will be tasked with building new service-oriented applications, working with APIs, building backend processing applications.- Write well-structured code that is documented and works in an optimal manner- Collaborate with other developers and Business Managers to design and implement new features.- Communicate frequently and effectively with other developers, managers, business partners, and other technical teams to ensure constant progress and that all required resources understand your needs.What You Need for this Position- Bachelor's degree- 3+ Years of professional C# expereince - 3+ Years of professional SQL experience ( bonus: Stored Procedures, SSIS, SSRS)You should also know some of the following:- JavaScript Frameworks (Angular preferred)- GIT- EDI- Agile- Visual Basic- APIs- .NET Core 3.1+What's In It for You- $75k-$95k Base Salary- 100% Remote- Generous PTO- Full Benefits- Career Growth- Bonus Potential+ More!If you're interested, please provide the following to get the ball rolling:1) Updated resume2) Salary requirements (a range would suffice)3) Interview availability this weekMy email is Justin.Johnson@cybercoders.com. - Applicants must be authorized to work in the U.S.CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}