{"title":"Customer Service Representative / Hospitality Experience NEW!","location":"","salary":"","description":"","term":"$35,000 to $45,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAIR0YZFRmhz4Ic0-ViHi9Mqyq6cRY-EOZu4dMzo_dleBAKs2xsEweHhrVeZ-SmWiKAKPdWAn8tfFzy2L_6S6-jhy5MQALGdFs47UwKilrPDzkmuxrT405-vBWcTzRR7TxvDOViCX8yb5U_zikrSr_3JJ7RQYwICWAySU5L4GEc6hV9NTvQZNrpL8TaFcwV4","source":"ziprecruiter","full_description":"Customer Service Representative / Hospitality Experience Do you enjoy being out and about vs. in a cubical?Do you have Great People Skills and want an EXCITING NEW CAREER?Are you tired of talking on the phone and never meeting your customers and clients?Do Quality Control and Scripts stunt your ability to use your personality?Are you seeking rapid advancement?We need enthusiastic, goal-oriented individuals, who want to succeed in a competitive high-energy environment!We are one of the premier promotional sales and marketing firms in the area. We specialize in gaining a fast, measurable advantage for our clients. Our clients are looking for \"an edge\" in advertising. We've developed a powerful, word-of-mouth method to our promotions that adds more of a personality to our clients' brand and services. This enables us to educate them on any changes in our client’s industry, promote various services, and personally thank customers for their business.Positions vary by department but some opportunities may include exposure to the following fields:Marketing and AdvertisingPromotional SalesCampaign ManagementTeam ManagementPersonnel / InterviewingFace to Face Customer ServiceDevelopment of Marketing PlansWe Offer:Fun and positive work environmentOpportunity for managementOptional travelUnlimited opportunitiesWe will provide individuals with excellent leadership, guidance, competitive merit-based compensation, and a challenging career path. This is an entry level position so college graduates or people looking to get their foot in the door are encouraged to apply.Candidates must represent the following:Excellent communication skillsLeadership experienceAbility to work in a high energy environmentAmbition, strong work ethic, and openness to new ideasBe a self-starter with problem-solving skillsBe a career-oriented individualMust be available to start within two weeks"}