{"title":"Software Engineer 1- Android App Developer","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAJBQo03WAD-vPNJBfRXhNYV-QyvxraweO4e2adf-UTeIyvRppSFXS4BGqhnI4D0Af_A_V1Ty-j6DYjjaGSWfxm1LbLtw2YDxRBPUoDvTVNeZyZ4SZltOvc1MPU--005AG_0Y5rNJPTCPHyY0gWKlHOgPnuj6gXd00oLcW9Q-CQV0IjkWM-Gd1-gtiU0g7E","source":"ziprecruiter","full_description":"As a leading worldwide provider of navigation devices and wearable technology, our focus is on developing, designing and supporting superior products. Our advanced technology promotes performance, safety and ease of use in every market we serve. That makes us an engineering and technology company with a keen focus on recruiting talent in those fields. But the same vertical integration business model that keeps all design and manufacturing processes in-house also gives us the incentive to hire top performers from different backgrounds, including operations, finance and accounting, information technology, sales, marketing and communications.Area 51 is our internal product Research & Development team.  From kids wearables and hybrid watches to the latest lidar and sonar technologies, we are in constant pursuit of new markets and cutting edge technologies. In Area 51, you will have opportunities to contribute as an “intrapreneur” – we will surround you with a team of innovators with diverse skill-sets.  We incubate and execute your big ideas! If you’re looking for an opportunity to bring your unique skills and perspective to a team focused on learning and venturing into uncharted territory, we want to speak with you!We are looking for a full time Software Engineer-Android App Developer.  In this role, you’ll be responsible for developing complex software for Garmin products and applications consistently following Garmin’s coding standards and in accordance with applicable software development methodology and release processes. Other essential functions include:Utilize software development tools and Instruments to develop, test, debug, and deploy quality softwareUtilize tools such as Git and Gerrit Bitbucket in the software development processCreate and executes designs for software components within a larger projectCollaborate and add value through participation in peer code reviews, providing comments and suggestionsProvide reliable solutions to a variety of problems using sound problem solving techniquesPerform technical root cause analysis and outlines corrective action for given problemsEstimate level of effort, evaluate new options of similar technology, offer suggestions to improve processesQualified candidates should possess a Bachelor of Science Degree in Computer Science, Electrical Engineering, Computer Engineering, Aerospace Engineering, Math or Physics or a technical field (such as CIS or IT) from a four-year college or university OR an equivalent combination of education and relevant experience with a minimum 3.0 cumulative GPA.  Other requirements include:Will also demonstrate proficient knowledge and utilization of engineering tools necessary for successful performance of the essential functions of this job description including experience necessary to develop complex softwareExperience with some of the following: Kotlin, Java, Android Developer and Android StudioExperience integrating and maintaining 3rd party software packages, and identifying system software security risks and developing solutions is highly preferred!Garmin International is an equal opportunity employer.  Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran’s status, age or disability."}