{"title":"Software Developer SASA3 (AM) AMB-105-056","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AALHAb68ISFltLRlguMR1ASEo1e2M73iY0Fvp6ZLZdF84ckYts6zVpLsBeymoPidZ5wUfW9gX7ra0E-pZDlQExMVxeszbCnnJf-HKyIBqlOIrtoA1rUc3F-esUWLoc-N6WPgT7HIf-rBIaRwKz4PyYrlXLPicSEaLpgQuraS7KoHI8wwsCFdcC40vpzgz7vj","source":"ziprecruiter","full_description":"Description Clarity Innovations connects human creativity with emerging technology to design, develop, and deploy software that enhances mission success. Our focus is redefining the Government's relationship with technology by encouraging the use of DevSecOps and Agile methodologies, small-teams constructs, modern tech stacks, and automation. Our software improves the lives and work of our end users and enhances innovation. We fulfil our responsibility to our country by delivering mission-changing results that help shape a better and safer world.DescriptionResponsibilities include, but are not limited to:Responsible for developing applications software for small to highly complex computer systems or portions of large integrated systems and/or for providing analysis and engineering of functional aspects of software and hardware architecture and system support.The candidate will prepare detailed specifications from which software products will be designed and/or candidate will translate documented designs into software products by developing, documenting, testing and debugging code.Experience with applications that deal with utility programs, job control language, macro, subroutines and other control modules. Basic Qualifications:Must have a High School DiplomaShall have a minimum of thirteen (13) years' experience in software engineering/development and/or systems engineering/analysisMust possess experience in all phases of software engineering to include requirements analysis, development, testing and integration, maintenance and problem diagnosis/resolution and/or experience in phases of applications systems analysis to include evaluation and design, integration and optimization of complex systemsMust have experience with communication applications, database management, use of programming languages and knowledge of storage and retrieval methods Preferred Qualifications: A Bachelor's degree in engineering, computer science, mathematics, or related discipline may be substituted for three (3) years of work experience.A Master's degree in any of the above disciplines may be substituted for an additional two (2) years of experience.Candidate shall be competent to work at the highest level of all phases of software engineering and/or all phases of applications systems analysis with minimal direction or oversight. CLEARANCE:TS/SCI with polygraphClarity Innovations provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, or any other protected class."}