{"title":"Sr Software Engineer","location":"","salary":"","description":"","term":"$70,000 to $100,000 AnnuallyFull-Time","detail":"https://www.ziprecruiter.com/k/l/AAKdf0_2oj--zdUBL3sjsi47891hZtKvD2MD0IqvK6pVxZBXwq-Gu147pOliJwqHVnB7R6YbjsLLhvUL5dJVv18CEHWp91H1gssVng2c5iFajbzbKKyImlRhs97xs42uRTXvClXX--kpOlUTAERTLJ7vl3oTEikDJZj5AhE4wb2zfuLQ90fOFTDalHgEK_I","source":"ziprecruiter","full_description":"Positions / Skillsets we're seekingGSA Corp is seeking candidates for a variety of areas including Power BI, Helpdesk Support, Database Administrators and Full Stack Software Development. www.gsacorp.ioOverviewAs a Software Engineer/Developer at GSA, you will participate in the development of our enterprise, software products for municipal and county governments and help us bring state of the art technology to communities across the country. Our product suite includes Property Appraisal, Permitting & Inspections, Code Enforcement, Field Data Collection, Zoning, Collections and Citizen Portals and Engagement.GSA is a growing startup offering the chance to work with top engineers and entrepreneurs on sophisticated business applications that include workflow, document management, GIS mapping, statistical analysis, iPhone and android applications, web applications, sketching tools, business intelligence, field data collection systems and reporting/query tools. You will be involved in product design and development using agile development techniques and state of the art tools working alongside a team with deep experience in the industry.Responsibilities:Analyze user needs and develop software solutions for our enterprise productsPerform new application coding, testing and documentation.Modify existing code to improve performance.Provide technical support to project teams.Provide technical support to customer service team to troubleshoot application issues.Document all programming tasks and proceduresPerform routine software maintenanceCoordinate system installations and deployment in Saas and client-hosted environments.Participate in product strategy and design workshops.May also perform server, database and network administration for client and internal infrastructure.Qualifications:Mid-level or higher experience with C#, MS SQL, JavaScript and HTML5Solid understanding of web-based application infrastructures and libraries. Angular preferred.Familiarity with relational databases such as MySQL and SQL ServerProficient in using Visual Studios, GIT and TFS to maintain and develop applications.A basic understanding of collaborative content editors such as MediaWikiIntermediate to advanced skills in IIS and MS SQL ServerFirm and demonstrable understanding of joins, indexes, insert, update and select statementsFirm and demonstrable understanding of T-SQL, HTML, JavaScript and CSS.Basic understanding of deploying cloud-based infrastructure.Minimum QualificationsBachelor’s degree or relevant experience in related disciplines such as computer science, along with a minimum of two to six (3-6) years of experience in C# programming and working with database transactions. Must understand relational databases and have a strong working knowledge of SQL. Experience with ArcGIS, property appraisal, CoreLogic, multiple regression and municipal software is a plus. This position works out of our Winter Park Office with some flexibility, but it is not remote."}