{"title":"Synthetic Organic Chemist","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKi-KMFT23oOf0qP8oS1a--f5LxxLgM0kHbtweXj2ohcMesa4N2YkR0SGk9umZlysq9-8IiwvodVgJatVoGepjHZopI2-gQFvGPnd3P7vFe3eiUL_VwDOlDXkZj3yRbnzYYckQf0WH3h2LZR4IuJM0xwLdvmKtE8mEKugyAabQgibCZJu9TUmPC_kdfHF4","source":"ziprecruiter","full_description":"At Cepheid, we are passionate about improving healthcare through faster, more accurate diagnostic tests. With our GeneXpert System, we've taken the most sophisticated molecular technology and packaged it into an automated, easy-to-use format that has quickly become the platform of choice worldwide. From the largest laboratories to small physician offices, our game-changing solution delivers critical answers when clinicians and patients need them most. Through strong molecular biology capabilities and ongoing product innovation, we are focused on developing tests for healthcare-associated infections, sexual health, critical infectious disease, virology, and oncology applications. Come join our vision for a better way and help make life better for us all! For more details, visit us at www.cepheid.com or follow us on Twitter (@CepheidNews).Are you a Synthetic Organic Chemist who has the abilities to create new molecular tools for use in Cepheid's diagnostic assays?This role is critical for securing and advancing Cepheid's position as the leading provider of integrated molecular diagnostic solutions. This function will enable Cepheid to stay on top of the latest technologies and innovations in the effort of delivering a better way to improve patient outcomes. The role is critical to support Cepheid's overall pipeline of new assays under experimental investigation.Introduction to the role:This position will utilize synthetic organic chemistry to create new molecular tools for use in Cepheid's diagnostic assays. New PCR tools that provide greater sensitivity, faster sample preparation and/or greater multiplexing with overall reduced total time to result are desired. The qualified scientist will apply a broad knowledge of organic chemistry, protein biochemistry and molecular biology to evaluate, review, and identify novel technologies that will help Cepheid maintain its leadership position in molecular diagnostics. The successful candidate will possess expertise and hands-on experience in synthetic chemistry, analytical chemistry and microbiology skills. This individual should be familiar with a variety of synthetic chemistry techniques with a focus on nucleic acid chemistry. The central scope and requirement in this role are to evaluate new research opportunities, propose and enable new research projects that will transform Cepheid's product pipeline.Essential job responsibilities: + Synthesize and characterize chemical intermediates and final reagents for use in research and process development projects+ Effective use of scientific literature and databases to design new chemical materials and other technologies that enable efficient PCR+ Scale-up chemical processes and provide key reagents to collaborators in the oligonucleotide research & development teams in Bothell+ Design, produce and experimentally evaluate new chemical tools to enable fast and highly multiplexed PCR based diagnostics+ Assist in transferring key chemical processes discovered in R&D into routine production+ Review, analyze, and access new technologies for PCR multiplexing+ Collaborate with other Chemists and Product Development groups across Cepheid to accelerate the evaluation of proprietary technologies for diagnostic applications+ Prepare presentation materials to communicate project status to key partners, site management and upper management+ Help develop strategies for development of complex PCR assays for the GeneXpert platform+ Prepare reports, protocols and SOPs according to FDA and international regulations (e.g., 21 CFR 820, ISO 13485) in support of Cepheid's product development process+ Be highly goal-oriented, organized and be able to thrive in an atmosphere of shifting demands and priorities Minimum requirements:Education or Experience (in years): + MS degree in Organic Chemistry with 4-6 years of relevant industrial experience+ PhD degree in Organic Chemistry with 0-2 years of relevant industrial experience+ Post-doctoral experience in Chemistry or Biochemistry is desirable Knowledge and skills: + Extensive knowledge and hands on experiences in organic chemistry+ Proficient use of standard chemical analyses (e.g., HPLC, mass spectroscopy, NMR, UV/Vis, GPC, etc.) for the characterization of small molecules, with expert interpretation of the resulting data+ Skilled in the purification of chemical and biological materials by chromatography, dialysis, precipitation, filtration, etc.+ Must be proficient in basic wet laboratory techniques for chemistry+ Must to have demonstrated history of implementing novel solutions to complex problems, ideally associated with complex PCR applications+ Highly motivated and results-driven individual with a passion for working in a fast-paced and evolving organization+ Conduct literature searches and keep up to date on relevant science+ Ability to communicate clearly and efficiently through formal presentations and written documents+ Mentally flexible and able to lead multiple projects+ Outstanding team player and scientific collaborator with exceptional interpersonal skills Preferred Skills + Extensive knowledge and hands on experiences in nucleic acid chemistries, organic fluorescent dyes, quenchers, lanthanide-based dyes.+ Experience with macromolecules and biomolecules+ Knowledge of standard PCR based testing equipment with rudimentary hands on operational experiences is desired+ Proficient in microbiology, molecular diagnostics, etc. Danaher Corporation and all Danaher Companies are equal opportunity employers that evaluate qualified applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law. The \"EEO is the Law\" poster is available here (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf) .Operating Company: Cepheid"}