{"title":"Technical Support Representative NEW!","location":"","salary":"","description":"","term":"Contractor","detail":"https://www.ziprecruiter.com/k/l/AAIcubU0CSoPYZXeM6j2RWfs6J0FvC9CFBDkifkYKXeMLBMEWbYKFiY1UT2hqZaO9tDYSvJPP7LQOxT9vT6NrY1mytqWy-tWk3p_A4AP4hdWn4Hrlrls_5mqcueeloC8yjhoeVr06lMNWjkcTXeZNKxT6F87CuWR7nXdQJckZMfmH1ujZdSI8vinexD-nTF4","source":"ziprecruiter","full_description":"Xactware Solutions, Inc. provides computer software solutions for professionals involved in estimating all phases of building and repair.In 1986 Xactware opened for business with its flagship estimating system called Xactimate. Xactimate helped contractors and insurance adjusters estimate repairs much faster and more accurately than they ever could before. Since then Xactimate has evolved into a high-powered package complete with a patented plan-sketching program. Eighty percent of insurance-repair contractors and 18 of the top 25* property insurers use Xactimate to determine the cost of repairs.Today Xactware is much more than just Xactimate. Xactware features software solutions for every phase of a building's life: from remodeling to totally replacing a building; from determining the rebuilding cost of a home for insurance purposes to sending and receiving estimates electronically. Xactware even helps homeowners store and access valuable information about their homes such as warranty information and blueprints and to receive recall notices and reminders about maintenance. To make sure everyone learns how to use the products effectively, Xactware's award-winning art department includes cutting-edge training with each product.Xactware reinvests heavily in research and development and in the quality of people who develop our products. Their job is to design and develop software that is so sophisticated, it's simple.Xactware Solutions, Inc. is a wholly-owned subsidiary of Insurance Services Office, Inc. (ISO).Xactware is an Equal Opportunity Employer.Provides accurate and timely technical support to Xactware, Inc. customers via telephone, email and chat. Manages support issues of a complex and technical nature with varying degrees of priority. Addresses incidents within predetermined service levels, requiring the ability to multi-task and prioritize. Insures that needs of customers are met. Champions' customer concerns regarding possible product defects/design issues. Carries out projects as assigned and supports other team members in order to represent Xactware, Inc. in a professional manner. This is a Temp to Hire position.Essential functions:1. Provides technical support via telephone, email and chat.2. Educates customers on the use of Xactware, Inc. products.3. Assists in testing new and enhanced products.4. Accurately records and maintains incidents in accordance with department standards.5. Champions customer issues from feedback stage through delivery of solution.6. Assists Development and Implementation staff in resolving product issues.7. Validates and reports customer submitted bug reports.8. Participates in department team meetings.9. Assists in special projects and other duties as assigned.Other Duties:1. Must be able to work rotating weekend shifts.2. Graveyard shift available.3. Experience in a customer support environment, preferably in a high-tech setting.4. Excellent communication skills, both written and verbal.5. Ability to systematically and effectively troubleshoot problems while ensuring customer satisfaction within stated service level goals.6. Excellent customer service skills.7. Ability to work in a fast paced environment.8. Ability to listen effectively and understands the details of a customer's issue.9. Other responsibilities assigned by supervisor or manager."}