{"title":"Chemist (Industrial Coatings)","location":"","salary":"","description":"","term":"Full-Time","detail":"https://www.ziprecruiter.com/k/l/AAKHE_KzFc4FaopaYlGNgO-PGwLtIxlCye0pkEw3QzZkL8nNHqEIGYm7Ai7QF29_25Kiad8k2XBZ7i_40rhliPlT-Hxozl6_f3g6q_RXFeBaZEVMLWTht_KDROl-LsPQyFuIFdYwWyoUKROE_T-Odo-adlKZnaAQ2IM-HHvnt-jXIUpaq18IYyfiCi5Bcg","source":"ziprecruiter","full_description":"Chemist (Industrial Coatings)Strongsville, OHPay: Up to $20/Hr.1 year contract, with potential to go permWe are seeking a Chemist for our global industrial coatings client in Strongsville, OH. In this role you will be responsible for the development of new global product platforms for a particular market which will encompass formulation design, preparation and application of coatings, as well as testing these coatings against a wide range of specifications and customer requirements from different regions around the globe.Job Description: Conduct experimental work under the lead of a senior chemist through formulation, application, and testing of coatings. Provide independent thought to the project design, design independent experiments to contribute to larger projects, and generate reliable data.Analyze and interpret experimental results effectively to contribute to the development of new and improved product platforms.Work closely with regional labs to learn and understand their needs and how to incorporate these needs into new product platforms.Work in conjunction with R&D and/or other functions located around the globe on the development of new product platforms.Work toward technical milestones and deliver results against aggressive timelines.Maintain project information up to date in Compass and ensure timelines are realistic and adhered to.Use project results to develop robust products that can be launched efficiently at key customers. Assist in launch activities as required.Build and maintain a network with commercial and technical teams in all regions to communicate progress on projects.Maintain and communicate results through written and verbal summaries, and coatings reports.Work safely, following all lab procedures and contribute to the maintenance of high safety standards.Actively contribute ideas for innovative new coating systems and application processes.Requirements: A BS degree in a technical field such as Chemistry, Polymer Science, Materials Science or Chemical Engineering1 to 4 years experienceDemonstrated track record of relevant work experience in coatings.Experience with experimental design (DOE) and complex problem solving.Very good cross-cultural communication skills and a strong desire to work in a dynamic global environment. Apply now for immediate consideration#ZR"}