{"title":"Developer Technical Support Engineer NEW!","location":"","salary":"","description":"","term":"$30 HourlyContractor","detail":"https://www.ziprecruiter.com/k/l/AAK2GB83ZbxdAeleJRuZIov7OLiAr9B8GS_ekDJQx2ItmCJRq_mYAfej9Eh0XvtGBV5EGoN6x_HREeCTC16rSDNxsoellp9eeFnrjNyPz39xziiyZvhp39GNLw_ZzKq-86rOyBXGWp_bgG20K7l6gwq2hhUNmRV5ZGOLVzyhXucE7nfrwYt-BWz0C0xrpKGb","source":"ziprecruiter","full_description":"Job - Technical Support - II Location – Denver, COContract Length: 6 MONTHSDescription:Developer Technical Support EngineerJob Description:The Verizon Location Technology Developer Technical Support team works primarily to support the tools on the Developer Network which includes map visualization tools, geocoding, routing, searching, and other APIs and SDKs.Our goal is to help developers and businesses leverage our technology stack in order to build their own apps. The team helps to build and maintain API documentation and demos, research and resolve customer issues, and teach others how to use Verizon Location Technology services.As a member of the support team, you must be a team player and focused on the customer to respond quickly, professionally, and accurately. You must be prepared to talk in both technical and non-technical terms to a variety of customers.You will be responsible for helping users build functional code, designing creative solutions to thorny problems, and operating in tandem with other team members to coordinate work. You will help users troubleshoot issues and solve data issues.While every call, email, forum post, tweet, or StackOverflow cry for help is different, your responsibilities include:1. Helping users build applications - Whether they need some help finding the right documentation or some helpful sample code, you can guide them to build those awesome apps with beautiful maps.2. Troubleshoot data issues - Nobody has all the data but that doesn’t mean we’re not trying. The team is adding new addresses, fixing closed roads, and looking for satellite imagery that needs a loving update all the time.3. Problem Solving - Developers have their specialties and maps are not always one of them. They need creative, or sometimes just simple basic, solutions that we can help provide.4. System Health - When things break you provide status to those blocked and provide clues to those trying to fix the breakage.You will need to have:-An appetite for learning-Patience and empathy when dealing with difficult customers-Bachelor’s degree or equivalent work experience-JavaScript / HTML / CSS experience required-Experience in a support role-Proficiency in API tools such as Postman-Excellent communication skills both verbal and written (but especially written); the ability to convey ideas to both technical and non-technical customers in a professional mannerNice to have:-Strong experience in querying databases (SQL)-Experience working with GIS, RESTful apis, JavaScript, Android or iOS-ZenDesk, Android Studio, Xcode, and command prompt experience is a major plus"}